[{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prtSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.99,"subtitle":null,"description":"Drowning in unnecessary complexity, unmanaged state, and tangles of spaghetti code? In the best tradition of Lisp, Clojure gets out of your way so you can focus on expressing simple solutions to hard problems. Clojure cuts through complexity by providing a set of composable tools--immutable data, functions, macros, and the interactive REPL. Written by members of the Clojure core team, this book is the essential, definitive guide to Clojure. This new edition includes information on all the newest features of Clojure, such as transducers and specs. Clojure joins the flexibility and agility of Lisp with the reach, stability, and performance of Java. Combine Clojure's tools for maximum effectiveness as you work with immutable data, functional programming, and safe concurrency to write programs that solve real-world problems. Start by reading and understanding Clojure syntax and see how Clojure is evaluated. From there, find out about the sequence abstraction, which combines immutable collections with functional programming to create truly reusable data transformation code. Clojure is a functional language; learn how to write programs in a functional style, and when and how to use recursion to your advantage. Discover Clojure's unique approach to state and identity, techniques for polymorphism and open systems using multimethods and protocols, and how to leverage Clojure's metaprogramming capabilities via macros. Finally, put all the pieces together in a real program. New to this edition is coverage of Clojure's spec library, one of the most interesting new features of Clojure for describing both data and functions. You can use Clojure spec to validate data, destructure data, explain invalid data, and generate large numbers of tests to verify the correctness of your code. With this book, you'll learn how to think in Clojure, and how to take advantage of its combined strengths to build powerful programs quickly. What You Need: Java 6 or higher Clojure 1.9","language":"en","currency":"USD","id":"1680505726","title":"Programming Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prtSDwAAQBAJ&source=gbs_api","authors":["Alex Miller","Stuart Halloway","Aaron Bedra"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":"Learn the Ultimate Language and Become a Better Programmer","description":"For weeks, months—nay!—from the very moment you were born, you’ve felt it calling to you. At long last you’ll be united with the programming language you’ve been longing for: Clojure! As a Lisp-style functional programming language, Clojure lets you write robust and elegant code, and because it runs on the Java Virtual Machine, you can take advantage of the vast Java ecosystem. Clojure for the Brave and True offers a \"dessert-first\" approach: you’ll start playing with real programs immediately, as you steadily acclimate to the abstract but powerful features of Lisp and functional programming. Inside you’ll find an offbeat, practical guide to Clojure, filled with quirky sample programs that catch cheese thieves and track glittery vampires. Learn how to: –Wield Clojure’s core functions –Use Emacs for Clojure development –Write macros to modify Clojure itself –Use Clojure’s tools to simplify concurrency and parallel programming Clojure for the Brave and True assumes no prior experience with Clojure, the Java Virtual Machine, or functional programming. Are you ready, brave reader, to meet your true destiny? Grab your best pair of parentheses—you’re about to embark on an epic journey into the world of Clojure!","language":"en","currency":"USD","id":"1593277237","title":"Clojure for the Brave and True","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jAYvDwAAQBAJ&source=gbs_api","authors":["Daniel Higginbotham"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ksJeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Build Your Functional Skills One Idea at a Time","description":"Behind every programming language lies a vision of how programs should be built. The vision behind Clojure is of a radically simple language framework holding together a sophisticated collection of programming features. Learning Clojure involves much more than just learning the mechanics of the language. To really get Clojure you need to understand the ideas underlying this structure of framework and features. You need this book: an accessible introduction to Clojure that focuses on the ideas behind the language as well as the practical details of writing code. Clojure attracts developers on the cutting edge and is arguably the best language for learning to program in the functional style without compromise. But this comes with a steep learning curve. Getting Clojure directly addresses this by teaching you how to think functionally as it teaches you the language. You'll learn about Clojure's powerful data structures and high-level functions, but you'll also learn what it means for a language to be functional, and how to think in Clojure's functional way. Each chapter of Getting Clojure takes a feature or two or three from the language, explains the syntax and the mechanics behind that feature so that you can make it work before digging into the deeper questions: What is the thinking behind the feature? And how does it fit in with the rest of the language? In Getting Clojure you'll learn Clojure's very simple syntax, but you'll also learn why that syntax is integral the way the language is constructed. You'll discover that most data structures in Clojure are immutable, but also why that leads to more reliable programs. And you'll see how easy it is to write Clojure functions and also how you can use those functions to build complex and capable systems. With real-world examples of how working Clojure programmers use the language, Getting Clojure will help you see the challenges of programming through the eye of experienced Clojure developers. What You Need: You will need to some background in programming. To follow along with the examples in the book, you will need Java 6 or new, Clojure 1.8 or 1.9, and Leiningen 2.","language":"en","currency":"USD","id":"1680506099","title":"Getting Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ksJeDwAAQBAJ&source=gbs_api","authors":["Russ Olsen"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SoodCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"An Introduction and Training Plan for Developers","description":"If you’re an experienced programmer who has not worked with Clojure before, this guide is the perfect thorough but gentle introduction for you. Author Carin Meier not only provides a practical overview of this JVM language and its functional programming concepts, but also includes a complete hands-on training course to help you learn Clojure in a structured way. The first half of the book takes you through Clojure’s unique design and lets you try your hand at two Clojure projects, including a web app. The holistic course in second half provides you with critical tools and resources, including ways to plug into the Clojure community. Understand the basic structure of a Clojure expression Learn how to shape and control code in a functional way Discover how Clojure handles real-world state and concurrency Take advantage of Java classes and learn how Clojure handles polymorphism Manage and use libraries in a Clojure project Use the core.async library for asynchronous and concurrent communication Explore the power of macros in Clojure programming Learn how to think in Clojure by following the book’s seven-week training course","language":"en","currency":"USD","id":"1491909285","title":"Living Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SoodCAAAQBAJ&source=gbs_api","authors":["Carin Meier"]},{"pageCount":630,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8KdEKceCHAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Practical Lisp for the Java World","description":"Clojure is a practical, general-purpose language that offers expressivity rivaling other dynamic languages like Ruby and Python, while seamlessly taking advantage of Java libraries, services, and all of the resources of the JVM ecosystem. This book helps you learn the fundamentals of Clojure with examples relating it to the languages you know already, in the domains and topics you work with every day. See how this JVM language can help eliminate unnecessary complexity from your programming practice and open up new options for solving the most challenging problems. Clojure Programming demonstrates the language’s flexibility by showing how it can be used for common tasks like web programming and working with databases, up through more demanding applications that require safe, effective concurrency and parallelism, data analysis, and more. This in-depth look helps tie together the full Clojure development experience, from how to organize your project and an introduction to Clojure build tooling, to a tutorial on how to make the most of Clojure’s REPL during development, and how to deploy your finished application in a cloud environment. Learn how to use Clojure while leveraging your investment in the Java platform Understand the advantages of Clojure as an efficient Lisp for the JVM See how Clojure is used today in several practical domains Discover how Clojure eliminates the need for many verbose and complicated design patterns Deploy large or small web applications to the cloud with Clojure","language":"en","currency":"USD","id":"1449335349","title":"Clojure Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8KdEKceCHAC&source=gbs_api","authors":["Chas Emerick","Brian Carper","Christophe Grand"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4QacPa1vwMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"This book is the first definitive reference for the Clojure language, providing both an introduction to functional programming in general and a more specific introduction to Clojure’s features. This book demonstrates the use of the language through examples, including features such as software transactional memory (STM) and immutability, which may be new to programmers coming from other languages. Overview of functional programming and description of what sets Clojure apart from other languages Detailed explanation of Clojure’s special features Examples of real-world tasks that are well-suited to Clojure’s capabilities, starting with simple tasks and moving on to more complex applications","language":"en","currency":"USD","id":"9781430272304","title":"Practical Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4QacPa1vwMUC&source=gbs_api","authors":["Luke VanderHart","Stuart Sierra"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3g5QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"From Practice to Practitioner","description":"Think in the Clojure way! Once you're familiar with Clojure, take the next step with extended lessons on the best practices and most critical decisions you'll need to make while developing. Learn how to model your domain with data, transform it with pure functions, manage state, spread your work across cores, and structure apps with components. Discover how to use Clojure in the real world, and unlock the speed and power of this beautiful language on the Java Virtual Machine. Clojure Applied gives you the practical, realistic advice and depth of field that's been missing from your development practice. You want to develop software in the most effective, efficient way possible. This book gives you the answers you've been looking for in friendly, clear language. Dive into the core concepts of Clojure: immutable collections, concurrency, pure functions, and state management. You'll finally get the complete picture you've been looking for, rather than dozens of puzzle pieces you must assemble yourself. First, explore the core concepts of Clojure development: learn how to model your domain with immutable data; choose the ideal collection; and write simple, pure functions for efficient transformation. Next you'll apply those core concepts to build applications: discover how Clojure manages state and identity; spread your work for concurrent programming; and create and assemble components. Finally, see how to manage external integration and deployment concerns by developing a testing strategy, connecting with other data sources, and getting your libraries and applications out the door. Go beyond the toy box and into Clojure's way of thinking. By the end of this book, you'll have the tools and information to put Clojure's strengths to work. What You Need: To follow along with the examples in the book, you will need Clojure 1.6, Leinegen 2, and Java 6 or higher.","language":"en","currency":"USD","id":"1680503227","title":"Clojure Applied","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3g5QDwAAQBAJ&source=gbs_api","authors":["Ben Vandgrift","Alex Miller"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HXsyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Effective Functional Programming","description":"Get up to speed with Clojure in this quick and practical primer. You'll learn the nuts and bolts of functional programming, data structures, sequences, destructuring, pattern matching, polymorphism, concurrency, conventions, and more. Author Mark McDonnell talks about organization with namespaces; how to change the language via macros; object-oriented programming; and creating command-line apps. Finally, he shows you how to write Clojure from shell languages and interfaces such as Vim. After reading and using Quick Clojure, you'll come away with first-hand knowledge and advice on how to quickly adopt, use, and apply Clojure without all the theoretical baggage that bigger books can sometimes bring. What You'll Learn Work with data structures and their syntax Discover OOP in Clojure with patterns, polymorphisms, pattern matching, and concurrency Use conventions, organization, and namespaces in Clojure Create command-line apps Build various Clojure projects with the Leiningen IDE tool and framework Who This Book Is For Programmers with experience. A Java background would be helpful, but not required.","language":"en","currency":"USD","id":"1484229525","title":"Quick Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HXsyDwAAQBAJ&source=gbs_api","authors":["Mark McDonnell"]},{"pageCount":476,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oH38AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Recipes for Functional Programming","description":"With more than 150 detailed recipes, this cookbook shows experienced Clojure developers how to solve a variety of programming tasks with this JVM language. The solutions cover everything from building dynamic websites and working with databases to network communication, cloud computing, and advanced testing strategies. And more than 60 of the world’s best Clojurians contributed recipes. Each recipe includes code that you can use right away, along with a discussion on how and why the solution works, so you can adapt these patterns, approaches, and techniques to situations not specifically covered in this cookbook. Master built-in primitive and composite data structures Create, develop and publish libraries, using the Leiningen tool Interact with the local computer that’s running your application Manage network communication protocols and libraries Use techniques for connecting to and using a variety of databases Build and maintain dynamic websites, using the Ring HTTP server library Tackle application tasks such as packaging, distributing, profiling, and logging Take on cloud computing and heavyweight distributed data crunching Dive into unit, integration, simulation, and property-based testing Clojure Cookbook is a collaborative project with contributions from some of the world’s best Clojurians, whose backgrounds range from aerospace to social media, banking to robotics, AI research to e-commerce.","language":"en","currency":"USD","id":"1449366406","title":"Clojure Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oH38AgAAQBAJ&source=gbs_api","authors":["Luke VanderHart","Ryan Neufeld"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qsa-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":"Leverage Clojure's polymorphic tools to develop your applications","description":"Learn when and how to use Clojure's polymorphic features to develop efficient multithreaded applications Key Features Get to grips with the different polymorphic tools that Clojure offers Develop a taste for good Clojure designs through various engaging examples Study various design principles and learn ways to use them in your applications Book Description Clojure is a modern, dynamic language that you can use to develop robust, multithreaded programs. Clojure Polymorphism is a comprehensive guide that shows you how to use Clojure's features to your advantage. The book begins by describing examples that show how to define and implement abstractions with plain functions and multimethods. Then you'll analyze these examples and separate the good and bad aspects of their design principles. You'll also learn how to perform data transformation abstraction with a plain function and discover how to write new cross-platform predicates while keeping the core of your abstraction free from reader conditionals. The later chapters explain the considerations to keep in mind when implementing Clojure protocols on the Java Virtual Machine (JVM). By the end of this book, you'll know how to use the various polymorphic tools of Clojure to your advantage while designing your applications. What you will learn Explore how polymorphism is implemented in Clojure Discover what design principles to use when creating and implementing abstractions Explore different ways to implement protocols in Clojure Implement various design principles while working with the JVM Write and compare plain functions and multimethods for transforming data Analyze functions and abstractions for their performance and flexibility Learn about common “gotchas” to avoid errors when writing code Who this book is for Clojure Polymorphism is useful for all programmers who want to leverage Clojure's polymorphic tools to build efficient applications. To get the most out of this book, you must be a moderately proficient Clojure programmer.","language":"en","currency":"USD","id":"1838988378","title":"Clojure Polymorphism","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qsa-DwAAQBAJ&source=gbs_api","authors":["Paul Stadig"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xIw9DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Clear, practical Clojure for the professional programmer Professional Clojure is the experienced developer's guide to functional programming using the Clojure language. Designed specifically to meet the needs of professional developers, this book briefly introduces functional programming before skipping directly to the heart of using Clojure in a real-world setting. The discussion details the read—eval—print workflow that enables fast feedback loops, then dives into enterprise-level Clojure development with expert guidance on web services, testing, datomics, performance, and more. Read from beginning to end, this book serves as a clear, direct guide to Clojure programming—but the comprehensive coverage and detail makes it extraordinarily useful as a quick reference for mid-project snags. The author team includes four professional Clojure developers, ensuring professional-level instruction from a highly practical perspective. Clojure is an open-source programming language maintained and supported by Cognitect., and quickly gaining use across industries at companies like Amazon, Walmart, Facebook, Netflix, and more. This guide provides a concise, yet thorough resource for professional developers needing to quickly put Clojure to work. Parse the difference between functional and object-oriented programming Understand Clojure performance and capabilities Develop reactive web pages using ClojureScript Adopt an REPL-driven development workflow Clojure is a modern dialect of Lisp, designed for concurrency and Java compatibility. It can be used with the Java virtual machine, Microsoft's Common Language Runtime, and JavaScript engines, providing a level of both versatility and functionality that is appealing to more and more enterprise-level developers. As requirements grow increasingly complex, stepping away from imperative programming can dramatically streamline the development workflow. Professional Clojure provides the expert instruction that gets professionals up to speed and back to work quickly.","language":"en","currency":"USD","id":"1119267293","title":"Professional Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xIw9DAAAQBAJ&source=gbs_api","authors":["Jeremy Anderson","Michael Gaare","Justin Holguín","Nick Bailey","Timothy Pratley"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w05sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"A book that brings out the strengths of Clojure programming that have to facilitate machine learning. Each topic is described in substantial detail, and examples and libraries in Clojure are also demonstrated. This book is intended for Clojure developers who want to explore the area of machine learning. Basic understanding of the Clojure programming language is required, but thorough acquaintance with the standard Clojure library or any libraries are not required. Familiarity with theoretical concepts and notation of mathematics and statistics would be an added advantage.","language":"en","currency":"USD","id":"1783284366","title":"Clojure for Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w05sAwAAQBAJ&source=gbs_api","authors":["Akhil Wali"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ng9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Build Bulletproof Web Apps with Less Code","description":"Modern web applications deserve modern tools. Harness the JVM's rich infrastructure while taking advantage of the expressive power and brisk performance of a modern functional language. Exploit Clojure's unique advantages for web development. Step by step, apply the fundamentals of programming in Clojure to build real-world, professional web applications. This edition features new libraries, tools, and best practices, and focuses on developing modern single-page applications. Stop developing web apps with yesterday's tools. Today, developers are increasingly adopting Clojure as a web-development platform. See for yourself what makes Clojure so desirable, as you create a series of web apps of growing complexity, exhibiting the full process of web development using a modern functional language. Journey through all the steps in developing a rich Picture Gallery web application--from conception to packaging and deployment. You'll work hands-on with Clojure and build real-world, professional web apps. This fully updated second edition reveals the changes in the rapidly evolving Clojure ecosystem. Get up to speed on the many new libraries, tools, and best practices. Gain expertise in the popular Ring\/Compojure stack using the Luminus framework. Learn how Clojure works with databases and speeds development of RESTful services. See why ClojureScript is rapidly becoming a popular front-end platform, and use ClojureScript with the popular Reagent library to build single-page applications. This book is for you, whether you're already familiar with Clojure or if you're completely new to the language. What You Need: The latest JVM, Clojure 1.6+, and the Leiningen build tool, as well as an editor such as Emacs, IntelliJ, Eclipse, Light Table, or VI.","language":"en","currency":"USD","id":"1680505300","title":"Web Development with Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ng9QDwAAQBAJ&source=gbs_api","authors":["Dmitri Sotnikov"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9jqBCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Statistics, big data, and machine learning for Clojure programmers About This Book Write code using Clojure to harness the power of your data Discover the libraries and frameworks that will help you succeed A practical guide to understanding how the Clojure programming language can be used to derive insights from data Who This Book Is For This book is aimed at developers who are already productive in Clojure but who are overwhelmed by the breadth and depth of understanding required to be effective in the field of data science. Whether you're tasked with delivering a specific analytics project or simply suspect that you could be deriving more value from your data, this book will inspire you with the opportunities–and inform you of the risks–that exist in data of all shapes and sizes. What You Will Learn Perform hypothesis testing and understand feature selection and statistical significance to interpret your results with confidence Implement the core machine learning techniques of regression, classification, clustering and recommendation Understand the importance of the value of simple statistics and distributions in exploratory data analysis Scale algorithms to web-sized datasets efficiently using distributed programming models on Hadoop and Spark Apply suitable analytic approaches for text, graph, and time series data Interpret the terminology that you will encounter in technical papers Import libraries from other JVM languages such as Java and Scala Communicate your findings clearly and convincingly to nontechnical colleagues In Detail The term “data science” has been widely used to define this new profession that is expected to interpret vast datasets and translate them to improved decision-making and performance. Clojure is a powerful language that combines the interactivity of a scripting language with the speed of a compiled language. Together with its rich ecosystem of native libraries and an extremely simple and consistent functional approach to data manipulation, which maps closely to mathematical formula, it is an ideal, practical, and flexible language to meet a data scientist's diverse needs. Taking you on a journey from simple summary statistics to sophisticated machine learning algorithms, this book shows how the Clojure programming language can be used to derive insights from data. Data scientists often forge a novel path, and you'll see how to make use of Clojure's Java interoperability capabilities to access libraries such as Mahout and Mllib for which Clojure wrappers don't yet exist. Even seasoned Clojure developers will develop a deeper appreciation for their language's flexibility! You'll learn how to apply statistical thinking to your own data and use Clojure to explore, analyze, and visualize it in a technically and statistically robust way. You can also use Incanter for local data processing and ClojureScript to present interactive visualisations and understand how distributed platforms such as Hadoop sand Spark's MapReduce and GraphX's BSP solve the challenges of data analysis at scale, and how to explain algorithms using those programming models. Above all, by following the explanations in this book, you'll learn not just how to be effective using the current state-of-the-art methods in data science, but why such methods work so that you can continue to be productive as the field evolves into the future. Style and approach This is a practical guide to data science that teaches theory by example through the libraries and frameworks accessible from the Clojure programming language.","language":"en","currency":"USD","id":"1784397504","title":"Clojure for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9jqBCgAAQBAJ&source=gbs_api","authors":["Henry Garner"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OQccDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Leverage the power and flexibility of the Clojure language for finance About This Book Apply the Clojure programming language in financial analytics and to build financial applications Work with high-level mathematical abstractions without having to implement low-level code for financial operations. This is a practical tutorial that takes you through real-world examples of financial analytics and applications with Clojure Who This Book Is For If you're a finance professional who is currently using VBA (Excel) to perform financial calculations and quantitative analysis, and would like to use Clojure instead to improve their efficiency, then this book is for you. Basic knowledge of financial concepts is essential. Basic programming knowledge would also be an added advantage. What You Will Learn Quickly and effectively represent data and calculations using Clojure Use Clojure's basic language tools such as laziness, immutability, and firstclass functions to solve real-world problems Explore mathematical derivatives to generate different wave forms Get acquainted with the advanced approaches to calculating and transforming data, and building algorithms Use Clojure's functions to access, update, and compose data structures Be introduced to the concept of sideeffecting behavior and the different ways to handle it Compose simple and exponential functions together to get a buy or sell signal In Detail Clojure is a dynamic programming language with an emphasis on functional programming. Clojure is well suited to financial modeling as it is a functional programming language. Such languages help developers work with high-level mathematical abstractions without having to implement low-level code that handles the arithmetic operations. Starting with the importance of representing data and calculations effectively, this book will take you all the way to being competent in financial analytics and building financial applications. First, we introduce the notions of computation and finance, which will help you understand Clojure's utility to solve real-world problems in many domains, especially finance. Next, we will show you how to develop the simple-moving-average function by using the more advanced partition Clojure data transformation function. This function, along with others, will be used to calculate and manipulate data. You will then learn to implement slightly more complicated equations, how to traverse data, and deal with branching and conditional dispatch. Then, the concept of side-effecting and its various approaches are introduced, along with the strategy of how to use data as the interface to other systems. Finally, you will discover how to build algorithms while manipulating and composing functions. Style and approach This book is a practical step-by-step tutorial that provides a basic overview of the concepts but focuses on providing the skills required to analyze data.","language":"en","currency":"USD","id":"1785287613","title":"Clojure for Finance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OQccDAAAQBAJ&source=gbs_api","authors":["Timothy Washington"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1tePBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a Clojure developer who is interested in using Reactive Programming to build asynchronous and concurrent applications, this book is for you. Knowledge of Clojure and Leiningen is required. Basic understanding of ClojureScript will be helpful for the web chapters, although it is not strictly necessary.","language":"en","currency":"USD","id":"1783986670","title":"Clojure Reactive Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1tePBwAAQBAJ&source=gbs_api","authors":["Leonardo Borges"]},{"pageCount":565,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wU8oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.19,"subtitle":null,"description":"Explore the world of lightning fast Clojure apps with asynchronous channels, logic, reactive programming, and more About This Book Discover Clojure's features and advantages and use them in your existing projects Explore lesser-known and more advanced features, constructs, and methodologies such as asynchronous channels, actors, logic programming, and reactive programming Measure and monitor performance, and understand optimization techniques Who This Book Is For If you're looking to learn more about its core libraries and delve into the Clojure language in detail, then this book is ideal for you. Prior knowledge of the Clojure language is required. What You Will Learn Understand tools for the Clojure world and how they relate to Java tools and standards (such as Maven) Write simple multicore programs using Clojure's core concepts, such as atoms, agents, and refs Get to grips with Clojure's concurrency and state-management primitives in depth Analyze latency using the Criterium library Avoid reflection and boxing with type hints Maximize the impact of parallelization, functional composition, and process transformation by composing reducers and transducers Modify and add features to the Clojure language using macros Test your code with unit tests, specs, and type checks to write testable code Troubleshoot and style your Clojure code to make it more maintainable In Detail Clojure is a general-purpose language from the Lisp family with an emphasis on functional programming. It has some interesting concepts and features such as immutability, gradual typing, thread-safe concurrency primitives, and macro-based metaprogramming, which makes it a great choice to create modern, performant, and scalable applications. This learning path aims at unleashing the true potential of the Clojure language so you can use it in your projects. It begins with installing and setting up the Clojure environment before moving on to explore the language in depth. You'll get acquainted with its various features such as functional programming, concurrency, reducers, transducers, core.async and core.logic, and so on with a great level of detail. Moving on, you'll also learn how to enhance performance using Java interoperability and JVM-specific features from Clojure; you'll even master language features such as asynchronous channels, actors, logic programming, reactive programming, metaprogramming, and so on. This learning path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Clojure for Java Developers by Eduardo Diaz Clojure High Performance Programming, Second Edition by Shantanu Kumar Mastering Clojure by Akhil Wali Style and approach This is an easy-to-follow, step-by-step guide to start writing Clojure programs, making use of all of its varied features and advantages.","language":"en","currency":"USD","id":"1787288013","title":"Clojure: High Performance JVM Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wU8oDwAAQBAJ&source=gbs_api","authors":["Eduardo Diaz","Shantanu Kumar","Akhil Wali"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=utRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop event-driven, scalable, and reactive microservices with real-time monitoring","description":"The common patterns and practices of the microservice architecture and their application using the Clojure programming language. Key Features Relevance of the microservice architecture and benefits of Clojure's functional and simple features to implement it. Learn best practices and common principles to avoid common pitfalls while developing microservices. Learn how to use Pedestal to build your next microservices, secure them using JWT, and monitor them using the ELK stack Book Description The microservice architecture is sweeping the world as the de facto pattern with which to design and build scalable, easy-tomaintain web applications. This book will teach you common patterns and practices, and will show you how to apply these using the Clojure programming language. This book will teach you the fundamental concepts of architectural design and RESTful communication, and show you patterns that provide manageable code that is supportable in development and at scale in production. We will provide you with examples of how to put these concepts and patterns into practice with Clojure. This book will explain and illustrate, with practical examples, how teams of all sizes can start solving problems with microservices. You will learn the importance of writing code that is asynchronous and non-blocking and how Pedestal helps us do this. Later, the book explains how to build Reactive microservices in Clojure that adhere to the principles underlying the Reactive Manifesto. We finish off by showing you various ways to monitor, test, and secure your microservices. By the end, you will be fully capable of setting up, modifying, and deploying a microservice with Clojure and Pedestal. What you will learn Explore the pros and cons of monolithic and microservice architectures Use Clojure to effectively build a reallife application using Microservices Gain practical knowledge of the Clojure Pedestal framework and how to use it to build Microservices Explore various persistence patterns and learn how to use Apache Kafka to build event-driven microservice architectures Secure your Microservices using JWT Monitor Microservices at scale using the ELK stack Deploy Microservices at scale using container orchestration platforms such as Kubernetes Who this book is for You should have a working knowledge of programming in Clojure. However, no knowledge of RESTful architecture, microservices, or web services is expected. If you are looking to apply techniques to your own projects, taking your first steps into microservice architecture, this book is for you.","language":"en","currency":"USD","id":"1788626311","title":"Microservices with Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=utRJDwAAQBAJ&source=gbs_api","authors":["Anuj Kumar"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4QacPa1vwMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"This book is the first definitive reference for the Clojure language, providing both an introduction to functional programming in general and a more specific introduction to Clojure’s features. This book demonstrates the use of the language through examples, including features such as software transactional memory (STM) and immutability, which may be new to programmers coming from other languages. Overview of functional programming and description of what sets Clojure apart from other languages Detailed explanation of Clojure’s special features Examples of real-world tasks that are well-suited to Clojure’s capabilities, starting with simple tasks and moving on to more complex applications","language":"en","currency":"USD","id":"9781430272304","title":"Practical Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4QacPa1vwMUC&source=gbs_api","authors":["Luke VanderHart","Stuart Sierra"]},{"pageCount":215,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VYw9DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Clear, practical Clojure for the professional programmer Professional Clojure is the experienced developer's guide to functional programming using the Clojure language. Designed specifically to meet the needs of professional developers, this book briefly introduces functional programming before skipping directly to the heart of using Clojure in a real-world setting. The discussion details the read—eval—print workflow that enables fast feedback loops, then dives into enterprise-level Clojure development with expert guidance on web services, testing, datomics, performance, and more. Read from beginning to end, this book serves as a clear, direct guide to Clojure programming—but the comprehensive coverage and detail makes it extraordinarily useful as a quick reference for mid-project snags. The author team includes four professional Clojure developers, ensuring professional-level instruction from a highly practical perspective. Clojure is an open-source programming language maintained and supported by Cognitect., and quickly gaining use across industries at companies like Amazon, Walmart, Facebook, Netflix, and more. This guide provides a concise, yet thorough resource for professional developers needing to quickly put Clojure to work. Parse the difference between functional and object-oriented programming Understand Clojure performance and capabilities Develop reactive web pages using ClojureScript Adopt an REPL-driven development workflow Clojure is a modern dialect of Lisp, designed for concurrency and Java compatibility. It can be used with the Java virtual machine, Microsoft's Common Language Runtime, and JavaScript engines, providing a level of both versatility and functionality that is appealing to more and more enterprise-level developers. As requirements grow increasingly complex, stepping away from imperative programming can dramatically streamline the development workflow. Professional Clojure provides the expert instruction that gets professionals up to speed and back to work quickly.","language":"en","currency":"USD","id":"1119267285","title":"Professional Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VYw9DAAAQBAJ&source=gbs_api","authors":["Jeremy Anderson","Michael Gaare","Justin Holguín","Nick Bailey","Timothy Pratley"]},{"pageCount":618,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VZvcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Handle every problem you come across in the world of Clojure programming with this expert collection of recipes About This Book Discover a wide variety of practical cases and real world techniques to enhance your productivity with Clojure. Learn to resolve the everyday issues you face with a functional mindset using Clojure You will learn to write highly efficient, more productive, and error-free programs without the risk of deadlocks and race-conditions Who This Book Is For This book is for Clojure developers who have some Clojure programming experience and are well aware of their shortcomings. If you want to learn to tackle common problems, become an expert, and develop a solid skill set, then this book is for you. What You Will Learn Manipulate, access, filter, and transform your data with Clojure Write efficient parallelized code through Clojure abstractions Tackle Complex Concurrency easily with Reactive Programming Build on Haskell abstractions to write dynamic functional tests Write AWS Lambda functions effortlessly Put Clojure in use into your IoT devices Use Clojure with Slack for instant monitoring Scaling your Clojure application using Docker Develop real-time system interactions using MQTT and websockets In Detail When it comes to learning and using a new language you need an effective guide to be by your side when things get rough. For Clojure developers, these recipes have everything you need to take on everything this language offers. This book is divided into three high impact sections. The first section gives you an introduction to live programming and best practices. We show you how to interact with your connections by manipulating, transforming, and merging collections. You'll learn how to work with macros, protocols, multi-methods, and transducers. We'll also teach you how to work with languages such as Java, and Scala. The next section deals with intermediate-level content and enhances your Clojure skills, here we'll teach you concurrency programming with Clojure for high performance. We will provide you with advanced best practices, tips on Clojure programming, and show you how to work with Clojure while developing applications. In the final section you will learn how to test, deploy and analyze websocket behavior when your app is deployed in the cloud. Finally, we will take you through DevOps. Developing with Clojure has never been easier with these recipes by your side! Style and approach This book takes a recipe-based approach by diving directly into helpful programming concepts. It will give you a foolproof approach to programming and teach you how to deal with problems that may arise while working with Clojure. The book is divided into three sections giving you the freedom skip to the section of your choice depending on the problem faced.","language":"en","currency":"USD","id":"178588851X","title":"Clojure Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VZvcDgAAQBAJ&source=gbs_api","authors":["Makoto Hashimoto","Nicolas Modrzyk"]},{"pageCount":476,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oH38AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Recipes for Functional Programming","description":"With more than 150 detailed recipes, this cookbook shows experienced Clojure developers how to solve a variety of programming tasks with this JVM language. The solutions cover everything from building dynamic websites and working with databases to network communication, cloud computing, and advanced testing strategies. And more than 60 of the world’s best Clojurians contributed recipes. Each recipe includes code that you can use right away, along with a discussion on how and why the solution works, so you can adapt these patterns, approaches, and techniques to situations not specifically covered in this cookbook. Master built-in primitive and composite data structures Create, develop and publish libraries, using the Leiningen tool Interact with the local computer that’s running your application Manage network communication protocols and libraries Use techniques for connecting to and using a variety of databases Build and maintain dynamic websites, using the Ring HTTP server library Tackle application tasks such as packaging, distributing, profiling, and logging Take on cloud computing and heavyweight distributed data crunching Dive into unit, integration, simulation, and property-based testing Clojure Cookbook is a collaborative project with contributions from some of the world’s best Clojurians, whose backgrounds range from aerospace to social media, banking to robotics, AI research to e-commerce.","language":"en","currency":"USD","id":"1449366406","title":"Clojure Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oH38AgAAQBAJ&source=gbs_api","authors":["Luke VanderHart","Ryan Neufeld"]},{"pageCount":630,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8KdEKceCHAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Practical Lisp for the Java World","description":"Clojure is a practical, general-purpose language that offers expressivity rivaling other dynamic languages like Ruby and Python, while seamlessly taking advantage of Java libraries, services, and all of the resources of the JVM ecosystem. This book helps you learn the fundamentals of Clojure with examples relating it to the languages you know already, in the domains and topics you work with every day. See how this JVM language can help eliminate unnecessary complexity from your programming practice and open up new options for solving the most challenging problems. Clojure Programming demonstrates the language’s flexibility by showing how it can be used for common tasks like web programming and working with databases, up through more demanding applications that require safe, effective concurrency and parallelism, data analysis, and more. This in-depth look helps tie together the full Clojure development experience, from how to organize your project and an introduction to Clojure build tooling, to a tutorial on how to make the most of Clojure’s REPL during development, and how to deploy your finished application in a cloud environment. Learn how to use Clojure while leveraging your investment in the Java platform Understand the advantages of Clojure as an efficient Lisp for the JVM See how Clojure is used today in several practical domains Discover how Clojure eliminates the need for many verbose and complicated design patterns Deploy large or small web applications to the cloud with Clojure","language":"en","currency":"USD","id":"1449335349","title":"Clojure Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8KdEKceCHAC&source=gbs_api","authors":["Chas Emerick","Brian Carper","Christophe Grand"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GK7NBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for anyone who's worked with Clojure and wants to use it to start developing applications for the Web. Experience or familiarity with basic Clojure syntax is a must, and exposure to Leiningen (or other similar build tools such as Maven) would be helpful.","language":"en","currency":"USD","id":"1784394874","title":"Clojure Web Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GK7NBgAAQBAJ&source=gbs_api","authors":["Ryan Baldwin"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1tePBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a Clojure developer who is interested in using Reactive Programming to build asynchronous and concurrent applications, this book is for you. Knowledge of Clojure and Leiningen is required. Basic understanding of ClojureScript will be helpful for the web chapters, although it is not strictly necessary.","language":"en","currency":"USD","id":"1783986670","title":"Clojure Reactive Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1tePBwAAQBAJ&source=gbs_api","authors":["Leonardo Borges"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cOZrBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"This book is for those with a basic knowledge of Clojure, who are looking to push the language to excel with data analysis.","language":"en","currency":"USD","id":"1784399957","title":"Clojure Data Analysis Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cOZrBgAAQBAJ&source=gbs_api","authors":["Eric Rochester"]},{"pageCount":152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vZYfAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This is a short, practical guide that will teach you everything you need to know to start writing high performance Clojure code. This book is ideal for intermediate Clojure developers who are looking to get a good grip on how to achieve optimum performance. You should already have some experience with Clojure and it would help if you already know a little bit of Java. Knowledge of performance analysis and engineering is not required. For hands-on practice, you should have access to Clojure REPL with Leiningen.","language":"en","currency":"USD","id":"1782165614","title":"Clojure High Performance Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vZYfAgAAQBAJ&source=gbs_api","authors":["Shantanu Kumar"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GtxdAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"An example-oriented approach to develop custom domain-specific languages.If you've already developed a few Clojure applications and wish to expand your knowledge on Clojure or domain-specific languages in general, then this book is for you. If you're an absolute Clojure beginner, then you may only find the detailed examples of the core Clojure components of value. If you've developed DSLs in other languages, this Lisp and Java-based book might surprise you with the power of Clojure.","language":"en","currency":"USD","id":"1782166513","title":"Clojure for Domain-specific Languages","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GtxdAgAAQBAJ&source=gbs_api","authors":["Ryan D. Kelker"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w05sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"A book that brings out the strengths of Clojure programming that have to facilitate machine learning. Each topic is described in substantial detail, and examples and libraries in Clojure are also demonstrated. This book is intended for Clojure developers who want to explore the area of machine learning. Basic understanding of the Clojure programming language is required, but thorough acquaintance with the standard Clojure library or any libraries are not required. Familiarity with theoretical concepts and notation of mathematics and statistics would be an added advantage.","language":"en","currency":"USD","id":"1783284366","title":"Clojure for Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w05sAwAAQBAJ&source=gbs_api","authors":["Akhil Wali"]},{"pageCount":116,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uvaWWZ1naikC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Functional Programming for the Web","description":"Learn how to build complete client-side applications with ClojureScript, the Clojure language variant that compiles to optimized JavaScript. This hands-on introduction shows you how ClojureScript not only has similarities to JavaScript—without the flaws—but also supports the full semantics of its parent language. You’ll delve into ClojureScript’s immutable data structures, lazy sequences, first-class functions, macros, and support for JavaScript libraries. No previous experience with Clojure or ClojureScript is necessary. If you’re familiar with JavaScript, HTML, CSS, and the DOM, you’ll quickly discover that ClojureScript has the same reach as JavaScript, but with more power. Start writing ClojureScript code with the Leiningen build system Learn how the ClojureScript compiler works to produce optimized JavaScript Use JavaScript functions and libraries directly from ClojureScript code Explore functions in Clojure’s sequence library such as map, reduce, and filter Use macros to define new control structures or embed domain-specific languages Compile manually or script your own workflow with ClojureScript’s compiler tools Integrate ClojureScript with Clojure on the JVM to build powerful client-server applications","language":"en","currency":"USD","id":"1449327397","title":"ClojureScript: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uvaWWZ1naikC&source=gbs_api","authors":["Stuart Sierra","Luke VanderHart"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wBQEp6ruIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"From Journeyman to Master","description":"What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” —Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” —Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” —Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” —John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” —Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” —Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” —Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” —Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” —Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.","language":"en","currency":"USD","id":"013211917X","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wBQEp6ruIAC&source=gbs_api","authors":["Andrew Hunt","David Thomas"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mbFKDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Transition smoothly from Java to the most widely used functional JVM-based language – Clojure About This Book Write apps for the multithreaded world with Clojure's flavor of functional programming Discover Clojure's features and advantages and use them in your existing projects The book is designed so that you'll be able put to use your existing skills and software knowledge to become a more effective Clojure developer Who This Book Is For This book is intended for Java developers, who are looking for a way to expand their skills and understand new paradigms of programming. Whether you know a little bit about functional languages, or you are just getting started, this book will get you up and running with how to use your existing skills in Clojure and functional programming. What You Will Learn Understand the tools for the Clojure world and how they relate to Java tools and standards (like Maven) Learn about immutable data structures, and what makes them feasible for everyday programming Write simple multi-core programs using Clojure's core concepts, like atoms, agents and refs Understand that in Clojure, code is data, and how to take advantage of that fact by generating and manipulating code with macros Learn how Clojure interacts with Java, how the class loaders work and how to use Clojure from Java or the other way around Discover a new, more flexible meaning of polymorphism and understand that OOP is not the only way to get it In Detail We have reached a point where machines are not getting much faster, software projects need to be delivered quickly, and high quality in software is more demanding as ever. We need to explore new ways of writing software that helps achieve those goals. Clojure offers a new possibility of writing high quality, multi-core software faster than ever, without having to leave your current platform. Clojure for Java developers aims at unleashing the true potential of the Clojure language to use it in your projects. The book begins with the installation and setup of the Clojure environment before moving on to explore the language in-depth. Get acquainted with its various features such as functional programming, concurrency, etc. with the help of example projects. Additionally, you will also, learn how the tooling works, and how it interacts with the Java environment. By the end of this book, you will have a firm grip on Clojure and its features, and use them effectively to write more robust programs. Style and approach An easy to follow, step-by-step, guide on how to start writing Clojure programs making use of all of its varied features and advantages. As this is a new language, certain new concepts are supported with theoretical section followed by simple projects to help you gain a better understanding and practice of how Clojure works.","language":"en","currency":"USD","id":"1785280414","title":"Clojure for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mbFKDAAAQBAJ&source=gbs_api","authors":["Eduardo Díaz"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6ABwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Master the art of agile single page web application development with ClojureScript About This Book Set up interactive development workflows for the browser or Node.js thanks to the ClojureScript ecosystem Learn the basics of interactive single page web app development taking advantage of the functional nature of ClojureScript Delve into advanced rich web application development concepts such as Om, along with core.async, using zippers and logic programming, and preparing code for production with testing or optimizing via the Google Closure Compiler Who This Book Is For This book is for web application developers who want to benefit from the power of ClojureScript to get an agile and highly productive development platform that targets mainly browser JavaScript. You are not required to be fluent in Clojure, but it will be easier for you if you have a basic understanding of browser and server-side JavaScript. What You Will Learn Understand how the ClojureScript compiler operates Set up interactive development workflows for ClojureScript Grasp the basics of the ClojureScript language, including basic syntax, data structures, variable scoping, namespaces, and finally the powerful sequence abstraction Delve into advanced concepts such as functional programming, macro writing, asynchronous programming, app routing, and real-time web Develop simple one page web applications Explore techniques to make your web apps aware of the external world through external or embedded database access or Oauth 2 integration Learn more advanced ClojureScript concepts like in app routing, real-time web Prepare your work for production, getting insights into optional type-checking, writing portable Clojure\/ClojureScript code, and testing In Detail Clojure is an expressive language that makes it possible to easily tackle complex software development challenges. Its bias toward interactive development has made it a powerful tool, enabling high developer productivity. In this book, you will first learn how to construct an interactive development experience for ClojureScript.. You will be guided through ClojureScript language concepts, looking at the basics first, then being introduced to advanced concepts such as functional programming or macro writing. After that, we elaborate on the subject of single page web applications, showcasing how to build a simple one, then covering different possible enhancements. We move on to study more advanced ClojureScript concepts, where you will be shown how to address some complex algorithmic cases. Finally, you'll learn about optional type-checking for your programs, how you can write portable code, test it, and put the advanced compilation mode of the Google Closure Compiler to good use. Style and approach This book is a comprehensive reference guide on ClojureScript development for the front end, and will gradually help you master interactive ClojureScript development workflows, through detailed step-by-step information illustrated with annotated code samples.","language":"en","currency":"USD","id":"1785887793","title":"Learning ClojureScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6ABwDQAAQBAJ&source=gbs_api","authors":["W. David Jarvis","Rafik Naccache","Allen Rohner"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=obm9CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"“There’s something for everyone here. . . . You can pick up and read this book and build an industry-standard system in a weekend: It has everything you need to get started with a new project. I also found it helpful in reviewing the structure of existing projects.” —Timothy Pratley, developer Developers are discovering the exceptional power of Clojure’s functional programming model to quickly solve problems in domains ranging from social networking to Big Data. Clojure is fast and efficient—ideal for rapid prototyping and lean development. And it is highly expressive and extremely extensible, which makes Clojure one of today’s leading tools for software innovation. Since it targets the Java Virtual Machine, Clojure also leverages the Java platform’s maturity and enormous ecosystem. Clojure Recipes is a wide-ranging, up-to-date “code recipe book” for this increasingly popular language. With practical and self-contained examples, author Julian Gamble illuminates Clojure’s key features and best practices, showing how to solve real-world problems one step at a time. Focusing on Clojure 1.7 and higher, Gamble fully reflects recent enhancements that ensure you’re getting the most up-to-date code for your project. Gamble first walks you through the essential steps required to set up your Clojure development environment, from setting up the Leiningen build tool to packaging Clojure for Java EE environments. He then shows you how to build both basic and advanced REST servers, before turning to a wide range of increasingly sophisticated applications. In this book you will find Innovative Clojure code for diverse web, security, administration, and development tasks, from log reading and app monitoring to software testing Detailed instructions for using concurrency primitives, writing new DSLs, simplifying cloud database development, and more “Learn by doing” projects, which offer practical experience with Clojurescript, Storm, Pedestal, Datomic, and other advanced tools Coverage of using Clojure with Cascalog 2.0 to write complex Hadoop queries with minimal code The breadth and quality of Gamble’s examples make Clojure Recipes uniquely valuable both to developers who are exploring Clojure for the first time and to those already using it in production.","language":"en","currency":"USD","id":"0133430073","title":"Clojure Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=obm9CgAAQBAJ&source=gbs_api","authors":["Julian Gamble"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7Hc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Explore the Java Virtual Machine with modern programming languages About This Book This guide provides in-depth coverage of the Java Virtual Machine and its features Filled with practical examples, this book will help you understand the core concepts of Java, Scala, Clojure, Kotlin, and Groovy Work with various programming paradigms and gain knowledge about imperative, object-oriented and functional programming Who This Book Is For This book is meant for programmers who are interested in the Java Virtual Machine (JVM) and want to learn more about the most popular programming languages that can be used for JVM development. Basic practical knowledge of a modern programming language that supports object-oriented programming (JavaScript, Python, C#, VB.NET, and C++) is assumed. What You Will Learn Gain practical information about the Java Virtual Machine Understand the popular JVM languages and the Java Class Library Get to know about various programming paradigms such as imperative, object-oriented, and functional Work with common JVM tools such as Eclipse IDE, Gradle, and Maven Explore frameworks such as SparkJava, Vert.x, Akka and JavaFX Boost your knowledge about dialects of other well-known programming languages that run on the JVM, including JavaScript, Python, and Ruby In Detail Anyone who knows software development knows about the Java Virtual Machine. The Java Virtual Machine is responsible for interpreting Java byte code and translating it into actions. In the beginning, Java was the only programming language used for the JVM. But increasing complexity of the language and the remarkable performance of the JVM created an opening for a new generation of programming languages. If you want to build a strong foundation with the Java Virtual Machine and get started with popular modern programming languages, then this book is for you. The book will begin with a general introduction of the JVM and its features, which are common to the JVM languages, helping you get abreast with its concepts. It will then dive into explaining languages such as Java, Scala, Clojure, Kotlin, and Groovy and will show how to work with each language, their features, use cases, and pros and cons. By writing example projects in those languages and focusing on each language's strong points, it will help you find the programming language that is most appropriate for your particular needs. By the end of the book, you will have written multiple programs that run on the Java Virtual Machine and know about the differences between the various languages. Style and approach This practical, example-filled guide will help you get started with the JVM and some of its most popular languages.","language":"en","currency":"USD","id":"1787126587","title":"Introduction to JVM Languages","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7Hc5DwAAQBAJ&source=gbs_api","authors":["Vincent van der Leun"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oJrjCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Understand the philosophy of the Clojure language and dive into its inner workings to unlock its advanced features, methodologies, and constructs About This Book Learn to handle data using sequences, reducers, and transducers in Clojure Explore the lesser known and more advanced features, constructs, and methodologies of the Clojure language and its ecosystem, such as asynchronous channels, actors, logic programming, and reactive programming Sharpen your Clojure skills through illustrative and comprehensive examples Who This Book Is For If you're looking to learn more about the core libraries and dive deep into the Clojure language, then this book is ideal for you. Prior knowledge of the Clojure language is required. What You Will Learn Maximize the impact of parallelization, functional composition, and process transformation by composing reducers and transducers Process and manipulate data using sequences, reducers, and transducers in Clojure Modify and add features to the Clojure language using macros Explore the features of category theory and custom data sources for logic programming in Clojure Orchestrate parallelism and concurrency using built-in primitives as well as community libraries in Clojure Handle data with asynchronous and reactive programming methodologies and leverage it using the core.async library Test your code with unit tests, specs, and type checks to write testable code Troubleshoot and style your Clojure code to make it more maintainable In Detail Clojure is a general-purpose language from the Lisp family with an emphasis on functional programming. It has some interesting concepts and features such as immutability, gradual typing, thread-safe concurrency primitives, and macro-based metaprogramming, which makes it a great choice to create modern, performant, and scalable applications. Mastering Clojure gives you an insight into the nitty-gritty details and more advanced features of the Clojure programming language to create more scalable, maintainable, and elegant applications. You'll start off by learning the details of sequences, concurrency primitives, and macros. Packed with a lot of examples, you'll get a walkthrough on orchestrating concurrency and parallelism, which will help you understand Clojure reducers, and we'll walk through composing transducers so you know about functional composition and process transformation inside out. We also explain how reducers and transducers can be used to handle data in a more performant manner. Later on, we describe how Clojure also supports other programming paradigms such as pure functional programming and logic programming. Furthermore, you'll level up your skills by taking advantage of Clojure's powerful macro system. Parallel, asynchronous, and reactive programming techniques are also described in detail. Lastly, we'll show you how to test and troubleshoot your code to speed up your development cycles and allow you to deploy the code faster. Style and approach This is an easy-to-follow project-based guide that throws you directly into the excitement of Clojure code. Mastering Clojure is for anyone who is interested in expanding their knowledge of language features and advanced functional programming.","language":"en","currency":"USD","id":"1785882058","title":"Mastering Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oJrjCwAAQBAJ&source=gbs_api","authors":["Akhil Wali"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g4KFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Create asynchronous, event-based, and concurrent applications, 2nd Edition","description":"Learn how to use RxClojure to deal with stateful computations Key Features Leverage the features of Functional Reactive Programming using Clojure Create dataflow-based systems that are the building blocks of Reactive Programming Use different Functional Reactive Programming frameworks, techniques, and patterns to solve real-world problems Book Description Reactive Programming is central to many concurrent systems, and can help make the process of developing highly concurrent, event-driven, and asynchronous applications simpler and less error-prone. This book will allow you to explore Reactive Programming in Clojure 1.9 and help you get to grips with some of its new features such as transducers, reader conditionals, additional string functions, direct linking, and socket servers. Hands-On Reactive Programming with Clojure starts by introducing you to Functional Reactive Programming (FRP) and its formulations, as well as showing you how it inspired Compositional Event Systems (CES). It then guides you in understanding Reactive Programming as well as learning how to develop your ability to work with time-varying values thanks to examples of reactive applications implemented in different frameworks. You'll also gain insight into some interesting Reactive design patterns such as the simple component, circuit breaker, request-response, and multiple-master replication. Finally, the book introduces microservices-based architecture in Clojure and closes with examples of unit testing frameworks. By the end of the book, you will have gained all the knowledge you need to create applications using different Reactive Programming approaches. What you will learn Understand how to think in terms of time-varying values and event streams Create, compose, and transform observable sequences using Reactive extensions Build a CES framework from scratch using core.async as its foundation Develop a simple ClojureScript game using Reagi Integrate Om and RxJS in a web application Implement a reactive API in Amazon Web Services (AWS) Discover helpful approaches to backpressure and error handling Get to grips with futures and their applications Who this book is for If you’re interested in using Reactive Programming to build asynchronous and concurrent applications, this is the book for you. Basic knowledge of Clojure programming is necessary to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789341965","title":"Hands-On Reactive Programming with Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g4KFDwAAQBAJ&source=gbs_api","authors":["Konrad Szydlo","Leonardo Borges"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tgkhAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":62.4,"subtitle":null,"description":"This is a comprehensive account of the semantics and the implementation of the whole Lisp family of languages, namely Lisp, Scheme and related dialects. It describes 11 interpreters and 2 compilers, including very recent techniques of interpretation and compilation. The book is in two parts. The first starts from a simple evaluation function and enriches it with multiple name spaces, continuations and side-effects with commented variants, while at the same time the language used to define these features is reduced to a simple lambda-calculus. Denotational semantics is then naturally introduced. The second part focuses more on implementation techniques and discusses precompilation for fast interpretation: threaded code or bytecode; compilation towards C. Some extensions are also described such as dynamic evaluation, reflection, macros and objects. This will become the new standard reference for people wanting to know more about the Lisp family of languages: how they work, how they are implemented, what their variants are and why such variants exist. The full code is supplied (and also available over the Net). A large bibliography is given as well as a considerable number of exercises. Thus it may also be used by students to accompany second courses on Lisp or Scheme.","language":"en","currency":"USD","id":"1139643282","title":"Lisp in Small Pieces","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tgkhAwAAQBAJ&source=gbs_api","authors":["Christian Queinnec"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KaqkAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book consists of a practical, exampleoriented approach that aims to help you learn how to use Clojure for data analysis quickly and efficiently. This book is great for those who have experience with Clojure and need to use it to perform data analysis. This book will also be hugely beneficial for readers with basic experience in data analysis and statistics.","language":"en","currency":"USD","id":"1783284145","title":"Mastering Clojure Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KaqkAwAAQBAJ&source=gbs_api","authors":["Eric Rochester"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":366,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z0bcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Redefining the Architect's Role in the Digital Enterprise","description":"As the digital economy changes the rules of the game for enterprises, the role of software and IT architects is also transforming. Rather than focus on technical decisions alone, architects and senior technologists need to combine organizational and technical knowledge to effect change in their company’s structure and processes. To accomplish that, they need to connect the IT engine room to the penthouse, where the business strategy is defined. In this guide, author Gregor Hohpe shares real-world advice and hard-learned lessons from actual IT transformations. His anecdotes help architects, senior developers, and other IT professionals prepare for a more complex but rewarding role in the enterprise. This book is ideal for: Software architects and senior developers looking to shape the company’s technology direction or assist in an organizational transformation Enterprise architects and senior technologists searching for practical advice on how to navigate technical and organizational topics CTOs and senior technical architects who are devising an IT strategy that impacts the way the organization works IT managers who want to learn what’s worked and what hasn’t in large-scale transformation","language":"en","currency":"USD","id":"1492077496","title":"The Software Architect Elevator","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z0bcDwAAQBAJ&source=gbs_api","authors":["Gregor Hohpe"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-s2xL0pVsLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"It’s easy to write correct Ruby code, but to gain the fluency needed to write great Ruby code, you must go beyond syntax and absorb the “Ruby way” of thinking and problem solving. In Eloquent Ruby, Russ Olsen helps you write Ruby like true Rubyists do–so you can leverage its immense, surprising power. Olsen draws on years of experience internalizing the Ruby culture and teaching Ruby to other programmers. He guides you to the “Ah Ha!” moments when it suddenly becomes clear why Ruby works the way it does, and how you can take advantage of this language’s elegance and expressiveness. Eloquent Ruby starts small, answering tactical questions focused on a single statement, method, test, or bug. You’ll learn how to write code that actually looks like Ruby (not Java or C#); why Ruby has so many control structures; how to use strings, expressions, and symbols; and what dynamic typing is really good for. Next, the book addresses bigger questions related to building methods and classes. You’ll discover why Ruby classes contain so many tiny methods, when to use operator overloading, and when to avoid it. Olsen explains how to write Ruby code that writes its own code–and why you’ll want to. He concludes with powerful project-level features and techniques ranging from gems to Domain Specific Languages. A part of the renowned Addison-Wesley Professional Ruby Series, Eloquent Ruby will help you “put on your Ruby-colored glasses” and get results that make you a true believer.","language":"en","currency":"USD","id":"0321700279","title":"Eloquent Ruby","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-s2xL0pVsLUC&source=gbs_api","authors":["Russ Olsen"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zJGVnUKijzYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"Learn to Program in Lisp, One Game at a Time!","description":"Lisp has been hailed as the world’s most powerful programming language, but its cryptic syntax and academic reputation can be enough to scare off even experienced programmers. Those dark days are finally over—Land of Lisp brings the power of functional programming to the people! With his brilliantly quirky comics and out-of-this-world games, longtime Lisper Conrad Barski teaches you the mysteries of Common Lisp. You’ll start with the basics, like list manipulation, I\/O, and recursion, then move on to more complex topics like macros, higher order programming, and domain-specific languages. Then, when your brain overheats, you can kick back with an action-packed comic book interlude! Along the way you’ll create (and play) games like Wizard Adventure, a text adventure with a whiskey-soaked twist, and Grand Theft Wumpus, the most violent version of Hunt the Wumpus the world has ever seen. You'll learn to: –Master the quirks of Lisp’s syntax and semantics –Write concise and elegant functional programs –Use macros, create domain-specific languages, and learn other advanced Lisp techniques –Create your own web server, and use it to play browser-based games –Put your Lisp skills to the test by writing brain-melting games like Dice of Doom and Orc Battle With Land of Lisp, the power of functional programming is yours to wield.","language":"en","currency":"USD","id":"1593273495","title":"Land of Lisp","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zJGVnUKijzYC&source=gbs_api","authors":["Conrad Barski"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZQJnYoAmw6gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.66,"subtitle":null,"description":"Richard Bird takes a radical approach to algorithm design, namely, design by calculation. These 30 short chapters each deal with a particular programming problem drawn from sources as diverse as games and puzzles, intriguing combinatorial tasks, and more familiar areas such as data compression and string matching. Each pearl starts with the statement of the problem expressed using the functional programming language Haskell, a powerful yet succinct language for capturing algorithmic ideas clearly and simply. The novel aspect of the book is that each solution is calculated from an initial formulation of the problem in Haskell by appealing to the laws of functional programming. Pearls of Functional Algorithm Design will appeal to the aspiring functional programmer, students and teachers interested in the principles of algorithm design, and anyone seeking to master the techniques of reasoning about programs in an equational style.","language":"en","currency":"USD","id":"1139490605","title":"Pearls of Functional Algorithm Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZQJnYoAmw6gC&source=gbs_api","authors":["Richard Bird"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QesxXj_ecD0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"A Beginner's Guide","description":"It's all in the name: Learn You a Haskell for Great Good! is a hilarious, illustrated guide to this complex functional language. Packed with the author's original artwork, pop culture references, and most importantly, useful example code, this book teaches functional fundamentals in a way you never thought possible. You'll start with the kid stuff: basic syntax, recursion, types and type classes. Then once you've got the basics down, the real black belt master-class begins: you'll learn to use applicative functors, monads, zippers, and all the other mythical Haskell constructs you've only read about in storybooks. As you work your way through the author's imaginative (and occasionally insane) examples, you'll learn to: –Laugh in the face of side effects as you wield purely functional programming techniques –Use the magic of Haskell's \"laziness\" to play with infinite sets of data –Organize your programs by creating your own types, type classes, and modules –Use Haskell's elegant input\/output system to share the genius of your programs with the outside world Short of eating the author's brain, you will not find a better way to learn this powerful language than reading Learn You a Haskell for Great Good!","language":"en","currency":"USD","id":"1593272952","title":"Learn You a Haskell for Great Good!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QesxXj_ecD0C&source=gbs_api","authors":["Miran Lipovaca"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QWOWqHANWoAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.79,"subtitle":null,"description":"Praise for Design Patterns in Ruby \" Design Patterns in Ruby documents smart ways to resolve many problems that Ruby developers commonly encounter. Russ Olsen has done a great job of selecting classic patterns and augmenting these with newer patterns that have special relevance for Ruby. He clearly explains each idea, making a wealth of experience available to Ruby developers for their own daily work.\" —Steve Metsker, Managing Consultant with Dominion Digital, Inc. \"This book provides a great demonstration of the key 'Gang of Four' design patterns without resorting to overly technical explanations. Written in a precise, yet almost informal style, this book covers enough ground that even those without prior exposure to design patterns will soon feel confident applying them using Ruby. Olsen has done a great job to make a book about a classically 'dry' subject into such an engaging and even occasionally humorous read.\" —Peter Cooper \"This book renewed my interest in understanding patterns after a decade of good intentions. Russ picked the most useful patterns for Ruby and introduced them in a straightforward and logical manner, going beyond the GoF's patterns. This book has improved my use of Ruby, and encouraged me to blow off the dust covering the GoF book.\" —Mike Stok \" Design Patterns in Ruby is a great way for programmers from statically typed objectoriented languages to learn how design patterns appear in a more dynamic, flexible language like Ruby.\" —Rob Sanheim, Ruby Ninja, Relevance Most design pattern books are based on C++ and Java. But Ruby is different—and the language's unique qualities make design patterns easier to implement and use. In this book, Russ Olsen demonstrates how to combine Ruby's power and elegance with patterns, and write more sophisticated, effective software with far fewer lines of code. After reviewing the history, concepts, and goals of design patterns, Olsen offers a quick tour of the Ruby language—enough to allow any experienced software developer to immediately utilize patterns with Ruby. The book especially calls attention to Ruby features that simplify the use of patterns, including dynamic typing, code closures, and \"mixins\" for easier code reuse. Fourteen of the classic \"Gang of Four\" patterns are considered from the Ruby point of view, explaining what problems each pattern solves, discussing whether traditional implementations make sense in the Ruby environment, and introducing Ruby-specific improvements. You'll discover opportunities to implement patterns in just one or two lines of code, instead of the endlessly repeated boilerplate that conventional languages often require. Design Patterns in Ruby also identifies innovative new patterns that have emerged from the Ruby community. These include ways to create custom objects with metaprogramming, as well as the ambitious Rails-based \"Convention Over Configuration\" pattern, designed to help integrate entire applications and frameworks. Engaging, practical, and accessible, Design Patterns in Ruby will help you build better software while making your Ruby programming experience more rewarding.","language":"en","currency":"USD","id":"9780132702508","title":"Design Patterns in Ruby (Adobe Reader)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QWOWqHANWoAC&source=gbs_api","authors":["Russ Olsen"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mJ7NDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Use functional programming to build data-centric applications with Clojure and ClojureScript","description":"The Clojure Workshop introduces you to the world of functional programming, helping you learn how to build real-world applications in Clojure and ClojureScript, keeping best practices, high performance and scalability in mind.","language":"en","currency":"USD","id":"1838825118","title":"The The Clojure Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mJ7NDwAAQBAJ&source=gbs_api","authors":["Joseph Fahey","Thomas Haratyk","Scott McCaughie","Yehonathan Sharvit","Konrad Szydlo"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IfEWBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for anyone who is interested in solving UI problems with AngularJS. Working knowledge of JavaScript, HTML, and CSS is assumed.","language":"en","currency":"USD","id":"1783288485","title":"AngularJS UI Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IfEWBQAAQBAJ&source=gbs_api","authors":["Amit Gharat","Matthias Nehlsen"]},{"pageCount":1029,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mHfNCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":58.36,"subtitle":"The Language","description":"The defacto standard - a must-have for all LISP programmers. In this greatly expanded edition of the defacto standard, you'll learn about the nearly 200 changes already made since original publication - and find out about gray areas likely to be revised later. Written by the Vice- Chairman of X3J13 (the ANSI committee responsible for the standardization of Common Lisp) and co-developer of the language itself, the new edition contains the entire text of the first edition plus six completely new chapters. They cover: - CLOS, the Common Lisp Object System, with new features to support function overloading and object-oriented programming, plus complete technical specifications * Loops, a powerful control structure for multiple variables * Conditions, a generalization of the error signaling mechanism * Series and generators * Plus other subjects not part of the ANSI standards but of interest to professional programmers. Throughout, you'll find fresh examples, additional clarifications, warnings, and tips - all presented with the author's customary vigor and wit.","language":"en","currency":"USD","id":"0080502261","title":"Common LISP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mHfNCgAAQBAJ&source=gbs_api","authors":["Guy Steele"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jiménez","Graham Lee","Corey Wade"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LebtAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Paradigm Over Syntax","description":"If you’re familiar with functional programming basics and want to gain a much deeper understanding, this in-depth guide takes you beyond syntax and demonstrates how you need to think in a new way. Software architect Neal Ford shows intermediate to advanced developers how functional coding allows you to step back a level of abstraction so you can see your programming problem with greater clarity. Each chapter shows you various examples of functional thinking, using numerous code examples from Java 8 and other JVM languages that include functional capabilities. This book may bend your mind, but you’ll come away with a much better grasp of functional programming concepts. Understand why many imperative languages are adding functional capabilities Compare functional and imperative solutions to common problems Examine ways to cede control of routine chores to the runtime Learn how memoization and laziness eliminate hand-crafted solutions Explore functional approaches to design patterns and code reuse View real-world examples of functional thinking with Java 8, and in functional architectures and web frameworks Learn the pros and cons of living in a paradigmatically richer world If you’re new to functional programming, check out Josh Backfield’s book Becoming Functional.","language":"en","currency":"USD","id":"1449365477","title":"Functional Thinking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LebtAwAAQBAJ&source=gbs_api","authors":["Neal Ford"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OIhuxqUO2TcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Introducing Functional Programming with Underscore.js","description":"How can you overcome JavaScript language oddities and unsafe features? With this book, you’ll learn how to create code that’s beautiful, safe, and simple to understand and test by using JavaScript’s functional programming support. Author Michael Fogus shows you how to apply functional-style concepts with Underscore.js, a JavaScript library that facilitates functional programming techniques. Sample code is available on GitHub at https:\/\/github.com\/funjs\/book-source. Fogus helps you think in a functional way to help you minimize complexity in the programs you build. If you’re a JavaScript programmer hoping to learn functional programming techniques, or a functional programmer looking to learn JavaScript, this book is the ideal introduction. Use applicative programming techniques with first-class functions Understand how and why you might leverage variable scoping and closures Delve into higher-order functions—and learn how they take other functions as arguments for maximum advantage Explore ways to compose new functions from existing functions Get around JavaScript’s limitations for using recursive functions Reduce, hide, or eliminate the footprint of state change in your programs Practice flow-based programming with chains and functional pipelines Discover how to code without using classes","language":"en","currency":"USD","id":"1449360785","title":"Functional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OIhuxqUO2TcC&source=gbs_api","authors":["Michael Fogus"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g1jBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Advanced techniques to build and administer scalable and reliable PostgreSQL database applications, 3rd Edition","description":"Master PostgreSQL 12 features such as advanced indexing, high availability, monitoring, and much more to efficiently manage and maintain your database Key Features Grasp advanced PostgreSQL 12 concepts with real-world examples and sample datasets Explore query parallelism, data replication, database administration, and more Extend PostgreSQL functionalities to suit your organization’s needs with minimal effort Book Description Thanks to its reliability, robustness, and high performance, PostgreSQL has become the most advanced open source database on the market. This third edition of Mastering PostgreSQL helps you build dynamic database solutions for enterprise applications using the latest release of PostgreSQL, which enables database analysts to design both physical and technical aspects of system architecture with ease. Starting with an introduction to the newly released features in PostgreSQL 12, this book will help you build efficient and fault-tolerant PostgreSQL applications. You’ll thoroughly examine the advanced features of PostgreSQL, including logical replication, database clusters, performance tuning, monitoring, and user management. You’ll also work with the PostgreSQL optimizer, configure PostgreSQL for high speed, and understand how to move from Oracle to PostgreSQL. As you progress through the chapters, you’ll cover transactions, locking, indexes, and how to optimize queries for improved performance. Additionally, you’ll learn how to manage network security and explore backups and replications while understanding useful PostgreSQL extensions to help you in optimizing the performance of large databases. By the end of this PostgreSQL book, you’ll be able to get the most out of your database by implementing advanced administrative tasks effortlessly. What you will learn Understand the advanced SQL functions in PostgreSQL 12 Use indexing features in PostgreSQL to fine-tune the performance of queries Work with stored procedures and manage backup and recovery Master replication and failover techniques to reduce data loss Replicate PostgreSQL database systems to create backups and to scale your database Manage and improve the security of your server to protect your data Troubleshoot your PostgreSQL instance for solutions to common and not-so-common problems Who this book is for This book is for PostgreSQL developers and administrators and database professionals who want to implement advanced functionalities and master complex administrative tasks with PostgreSQL 12. Prior exposure to PostgreSQL as well as familiarity with the basics of database administration is expected.","language":"en","currency":"USD","id":"1838985271","title":"Mastering PostgreSQL 12","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g1jBDwAAQBAJ&source=gbs_api","authors":["Hans-Jürgen Schönig"]},{"pageCount":501,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dVJvr8PtCMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"* Treats LISP as a language for commercial applications, not a language for academic AI concerns. This could be considered to be a secondary text for the Lisp course that most schools teach . This would appeal to students who sat through a LISP course in college without quite getting it – so a \"nostalgia\" approach, as in \"wow-lisp can be practical...\" * Discusses the Lisp programming model and environment. Contains an introduction to the language and gives a thorough overview of all of Common Lisp’s main features. * Designed for experienced programmers no matter what languages they may be coming from and written for a modern audience—programmers who are familiar with languages like Java, Python, and Perl. * Includes several examples of working code that actually does something useful like Web programming and database access.","language":"en","currency":"USD","id":"1430200170","title":"Practical Common Lisp","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dVJvr8PtCMUC&source=gbs_api","authors":["Peter Seibel"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hS9mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.16,"subtitle":null,"description":null,"language":"en","currency":"USD","id":"0135229472","title":"The Design and Evolution of C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hS9mDwAAQBAJ&source=gbs_api","authors":["Bjarne Stroustrup"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IV8hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":null,"description":"Most books on data structures assume an imperative language like C or C++. However, data structures for these languages do not always translate well to functional languages such as Standard ML, Haskell, or Scheme. This book describes data structures from the point of view of functional languages, with examples, and presents design techniques so that programmers can develop their own functional data structures. It includes both classical data structures, such as red-black trees and binomial queues, and a host of new data structures developed exclusively for functional languages. All source code is given in Standard ML and Haskell, and most of the programs can easily be adapted to other functional languages. This handy reference for professional programmers working with functional languages can also be used as a tutorial or for self-study.","language":"en","currency":"USD","id":"1139811010","title":"Purely Functional Data Structures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IV8hAwAAQBAJ&source=gbs_api","authors":["Chris Okasaki"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Mastering Synchronization, STM, and Actors","description":"More than ever, learning to program concurrency is critical to creating faster, responsive applications. Speedy and affordable multicore hardware is driving the demand for high-performing applications, and you can leverage the Java platform to bring these applications to life. Concurrency on the Java platform has evolved, from the synchronization model of JDK to software transactional memory (STM) and actor-based concurrency. This book is the first to show you all these concurrency styles so you can compare and choose what works best for your applications. You'll learn the benefits of each of these models, when and how to use them, and what their limitations are. Through hands-on exercises, you'll learn how to avoid shared mutable state and how to write good, elegant, explicit synchronization-free programs so you can create easy and safe concurrent applications. The techniques you learn in this book will take you from dreading concurrency to mastering and enjoying it. Best of all, you can work with Java or a JVM language of your choice - Clojure, JRuby, Groovy, or Scala - to reap the growing power of multicore hardware. If you are a Java programmer, you'd need JDK 1.5 or later and the Akka 1.0 library. In addition, if you program in Scala, Clojure, Groovy or JRuby you'd need the latest version of your preferred language. Groovy programmers will also need GPars.","language":"en","currency":"USD","id":"1680504304","title":"Programming Concurrency on the JVM","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PA9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tjjrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Modern Patterns for Developing React Apps","description":"If you want to learn how to build efficient React applications, this is your book. Ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, this updated edition provides best practices and patterns for writing modern React code. No prior knowledge of React or functional JavaScript is necessary. With their learning road map, authors Alex Banks and Eve Porcello show you how to create UIs that can deftly display changes without page reloads on large-scale, data-driven websites. You’ll also discover how to work with functional programming and the latest ECMAScript features. Once you learn how to build React components with this hands-on guide, you’ll understand just how useful React can be in your organization. Understand key functional programming concepts with JavaScriptLook under the hood to learn how React runs in the browserCreate application presentation layers with React componentsManage data and reduce the time you spend debugging applicationsIncorporate React Hooks to manage state and fetch dataUse a routing solution for single-page application featuresLearn how to structure React applications with servers in mind","language":"en","currency":"USD","id":"1492051675","title":"Learning React","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tjjrDwAAQBAJ&source=gbs_api","authors":["Alex Banks","Eve Porcello"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Sk0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Implement a High-Performance Enterprise Java Application Modernization Strategy Learn cutting-edge techniques and processes to systematically and strategically modernize legacy Java applications with predictability, consistency, and confidence. This Oracle Press guide offers an innovative blueprint that empowers corporate management teams to better understand necessary technical requirements and enables Java architects and developers to better align with agile business needs. Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio contains modernization approaches that offer end-to-end Java application portfolio visibility so that application modernization projects can stay on-schedule and within budget.","language":"en","currency":"USD","id":"0071842047","title":"Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Sk0DwAAQBAJ&source=gbs_api","authors":["G. Venkat"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3lLGDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Getting Started in Functional Programming","description":"Smooth, powerful, and small, Elixir is an excellent language for learning functional programming, and with this hands-on introduction, you’ll discover just how powerful Elixir can be. Authors Simon St. Laurent and J. David Eisenberg show you how Elixir combines the robust functional programming of Erlang with an approach that looks more like Ruby, and includes powerful macro features for metaprogramming. Updated to cover Elixir 1.4, the second edition of this practical book helps you write simple Elixir programs by teaching one skill at a time. Once you pick up pattern matching, process-oriented programming, and other concepts, you’ll understand why Elixir makes it easier to build concurrent and resilient programs that scale up and down with ease. Get comfortable with IEx, Elixir’s command line interface Learn Elixir’s basic structures by working with numbers Discover atoms, pattern matching, and guards: the foundations of your program structure Delve into the heart of Elixir processing with recursion, strings, lists, and higher-order functions Create Elixir processes and send messages among them Store and manipulate structured data with Erlang Term Storage and the Mnesia database Build resilient applications with the Open Telecom Platform","language":"en","currency":"USD","id":"1491956852","title":"Introducing Elixir","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3lLGDQAAQBAJ&source=gbs_api","authors":["Simon St. Laurent","J. David Eisenberg"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PkXiCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Extend the power of your infrastructure and applications with Salt modules About This Book Get the most up-to-date practical resource on writing new Salt modules and extending Salt Learn through use cases and encounter both commonly-used modules as well as advanced ones Effectively troubleshoot problems and hiccups encountered while building and putting modules to work Who This Book Is For This book is for both new and existing Salt developers who are looking to build and write new Salt modules. Some prior Python development experience is expected. What You Will Learn Understand the working of Salt's Loader system Write several of the most common types of Salt modules Interact between different kinds of modules and build new ones Submit open source modules upstream to the Salt project Make Salt interact with third-party services and applications In Detail Salt already ships with a very powerful set of tools, but that doesn't mean that they all suit your needs perfectly. By adding your own modules and enhancing existing ones, you can bring the functionality that you need to increase your productivity. Extending SaltStack follows a tutorial-based approach to explain different types of modules, from fundamentals to complete and full-functioning modules. Starting with the Loader system that drives Salt, this book will guide you through the most common types of modules. First you will learn how to write execution modules. Then you will extend the configuration using the grain, pillar, and SDB modules. Next up will be state modules and then the renderers that can be used with them. This will be followed with returner and output modules, which increase your options to manage return data. After that, there will be modules for external file servers, clouds, beacons, and finally external authentication and wheel modules to manage the master. With this guide in hand, you will be prepared to create, troubleshoot, and manage the most common types of Salt modules and take your infrastructure to new heights! Style and approach This book follows a step-by-step tutorial-based approach explaining the different types of modules, from fundamentals to complete and full-functioning modules.","language":"en","currency":"USD","id":"1785888161","title":"Extending SaltStack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PkXiCwAAQBAJ&source=gbs_api","authors":["Joseph Hall"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U5LUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Enabling Test-Driven Development, Domain-Driven Design, and Event-Driven Microservices","description":"As Python continues to grow in popularity, projects are becoming larger and more complex. Many Python developers are taking an interest in high-level software design patterns such as hexagonal\/clean architecture, event-driven architecture, and the strategic patterns prescribed by domain-driven design (DDD). But translating those patterns into Python isn’t always straightforward. With this hands-on guide, Harry Percival and Bob Gregory from MADE.com introduce proven architectural design patterns to help Python developers manage application complexity—and get the most value out of their test suites. Each pattern is illustrated with concrete examples in beautiful, idiomatic Python, avoiding some of the verbosity of Java and C# syntax. Patterns include: Dependency inversion and its links to ports and adapters (hexagonal\/clean architecture) Domain-driven design’s distinction between Entities, Value Objects, and Aggregates Repository and Unit of Work patterns for persistent storage Events, commands, and the message bus Command-query responsibility segregation (CQRS) Event-driven architecture and reactive microservices","language":"en","currency":"USD","id":"1492052159","title":"Architecture Patterns with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U5LUDwAAQBAJ&source=gbs_api","authors":["Harry Percival","Bob Gregory"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oVadw8Jf0cYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Anyone who develops software for a living needs a proven way to produce it better, faster, and cheaper. The Productive Programmer offers critical timesaving and productivity tools that you can adopt right away, no matter what platform you use. Master developer Neal Ford not only offers advice on the mechanics of productivity-how to work smarter, spurn interruptions, get the most out your computer, and avoid repetition-he also details valuable practices that will help you elude common traps, improve your code, and become more valuable to your team. You'll learn to: Write the test before you write the code Manage the lifecycle of your objects fastidiously Build only what you need now, not what you might need later Apply ancient philosophies to software development Question authority, rather than blindly adhere to standards Make hard things easier and impossible things possible through meta-programming Be sure all code within a method is at the same level of abstraction Pick the right editor and assemble the best tools for the job This isn't theory, but the fruits of Ford's real-world experience as an Application Architect at the global IT consultancy ThoughtWorks. Whether you're a beginner or a pro with years of experience, you'll improve your work and your career with the simple and straightforward principles in The Productive Programmer.","language":"en","currency":"USD","id":"9780596551865","title":"The Productive Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oVadw8Jf0cYC&source=gbs_api","authors":["Neal Ford"]},{"pageCount":824,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ymLHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn to write clean, efficient code and build high-performance applications with Go","description":"The Go Workshop takes you from being a novice Go programmer to a confident developer who can leverage the key features of the language to build real-world applications. This book helps you cut through excessive theory and delve into the practical features and techniques that are commonly applied to design performant, scalable applications.","language":"en","currency":"USD","id":"1838640150","title":"The The Go Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ymLHDwAAQBAJ&source=gbs_api","authors":["Delio D'Anna","Andrew Hayes","Sam Hennessy","Jeremy Leasor","Gobin Sougrakpam","Dániel Szabó"]},{"pageCount":362,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y54ACAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":null,"description":"Since the summer of 1973, when I became a Burroughs Research Fellow, my life has been very different from what it had been before. The daily routine changed: instead of going to the University each day, where I used to spend most of my time in the company of others, I now went there only one day a week and was most of the time -that is, when not travelling!- alone in my study. In my solitude, mail and the written word in general became more and more important. The circumstance that my employer and I had the Atlantic Ocean between us was a further incentive to keep a fairly complete record of what I was doing. The public part of that output found its place in what became known as \"the EWD series\", which can be viewed as a form of scientific correspondence, possible since the advent of the copier. (That same copier makes it hard to estimate its actual distribution: I myself made about two dozen copies of my texts, but their recipients were welcome to act as further nodes of the distribution tree. ) The decision to publish a se1ection from the EWD series in book form was at first highly embarrassing, but as the months went by I got used to the idea. As soon as some guiding principles had been adopted -preferably not published elsewhere, as varied and as representative as possible, etc.","language":"en","currency":"USD","id":"146125695X","title":"Selected Writings on Computing: A personal Perspective","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y54ACAAAQBAJ&source=gbs_api","authors":["Edsger W. Dijkstra"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Nxi7O7FCdIEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"The Case Against XP","description":"Stephens and Rosenberg examine XP in the context of existing methodologies and processes such as RUP, ICONIX, Spiral, RAD, DSDM, etc – and show how XP goals can be achieved using these existing processes.","language":"en","currency":"USD","id":"1430208104","title":"Extreme Programming Refactored","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Nxi7O7FCdIEC&source=gbs_api","authors":["Don Rosenberg","Matt Stephens"]},{"pageCount":750,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w5QfDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":"","description":"A hands-on and introductory guide to the art of modern application and infrastructure monitoring and metrics. We start small and then build on what you learn to scale out to multi-site, multi-tier applications. The book is written for both developers and sysadmins. We focus on building monitored and measurable applications. We also use tools that are designed to handle the challenges of managing Cloud, containerised and distributed applications and infrastructure. In the book we'll deliver: * An introduction to monitoring, metrics and measurement. * A scalable framework for monitoring hosts (including Docker and containers), services and applications built on top of the Riemann event stream processor. * Graphing and metric storage using Graphite and Grafana. * Logging with Logstash. * A framework for high quality and useful notifications * Techniques for developing and building monitorable applications * A capstone that puts all the pieces together to monitor a multi-tier application.","language":"en","currency":"USD","id":"0988820242","title":"The Art of Monitoring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w5QfDAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3lLGDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Getting Started in Functional Programming","description":"Smooth, powerful, and small, Elixir is an excellent language for learning functional programming, and with this hands-on introduction, you’ll discover just how powerful Elixir can be. Authors Simon St. Laurent and J. David Eisenberg show you how Elixir combines the robust functional programming of Erlang with an approach that looks more like Ruby, and includes powerful macro features for metaprogramming. Updated to cover Elixir 1.4, the second edition of this practical book helps you write simple Elixir programs by teaching one skill at a time. Once you pick up pattern matching, process-oriented programming, and other concepts, you’ll understand why Elixir makes it easier to build concurrent and resilient programs that scale up and down with ease. Get comfortable with IEx, Elixir’s command line interface Learn Elixir’s basic structures by working with numbers Discover atoms, pattern matching, and guards: the foundations of your program structure Delve into the heart of Elixir processing with recursion, strings, lists, and higher-order functions Create Elixir processes and send messages among them Store and manipulate structured data with Erlang Term Storage and the Mnesia database Build resilient applications with the Open Telecom Platform","language":"en","currency":"USD","id":"1491956852","title":"Introducing Elixir","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3lLGDQAAQBAJ&source=gbs_api","authors":["Simon St. Laurent","J. David Eisenberg"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G8h3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":null,"description":"Mit diesen sieben Sprachen erkunden Sie die wichtigsten Programmiermodelle unserer Zeit. Lernen Sie die dynamische Typisierung kennen, die Ruby, Python und Perl so flexibel und verlockend macht. Lernen Sie das Prototyp-System verstehen, das das Herzstück von JavaScript bildet. Erfahren Sie, wie das Pattern Matching in Prolog die Entwicklung von Scala und Erlang beeinflusst hat. Entdecken Sie, wie sich die rein funktionale Programmierung in Haskell von der Lisp-Sprachfamilie, inklusive Clojure, unterscheidet. Erkunden Sie die parallelen Techniken, die das Rückgrat der nächsten Generation von Internet-Anwendungen bilden werden. Finden Sie heraus, wie man Erlangs \"Lass es abstürzen\"-Philosophie zum Aufbau fehlertoleranter Systeme nutzt. Lernen Sie das Aktor-Modell kennen, das das parallele Design bei Io und Scala bestimmt. Entdecken Sie, wie Clojure die Versionierung nutzt, um einige der schwierigsten Probleme der Nebenläufigkeit zu lösen. Hier finden Sie alles in einem Buch. Nutzen Sie die Konzepte einer Sprache, um kreative Lösungen in einer anderen Programmiersprache zu finden - oder entdecken Sie einfach eine Sprache, die Sie bisher nicht kannten. Man kann nie wissen - vielleicht wird sie sogar eines ihrer neuen Lieblingswerkzeuge.","language":"de","currency":"USD","id":"3868994688","title":"Sieben Wochen, sieben Sprachen (Prags)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G8h3DwAAQBAJ&source=gbs_api","authors":["Bruce A. Tate"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UuBU732z6zgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":38.47,"subtitle":null,"description":"The Robert C. Martin Clean Code Collection consists of two bestselling eBooks: Clean Code: A Handbook of Agile Software Craftmanship The Clean Coder: A Code of Conduct for Professional Programmers In Clean Code, legendary software expert Robert C. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. You will be challenged to think about what’s right about that code and what’s wrong with it. More important, you will be challenged to reassess your professional values and your commitment to your craft. In The Clean Coder, Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice--about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers of this collection will come away understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”--and how to say it When to say “Yes”--and what yes really means","language":"en","currency":"USD","id":"0132911221","title":"The Robert C. Martin Clean Code Collection (Collection)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UuBU732z6zgC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3lLGDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Getting Started in Functional Programming","description":"Smooth, powerful, and small, Elixir is an excellent language for learning functional programming, and with this hands-on introduction, you’ll discover just how powerful Elixir can be. Authors Simon St. Laurent and J. David Eisenberg show you how Elixir combines the robust functional programming of Erlang with an approach that looks more like Ruby, and includes powerful macro features for metaprogramming. Updated to cover Elixir 1.4, the second edition of this practical book helps you write simple Elixir programs by teaching one skill at a time. Once you pick up pattern matching, process-oriented programming, and other concepts, you’ll understand why Elixir makes it easier to build concurrent and resilient programs that scale up and down with ease. Get comfortable with IEx, Elixir’s command line interface Learn Elixir’s basic structures by working with numbers Discover atoms, pattern matching, and guards: the foundations of your program structure Delve into the heart of Elixir processing with recursion, strings, lists, and higher-order functions Create Elixir processes and send messages among them Store and manipulate structured data with Erlang Term Storage and the Mnesia database Build resilient applications with the Open Telecom Platform","language":"en","currency":"USD","id":"1491956852","title":"Introducing Elixir","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3lLGDQAAQBAJ&source=gbs_api","authors":["Simon St. Laurent","J. David Eisenberg"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G8h3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":null,"description":"Mit diesen sieben Sprachen erkunden Sie die wichtigsten Programmiermodelle unserer Zeit. Lernen Sie die dynamische Typisierung kennen, die Ruby, Python und Perl so flexibel und verlockend macht. Lernen Sie das Prototyp-System verstehen, das das Herzstück von JavaScript bildet. Erfahren Sie, wie das Pattern Matching in Prolog die Entwicklung von Scala und Erlang beeinflusst hat. Entdecken Sie, wie sich die rein funktionale Programmierung in Haskell von der Lisp-Sprachfamilie, inklusive Clojure, unterscheidet. Erkunden Sie die parallelen Techniken, die das Rückgrat der nächsten Generation von Internet-Anwendungen bilden werden. Finden Sie heraus, wie man Erlangs \"Lass es abstürzen\"-Philosophie zum Aufbau fehlertoleranter Systeme nutzt. Lernen Sie das Aktor-Modell kennen, das das parallele Design bei Io und Scala bestimmt. Entdecken Sie, wie Clojure die Versionierung nutzt, um einige der schwierigsten Probleme der Nebenläufigkeit zu lösen. Hier finden Sie alles in einem Buch. Nutzen Sie die Konzepte einer Sprache, um kreative Lösungen in einer anderen Programmiersprache zu finden - oder entdecken Sie einfach eine Sprache, die Sie bisher nicht kannten. Man kann nie wissen - vielleicht wird sie sogar eines ihrer neuen Lieblingswerkzeuge.","language":"de","currency":"USD","id":"3868994688","title":"Sieben Wochen, sieben Sprachen (Prags)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G8h3DwAAQBAJ&source=gbs_api","authors":["Bruce A. Tate"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UuBU732z6zgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":38.47,"subtitle":null,"description":"The Robert C. Martin Clean Code Collection consists of two bestselling eBooks: Clean Code: A Handbook of Agile Software Craftmanship The Clean Coder: A Code of Conduct for Professional Programmers In Clean Code, legendary software expert Robert C. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. You will be challenged to think about what’s right about that code and what’s wrong with it. More important, you will be challenged to reassess your professional values and your commitment to your craft. In The Clean Coder, Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice--about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers of this collection will come away understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”--and how to say it When to say “Yes”--and what yes really means","language":"en","currency":"USD","id":"0132911221","title":"The Robert C. Martin Clean Code Collection (Collection)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UuBU732z6zgC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书是一部讲解Kotlin语言的入门书籍，从Kotlin语言的基本语法一直讲到如何将其运用于Android开发。由浅入深、从理论到实战，帮助读者快速掌握Kotlin开发技巧。 全书共有10章内容，可分为三大部分：第一部分即第1章，主要介绍Kotlin语言的开发环境搭建；第二部分包含第2～5章，主要介绍Kotlin的基本语法知识，包括Kotlin的变量声明、控制语句、函数定义、类与对象等；第三部分包含第6～10章，主要介绍如何使用Kotlin进行实际的App开发工作，包括利用Kotlin操作简单控件、复杂控件、数据存储、自定义控件、网络通信等。为增强学习Kotlin语言的趣味，本书在讲解Kotlin的用法时，特别注意结合生活中的具体案例，并加以示范和运用。尤其是后面讲到利用Kotlin开发App的时候，精心设计了数个电商App的实战模块，例如电商App的登录模块、频道模块、购物车模块、团购模块、升级模块等。通过这些实战小项目，读者可迅速将Kotlin应用于App开发工作中。 本书适用于Android开发的广大从业者、Kotlin语言的业余爱好者，也可用作大中专院校与培训机构的Kotlin课程教材。","language":"zh-CN","currency":"USD","id":"7302498148","title":"Kotlin从零到精通Android开发","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSf7DwAAQBAJ&source=gbs_api","authors":["欧阳燊编著"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyj7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书从Kotlin语言的基础语法讲起，逐步深入到Kotlin进阶实战，并在最后配合项目实战案例，重点介绍了使用Kotlin+Spring Boot进行服务端开发和使用Kotlin进行Android应用程序开发的内容，让读者不但可以系统地学习Kotlin编程的相关知识，而且还能对Kotlin应用开发有更为深入的理解。 本书分为14章，涵盖的主要内容有Kotlin简介，Kotlin语法基础，类型系统与可空类型，类与面向对象编程，函数与函数式编程，扩展函数与属性，集合类，泛型，文件I\/O操作、正则表达式与多线程，使用Kotlin创建DSL，运算符重载与约定，元编程、注解与反射，Kotlin集成Spring Boot服务端开发，使用Kotlin进行Android开发。 本书内容通俗易懂，案例丰富，实用性强，特别适合Kotlin语言的入门读者和进阶读者阅读，也适合Android程序员、Java程序员等其他编程爱好者阅读，还适合作为相关培训机构的教材。","language":"zh-CN","currency":"USD","id":"7302508720","title":"Kotlin从入门到进阶实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyj7DwAAQBAJ&source=gbs_api","authors":["陈光金编著"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_nkcXZg5H2QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Leveraging Java Open Source Technologies","description":"Open source has had a profound effect on the Java community. Many Java open source projects have even become de-facto standards. The principal purpose of Enterprise Java Development on a Budget is to guide you through the development of a real enterprise Java application using nothing but open source Java tools, projects, and frameworks. This book is organized by activities and by particular open source projects that can help you take on the challenges of building the different tiers of your applications. The authors also present a realistic example application that covers most areas of enterprise application development. You'll find information on how to use and configure JBoss, Ant, XDoclet, Struts, ArgoUML, OJB, Hibernate, JUnit, SWT\/JFace, and others. Not only will you learn how to use each individual tool, but you'll also understand how to use them in synergy to create robust enterprise Java applications within your budget. Enterprise Java Development on a Budget combines coverage of best practices with information on the right open source Java tools and technologies, all of which will help support your Java development budget and goals.","language":"en","currency":"USD","id":"1430206829","title":"Enterprise Java Development on a Budget","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_nkcXZg5H2QC&source=gbs_api","authors":["Brian Sam-Bodden","Christopher M Judd"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0y9pgN1rFSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Lightweight Java Web Development Using Plain Old Java Objects in Spring, Hibernate, and Tapestry","description":"*ONLY Beginning-level book that introduces major Open Source Java tools and frameworks from scratch *Covers the most successful and prevalent open source and some lightweight tools and frameworks, like Spring, JBoss, Hibernate, Tapestry, Ant, and more *Shows how to build an enterprise application, end-to-end, integrating the different open source frameworks, including rapid enterprise Java application development","language":"en","currency":"USD","id":"9781430201427","title":"Beginning POJOs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0y9pgN1rFSkC&source=gbs_api","authors":["Brian Sam-Bodden"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UuBU732z6zgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":38.47,"subtitle":null,"description":"The Robert C. Martin Clean Code Collection consists of two bestselling eBooks: Clean Code: A Handbook of Agile Software Craftmanship The Clean Coder: A Code of Conduct for Professional Programmers In Clean Code, legendary software expert Robert C. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. You will be challenged to think about what’s right about that code and what’s wrong with it. More important, you will be challenged to reassess your professional values and your commitment to your craft. In The Clean Coder, Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice--about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers of this collection will come away understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”--and how to say it When to say “Yes”--and what yes really means","language":"en","currency":"USD","id":"0132911221","title":"The Robert C. Martin Clean Code Collection (Collection)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UuBU732z6zgC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书是一部讲解Kotlin语言的入门书籍，从Kotlin语言的基本语法一直讲到如何将其运用于Android开发。由浅入深、从理论到实战，帮助读者快速掌握Kotlin开发技巧。 全书共有10章内容，可分为三大部分：第一部分即第1章，主要介绍Kotlin语言的开发环境搭建；第二部分包含第2～5章，主要介绍Kotlin的基本语法知识，包括Kotlin的变量声明、控制语句、函数定义、类与对象等；第三部分包含第6～10章，主要介绍如何使用Kotlin进行实际的App开发工作，包括利用Kotlin操作简单控件、复杂控件、数据存储、自定义控件、网络通信等。为增强学习Kotlin语言的趣味，本书在讲解Kotlin的用法时，特别注意结合生活中的具体案例，并加以示范和运用。尤其是后面讲到利用Kotlin开发App的时候，精心设计了数个电商App的实战模块，例如电商App的登录模块、频道模块、购物车模块、团购模块、升级模块等。通过这些实战小项目，读者可迅速将Kotlin应用于App开发工作中。 本书适用于Android开发的广大从业者、Kotlin语言的业余爱好者，也可用作大中专院校与培训机构的Kotlin课程教材。","language":"zh-CN","currency":"USD","id":"7302498148","title":"Kotlin从零到精通Android开发","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSf7DwAAQBAJ&source=gbs_api","authors":["欧阳燊编著"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyj7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书从Kotlin语言的基础语法讲起，逐步深入到Kotlin进阶实战，并在最后配合项目实战案例，重点介绍了使用Kotlin+Spring Boot进行服务端开发和使用Kotlin进行Android应用程序开发的内容，让读者不但可以系统地学习Kotlin编程的相关知识，而且还能对Kotlin应用开发有更为深入的理解。 本书分为14章，涵盖的主要内容有Kotlin简介，Kotlin语法基础，类型系统与可空类型，类与面向对象编程，函数与函数式编程，扩展函数与属性，集合类，泛型，文件I\/O操作、正则表达式与多线程，使用Kotlin创建DSL，运算符重载与约定，元编程、注解与反射，Kotlin集成Spring Boot服务端开发，使用Kotlin进行Android开发。 本书内容通俗易懂，案例丰富，实用性强，特别适合Kotlin语言的入门读者和进阶读者阅读，也适合Android程序员、Java程序员等其他编程爱好者阅读，还适合作为相关培训机构的教材。","language":"zh-CN","currency":"USD","id":"7302508720","title":"Kotlin从入门到进阶实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyj7DwAAQBAJ&source=gbs_api","authors":["陈光金编著"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_nkcXZg5H2QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Leveraging Java Open Source Technologies","description":"Open source has had a profound effect on the Java community. Many Java open source projects have even become de-facto standards. The principal purpose of Enterprise Java Development on a Budget is to guide you through the development of a real enterprise Java application using nothing but open source Java tools, projects, and frameworks. This book is organized by activities and by particular open source projects that can help you take on the challenges of building the different tiers of your applications. The authors also present a realistic example application that covers most areas of enterprise application development. You'll find information on how to use and configure JBoss, Ant, XDoclet, Struts, ArgoUML, OJB, Hibernate, JUnit, SWT\/JFace, and others. Not only will you learn how to use each individual tool, but you'll also understand how to use them in synergy to create robust enterprise Java applications within your budget. Enterprise Java Development on a Budget combines coverage of best practices with information on the right open source Java tools and technologies, all of which will help support your Java development budget and goals.","language":"en","currency":"USD","id":"1430206829","title":"Enterprise Java Development on a Budget","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_nkcXZg5H2QC&source=gbs_api","authors":["Brian Sam-Bodden","Christopher M Judd"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0y9pgN1rFSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Lightweight Java Web Development Using Plain Old Java Objects in Spring, Hibernate, and Tapestry","description":"*ONLY Beginning-level book that introduces major Open Source Java tools and frameworks from scratch *Covers the most successful and prevalent open source and some lightweight tools and frameworks, like Spring, JBoss, Hibernate, Tapestry, Ant, and more *Shows how to build an enterprise application, end-to-end, integrating the different open source frameworks, including rapid enterprise Java application development","language":"en","currency":"USD","id":"9781430201427","title":"Beginning POJOs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0y9pgN1rFSkC&source=gbs_api","authors":["Brian Sam-Bodden"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dN93DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"Die Extension-Entwicklung ist eine zentrale Aufgabe von TYPO3-Programmierern, kaum eine TYPO3-Installation kommt ohne zusätzliche Erweiterungen des Systems aus. Seit TYPO3 v4.3 bietet das CMS ein eigenes Framework und eine Template-Engine, mit der die Extension-Entwicklung noch geschmeidiger wird - und das bei hoher Qualität des Codes. Mit Extbase und Fluid stehen zwei Tools zur Verfügung, die Sie darin unterstützen, saubere, modular gekapselte und zukunftssichere Extensions zu schreiben, die auch zu TYPO3 Neos bzw. TYPO3 FLOW portiert werden können. Dieses Buch beschreibt die Programmierkonzepte der Extension-Werkzeuge, zeigt aber auch ausführlich deren Einsatz in der Praxis. Dabei stammen alle Informationen aus erster Hand, denn die Autoren sind TYPO3-Experten, sie gewährleisten die zuverlässige Vermittlung aller Techniken, Details und Tricks. Für diese 2. Auflage wurde das Buch vollständig aktualisiert und deckt jetzt die TYPO3 CMS-Version 6.2 ab.","language":"de","currency":"USD","id":"3955614719","title":"Zukunftssichere TYPO3-Extensions mit Extbase und Fluid","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dN93DwAAQBAJ&source=gbs_api","authors":["Jochen Rau","Sebastian Kurfürst","Martin Helmich"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UuBU732z6zgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":38.47,"subtitle":null,"description":"The Robert C. Martin Clean Code Collection consists of two bestselling eBooks: Clean Code: A Handbook of Agile Software Craftmanship The Clean Coder: A Code of Conduct for Professional Programmers In Clean Code, legendary software expert Robert C. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. You will be challenged to think about what’s right about that code and what’s wrong with it. More important, you will be challenged to reassess your professional values and your commitment to your craft. In The Clean Coder, Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice--about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers of this collection will come away understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”--and how to say it When to say “Yes”--and what yes really means","language":"en","currency":"USD","id":"0132911221","title":"The Robert C. Martin Clean Code Collection (Collection)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UuBU732z6zgC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书是一部讲解Kotlin语言的入门书籍，从Kotlin语言的基本语法一直讲到如何将其运用于Android开发。由浅入深、从理论到实战，帮助读者快速掌握Kotlin开发技巧。 全书共有10章内容，可分为三大部分：第一部分即第1章，主要介绍Kotlin语言的开发环境搭建；第二部分包含第2～5章，主要介绍Kotlin的基本语法知识，包括Kotlin的变量声明、控制语句、函数定义、类与对象等；第三部分包含第6～10章，主要介绍如何使用Kotlin进行实际的App开发工作，包括利用Kotlin操作简单控件、复杂控件、数据存储、自定义控件、网络通信等。为增强学习Kotlin语言的趣味，本书在讲解Kotlin的用法时，特别注意结合生活中的具体案例，并加以示范和运用。尤其是后面讲到利用Kotlin开发App的时候，精心设计了数个电商App的实战模块，例如电商App的登录模块、频道模块、购物车模块、团购模块、升级模块等。通过这些实战小项目，读者可迅速将Kotlin应用于App开发工作中。 本书适用于Android开发的广大从业者、Kotlin语言的业余爱好者，也可用作大中专院校与培训机构的Kotlin课程教材。","language":"zh-CN","currency":"USD","id":"7302498148","title":"Kotlin从零到精通Android开发","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSf7DwAAQBAJ&source=gbs_api","authors":["欧阳燊编著"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyj7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书从Kotlin语言的基础语法讲起，逐步深入到Kotlin进阶实战，并在最后配合项目实战案例，重点介绍了使用Kotlin+Spring Boot进行服务端开发和使用Kotlin进行Android应用程序开发的内容，让读者不但可以系统地学习Kotlin编程的相关知识，而且还能对Kotlin应用开发有更为深入的理解。 本书分为14章，涵盖的主要内容有Kotlin简介，Kotlin语法基础，类型系统与可空类型，类与面向对象编程，函数与函数式编程，扩展函数与属性，集合类，泛型，文件I\/O操作、正则表达式与多线程，使用Kotlin创建DSL，运算符重载与约定，元编程、注解与反射，Kotlin集成Spring Boot服务端开发，使用Kotlin进行Android开发。 本书内容通俗易懂，案例丰富，实用性强，特别适合Kotlin语言的入门读者和进阶读者阅读，也适合Android程序员、Java程序员等其他编程爱好者阅读，还适合作为相关培训机构的教材。","language":"zh-CN","currency":"USD","id":"7302508720","title":"Kotlin从入门到进阶实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyj7DwAAQBAJ&source=gbs_api","authors":["陈光金编著"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_nkcXZg5H2QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Leveraging Java Open Source Technologies","description":"Open source has had a profound effect on the Java community. Many Java open source projects have even become de-facto standards. The principal purpose of Enterprise Java Development on a Budget is to guide you through the development of a real enterprise Java application using nothing but open source Java tools, projects, and frameworks. This book is organized by activities and by particular open source projects that can help you take on the challenges of building the different tiers of your applications. The authors also present a realistic example application that covers most areas of enterprise application development. You'll find information on how to use and configure JBoss, Ant, XDoclet, Struts, ArgoUML, OJB, Hibernate, JUnit, SWT\/JFace, and others. Not only will you learn how to use each individual tool, but you'll also understand how to use them in synergy to create robust enterprise Java applications within your budget. Enterprise Java Development on a Budget combines coverage of best practices with information on the right open source Java tools and technologies, all of which will help support your Java development budget and goals.","language":"en","currency":"USD","id":"1430206829","title":"Enterprise Java Development on a Budget","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_nkcXZg5H2QC&source=gbs_api","authors":["Brian Sam-Bodden","Christopher M Judd"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0y9pgN1rFSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Lightweight Java Web Development Using Plain Old Java Objects in Spring, Hibernate, and Tapestry","description":"*ONLY Beginning-level book that introduces major Open Source Java tools and frameworks from scratch *Covers the most successful and prevalent open source and some lightweight tools and frameworks, like Spring, JBoss, Hibernate, Tapestry, Ant, and more *Shows how to build an enterprise application, end-to-end, integrating the different open source frameworks, including rapid enterprise Java application development","language":"en","currency":"USD","id":"9781430201427","title":"Beginning POJOs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0y9pgN1rFSkC&source=gbs_api","authors":["Brian Sam-Bodden"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dN93DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"Die Extension-Entwicklung ist eine zentrale Aufgabe von TYPO3-Programmierern, kaum eine TYPO3-Installation kommt ohne zusätzliche Erweiterungen des Systems aus. Seit TYPO3 v4.3 bietet das CMS ein eigenes Framework und eine Template-Engine, mit der die Extension-Entwicklung noch geschmeidiger wird - und das bei hoher Qualität des Codes. Mit Extbase und Fluid stehen zwei Tools zur Verfügung, die Sie darin unterstützen, saubere, modular gekapselte und zukunftssichere Extensions zu schreiben, die auch zu TYPO3 Neos bzw. TYPO3 FLOW portiert werden können. Dieses Buch beschreibt die Programmierkonzepte der Extension-Werkzeuge, zeigt aber auch ausführlich deren Einsatz in der Praxis. Dabei stammen alle Informationen aus erster Hand, denn die Autoren sind TYPO3-Experten, sie gewährleisten die zuverlässige Vermittlung aller Techniken, Details und Tricks. Für diese 2. Auflage wurde das Buch vollständig aktualisiert und deckt jetzt die TYPO3 CMS-Version 6.2 ab.","language":"de","currency":"USD","id":"3955614719","title":"Zukunftssichere TYPO3-Extensions mit Extbase und Fluid","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dN93DwAAQBAJ&source=gbs_api","authors":["Jochen Rau","Sebastian Kurfürst","Martin Helmich"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UuBU732z6zgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":38.47,"subtitle":null,"description":"The Robert C. Martin Clean Code Collection consists of two bestselling eBooks: Clean Code: A Handbook of Agile Software Craftmanship The Clean Coder: A Code of Conduct for Professional Programmers In Clean Code, legendary software expert Robert C. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. You will be challenged to think about what’s right about that code and what’s wrong with it. More important, you will be challenged to reassess your professional values and your commitment to your craft. In The Clean Coder, Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice--about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers of this collection will come away understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”--and how to say it When to say “Yes”--and what yes really means","language":"en","currency":"USD","id":"0132911221","title":"The Robert C. Martin Clean Code Collection (Collection)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UuBU732z6zgC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书是一部讲解Kotlin语言的入门书籍，从Kotlin语言的基本语法一直讲到如何将其运用于Android开发。由浅入深、从理论到实战，帮助读者快速掌握Kotlin开发技巧。 全书共有10章内容，可分为三大部分：第一部分即第1章，主要介绍Kotlin语言的开发环境搭建；第二部分包含第2～5章，主要介绍Kotlin的基本语法知识，包括Kotlin的变量声明、控制语句、函数定义、类与对象等；第三部分包含第6～10章，主要介绍如何使用Kotlin进行实际的App开发工作，包括利用Kotlin操作简单控件、复杂控件、数据存储、自定义控件、网络通信等。为增强学习Kotlin语言的趣味，本书在讲解Kotlin的用法时，特别注意结合生活中的具体案例，并加以示范和运用。尤其是后面讲到利用Kotlin开发App的时候，精心设计了数个电商App的实战模块，例如电商App的登录模块、频道模块、购物车模块、团购模块、升级模块等。通过这些实战小项目，读者可迅速将Kotlin应用于App开发工作中。 本书适用于Android开发的广大从业者、Kotlin语言的业余爱好者，也可用作大中专院校与培训机构的Kotlin课程教材。","language":"zh-CN","currency":"USD","id":"7302498148","title":"Kotlin从零到精通Android开发","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSf7DwAAQBAJ&source=gbs_api","authors":["欧阳燊编著"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyj7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书从Kotlin语言的基础语法讲起，逐步深入到Kotlin进阶实战，并在最后配合项目实战案例，重点介绍了使用Kotlin+Spring Boot进行服务端开发和使用Kotlin进行Android应用程序开发的内容，让读者不但可以系统地学习Kotlin编程的相关知识，而且还能对Kotlin应用开发有更为深入的理解。 本书分为14章，涵盖的主要内容有Kotlin简介，Kotlin语法基础，类型系统与可空类型，类与面向对象编程，函数与函数式编程，扩展函数与属性，集合类，泛型，文件I\/O操作、正则表达式与多线程，使用Kotlin创建DSL，运算符重载与约定，元编程、注解与反射，Kotlin集成Spring Boot服务端开发，使用Kotlin进行Android开发。 本书内容通俗易懂，案例丰富，实用性强，特别适合Kotlin语言的入门读者和进阶读者阅读，也适合Android程序员、Java程序员等其他编程爱好者阅读，还适合作为相关培训机构的教材。","language":"zh-CN","currency":"USD","id":"7302508720","title":"Kotlin从入门到进阶实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyj7DwAAQBAJ&source=gbs_api","authors":["陈光金编著"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_nkcXZg5H2QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Leveraging Java Open Source Technologies","description":"Open source has had a profound effect on the Java community. Many Java open source projects have even become de-facto standards. The principal purpose of Enterprise Java Development on a Budget is to guide you through the development of a real enterprise Java application using nothing but open source Java tools, projects, and frameworks. This book is organized by activities and by particular open source projects that can help you take on the challenges of building the different tiers of your applications. The authors also present a realistic example application that covers most areas of enterprise application development. You'll find information on how to use and configure JBoss, Ant, XDoclet, Struts, ArgoUML, OJB, Hibernate, JUnit, SWT\/JFace, and others. Not only will you learn how to use each individual tool, but you'll also understand how to use them in synergy to create robust enterprise Java applications within your budget. Enterprise Java Development on a Budget combines coverage of best practices with information on the right open source Java tools and technologies, all of which will help support your Java development budget and goals.","language":"en","currency":"USD","id":"1430206829","title":"Enterprise Java Development on a Budget","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_nkcXZg5H2QC&source=gbs_api","authors":["Brian Sam-Bodden","Christopher M Judd"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0y9pgN1rFSkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Lightweight Java Web Development Using Plain Old Java Objects in Spring, Hibernate, and Tapestry","description":"*ONLY Beginning-level book that introduces major Open Source Java tools and frameworks from scratch *Covers the most successful and prevalent open source and some lightweight tools and frameworks, like Spring, JBoss, Hibernate, Tapestry, Ant, and more *Shows how to build an enterprise application, end-to-end, integrating the different open source frameworks, including rapid enterprise Java application development","language":"en","currency":"USD","id":"9781430201427","title":"Beginning POJOs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0y9pgN1rFSkC&source=gbs_api","authors":["Brian Sam-Bodden"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dN93DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"Die Extension-Entwicklung ist eine zentrale Aufgabe von TYPO3-Programmierern, kaum eine TYPO3-Installation kommt ohne zusätzliche Erweiterungen des Systems aus. Seit TYPO3 v4.3 bietet das CMS ein eigenes Framework und eine Template-Engine, mit der die Extension-Entwicklung noch geschmeidiger wird - und das bei hoher Qualität des Codes. Mit Extbase und Fluid stehen zwei Tools zur Verfügung, die Sie darin unterstützen, saubere, modular gekapselte und zukunftssichere Extensions zu schreiben, die auch zu TYPO3 Neos bzw. TYPO3 FLOW portiert werden können. Dieses Buch beschreibt die Programmierkonzepte der Extension-Werkzeuge, zeigt aber auch ausführlich deren Einsatz in der Praxis. Dabei stammen alle Informationen aus erster Hand, denn die Autoren sind TYPO3-Experten, sie gewährleisten die zuverlässige Vermittlung aller Techniken, Details und Tricks. Für diese 2. Auflage wurde das Buch vollständig aktualisiert und deckt jetzt die TYPO3 CMS-Version 6.2 ab.","language":"de","currency":"USD","id":"3955614719","title":"Zukunftssichere TYPO3-Extensions mit Extbase und Fluid","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dN93DwAAQBAJ&source=gbs_api","authors":["Jochen Rau","Sebastian Kurfürst","Martin Helmich"]}]