[{"pageCount":349,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wtALCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"This new edition is a hands-on guide for developers and administrators who want to use the power and flexibility of Couchbase Server 4.0 in their applications. The second edition extends coverage of N1QL, the SQL-like query language for Couchbase. It also brings coverage of multiple new features, including the new generation of client SDKs, security and LDAP integration, secondary indexes, and multi-dimensional scaling. Pro Couchbase Server covers everything you need to develop Couchbase solutions and deploy them in production. The NoSQL movement has fundamentally changed the database world in recent years. Influenced by the growing needs of web-scale applications, NoSQL databases such as Couchbase Server provide new approaches to scalability, reliability, and performance. Never have document databases been so powerful and performant. With the power and flexibility of Couchbase Server, you can model your data however you want, and easily change the data model any time you want. Pro Couchbase Server shows what is possible and helps you take full advantage of Couchbase Server and all the performance and scalability that it offers. Helps you design and develop a document database using Couchbase Server. Covers the latest features such as the N1QL query language. Gives you the tools to scale out your application as needed.","language":"en","currency":"USD","id":"1484211855","title":"Pro Couchbase Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wtALCwAAQBAJ&source=gbs_api","authors":["David Ostrovsky","Yaniv Rodenski","Mohammed Haji"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4PWoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design documents and implement real world e-commerce applications with Couchbase About This Book Get acquainted with Couchbase architecture and design your document-based data schema Implement full text search using industry standard elastic search plugins Develop critical and high performance applications using this hands-on tutorial guide Who This Book Is For If you are new to the NoSQL document system or have little or no experience in NoSQL development and administration and are planning to deploy Couchbase for your next project, then this book is for you. It would be helpful to have a bit of familiarity with Java. What You Will Learn Get acquainted with the concept of NoSQL databases and configure your Couchbase database cluster Maintain Couchbase effectively using the web-based administrative console with ease Enable partition capabilities by making use of Buckets Analyze important design considerations for maintaining relationship between various documents Use Couchbase SDK Java API to store and retrieve document Write views using map\/reduce to retrieve documents efficiently Get familiar with N1QL and how to use it in Java applications Integrate Couchbase with Elasticsearch to implement full text search Configure XDCR for disaster recovery and develop ecommerce application using Couchbase In Detail NoSQL database systems have changed application development in terms of adaptability to dynamics schema and scalability. Compared with the currently available NoSQL database systems, Couchbase is the fastest. Its ease of configuration and powerful features for storing different schema structures, retrieval using map reduce and inbuilt disaster recovery by replicating document across the geographical region, make it one of the most powerful, scalable and comprehensive NoSQL in the market. Couchbase also introduces smart client API for various programming language to integrate the database with the application easily, yet providing very complex features like cluster health awareness. This book achieves its goal by taking up an end-to-end development structure, right from understanding NOSQL document design to implementing full fledged eCommerce application design using Couchbase as a backend. Starting with the architecture of Couchbase to get you up and running, this book quickly takes you through designing a NoSQL document and implementing highly scalable applications using Java API. You will then be introduced to document design and get to know the various ways to administer Couchbase. Followed by this, learn to store documents using bucket. Moving on, you will then learn to store, retrieve and delete documents using smart client base on Java API. You will then retrieve documents using SQL like syntax call N1QL. Next, you will learn how to write map reduce base views. Finally, you will configure XDCR for disaster recovery and implement an eCommerce application using Couchbase. Style and approach The book starts from absolute basics and slowly moves to more advanced topics ensuring at every step that all concepts and terms are understood by the reader to have complete understanding at every stage. Technical and complex terms are explained in clear and simple language, thus making this book a perfect companion for those who have started their journey to NoSQL using Couchbase","language":"en","currency":"USD","id":"1785284282","title":"Learning Couchbase","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4PWoCwAAQBAJ&source=gbs_api","authors":["Henry Potsangbam"]},{"pageCount":331,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6_BUCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A NoSQL Platform for the Enterprise","description":"Pro Couchbase Development: A NoSQL Platform for the Enterprise discusses programming for Couchbase using Java and scripting languages, querying and searching, handling migration, and integrating Couchbase with Hadoop, HDFS, and JSON. It also discusses migration from other NoSQL databases like MongoDB. This book is for big data developers who use Couchbase NoSQL database or want to use Couchbase for their web applications as well as for those migrating from other NoSQL databases like MongoDB and Cassandra. For example, a reason to migrate from Cassandra is that it is not based on the JSON document model with support for a flexible schema without having to define columns and supercolumns. The target audience is largely Java developers but the book also supports PHP and Ruby developers who want to learn about Couchbase. The author supplies examples in Java, PHP, Ruby, and JavaScript. After reading and using this hands-on guide for developing with Couchbase, you'll be able to build complex enterprise, database and cloud applications that leverage this powerful platform.","language":"en","currency":"USD","id":"148421434X","title":"Pro Couchbase Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6_BUCgAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":170,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVvTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is for those application developers who want to achieve greater flexibility and scalability from their software. Whether you are familiar with other NoSQL databases or have only used relational systems, this book will provide you with enough background to move you along at your own pace. If you are new to NoSQL document databases, the design discussions and introductory material will give you the information you need to get started with Couchbase.","language":"en","currency":"USD","id":"1784397857","title":"Couchbase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVvTBgAAQBAJ&source=gbs_api","authors":["John Zablocki"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4PWoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design documents and implement real world e-commerce applications with Couchbase About This Book Get acquainted with Couchbase architecture and design your document-based data schema Implement full text search using industry standard elastic search plugins Develop critical and high performance applications using this hands-on tutorial guide Who This Book Is For If you are new to the NoSQL document system or have little or no experience in NoSQL development and administration and are planning to deploy Couchbase for your next project, then this book is for you. It would be helpful to have a bit of familiarity with Java. What You Will Learn Get acquainted with the concept of NoSQL databases and configure your Couchbase database cluster Maintain Couchbase effectively using the web-based administrative console with ease Enable partition capabilities by making use of Buckets Analyze important design considerations for maintaining relationship between various documents Use Couchbase SDK Java API to store and retrieve document Write views using map\/reduce to retrieve documents efficiently Get familiar with N1QL and how to use it in Java applications Integrate Couchbase with Elasticsearch to implement full text search Configure XDCR for disaster recovery and develop ecommerce application using Couchbase In Detail NoSQL database systems have changed application development in terms of adaptability to dynamics schema and scalability. Compared with the currently available NoSQL database systems, Couchbase is the fastest. Its ease of configuration and powerful features for storing different schema structures, retrieval using map reduce and inbuilt disaster recovery by replicating document across the geographical region, make it one of the most powerful, scalable and comprehensive NoSQL in the market. Couchbase also introduces smart client API for various programming language to integrate the database with the application easily, yet providing very complex features like cluster health awareness. This book achieves its goal by taking up an end-to-end development structure, right from understanding NOSQL document design to implementing full fledged eCommerce application design using Couchbase as a backend. Starting with the architecture of Couchbase to get you up and running, this book quickly takes you through designing a NoSQL document and implementing highly scalable applications using Java API. You will then be introduced to document design and get to know the various ways to administer Couchbase. Followed by this, learn to store documents using bucket. Moving on, you will then learn to store, retrieve and delete documents using smart client base on Java API. You will then retrieve documents using SQL like syntax call N1QL. Next, you will learn how to write map reduce base views. Finally, you will configure XDCR for disaster recovery and implement an eCommerce application using Couchbase. Style and approach The book starts from absolute basics and slowly moves to more advanced topics ensuring at every step that all concepts and terms are understood by the reader to have complete understanding at every stage. Technical and complex terms are explained in clear and simple language, thus making this book a perfect companion for those who have started their journey to NoSQL using Couchbase","language":"en","currency":"USD","id":"1785284282","title":"Learning Couchbase","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4PWoCwAAQBAJ&source=gbs_api","authors":["Henry Potsangbam"]},{"pageCount":88,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WgaLi2zWw74C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Building Scalable, Flexible Database-Based Applications","description":"Today’s highly interactive websites pose a challenge for traditional SQL databases—the ability to scale rapidly and serve loads of concurrent users. With this concise guide, you’ll learn how to build web applications on top of Couchbase Server 2.0, a NoSQL database that can handle websites and social media where hundreds of thousands of users read and write large volumes of information. Using food recipe information as examples, this book demonstrates how to take advantage of Couchbase’s document-oriented database design, and how to store and query data with various CRUD operations. Discover why Couchbase is better than SQL databases with memcached tiers for managing data from the most interactive portions of your application. Learn about Couchbase Server’s cluster-based architecture and how it differs from SQL databases Choose a client library for Java, .NET, Ruby, Python, PHP, or C, and connect to a cluster Structure data in a variety of formats, from serialized objects, a stream of raw bytes, or as JSON documents Learn core storage and retrieval methods, including document IDs, expiry times, and concurrent updates Create views with map\/reduce and learn Couchbase mechanisms for querying and selection","language":"en","currency":"USD","id":"1449331122","title":"Developing with Couchbase Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WgaLi2zWw74C&source=gbs_api","authors":["MC Brown"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xu33G9LGkMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Extreme Scalability at Your Fingertips","description":"Do you know what to do if your web application goes viral and usage suddenly explodes? This concise guide introduces you to Couchbase Server, an extremely fast NoSQL database that automatically distributes data across a cluster of commodity servers or virtual machines. You’ll learn hands-on how to build a Couchbase cluster without changing your application, and how to expand your database on the fly without interrupting service. Discover how this open source server can help your application gain scalability and performance. Learn how the server’s architecture affects the way you build and deploy your database Store data without defining a data structure—and retrieve it without complex queries or query languages Use a formula to estimate your cluster size requirements Set up individual nodes through a browser, command line, or REST API Enable your application to read and write data with sub-millisecond latency through managed object caching Get a quick guide to building applications that integrate Couchbase’s core protocol Identify problems in your cluster with the web console Expand or shrink your cluster, handle failovers, and back up data","language":"en","currency":"USD","id":"1449331025","title":"Getting Started with Couchbase Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xu33G9LGkMC&source=gbs_api","authors":["MC Brown"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S69PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"In this fast-paced book on the Docker open standards platform for developing, packaging and running portable distributed applications, Deepak Vorhadiscusses how to build, ship and run applications on any platform such as a PC, the cloud, data center or a virtual machine. He describes how to install and create Docker images. and the advantages off Docker containers.The remainder of the book is devoted to discussing using Docker with important software solutions. He begins by discussing using Docker with a traditional RDBMS using Oracle and MySQL. Next he moves on to NoSQL with chapter on MongoDB Cassandra, and Couchbase. Then he addresses the use of Docker in the Hadoop ecosystem with complete chapters on utilizing not only Hadoop, but Hive, HBase, Sqoop, Kafka, Solr and Spark. What You Will Learn How to install a Docker image How to create a Docker container How to run an Application in a Docker Container Use Docker with Apache Hadoop Ecosystem Use Docker with NoSQL Databases Use Docker with RDBMS Who This Book Is ForApache Hadoop Developers. Database developers. NoSQL Developers.","language":"en","currency":"USD","id":"1484218302","title":"Pro Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S69PCwAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ra1PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Pro MongoDB Development is about MongoDB, a NoSQL database based on the BSON (binary JSON) document model. The book discusses all aspects of using MongoDB in web applications: Java, PHP, Ruby, JavaScript are the most commonly used programming\/scripting languages and the book discusses accessing MongoDB database with these languages. The book also discusses using Java EE frameworks Kundera and Spring Data with MongoDB. As NoSQL databases are commonly used with the Hadoop ecosystem the book also discusses using MongoDB with Apache Hive. Migration from other NoSQL databases (Apache Cassandra and Couchbase) and from relational databases (Oracle Database) is also discussed. What You'll Learn: How to use a Java client and MongoDB shell How to use MongoDB with PHP, Ruby, and Node.js as well How to migrate Apache Cassandra tables to MongoDB documents; Couchbase to MongoDB; and transferring data between Oracle and MongoDB How to use Kundera, Spring Data, and Spring XD with MongoDB How to load MongoDB data into Oracle Database and integrating MongoDB with Oracle Database in Oracle Data Integrator Audience: The target audience of the book is NoSQL database developers. Target audience includes Java, PHP and Ruby developers. The book is suitable for an intermediate level course in NoSQL database.","language":"en","currency":"USD","id":"1484215982","title":"Pro MongoDB Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ra1PCwAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BJpGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Transform the way you build apps for enterprises","description":"Develop and extend efficient cloud-native applications with ServiceNow About This Book Build and customize your apps and workflows to suit your organization's requirements Perform in-depth application development from designing forms to writing business rules, client-scripts, and workflows Comprehensive guide to the end-to-end implementation of designing and extending apps with ServiceNow Who This Book Is For If you are a ServiceNow administrator and developer and need to build and customize your service management solution (apps and workflows) with ServiceNow, then this book is for you. What You Will Learn Customize the ServiceNow dashboard to meet your business requirements Use Administration and Security Controls to add roles and ensure proper access Manage tables and columns using data dictionaries Learn how application scopes are defined within ServiceNow Configure different types of table to design your application Start using the different types of scripting options available in ServiceNow Design and create workflows for task tables Use debugging techniques available in ServiceNow to easily resolve script-related issues Run scripts at regular time intervals using the Scheduled Script Execution module In Detail ServiceNow provides service management for every department in the enterprise, including IT, Human Resources, Facilities, Field Service, and more. This book focuses on all the steps required to develop apps and workflows for any of your business requirements using ServiceNow. You will start with the first module, which covers the basics of ServiceNow and how applications are structured; how you can customize the dashboard as required; and also how to create users. After you get used to the dashboard, you will move on to the next module, Applications and Tables, where you will learn about working with different tables and how you can create a scope other than the global scope for your application. The next module is Scripting and APIs, where you will learn Scripting in ServiceNow and use powerful APIs to develop applications. The final module, Administration Essentials, covers debugging, advanced database features, and scheduled script creation. By the end of the book you will have mastered creating organized and customer-friendly applications Style and approach A step-by-step tutorial to designing applications and workflows with ServiceNow","language":"en","currency":"USD","id":"1787129780","title":"ServiceNow Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BJpGDwAAQBAJ&source=gbs_api","authors":["Sagar Gupta"]},{"pageCount":84,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5_88BpVaMPkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Extreme Scalability at Your Fingertips","description":"CouchDB is a new breed of database for the Internet, geared to meet the needs of today’s dynamic web applications. With this concise introduction, you’ll learn how CouchDB’s simple model for storing, processing, and accessing data makes it ideal for the type of data and rapid response users now demand from your applications—and how easy CouchDB is to set up, deploy, maintain, and scale. The code-packed examples in this book will help you learn how to work with documents, populate a simple database, replicate data from one database to another, and a host of other tasks. Install CouchDB on Linux, Mac OS X, Windows, or (if you must) from the source code Interact with data through CouchDB’s RESTful API, and use standard HTTP operations, such as PUT, GET, POST, and DELETE Use Futon—CouchDB’s web-based interface— to manage databases and documents, and to configure replications Learn how to create, update, and delete documents in JSON format, and how to create and delete databases Work with design documents to get the formatting and indexing your application requires","language":"en","currency":"USD","id":"1449329578","title":"Getting Started with CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5_88BpVaMPkC&source=gbs_api","authors":["MC Brown"]},{"pageCount":141,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q6xPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practitioners guide to choosing relevant Big Data architecture","description":"This book highlights the different types of data architecture and illustrates the many possibilities hidden behind the term \"Big Data\", from the usage of No-SQL databases to the deployment of stream analytics architecture, machine learning, and governance. Scalable Big Data Architecture covers real-world, concrete industry use cases that leverage complex distributed applications , which involve web applications, RESTful API, and high throughput of large amount of data stored in highly scalable No-SQL data stores such as Couchbase and Elasticsearch. This book demonstrates how data processing can be done at scale from the usage of NoSQL datastores to the combination of Big Data distribution. When the data processing is too complex and involves different processing topology like long running jobs, stream processing, multiple data sources correlation, and machine learning, it’s often necessary to delegate the load to Hadoop or Spark and use the No-SQL to serve processed data in real time. This book shows you how to choose a relevant combination of big data technologies available within the Hadoop ecosystem. It focuses on processing long jobs, architecture, stream data patterns, log analysis, and real time analytics. Every pattern is illustrated with practical examples, which use the different open sourceprojects such as Logstash, Spark, Kafka, and so on. Traditional data infrastructures are built for digesting and rendering data synthesis and analytics from large amount of data. This book helps you to understand why you should consider using machine learning algorithms early on in the project, before being overwhelmed by constraints imposed by dealing with the high throughput of Big data. Scalable Big Data Architecture is for developers, data architects, and data scientists looking for a better understanding of how to choose the most relevant pattern for a Big Data project and which tools to integrate into that pattern.","language":"en","currency":"USD","id":"1484213262","title":"Scalable Big Data Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q6xPCwAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]},{"pageCount":118,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7rpRCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Keeping It Local","description":"One of the most useful features of today’s modern browsers is the ability to store data right on the user’s computer or mobile device. Even as more people move toward the cloud, client-side storage can still save web developers a lot of time and money, if you do it right. This hands-on guide demonstrates several storage APIs in action. You’ll learn how and when to use them, their plusses and minuses, and steps for implementing one or more of them in your application. Ideal for experienced web developers familiar with JavaScript, this book also introduces several open source libraries that make storage APIs easier to work with. Learn how different browsers support each client-side storage API Work with web (aka local) storage for simple things like lists or preferences Use IndexedDB to store nearly anything you want on the user’s browser Learn how support web apps that still use the discontinued Web SQL Database API Explore Lockr, Dexie, and localForage, three libraries that simplify the use of storage APIs Build a simple working application that makes use of several storage techniques","language":"en","currency":"USD","id":"1491935065","title":"Client-Side Data Storage","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7rpRCwAAQBAJ&source=gbs_api","authors":["Raymond Camden"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rJUFDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Start using Kubernetes in complex big data and enterprise applications, including Docker containers. Starting with installing Kubernetes on a single node, the book introduces Kubernetes with a simple Hello example and discusses using environment variables in Kubernetes. Next, Kubernetes Microservices with Docker discusses using Kubernetes with all major groups of technologies such as relational databases, NoSQL databases, and in the Apache Hadoop ecosystem. The book concludes with using multi container pods and installing Kubernetes on a multi node cluster. \/div \"a concise but clear introduction to containers, Docker and Kubernetes, using simple real-world examples to pass on the core concepts, via repetition, and is a very useful enabler.\" 10\/10 Dave Hay MBCS CITP: review for BCS, The Chartered Institute for IT (http:\/\/www.bcs.org\/content\/conWebDoc\/58512) What You Will Learn Install Kubernetes on a single node Set environment variables Create multi-container pods using Docker Use volumes Use Kubernetes with the Apache Hadoop ecosystem, NoSQL databases, and RDBMSs Install Kubernetes on a multi-node cluster Who This Book Is For Application developers including Apache Hadoop developers, database developers and NoSQL developers.","language":"en","currency":"USD","id":"1484219074","title":"Kubernetes Microservices with Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rJUFDAAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":594,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6EZsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Become a successful software architect by implementing effective architecture concepts","description":"A comprehensive guide to exploring software architecture concepts and implementing best practices Key Features Enhance your skills to grow your career as a software architect Design efficient software architectures using patterns and best practices Learn how software architecture relates to an organization as well as software development methodology Book Description The Software Architect’s Handbook is a comprehensive guide to help developers, architects, and senior programmers advance their career in the software architecture domain. This book takes you through all the important concepts, right from design principles to different considerations at various stages of your career in software architecture. The book begins by covering the fundamentals, benefits, and purpose of software architecture. You will discover how software architecture relates to an organization, followed by identifying its significant quality attributes. Once you have covered the basics, you will explore design patterns, best practices, and paradigms for efficient software development. The book discusses which factors you need to consider for performance and security enhancements. You will learn to write documentation for your architectures and make appropriate decisions when considering DevOps. In addition to this, you will explore how to design legacy applications before understanding how to create software architectures that evolve as the market, business requirements, frameworks, tools, and best practices change over time. By the end of this book, you will not only have studied software architecture concepts but also built the soft skills necessary to grow in this field. What you will learn Design software architectures using patterns and best practices Explore the different considerations for designing software architecture Discover what it takes to continuously improve as a software architect Create loosely coupled systems that can support change Understand DevOps and how it affects software architecture Integrate, refactor, and re-architect legacy applications Who this book is for The Software Architect’s Handbook is for you if you are a software architect, chief technical officer (CTO), or senior developer looking to gain a firm grasp of software architecture.","language":"en","currency":"USD","id":"1788627679","title":"Software Architect’s Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6EZsDwAAQBAJ&source=gbs_api","authors":["Joseph Ingeno"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ON0DCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book will introduce Redis and help you understand its various facets. Starting with an introduction to NoSQL, you will learn how to install Redis and how to classify and work with data structures. By working with real world scenarios pertaining to using Redis, you will discover sharding and indexing techniques, along with how to improve scalability and performance through persistent strategies and data migration techniques. With the help of multiple examples, you will learn to design web and business applications. You will also learn how to configure Redis for setting up clusters and tuning it for performance. At the end of this book, you will find essential tips on backup and recovery strategies for the Redis environment.","language":"en","currency":"USD","id":"1783980133","title":"Learning Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ON0DCgAAQBAJ&source=gbs_api","authors":["Vinoo Das"]},{"pageCount":58,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qHdFQsFnc0YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. Instant Apache Sqoop is full of step-by-step instructions and practical examples along with challenges to test and improve your knowledge.This book is great for developers who are looking to get a good grounding in how to effectively and efficiently move data between RDBMS and the Hadoop ecosystem. It's assumed that you will have some experience in Hadoop already as well as some familiarity with HBase and Hive.","language":"en","currency":"USD","id":"1782165770","title":"Instant Apache Sqoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qHdFQsFnc0YC&source=gbs_api","authors":["Ankit Jain"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tf--AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"What every web developer should know about networking and web performance","description":"How prepared are you to build fast and efficient web applications? This eloquent book provides what every web developer should know about the network, from fundamental limitations that affect performance to major innovations for building even more powerful browser applications—including HTTP 2.0 and XHR improvements, Server-Sent Events (SSE), WebSocket, and WebRTC. Author Ilya Grigorik, a web performance engineer at Google, demonstrates performance optimization best practices for TCP, UDP, and TLS protocols, and explains unique wireless and mobile network optimization requirements. You’ll then dive into performance characteristics of technologies such as HTTP 2.0, client-side network scripting with XHR, real-time streaming with SSE and WebSocket, and P2P communication with WebRTC. Deliver superlative TCP, UDP, and TLS performance Speed up network performance over 3G\/4G mobile networks Develop fast and energy-efficient mobile applications Address bottlenecks in HTTP 1.x and other browser protocols Plan for and deliver the best HTTP 2.0 performance Enable efficient real-time streaming in the browser Create efficient peer-to-peer videoconferencing and low-latency applications with real-time WebRTC transports","language":"en","currency":"USD","id":"1449344720","title":"High Performance Browser Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tf--AAAAQBAJ&source=gbs_api","authors":["Ilya Grigorik"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pF9dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Complete guide to automating Big Data solutions using Artificial Intelligence techniques","description":"Build next-generation Artificial Intelligence systems with Java Key Features Implement AI techniques to build smart applications using Deeplearning4j Perform big data analytics to derive quality insights using Spark MLlib Create self-learning systems using neural networks, NLP, and reinforcement learning Book Description In this age of big data, companies have larger amount of consumer data than ever before, far more than what the current technologies can ever hope to keep up with. However, Artificial Intelligence closes the gap by moving past human limitations in order to analyze data. With the help of Artificial Intelligence for big data, you will learn to use Machine Learning algorithms such as k-means, SVM, RBF, and regression to perform advanced data analysis. You will understand the current status of Machine and Deep Learning techniques to work on Genetic and Neuro-Fuzzy algorithms. In addition, you will explore how to develop Artificial Intelligence algorithms to learn from data, why they are necessary, and how they can help solve real-world problems. By the end of this book, you'll have learned how to implement various Artificial Intelligence algorithms for your big data systems and integrate them into your product offerings such as reinforcement learning, natural language processing, image recognition, genetic algorithms, and fuzzy logic systems. What you will learn Manage Artificial Intelligence techniques for big data with Java Build smart systems to analyze data for enhanced customer experience Learn to use Artificial Intelligence frameworks for big data Understand complex problems with algorithms and Neuro-Fuzzy systems Design stratagems to leverage data using Machine Learning process Apply Deep Learning techniques to prepare data for modeling Construct models that learn from data using open source tools Analyze big data problems using scalable Machine Learning algorithms Who this book is for This book is for you if you are a data scientist, big data professional, or novice who has basic knowledge of big data and wish to get proficiency in Artificial Intelligence techniques for big data. Some competence in mathematics is an added advantage in the field of elementary linear algebra and calculus.","language":"en","currency":"USD","id":"1788476018","title":"Artificial Intelligence for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pF9dDwAAQBAJ&source=gbs_api","authors":["Anand Deshpande","Manish Kumar"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_X1XAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"Strategies for Gaining a Competitive Advantage with Data","description":"Information Management: Gaining a Competitive Advantage with Data is about making smart decisions to make the most of company information. Expert author William McKnight develops the value proposition for information in the enterprise and succinctly outlines the numerous forms of data storage. Information Management will enlighten you, challenge your preconceived notions, and help activate information in the enterprise. Get the big picture on managing data so that your team can make smart decisions by understanding how everything from workload allocation to data stores fits together. The practical, hands-on guidance in this book includes: Part 1: The importance of information management and analytics to business, and how data warehouses are used Part 2: The technologies and data that advance an organization, and extend data warehouses and related functionality Part 3: Big Data and NoSQL, and how technologies like Hadoop enable management of new forms of data Part 4: Pulls it all together, while addressing topics of agile development, modern business intelligence, and organizational change management Read the book cover-to-cover, or keep it within reach for a quick and useful resource. Either way, this book will enable you to master all of the possibilities for data or the broadest view across the enterprise. Balances business and technology, with non-product-specific technical detail Shows how to leverage data to deliver ROI for a business Engaging and approachable, with practical advice on the pros and cons of each domain, so that you learn how information fits together into a complete architecture Provides a path for the data warehouse professional into the new normal of heterogeneity, including NoSQL solutions","language":"en","currency":"USD","id":"0124095267","title":"Information Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_X1XAQAAQBAJ&source=gbs_api","authors":["William McKnight"]},{"pageCount":410,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VsC_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Securing Spring Framework 5 and Boot 2-based Java Applications","description":"Build and deploy secure Spring Framework and Spring Boot-based enterprise Java applications with the Spring Security Framework. This book explores a comprehensive set of functionalities to implement industry-standard authentication and authorization mechanisms for Java applications. Pro Spring Security, Second Edition has been updated to incorporate the changes in Spring Framework 5 and Spring Boot 2. It is an advanced tutorial and reference that guides you through the implementation of the security features for a Java web application by presenting consistent examples built from the ground up. This book also provides you with a broader look into Spring security by including up-to-date use cases such as building a security layer for RESTful web services and Grails applications. What You Will Learn Explore the scope of security and how to use the Spring Security Framework Master Spring security architecture and design Secure the web tier in Spring Work with alternative authentication providers Take advantage of business objects and logic security Extend Spring security with other frameworks and languages Secure the service layer Who This Book Is ForExperienced Spring and Java developers with prior experience in building Spring Framework or Boot-based applications.","language":"en","currency":"USD","id":"1484250524","title":"Pro Spring Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VsC_DwAAQBAJ&source=gbs_api","authors":["Carlo Scarioni","Massimo Nardone"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CglnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Learn effective ways to secure your applications with Spring and Spring WebFlux","description":"Secure your Java applications by integrating the Spring Security framework in your code Key Features Provide authentication, authorization and other security features for Java applications. Learn how to secure microservices, cloud, and serverless applications easily Understand the code behind the implementation of various security features Book Description Security is one of the most vital concerns for any organization. The complexity of an application is compounded when you need to integrate security with existing code, new technology, and other frameworks. This book will show you how to effectively write Java code that is robust and easy to maintain. Hands-On Spring Security 5 for Reactive Applications starts with the essential concepts of reactive programming, Spring Framework, and Spring Security. You will then learn about a variety of authentication mechanisms and how to integrate them easily with the Spring MVC application. You will also understand how to achieve authorization in a Spring WebFlux application using Spring Security.You will be able to explore the security confgurations required to achieve OAuth2 for securing REST APIs and integrate security in microservices and serverless applications. This book will guide you in integrating add-ons that will add value to any Spring Security module. By the end of the book, you will be proficient at integrating Spring Security in your Java applications What you will learn Understand how Spring Framework and Reactive application programming are connected Implement easy security confgurations with Spring Security expressions Discover the relationship between OAuth2 and OpenID Connect Secure microservices and serverless applications with Spring Integrate add-ons, such as HDIV, Crypto Module, and CORS support Apply Spring Security 5 features to enhance your Java reactive applications Who this book is for If you are a Java developer who wants to improve application security, then this book is for you. A basic understanding of Spring, Spring Security framework, and reactive applications is required to make the most of the book.","language":"en","currency":"USD","id":"1788990072","title":"Hands-On Spring Security 5 for Reactive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CglnDwAAQBAJ&source=gbs_api","authors":["Tomcy John"]},{"pageCount":1250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AJ-1BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":367.2,"subtitle":null,"description":"This book contains a selection of articles from The 2015 World Conference on Information Systems and Technologies (WorldCIST'15), held between the 1st and 3rd of April in Funchal, Madeira, Portugal, a global forum for researchers and practitioners to present and discuss recent results and innovations, current trends, professional experiences and challenges of modern Information Systems and Technologies research, technological development and applications. The main topics covered are: Information and Knowledge Management; Organizational Models and Information Systems; Intelligent and Decision Support Systems; Big Data Analytics and Applications; Software Systems, Architectures, Applications and Tools; Multimedia Systems and Applications; Computer Networks, Mobility and Pervasive Systems; Human-Computer Interaction; Health Informatics; Information Technologies in Education; Information Technologies in Radio communications.","language":"en","currency":"USD","id":"3319164864","title":"New Contributions in Information Systems and Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AJ-1BwAAQBAJ&source=gbs_api","authors":["Alvaro Rocha","Ana Maria Correia","Sandra Costanzo","Luis Paulo Reis"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eVjBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"A fun and hands-on introduction to machine learning, reinforcement learning, deep learning, and artificial intelligence with Python","description":"This friendly and accessible guide to AI theory and programming in Python requires no maths or data science background. Key Features Roll up your sleeves and start programming AI models No math, data science, or machine learning background required Packed with hands-on examples, illustrations, and clear step-by-step instructions 5 hands-on working projects put ideas into action and show step-by-step how to build intelligent software Book Description AI is changing the world – and with this book, anyone can start building intelligent software! Through his best-selling video courses, Hadelin de Ponteves has taught hundreds of thousands of people to write AI software. Now, for the first time, his hands-on, energetic approach is available as a book. Taking a graduated approach that starts with the basics before easing readers into more complicated formulas and notation, Hadelin helps you understand what you really need to build AI systems with reinforcement learning and deep learning. Five full working projects put the ideas into action, showing step-by-step how to build intelligent software using the best and easiest tools for AI programming: Google Colab Python TensorFlow Keras PyTorch AI Crash Course teaches everyone to build an AI to work in their applications. Once you’ve read this book, you’re only limited by your imagination. What you will learn Master the key skills of deep learning, reinforcement learning, and deep reinforcement learning Understand Q-learning and deep Q-learning Learn from friendly, plain English explanations and practical activities Build fun projects, including a virtual-self-driving car Use AI to solve real-world business problems and win classic video games Build an intelligent, virtual robot warehouse worker Who this book is for If you want to add AI to your skillset, this book is for you. It doesn’t require data science or machine learning knowledge. Just maths basics (high school level).","language":"en","currency":"USD","id":"1838645551","title":"AI Crash Course","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eVjBDwAAQBAJ&source=gbs_api","authors":["Hadelin de Ponteves"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wljJZbEO8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Fundamental Design Solutions for SOAP\/WSDL and RESTful Web Services","description":"Web services have been used for many years. In this time, developers and architects have encountered a number of recurring design challenges related to their usage, and have learned that certain service design approaches work better than others to solve certain problems. In Service Design Patterns, Rob Daigneau codifies proven design solutions for web services that follow the REST architectural style or leverage the SOAP\/WSDL specifications. This catalogue identifies the fundamental topics in web service design and lists the common design patterns for each topic. All patterns identify the context in which they may be used, explain the constituent design elements, and explore the relative strengths and trade-offs. Code examples are provided to help you better understand how the patterns work but are kept general so that you can see how the solutions may be applied to disparate technologies that will inevitably change in the years to come. This book will help readers answer the following questions: How do you create a web service API, what are the common API styles, and when should a particular style be used? How can clients and web services communicate, and what are the foundations for creating complex conversations in which multiple parties exchange data over extended periods of time? What are the options for implementing web service logic, and when should a particular approach be used? How can clients become less coupled to the underlying systems used by a service? How can information about a web service be discovered? How can generic functions like authentication, validation, caching, and logging be supported on the client or service? What changes to a service cause clients to break? What are the common ways to version a service? How can web services be designed to support the continuing evolution of business logic without forcing clients to constantly upgrade? This book is an invaluable resource for enterprise architects, solution architects, and developers who use web services to create enterprise IT applications, commercial or open source products, and Software as a Service (SaaS) products that leverage emerging Cloud platforms.","language":"en","currency":"USD","id":"0321669606","title":"Service Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wljJZbEO8ZQC&source=gbs_api","authors":["Robert Daigneau"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2o-qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Effective Machine Learning Inspired by the Agile Manifesto","description":"Build resilient applied machine learning teams that deliver better data products through adapting the guiding principles of the Agile Manifesto. Bringing together talented people to create a great applied machine learning team is no small feat. With developers and data scientists both contributing expertise in their respective fields, communication alone can be a challenge. Agile Machine Learning teaches you how to deliver superior data products through agile processes and to learn, by example, how to organize and manage a fast-paced team challenged with solving novel data problems at scale, in a production environment. The authors’ approach models the ground-breaking engineering principles described in the Agile Manifesto. The book provides further context, and contrasts the original principles with the requirements of systems that deliver a data product. What You'll Learn Effectively run a data engineering team that is metrics-focused, experiment-focused, and data-focused Make sound implementation and model exploration decisions based on the data and the metrics Know the importance of data wallowing: analyzing data in real time in a group setting Recognize the value of always being able to measure your current state objectively Understand data literacy, a key attribute of a reliable data engineer, from definitions to expectations Who This Book Is For Anyone who manages a machine learning team, or is responsible for creating production-ready inference components. Anyone responsible for data project workflow of sampling data; labeling, training, testing, improving, and maintaining models; and system and data metrics will also find this book useful. Readers should be familiar with software engineering and understand the basics of machine learning and working with data.","language":"en","currency":"USD","id":"1484251075","title":"Agile Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2o-qDwAAQBAJ&source=gbs_api","authors":["Eric Carter","Matthew Hurst"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LkFKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.95,"subtitle":"How the Application-Centric Mindset is Hobbling our Enterprises","description":"Know what’s causing application development waste so you can turn the tide. This is the book your Systems Integrator and your Application Software vendor don’t want you to read. Enterprise IT (Information Technology) is a $3.8 trillion per year industry worldwide. Most of it is waste. We've grown used to projects costing tens of millions or even billions of dollars, and routinely running over budget and schedule many times over. These overages in both time and money are almost all wasted resources. However, the waste is hard to see, after being so marbled through all the products, processes, and guiding principles. That is what this book is about. We must see, understand, and agree about the problem before we can take coordinated action to address it. The trajectory of this book is as follows: In Chapter 1, we explore how bad the current state is. The three industries that address software waste are discussed, including the legacy software industry, neo-legacy software industry, and legacy modernization industry. Examples of application waste are illustrated from both public and private sectors. In Chapter 2, we explore the economics of the software industry. Although the economic tradeoffs are changing at the speed of Moore’s Law, our approaches are not keeping pace. Learn how information systems really behave in terms of actual application development. In Chapter 3 we use “root cause analysis” to reveal the real contributors to this situation, which are dependency, redundancy, complexity, and application centricity. Chapter 4 recounts the many failed attempts we’ve made in the past to deal with information system complexity, including relational databases, ERP systems, enterprise data modeling, service oriented architectures, and APIs, Agile, data warehouse and business intelligence, outsourcing and offshoring, cloud, Software as a Service (SaaS), data lakes, machine learning, and artificial intelligence. Chapter 5 dismantles seven fallacies that contribute to our remaining stuck. For example, the first fallacy is “We need detailed requirements or we won’t get what we want.” The quagmire is not affecting all sectors of the economy equally. Chapter 6 looks at how this is playing out in the government and private sectors, large and small companies, and various parts of the IT industry itself. Chapter 7 outlines some action you can take now to begin to extricate yourself, including a detailed assessment and defining metrics for measuring and preventing software development waste.","language":"en","currency":"USD","id":"1634623185","title":"Software Wasteland","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LkFKDwAAQBAJ&source=gbs_api","authors":["Dave McComb"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h_WlXqgPV00C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is written in a Cookbook style and it offers learning through recipes with examples and illustrations. Each recipe contains step-by-step instructions about everything necessary to execute a particular task. The book is designed so that you can read it from start to end for beginners, or just open up any chapter and start following the recipes as a reference for advanced users.If you are a beginner or an intermediate user who wants to master the skill of quickly writing scripts to perform various tasks without reading the entire manual, this book is for you. You can start writing scripts and one-liners by simply looking at the similar recipe and its descriptions without any working knowledge of shell scripting or Linux. Intermediate\/advanced users as well as system administrators\/ developers and programmers can use this book as a reference when they face problems while coding.","language":"en","currency":"USD","id":"1782162755","title":"Linux Shell Scripting Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h_WlXqgPV00C&source=gbs_api","authors":["Shantanu Tushar"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gYY1DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Creating Asynchronous, Event-Based Applications","description":"In today’s app-driven era, when programs are asynchronous and responsiveness is so vital, reactive programming can help you write code that’s more reliable, easier to scale, and better-performing. With this practical book, Java developers will first learn how to view problems in the reactive way, and then build programs that leverage the best features of this exciting new programming paradigm. Authors Tomasz Nurkiewicz and Ben Christensen include concrete examples that use the RxJava library to solve real-world performance issues on Android devices as well as the server. You’ll learn how RxJava leverages parallelism and concurrency to help you solve today’s problems. This book also provides a preview of the upcoming 2.0 release. Write programs that react to multiple asynchronous sources of input without descending into \"callback hell\" Get to that aha! moment when you understand how to solve problems in the reactive way Cope with Observables that produce data too quickly to be consumed Explore strategies to debug and to test programs written in the reactive style Efficiently exploit parallelism and concurrency in your programs Learn about the transition to RxJava version 2","language":"en","currency":"USD","id":"1491931604","title":"Reactive Programming with RxJava","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gYY1DQAAQBAJ&source=gbs_api","authors":["Tomasz Nurkiewicz","Ben Christensen"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NX_QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Use Service Workers to Turbocharge Your Web Apps “You have made an excellent decision in picking up this book. If I was just starting on my learning path to mastery of Progressive Web Apps, there are not many folks I would trust more to get me there than John.” —Simon MacDonald, Developer Advocate, Adobe Software developers have two options for the apps they build: native apps targeting a specific device or web apps that run on any device. Building native apps is challenging, especially when your app targets multiple system types—i.e., desktop computers, smartphones, televisions—because user experience varies dramatically across devices. Service Workers—a relatively new technology—make it easier for web apps to bridge the gap between native and web capabilities. In Learning Progressive Web Apps, author John M. Wargo demonstrates how to use Service Workers to enhance the capabilities of a web app to create Progressive Web Apps (PWA). He focuses on the technologies that enable PWAs and how to use those technologies to enhance your web apps to deliver a more native-like experience. Build web apps a user can easily install on their local system and that work offline or on low-quality networks Utilize caching strategies that give you control over which app resources are cached and when Deliver background processing in a web application Implement push notifications that enable an app to easily engage with users or trigger action from a remote server Throughout the book, Wargo introduces each core concept and illustrates the implementation of each capability through several complete, operational examples. You’ll start with simple web apps, then incrementally expand and extend them with state-of-the-art features. All example source code is available on GitHub, and additional resources are available on the author’s companion site, learningpwa.com. Register your book for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for details.","language":"en","currency":"USD","id":"0136485677","title":"Learning Progressive Web Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NX_QDwAAQBAJ&source=gbs_api","authors":["John M. Wargo"]},{"pageCount":228,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gJUeBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is great for you if you are a developer, quality assurance engineer, tester, or test manager who is looking to get a firmer grasp of elementary, deep, and advanced testing concepts using Apache JMeter. It’s assumed you have access to a computer and an Internet connection. No prior testing or programming experience is required, but would be helpful.","language":"en","currency":"USD","id":"1783988290","title":"JMeter Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gJUeBQAAQBAJ&source=gbs_api","authors":["Bayo Erinle"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xslUFS2WMcIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Recipes and Examples","description":"100+ Practical jQuery Recipes for Solving Your Real-World Web and Mobile Development Challenges! jQuery makes it easier than ever for developers to build exceptionally robust, cross-platform websites and mobile apps. jQuery, jQuery UI, and jQuery Mobile: Recipes and Examples is a practical “cookbook,” packed with realistic, easy-to-use solutions for making the most of jQuery Core, jQuery UI, plugins, and jQuery Mobile. This guide brings together more than one hundred self-contained, downloadable examples, each with an in-depth explanation of how the code works and how to adapt it for your own needs. Pioneering web\/mobile developers Adriaan de Jonge and Phil Dutson present examples you can apply immediately in virtually any web or mobile app, and with any server-side platform, including PHP, .NET, Java, Ruby, Node.js, or Python. This extremely useful guide will help you Test browser support and provide for graceful degradation Fine-tune DOM element selection and manipulate your site’s DOM structure Master the newest techniques for event handling and binding Communicate with web servers: AJAX, page errors, redirects, XML, and more Use advanced UI widgets, from accordions and autocomplete to sliders and tabs Build mobile-optimized sites with the jQuery Mobile library Write and smoothly incorporate new plugins Integrate powerful third-party plugins, such as the Twitter Bootstrap framework The authors’ proven “code first, explain later” approach supports developers at all levels who want to start experimenting immediately. Their exceptionally readable examples never take shortcuts or compromise quality,and their detailed walk-throughs are ideal for anyone who wants to thoroughly understand their code. If you have a working knowledge of HTML, CSS, and basic JavaScript, you’ll feel right at home immediately; if not, de Jonge and Dutson’s careful explanations and full HTML page layout examples will get you up to speed quickly. Covers jQuery 1.6.4 and 1.7, with Tips for 1.8","language":"en","currency":"USD","id":"013298136X","title":"jQuery, jQuery UI, and jQuery Mobile","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xslUFS2WMcIC&source=gbs_api","authors":["Adriaan de Jonge","Phil Dutson"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H99YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A beginner's guide to build smart contracts for Ethereum and blockchain","description":"Learn the most powerful and primary programming language for writing smart contracts and find out how to write, deploy, and test smart contracts in Ethereum. Key Features Get you up and running with Solidity Programming language Build Ethereum Smart Contracts with Solidity as your scripting language Learn to test and deploy the smart contract to your private Blockchain Book Description Solidity is a contract-oriented language whose syntax is highly influenced by JavaScript, and is designed to compile code for the Ethereum Virtual Machine. Solidity Programming Essentials will be your guide to understanding Solidity programming to build smart contracts for Ethereum and blockchain from ground-up. We begin with a brief run-through of blockchain, Ethereum, and their most important concepts or components. You will learn how to install all the necessary tools to write, test, and debug Solidity contracts on Ethereum. Then, you will explore the layout of a Solidity source file and work with the different data types. The next set of recipes will help you work with operators, control structures, and data structures while building your smart contracts. We take you through function calls, return types, function modifers, and recipes in object-oriented programming with Solidity. Learn all you can on event logging and exception handling, as well as testing and debugging smart contracts. By the end of this book, you will be able to write, deploy, and test smart contracts in Ethereum. This book will bring forth the essence of writing contracts using Solidity and also help you develop Solidity skills in no time. What you will learn Learn the basics and foundational concepts of Solidity and Ethereum Explore the Solidity language and its uniqueness in depth Create new accounts and submit transactions to blockchain Get to know the complete language in detail to write smart contracts Learn about major tools to develop and deploy smart contracts Write defensive code using exception handling and error checking Understand Truffle basics and the debugging process Who this book is for This book is for anyone who would like to get started with Solidity Programming for developing an Ethereum smart contract. No prior knowledge of EVM is required.","language":"en","currency":"USD","id":"1788838378","title":"Solidity Programming Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H99YDwAAQBAJ&source=gbs_api","authors":["Ritesh Modi"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iYkKAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Take your idea from concept to production with this unique guide Whether it's called physical computing, ubiquitous computing, or the Internet of Things, it's a hot topic in technology: how to channel your inner Steve Jobs and successfully combine hardware, embedded software, web services, electronics, and cool design to create cutting-edge devices that are fun, interactive, and practical. If you'd like to create the next must-have product, this unique book is the perfect place to start. Both a creative and practical primer, it explores the platforms you can use to develop hardware or software, discusses design concepts that will make your products eye-catching and appealing, and shows you ways to scale up from a single prototype to mass production. Helps software engineers, web designers, product designers, and electronics engineers start designing products using the Internet-of-Things approach Explains how to combine sensors, servos, robotics, Arduino chips, and more with various networks or the Internet, to create interactive, cutting-edge devices Provides an overview of the necessary steps to take your idea from concept through production If you'd like to design for the future, Designing the Internet of Things is a great place to start.","language":"en","currency":"USD","id":"1118430654","title":"Designing the Internet of Things","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iYkKAgAAQBAJ&source=gbs_api","authors":["Adrian McEwen","Hakim Cassimally"]},{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7RfBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Transform Legacy Intranets to Employee Experience Platforms","description":"Evolve your traditional intranet platform into a next-generation digital workspace with this comprehensive book. Through in-depth coverage of strategies, methods, and case studies, you will learn how to design and build an employee experience platform (EXP) for improved employee productivity, engagement, and collaboration. In Build a Next-Generation Digital Workplace, author Shailesh Kumar Shivakumar takes you through the advantages of EXPs and shows you how to successfully implement one in your organization. This book provides extensive coverage of topics such as EXP design, user experience, content strategy, integration, EXP development, collaboration, and EXP governance. Real-world case studies are also presented to explore practical applications. Employee experience platforms play a vital role in engaging, empowering, and retaining the employees of an organization. Next-generation workplaces demand constant innovation and responsiveness, and this book readies you to fulfill that need with an employee experience platform. You will: Understand key design elements of EXP, including the visual design, EXP strategy, EXP transformation themes, information architecture, and navigation design. Gain insights into end-to-end EXP topics needed to successfully design, implement, and maintain next-generation digital workplace platforms. Study methods used in the EXP lifecycle, such as requirements and design, development, governance, and maintenance Execute the main steps involved in digital transformation of legacy intranet platforms to EXP. Discover emerging trends in digital workplace such as gamification, machine-led operations model and maintenance model, employee-centric design (including persona based design and employee journey mapping), cloud transformation, and design transformation. Comprehend proven methods for legacy Intranet modernization, collaboration, solution validation, migration, and more. Who This Book Is For Digital enthusiasts, web developers, digital architects, program managers, and more.","language":"en","currency":"USD","id":"1484255127","title":"Build a Next-Generation Digital Workplace","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7RfBDwAAQBAJ&source=gbs_api","authors":["Shailesh Kumar Shivakumar"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1D24-cGQRdsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Hypermedia and Systems Architecture","description":"Why don't typical enterprise projects go as smoothly as projects you develop for the Web? Does the REST architectural style really present a viable alternative for building distributed systems and enterprise-class applications? In this insightful book, three SOA experts provide a down-to-earth explanation of REST and demonstrate how you can develop simple and elegant distributed hypermedia systems by applying the Web's guiding principles to common enterprise computing problems. You'll learn techniques for implementing specific Web technologies and patterns to solve the needs of a typical company as it grows from modest beginnings to become a global enterprise. Learn basic Web techniques for application integration Use HTTP and the Web’s infrastructure to build scalable, fault-tolerant enterprise applications Discover the Create, Read, Update, Delete (CRUD) pattern for manipulating resources Build RESTful services that use hypermedia to model state transitions and describe business protocols Learn how to make Web-based solutions secure and interoperable Extend integration patterns for event-driven computing with the Atom Syndication Format and implement multi-party interactions in AtomPub Understand how the Semantic Web will impact systems design","language":"en","currency":"USD","id":"9781449396923","title":"REST in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1D24-cGQRdsC&source=gbs_api","authors":["Jim Webber","Savas Parastatidis","Ian Robinson"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tYrPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.49,"subtitle":"How Google Runs Production Systems","description":"The overwhelming majority of a software system’s lifespan is spent in use, not in design or implementation. So, why does conventional wisdom insist that software engineers focus primarily on the design and development of large-scale computing systems? In this collection of essays and articles, key members of Google’s Site Reliability Team explain how and why their commitment to the entire lifecycle has enabled the company to successfully build, deploy, monitor, and maintain some of the largest software systems in the world. You’ll learn the principles and practices that enable Google engineers to make systems more scalable, reliable, and efficient—lessons directly applicable to your organization. This book is divided into four sections: Introduction—Learn what site reliability engineering is and why it differs from conventional IT industry practices Principles—Examine the patterns, behaviors, and areas of concern that influence the work of a site reliability engineer (SRE) Practices—Understand the theory and practice of an SRE’s day-to-day work: building and operating large distributed computing systems Management—Explore Google's best practices for training, communication, and meetings that your organization can use","language":"en","currency":"USD","id":"1491951176","title":"Site Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tYrPCwAAQBAJ&source=gbs_api","authors":["Niall Richard Murphy","Betsy Beyer","Chris Jones","Jennifer Petoff"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=je5sDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Write Apps for Maximum Performance and Responsiveness “Threading and concurrency are as important in mobile as they are in large, distributed systems. This book does an excellent job of re-introducing us to the basic concepts and describing how to apply them to the Android framework. Even the most experienced Android developer should pick up at least a few tricks from these pages.” —Dave Smith, PE, Google Developer Expert for Android Mastering concurrency is critical to developing software with superior performance and responsiveness. This is especially true for Android, where interruptions are frequent and abrupt, and in order to be correct, programs must be aware of component and process lifecycles in addition to being thread safe. You need a deep, Android-specific understanding of concurrency—and Android Concurrency delivers it. This guide in Addison-Wesley’s Android Deep Dive series for experienced Android developers helps you leverage today’s multi-core processors and heavily cached architectures, as well as major improvements built into Android 5 (Lollipop). Top Android developer and consultant Blake Meike strips the magic and mystery from concurrent programming and presents intensely practical solutions for everything from inter-thread communication to network communication. Meike introduces a simple but powerful architectural framework you can use to address new issues whenever they arise, and offers expert guidance for debugging even highly complex concurrency issues. Android Concurrency combines in-depth knowledge, proven patterns and idioms, and world-class insights for avoiding performance-killing mistakes. For serious Android developers, it will be an indispensable resource. You will • Gain new clarity about what concurrency really is, and how concurrent processes work • Master best practices for writing concurrent code that’s more robust and less susceptible to weird, hard-to-diagnose errors • Review the Java concurrency mechanisms Android’s constructs are built upon • Shape an approach to concurrency that reflects the unique characteristics of the Android environment • Avoid widespread misconceptions that lead Android developers into trouble • Make the most of AsyncTask—but only when it’s the right tool for the job • Leverage the powerful, lightweight Looper\/Handler framework to support scheduled, asynchronous tasks and execute many message types • Use the Android Service component to separate business logic from UI • Understand the differences between started and bound services and use them effectively for intra- and inter-process communication • Perform scheduled tasks, including tasks requiring polling and explicit scheduling • Track down problems via static analysis, annotations, and assertions","language":"en","currency":"USD","id":"0134177606","title":"Android Concurrency","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=je5sDAAAQBAJ&source=gbs_api","authors":["G. Blake Meike"]},{"pageCount":604,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6OjJCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"A Programmer's Guide to Building Products, Technologies, and Teams","description":"This book is the \"Hello, World\" tutorial for building products, technologies, and teams in a startup environment. It's based on the experiences of the author, Yevgeniy (Jim) Brikman, as well as interviews with programmers from some of the most successful startups of the last decade, including Google, Facebook, LinkedIn, Twitter, GitHub, Stripe, Instagram, AdMob, Pinterest, and many others. Hello, Startup is a practical, how-to guide that consists of three parts: Products, Technologies, and Teams. Although at its core, this is a book for programmers, by programmers, only Part II (Technologies) is significantly technical, while the rest should be accessible to technical and non-technical audiences alike. If you’re at all interested in startups—whether you’re a programmer at the beginning of your career, a seasoned developer bored with large company politics, or a manager looking to motivate your engineers—this book is for you.","language":"en","currency":"USD","id":"1491910046","title":"Hello, Startup","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6OjJCgAAQBAJ&source=gbs_api","authors":["Yevgeniy Brikman"]},{"pageCount":462,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UanWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Automating the Continuous Deployment Pipeline with Containerized Microservices About This Book First principles of devops, Ansible, Docker, Kubernetes, microservices Architect your software in a better and more efficient way with microservices packed as immutable containers Practical guide describing an extremely modern and advanced devops toolchain that can be improved continuously Who This Book Is For If you are an intermediate-level developer who wants to master the whole microservices development and deployment lifecycle using some of the latest and greatest practices and tools, this is the book for you. Familiarity with the basics of Devops and Continuous Deployment will be useful. What You Will Learn Get to grips with the fundamentals of Devops Architect efficient software in a better and more efficient way with the help of microservices Use Docker, Kubernetes, Ansible, Ubuntu, Docker Swarm and more Implement fast, reliable and continuous deployments with zero-downtime and ability to roll-back Learn about centralized logging and monitoring of your cluster Design self-healing systems capable of recovery from both hardware and software failures In Detail Building a complete modern devops toolchain requires not only the whole microservices development and a complete deployment lifecycle, but also the latest and greatest practices and tools. Victor Farcic argues from first principles how to build a devops toolchain. This book shows you how to chain together Docker, Kubernetes, Ansible, Ubuntu, and other tools to build the complete devops toolkit. Style and approach This book follows a unique, hands-on approach familiarizing you to the Devops 2.0 toolkit in a very practical manner. Although there will be a lot of theory, you won't be able to complete this book by reading it in a metro on a way to work. You'll need to be in front of your computer and get your hands dirty.","language":"en","currency":"USD","id":"1785280317","title":"The DevOps 2.0 Toolkit","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UanWDQAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZwCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Create impressive comics and Manga art in world-class graphics software, 2nd Edition","description":"Take your comics and illustrations to the next level with the powerful art tools in Clip Studio Paint 1.8 Key Features Overcome “interface overwhelm” with a practical breakdown of the Clip Studio interface Comprehensive guide on the Clip Studio Paint with detailed coverage of all the tools and concepts of designing comics Streamline your workflow to create faster and easier using Clip Studio’s features Book Description Clip Studio Paint, the successor to Manga Studio, is used by over four million illustrators and comic creators around the world. This book will guide you through every step of learning this software, from system requirements and installation, all the way through to exporting your work for print or the web. Learn how to create new documents, customize tools to fit your working style, use ruler tools to create anything from straight lines to intricate backgrounds, add 3D elements, create comic panels using the specialized panel tools, utilize screentones and materials, add text and word balloons to your comics, create sound effects, easily flat and color your comics using reference layers, and bring your drawings to life using the animation features. By the end of this book, you will be able to navigate the Clip Studio Interface and program preferences, customize the various tools, and be able to create your own black-and-white and color illustrations and comics from start to finish. What you will learn Understand the differences between Clip Studio Paint Pro and EX Discover how to navigate and customize the user interface Creating custom tools that fit your unique style of illustration Using the ruler tools to create intricate perspective shots and complex symmetry Discover how to use 3D elements in your work Learn how to create lettering and word balloons to bring your comic stories to life Understand the process of digital art creation from pencils to inks to color Understand how to use the animation tools available in Clip Studio Paint Who this book is for If you are a beginning digital artist or are switching to Clip Studio from another graphics software, this book is for you. This book is excellent for those with no knowledge of digital art up to intermediate users looking to explore the unique features of Clip Studio Paint.","language":"en","currency":"USD","id":"1789345812","title":"Learn Clip Studio Paint","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZwCBDwAAQBAJ&source=gbs_api","authors":["Liz Staley"]},{"pageCount":132,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8kh-dOU0CyMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"ASP.NET Website Development Made Easy","description":"Use your C# skills to build your next website with Orchard, the popular content management system based on ASP.NET MVC. With step-by-step guidance, you’ll learn your way around the Orchard environment by constructing a complete, real-world site throughout the course of this book. You’ll create, manage, and display dynamic content with out-of-the-box functionality, and then build themes, modules, and widgets to customize the site. Author John Zablocki gets you started by showing you how to obtain and compile the Orchard source code, so you can more efficiently customize and manage the sites you create. Create or extend Orchard content types to manage dynamic content Use alternate templates to change the way Orchard displays content Design a theme to define your website’s look and feel Build custom modules when the Orchard Gallery doesn’t have extensions you need Create reusable content pieces by creating widgets Explore options for adding multi-language support to a site Learn hosting options for your Orchard sites, including the cloud Package your custom themes and modules to share in Orchard Gallery","language":"en","currency":"USD","id":"144933976X","title":"Orchard CMS: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8kh-dOU0CyMC&source=gbs_api","authors":["John Zablocki"]},{"pageCount":64,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F7pCCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"An Unfinished Work","description":"This short work is the first draft of a book manuscript by Aaron Swartz written for the series \"Synthesis Lectures on the Semantic Web\" at the invitation of its editor, James Hendler. Unfortunately, the book wasn't completed before Aaron's death in January 2013. As a tribute, the editor and publisher are publishing the work digitally without cost. From the author's introduction: \" . . . we will begin by trying to understand the architecture of the Web -- what it got right and, occasionally, what it got wrong, but most importantly why it is the way it is. We will learn how it allows both users and search engines to co-exist peacefully while supporting everything from photo-sharing to financial transactions. We will continue by considering what it means to build a program on top of the Web -- how to write software that both fairly serves its immediate users as well as the developers who want to build on top of it. Too often, an API is bolted on top of an existing application, as an afterthought or a completely separate piece. But, as we'll see, when a web application is designed properly, APIs naturally grow out of it and require little effort to maintain. Then we'll look into what it means for your application to be not just another tool for people and software to use, but part of the ecology -- a section of the programmable web. This means exposing your data to be queried and copied and integrated, even without explicit permission, into the larger software ecosystem, while protecting users' freedom. Finally, we'll close with a discussion of that much-maligned phrase, 'the Semantic Web,' and try to understand what it would really mean.\"","language":"en","currency":"USD","id":"1627051694","title":"Aaron Swartz's The Programmable Web","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F7pCCQAAQBAJ&source=gbs_api","authors":["Aaron Swartz"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":492,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BsNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Foundations and Challenges","description":"This handbook offers a comprehensive overview of cloud computing security technology and implementation, while exploring practical solutions to a wide range of cloud computing security issues. With more organizations using cloud computing and cloud providers for data operations, proper security in these and other potentially vulnerable areas have become a priority for organizations of all sizes across the globe. Research efforts from both academia and industry in all security aspects related to cloud computing are gathered within one reference guide.","language":"en","currency":"USD","id":"1482260956","title":"Cloud Computing Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BsNDgAAQBAJ&source=gbs_api","authors":["John R. Vacca"]},{"pageCount":84,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5_88BpVaMPkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Extreme Scalability at Your Fingertips","description":"CouchDB is a new breed of database for the Internet, geared to meet the needs of today’s dynamic web applications. With this concise introduction, you’ll learn how CouchDB’s simple model for storing, processing, and accessing data makes it ideal for the type of data and rapid response users now demand from your applications—and how easy CouchDB is to set up, deploy, maintain, and scale. The code-packed examples in this book will help you learn how to work with documents, populate a simple database, replicate data from one database to another, and a host of other tasks. Install CouchDB on Linux, Mac OS X, Windows, or (if you must) from the source code Interact with data through CouchDB’s RESTful API, and use standard HTTP operations, such as PUT, GET, POST, and DELETE Use Futon—CouchDB’s web-based interface— to manage databases and documents, and to configure replications Learn how to create, update, and delete documents in JSON format, and how to create and delete databases Work with design documents to get the formatting and indexing your application requires","language":"en","currency":"USD","id":"1449329578","title":"Getting Started with CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5_88BpVaMPkC&source=gbs_api","authors":["MC Brown"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MswRBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.14,"subtitle":null,"description":"A practical approach covering everything you need to know to get up and running with Go, starting with the basics and imparting increasingly more detail as the examples and topics become more complicated. The book utilizes a casual, conversational style, rife with actual code and historical anecdotes for perspective, as well as usable and extensible example applications. This book is intended for systems developers and programmers with some experience in either Go and\/or concurrent programming who wish to become fluent in building high-performance applications that scale by leveraging single-core, multicore, or distributed concurrency.","language":"en","currency":"USD","id":"1783983493","title":"Mastering Concurrency in Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MswRBAAAQBAJ&source=gbs_api","authors":["Nathan Kozyra"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnnlCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This invaluable roadmap for startup engineers reveals how to successfully handle web application scalability challenges to meet increasing product and traffic demands. Web Scalability for Startup Engineers shows engineers working at startups and small companies how to plan and implement a comprehensive scalability strategy. It presents broad and holistic view of infrastructure and architecture of a scalable web application. Successful startups often face the challenge of scalability, and the core concepts driving a scalable architecture are language and platform agnostic. The book covers scalability of HTTP-based systems (websites, REST APIs, SaaS, and mobile application backends), starting with a high-level perspective before taking a deep dive into common challenges and issues. This approach builds a holistic view of the problem, helping you see the big picture, and then introduces different technologies and best practices for solving the problem at hand. The book is enriched with the author's real-world experience and expert advice, saving you precious time and effort by learning from others' mistakes and successes. Language-agnostic approach addresses universally challenging concepts in Web development\/scalability—does not require knowledge of a particular language Fills the gap for engineers in startups and smaller companies who have limited means for getting to the next level in terms of accomplishing scalability Strategies presented help to decrease time to market and increase the efficiency of web applications","language":"en","currency":"USD","id":"0071843663","title":"Web Scalability for Startup Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnnlCQAAQBAJ&source=gbs_api","authors":["Artur Ejsmont"]},{"pageCount":1440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prdSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The professional’s guide to C# 7, with expert guidance on the newest features Professional C# 7 and .NET Core 2.0 provides experienced programmers with the information they need to work effectively with the world’s leading programming language. The latest C# update added many new features that help you get more done in less time, and this book is your ideal guide for getting up to speed quickly. C# 7 focuses on data consumption, code simplification, and performance, with new support for local functions, tuple types, record types, pattern matching, non-nullable reference types, immutable types, and better support for variables. Improvements to Visual Studio will bring significant changes to the way C# developers interact with the space, bringing .NET to non-Microsoft platforms and incorporating tools from other platforms like Docker, Gulp, and NPM. Guided by a leading .NET expert and steeped in real-world practicality, this guide is designed to get you up to date and back to work. With Microsoft speeding up its release cadence while offering more significant improvement with each update, it has never been more important to get a handle on new tools and features quickly. This book is designed to do just that, and more—everything you need to know about C# is right here, in the single-volume resource on every developer’s shelf. Tour the many new and enhanced features packed into C# 7 and .NET Core 2.0 Learn how the latest Visual Studio update makes developers’ jobs easier Streamline your workflow with a new focus on code simplification and performance enhancement Delve into improvements made for localization, networking, diagnostics, deployments, and more Whether you’re entirely new to C# or just transitioning to C# 7, having a solid grasp of the latest features allows you to exploit the language’s full functionality to create robust, high -quality apps. Professional C# 7 and .NET Core 2.0 is the one-stop guide to everything you need to know.","language":"en","currency":"USD","id":"1119449243","title":"Professional C# 7 and .NET Core 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prdSDwAAQBAJ&source=gbs_api","authors":["Christian Nagel"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TQqSwRScVhoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Guide for Developers and Administrators","description":"If you’ve been asked to maintain large and complex Hadoop clusters, this book is a must. Demand for operations-specific material has skyrocketed now that Hadoop is becoming the de facto standard for truly large-scale data processing in the data center. Eric Sammer, Principal Solution Architect at Cloudera, shows you the particulars of running Hadoop in production, from planning, installing, and configuring the system to providing ongoing maintenance. Rather than run through all possible scenarios, this pragmatic operations guide calls out what works, as demonstrated in critical deployments. Get a high-level overview of HDFS and MapReduce: why they exist and how they work Plan a Hadoop deployment, from hardware and OS selection to network requirements Learn setup and configuration details with a list of critical properties Manage resources by sharing a cluster across multiple groups Get a runbook of the most common cluster maintenance tasks Monitor Hadoop clusters—and learn troubleshooting with the help of real-world war stories Use basic tools and techniques to handle backup and catastrophic failure","language":"en","currency":"USD","id":"144932729X","title":"Hadoop Operations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TQqSwRScVhoC&source=gbs_api","authors":["Eric Sammer"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OmeEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.99,"subtitle":"Building Artificial Intelligence We Can Trust","description":"Two leaders in the field offer a compelling analysis of the current state of the art and reveal the steps we must take to achieve a truly robust artificial intelligence. Despite the hype surrounding AI, creating an intelligence that rivals or exceeds human levels is far more complicated than we have been led to believe. Professors Gary Marcus and Ernest Davis have spent their careers at the forefront of AI research and have witnessed some of the greatest milestones in the field, but they argue that a computer beating a human in Jeopardy! does not signal that we are on the doorstep of fully autonomous cars or superintelligent machines. The achievements in the field thus far have occurred in closed systems with fixed sets of rules, and these approaches are too narrow to achieve genuine intelligence. The real world, in contrast, is wildly complex and open-ended. How can we bridge this gap? What will the consequences be when we do? Taking inspiration from the human mind, Marcus and Davis explain what we need to advance AI to the next level, and suggest that if we are wise along the way, we won't need to worry about a future of machine overlords. If we focus on endowing machines with common sense and deep understanding, rather than simply focusing on statistical analysis and gatherine ever larger collections of data, we will be able to create an AI we can trust—in our homes, our cars, and our doctors' offices. Rebooting AI provides a lucid, clear-eyed assessment of the current science and offers an inspiring vision of how a new generation of AI can make our lives better.","language":"en","currency":"USD","id":"1524748269","title":"Rebooting AI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OmeEDwAAQBAJ&source=gbs_api","authors":["Gary Marcus","Ernest Davis"]},{"pageCount":652,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UHFdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"Building Applications with Enterprise JavaBeans","description":"Build powerful back-end business logic and complex Enterprise JavaBeans (EJB)-based applications using Java EE 8, Eclipse Enterprise for Java (EE4J), Web Tools Project (WTP), and the Microprofile platform. Targeted at Java and Java EE developers, with or without prior EJB experience, this book is packed with practical insights, strategy tips, and code examples. As each chapter unfolds, you'll see how you can apply the new EJB spec to your own applications through specific examples. Beginning EJB in Java EE 8 serves not only as a reference, but also as a how-to guide and repository of practical examples to which you can refer as you build your own applications. It will help you harness the power of EJBs and take your Java EE 8 development to the next level. You'll gain the knowledge and skills you’ll need to create the complex enterprise applications that run today's transactions and more. What You'll Learn Build applications with Enterprise JavaBeans (EJBs) in the new Java EE 8 platform Discover when to use EJBs over contexts and dependency injection Use message-driven beans to do tasks asynchronously Integrate EJBs with microservices using the new Eclipse Microprofile project Manage complex enterprise transactions and much more Who This Book Is For Java programmers new to enterprise development and for those who may have experience with EJBs but are new to Java EE 8, EE4J, and related Eclipse projects.","language":"en","currency":"USD","id":"1484235738","title":"Beginning EJB in Java EE 8","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UHFdDwAAQBAJ&source=gbs_api","authors":["Jonathan Wetherbee","Massimo Nardone","Chirag Rathod","Raghu Kodali"]},{"pageCount":189,"thumbnail":"http:\/\/books.google.com\/books\/content?id=b951DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":"Designing Warehouse-Scale Machines, Third Edition","description":"This book describes warehouse-scale computers (WSCs), the computing platforms that power cloud computing and all the great web services we use every day. It discusses how these new systems treat the datacenter itself as one massive computer designed at warehouse scale, with hardware and software working in concert to deliver good levels of internet service performance. The book details the architecture of WSCs and covers the main factors influencing their design, operation, and cost structure, and the characteristics of their software base. Each chapter contains multiple real-world examples, including detailed case studies and previously unpublished details of the infrastructure used to power Google's online services. Targeted at the architects and programmers of today's WSCs, this book provides a great foundation for those looking to innovate in this fascinating and important area, but the material will also be broadly interesting to those who just want to understand the infrastructure powering the internet. The third edition reflects four years of advancements since the previous edition and nearly doubles the number of pictures and figures. New topics range from additional workloads like video streaming, machine learning, and public cloud to specialized silicon accelerators, storage and network building blocks, and a revised discussion of data center power and cooling, and uptime. Further discussions of emerging trends and opportunities ensure that this revised edition will remain an essential resource for educators and professionals working on the next generation of WSCs.","language":"en","currency":"USD","id":"1681734346","title":"The Datacenter as a Computer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=b951DwAAQBAJ&source=gbs_api","authors":["Luiz Andr Barroso","Urs Hlzle","Parthasarathy Ranganathan"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=st18CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33,"subtitle":null,"description":"Maximize your Excel experience with VBA Excel 2016 Power Programming with VBA is fully updated to cover all the latest tools and tricks of Excel 2016. Encompassing an analysis of Excel application development and a complete introduction to Visual Basic for Applications (VBA), this comprehensive book presents all of the techniques you need to develop both large and small Excel applications. Over 800 pages of tips, tricks, and best practices shed light on key topics, such as the Excel interface, file formats, enhanced interactivity with other Office applications, and improved collaboration features. In addition to the procedures, tips, and ideas that will expand your capabilities, this resource provides you with access to over 100 online example Excel workbooks and the Power Utility Pak, found on the Mr. Spreadsheet website. Understanding how to leverage VBA to improve your Excel programming skills can enhance the quality of deliverables that you produce—and can help you take your career to the next level. Explore fully updated content that offers comprehensive coverage through over 900 pages of tips, tricks, and techniques Leverage templates and worksheets that put your new knowledge in action, and reinforce the skills introduced in the text Access online resources, including the Power Utility Pak, that supplement the content Improve your capabilities regarding Excel programming with VBA, unlocking more of your potential in the office Excel 2016 Power Programming with VBA is a fundamental resource for intermediate to advanced users who want to polish their skills regarding spreadsheet applications using VBA.","language":"en","currency":"USD","id":"1119067626","title":"Excel 2016 Power Programming with VBA","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=st18CwAAQBAJ&source=gbs_api","authors":["Michael Alexander","Richard Kusleika"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OwPG6pFAGX8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"A Systematic Approach to Database Optimization","description":"Oracle Performance Survival Guide A Systematic Approach to Database Optimization The fast, complete, start-to-finish guide to optimizing Oracle performance Oracle Performance Survival Guide offers a structured, systematic, start-to-finish methodology for optimizing Oracle performance as efficiently as possible. Leading Oracle expert Guy Harrison shows how to maximize your tuning investment by focusing on causes rather than symptoms, and by quickly identifying the areas that deliver the greatest “bang for the buck.” Writing for DBAs and developers with all levels of experience, Harrison covers every area of Oracle performance management, from application design through SQL tuning, contention management through memory and physical IO management. He also presents up-to-the-minute guidance for optimizing the performance of the Oracle 11g Release 2. You’ll start by mastering Oracle structured performance tuning principles and tools, including techniques for tracing and monitoring Oracle execution. Harrison illuminates the interaction between applications and databases, guides you through choosing tuning tools, and introduces upfront design techniques that lead to higher-performance applications. He also presents a collection of downloadable scripts for reporting on all aspects of database performance. Coverage includes • “Tuning by layers,” the most effective, highest-value approach to Oracle performance optimization • Making the most of Oracle’s core tools for tracing, monitoring, and diagnosing performance • Highly efficient database logical and physical design, indexing, transaction design, and API use • SQL and PL\/SQL tuning, including the use of parallel SQL techniques • Minimizing contention for locks, latches, shared memory, and other database resources • Optimizing memory and physical disk IO • Tuning Real Application Cluster (RAC) databases guyharrison.net informit.com\/ph","language":"en","currency":"USD","id":"0137000502","title":"Oracle Performance Survival Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OwPG6pFAGX8C&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":210,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYWnHfz5jRUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":"A Quick Reference for Simplified Enterprise Java Development","description":"This handy guide provides an overview of Java Enterprise Edition 6’s main technologies and includes extensive, easy-to-understand code samples that demonstrate the platform’s many improvements. You’ll quickly understand how Java EE 6 simplifies the process of developing and deploying web and enterprise applications. Explore what’s new in Java EE 6, including Contexts and Dependency Injection and the Java API for RESTful Web Services Discover how Java EE 6 features relate to design patterns in web and enterprise applications Get the specifications for making your application Java EE compliant Learn about revisions to Enterprise JavaBeans, JavaServer Faces, and other components Find out how Java EE 6 profiles change the platform’s “one size fits all” approach Get started with Java EE 6 development and deployment, using NetBeans IDE and GlassFish","language":"en","currency":"USD","id":"1449338348","title":"Java EE 6 Pocket Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYWnHfz5jRUC&source=gbs_api","authors":["Arun Gupta"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYZqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"What Every SQL Professional Needs to Know about Non-Relational Databases","description":"Joe Celko's Complete Guide to NoSQL provides a complete overview of non-relational technologies so that you can become more nimble to meet the needs of your organization. As data continues to explode and grow more complex, SQL is becoming less useful for querying data and extracting meaning. In this new world of bigger and faster data, you will need to leverage non-relational technologies to get the most out of the information you have. Learn where, when, and why the benefits of NoSQL outweigh those of SQL with Joe Celko's Complete Guide to NoSQL. This book covers three areas that make today's new data different from the data of the past: velocity, volume and variety. When information is changing faster than you can collect and query it, it simply cannot be treated the same as static data. Celko will help you understand velocity, to equip you with the tools to drink from a fire hose. Old storage and access models do not work for big data. Celko will help you understand volume, as well as different ways to store and access data such as petabytes and exabytes. Not all data can fit into a relational model, including genetic data, semantic data, and data generated by social networks. Celko will help you understand variety, as well as the alternative storage, query, and management frameworks needed by certain kinds of data. Gain a complete understanding of the situations in which SQL has more drawbacks than benefits so that you can better determine when to utilize NoSQL technologies for maximum benefit Recognize the pros and cons of columnar, streaming, and graph databases Make the transition to NoSQL with the expert guidance of best-selling SQL expert Joe Celko","language":"en","currency":"USD","id":"0124072208","title":"Joe Celko’s Complete Guide to NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYZqAAAAQBAJ&source=gbs_api","authors":["Joe Celko"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OXpzPr1C4o4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Nmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities. \"Nmap 6: Network exploration and security auditing cookbook\" will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts. \"Nmap 6: Network exploration and security auditing cookbook\" is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system. The book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.","language":"en","currency":"USD","id":"1849517495","title":"Nmap 6: Network Exploration and Security Auditing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OXpzPr1C4o4C&source=gbs_api","authors":["Paulino Calderon Pale"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6ksf6yHS7L4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"From Novice to Professional","description":"Beginning Database Design, Second Edition provides short, easy-to-read explanations of how to get database design right the first time. This book offers numerous examples to help you avoid the many pitfalls that entrap new and not-so-new database designers. Through the help of use cases and class diagrams modeled in the UML, you’ll learn to discover and represent the details and scope of any design problem you choose to attack. Database design is not an exact science. Many are surprised to find that problems with their databases are caused by poor design rather than by difficulties in using the database management software. Beginning Database Design, Second Edition helps you ask and answer important questions about your data so you can understand the problem you are trying to solve and create a pragmatic design capturing the essentials while leaving the door open for refinements and extension at a later stage. Solid database design principles and examples help demonstrate the consequences of simplifications and pragmatic decisions. The rationale is to try to keep a design simple, but allow room for development as situations change or resources permit. Provides solid design principles by which to avoid pitfalls and support changing needs Includes numerous examples of good and bad design decisions and their consequences Shows a modern method for documenting design using the Unified Modeling Language","language":"en","currency":"USD","id":"1430242108","title":"Beginning Database Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6ksf6yHS7L4C&source=gbs_api","authors":["Clare Churcher"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y83aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.49,"subtitle":"Build powerful and reliable Python web applications from scratch, 3rd Edition","description":"Learn Django 3 with four end-to-end web projects Key Features Learn Django 3 by building real-world web applications from scratch in Python, using coding best practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Implement advanced functionalities like a full-text search engine, a user activity stream, or a recommendation engine Add real-time features with Django Channels and WebSockets Book Description If you want to learn the entire process of developing professional web applications with Python and Django, then this book is for you. In the process of building four professional Django projects, you will learn about Django 3 features, how to solve common web development problems, how to implement best practices, and how to successfully deploy your applications. In this book, you will build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Step-by-step guidance will teach you how to integrate popular technologies, enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. By the end of this book, you will have mastered Django 3 by building advanced web applications. What you will learn Build real-world web applications Learn Django essentials, including models, views, ORM, templates, URLs, forms, and authentication Implement advanced features such as custom model fields, custom template tags, cache, middleware, localization, and more Create complex functionalities, such as AJAX interactions, social authentication, a full-text search engine, a payment system, a CMS, a RESTful API, and more Integrate other technologies, including Redis, Celery, RabbitMQ, PostgreSQL, and Channels, into your projects Deploy Django projects in production using NGINX, uWSGI, and Daphne Who this book is for This book is intended for developers with Python knowledge who wish to learn Django in a pragmatic way. Perhaps you are completely new to Django, or you already know a little but you want to get the most out of it. This book will help you to master the most relevant areas of the framework by building practical projects from scratch. You need to have familiarity with programming concepts in order to read this book. Some previous knowledge of HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1838989323","title":"Django 3 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y83aDwAAQBAJ&source=gbs_api","authors":["Antonio Mel"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vz6PcTdo8VUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Discovering and Improving a Great Database","description":"Although MySQL's source code is open in the sense of being publicly available, it's essentially closed to you if you don't understand it. In this book, Sasha Pachev -- a former member of the MySQL Development Team -- provides a comprehensive tour of MySQL 5 that shows you how to figure out the inner workings of this powerful database. You'll go right to heart of the database to learn how data structures and convenience functions operate, how to add new storage engines and configuration options, and much more. The core of Understanding MySQL Internals begins with an Architecture Overview that provides a brief introduction of how the different components of MySQL work together. You then learn the steps for setting up a working compilable copy of the code that you can change and test at your pleasure. Other sections of the book cover: Core server classes, structures, and API The communication protocol between the client and the server Configuration variables, the controls of the server; includes a tutorial on how to add your own Thread-based request handling -- understanding threads and how they are used in MySQL An overview of MySQL storage engines The storage engine interface for integrating third-party storage engines The table lock manager The parser and optimizer for improving MySQL's performance Integrating a transactional storage engine into MySQL The internals of replication Understanding MySQL Internals provides unprecedented opportunities for developers, DBAs, database application programmers, IT departments, software vendors, and computer science students to learn about the inner workings of this enterprise-proven database. With this book, you will soon reach a new level of comprehension regarding database development that will enable you to accomplish your goals. It's your guide to discovering and improving a great database.","language":"en","currency":"USD","id":"0596552807","title":"Understanding MySQL Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vz6PcTdo8VUC&source=gbs_api","authors":["Sasha Pachev"]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WWgMsgBl3B4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Pro Spring Integration is an authoritative book from the experts that guides you through the vast world of enterprise application integration (EAI) and application of the Spring Integration framework towards solving integration problems. The book is: An introduction to the concepts of enterprise application integration A reference on building event-driven applications using Spring Integration A guide to solving common integration problems using Spring Integration What makes this book unique is its coverage of contemporary technologies and real-world information, with a focus on common problems that users are likely to confront. This book zeroes in on extending the Spring Integration framework to meet your custom integration demands. As Spring Integration is an extension of the Spring programming model, it builds on the Spring Framework's existing support for enterprise integration. This book will take you through all aspects of this relationship and show you how to get the most out of your Spring applications, where integration is a consideration. It discusses simple messaging within Spring-based applications and integration with external systems via simple adapters. Those adapters provide a higher-level of abstraction over Spring's support for remoting, messaging, and scheduling, all of which receives coverage in this book.","language":"en","currency":"USD","id":"143023346X","title":"Pro Spring Integration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WWgMsgBl3B4C&source=gbs_api","authors":["Josh Long","Dr Mark Lui","Mario Gray","Andy Chan"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CnDJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Modern Practices for SQL Server Applications","description":"Breathe new life into older applications by refactoring T-SQL queries and code using modern techniques. This book shows you how to significantly improve the performance of older applications by finding common anti-patterns in T-SQL code, then rewriting those anti-patterns using new functionality that is supported in current versions of SQL Server, including SQL Server 2019. The focus moves through the different types of database objects and the code used to create them, discussing the limitations and anti-patterns commonly found for each object type in your database. Legacy code isn’t just found in queries and external applications. It’s also found in the definitions of underlying database objects such as views and tables. This book helps you quickly find problematic code throughout the database and points out where and how modern solutions can replace older code, thereby making your legacy applications run faster and extending their lifetimes. Author Lisa Bohm explains the logic behind each anti-pattern, helping you understand why each pattern is a problem and showing how it can be avoided. Good coding habits are discussed, including guidance on topics such as readability and maintainability. What You Will Learn Find specific areas in code to target for performance gains Identify pain points quickly and understand why they are problematic Rewrite legacy T-SQL to reduce or eliminate hidden performance issues Write modern code with an awareness of readability and maintainability Recognize and correlate T-SQL anti-patterns with techniques for better solutions Make a positive impact on application user experience in your organization Who This Book Is For Database administrators or developers who maintain older code, those frustrated with complaints about slow code when there is so much of it to fix, and those who want a head start in making a positive impact on application user experience in their organization","language":"en","currency":"USD","id":"148425581X","title":"Refactoring Legacy T-SQL for Improved Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CnDJDwAAQBAJ&source=gbs_api","authors":["Lisa Bohm"]},{"pageCount":311,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BHGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"Data Virtualization with SQL Server, Hadoop, Apache Spark, and Beyond","description":"Harness the power of PolyBase data virtualization software to make data from a variety of sources easily accessible through SQL queries while using the T-SQL skills you already know and have mastered. PolyBase Revealed shows you how to use the PolyBase feature of SQL Server 2019 to integrate SQL Server with Azure Blob Storage, Apache Hadoop, other SQL Server instances, Oracle, Cosmos DB, Apache Spark, and more. You will learn how PolyBase can help you reduce storage and other costs by avoiding the need for ETL processes that duplicate data in order to make it accessible from one source. PolyBase makes SQL Server into that one source, and T-SQL is your golden ticket. The book also covers PolyBase scale-out clusters, allowing you to distribute PolyBase queries among several SQL Server instances, thus improving performance. With great flexibility comes great complexity, and this book shows you where to look when queries fail, complete with coverage of internals, troubleshooting techniques, and where to find more information on obscure cross-platform errors. Data virtualization is a key target for Microsoft with SQL Server 2019. This book will help you keep your skills current, remain relevant, and build new business and career opportunities around Microsoft’s product direction. What You Will Learn Install and configure PolyBase as a stand-alone service, or unlock its capabilities with a scale-out cluster Understand how PolyBase interacts with outside data sources while presenting their data as regular SQL Server tables Write queries combining data from SQL Server, Apache Hadoop, Oracle, Cosmos DB, Apache Spark, and more Troubleshoot PolyBase queries using SQL Server Dynamic Management Views Tune PolyBase queries using statistics and execution plans Solve common business problems, including \"cold storage\" of infrequently accessed data and simplifying ETL jobs Who This Book Is For SQL Server developers working in multi-platform environments who want one easy way of communicating with, and collecting data from, all of these sources","language":"en","currency":"USD","id":"1484254619","title":"PolyBase Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BHGDwAAQBAJ&source=gbs_api","authors":["Kevin Feasel"]},{"pageCount":965,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KSfXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Systematic Method for Improving Execution Speeds","description":"Identify, analyze, and improve poorly performing queries that damage user experience and lead to lost revenue for your business. This book will help you make query tuning an integral part of your daily routine through a multi-step process that includes monitoring of execution times, identifying candidate queries for optimization, analyzing their current performance, and improving them to deliver results faster and with less overhead. Author Jesper Krogh systematically discusses each of these steps along with the data sources and the tools used to perform them. MySQL 8 Query Performance Tuning aims to help you improve query performance using a wide range of strategies. You will know how to analyze queries using both the traditional EXPLAIN command as well as the new EXPLAIN ANALYZE tool. You also will see how to use the Visual Explain feature to provide a visually-oriented view of an execution plan. Coverage of indexes includes indexing strategies and index statistics, and you will learn how histograms can be used to provide input on skewed data distributions that the optimizer can use to improve query performance. You will learn about locks, and how to investigate locking issues. And you will come away with an understanding of how the MySQL optimizer works, including the new hash join algorithm, and how to change the optimizer’s behavior when needed to deliver faster execution times. You will gain the tools and skills needed to delight application users and to squeeze the most value from corporate computing resources. What You Will Learn Monitor query performance to identify poor performers Choose queries to optimize that will provide the greatest gain Analyze queries using tools such as EXPLAIN ANALYZE and Visual Explain Improve slow queries through a wide range of strategies Properly deploy indexes and histograms to aid in creating fast execution plans Understand and analyze locks to resolve contention and increase throughput Who This Book Is For Database administrators and SQL developers who are familiar with MySQL and need to participate in query tuning. While some experience with MySQL is required, no prior knowledge of query performance tuning is needed.","language":"en","currency":"USD","id":"1484255844","title":"MySQL 8 Query Performance Tuning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KSfXDwAAQBAJ&source=gbs_api","authors":["Jesper Wisborg Krogh"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k9zIDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.59,"subtitle":null,"description":"Domain-Driven Design (DDD) software modeling delivers powerful results in practice, not just in theory, which is why developers worldwide are rapidly moving to adopt it. Now, for the first time, there’s an accessible guide to the basics of DDD: What it is, what problems it solves, how it works, and how to quickly gain value from it. Concise, readable, and actionable, Domain-Driven Design Distilled never buries you in detail–it focuses on what you need to know to get results. Vaughn Vernon, author of the best-selling Implementing Domain-Driven Design, draws on his twenty years of experience applying DDD principles to real-world situations. He is uniquely well-qualified to demystify its complexities, illuminate its subtleties, and help you solve the problems you might encounter. Vernon guides you through each core DDD technique for building better software. You’ll learn how to segregate domain models using the powerful Bounded Contexts pattern, to develop a Ubiquitous Language within an explicitly bounded context, and to help domain experts and developers work together to create that language. Vernon shows how to use Subdomains to handle legacy systems and to integrate multiple Bounded Contexts to define both team relationships and technical mechanisms. Domain-Driven Design Distilled brings DDD to life. Whether you’re a developer, architect, analyst, consultant, or customer, Vernon helps you truly understand it so you can benefit from its remarkable power. Coverage includes What DDD can do for you and your organization–and why it’s so important The cornerstones of strategic design with DDD: Bounded Contexts and Ubiquitous Language Strategic design with Subdomains Context Mapping: helping teams work together and integrate software more strategically Tactical design with Aggregates and Domain Events Using project acceleration and management tools to establish and maintain team cadence","language":"en","currency":"USD","id":"0134434994","title":"Domain-Driven Design Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k9zIDAAAQBAJ&source=gbs_api","authors":["Vaughn Vernon"]},{"pageCount":505,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fQJ2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Real-World Scalable Web Apps","description":"Learn how to build a wide range of scalable real-world web applications using a professional development toolkit. If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages.With this book, you'll work with a varied collection of standards and frameworks and see how all those pieces fit together. Practical Node.js takes you from installing all the necessary modules to writing full-stack web applications. You'll harness the power of the Express.js and Hapi frameworks, the MongoDB database with Mongoskin and Mongoose. You'll also work with Pug and Handlebars template engines, Stylus and LESS CSS lanaguages, OAuth and Everyauth libraries, and the Socket.IO and Derby libraries, and everything in between. This exciting second edition is fully updated for ES6\/ES2015 and also covers how to deploy to Heroku and AWS, daemonize apps, and write REST APIs. You’ll build full-stack real-world Node.js apps from scratch, and also discover how to write your own Node.js modules and publish them on NPM. Fully supported by a continuously updated source code repository on GitHub and with full-color code examples, learn what you can do with Node.js and how far you can take it! What You'll Learn Manipulate data from the mongo console Use the Mongoskin and Mongoose MongoDB libraries Build REST API servers with Express and Hapi Deploy apps to Heroku and AWS Test services with Mocha, Expect and TravisCI Implement a third-party OAuth strategy with Everyauth Web developers who have some familiarity with the basics of Node.js and want to learn how to use it to build apps in a professional environment.","language":"en","currency":"USD","id":"1484230396","title":"Practical Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fQJ2DwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QBp2qSknzRIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":null,"description":"This book covers developing web applications with Ruby on Rails. It discusses Ajax, directory services, and web services. The book details the configuration of Ruby on Rails with different databases such as MySQL, Oracle and SQL Server 2005. In addition, it makes a comparison with PHP, the most commonly used scripting language for developing web applications. The book also provides example applications that may be modified to suit a developer’s application.","language":"en","currency":"USD","id":"3540731458","title":"Ruby on Rails for PHP and Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QBp2qSknzRIC&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uyTXBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"A Handbook for Aligning the Business with IT using High-Level Data Models","description":"Did you ever try getting Businesspeople and IT to agree on the project scope for a new application? Or try getting Marketing and Sales to agree on the target audience? Or try bringing new team members up to speed on the hundreds of tables in your data warehouse — without them dozing off? Whether you are a businessperson or an IT professional, you can be the hero in each of these and hundreds of other scenarios by building a High-Level Data Model. The High-Level Data Model is a simplified view of our complex environment. It can be a powerful communication tool of the key concepts within our application development projects, business intelligence and master data management programs, and all enterprise and industry initiatives. Learn about the High-Level Data Model and master the techniques for building one, including a comprehensive ten-step approach and hands-on exercises to help you practice topics on your own. In this book, we review data modeling basics and explain why the core concepts stored in a high-level data model can have significant business impact on an organization. We explain the technical notation used for a data model and walk through some simple examples of building a high-level data model. We also describe how data models relate to other key initiatives you may have heard of or may be implementing in your organization. This book contains best practices for implementing a high-level data model, along with some easy-to-use templates and guidelines for a step-by-step approach. Each step will be illustrated using many examples based on actual projects we have worked on. Names have been changed to protect the innocent, but the pain points and lessons have been preserved. One example spans an entire chapter and will allow you to practice building a high-level data model from beginning to end, and then compare your results to ours. Building a high-level data model following the ten step approach you’ll read about is a great way to ensure you will retain the new skills you learn in this book. As is the case in many disciplines, using the right tool for the right job is critical to the overall success of your high-level data model implementation. To help you in your tool selection process, there are several chapters dedicated to discussing what to look for in a high-level data modeling tool and a framework for choosing a data modeling tool, in general. This book concludes with a real-world case study that shows how an international energy company successfully used a high-level data model to streamline their information management practices and increase communication throughout the organization—between both businesspeople and IT. Data modeling is one of the under-exploited, and potentially very valuable, business capabilities that are often hidden away in an organization’s Information Technology department. Data Modeling for the Business highlights both the resulting damage to business value, and the opportunities to make things better. As an easy-to follow and comprehensive guide on the ‘why’ and ‘how’ of data modeling, it also reminds us that a successful strategy for exploiting IT depends at least as much on the information as the technology. Chris Potts, Corporate IT Strategist and Author of fruITion: Creating the Ultimate Corporate Strategy for Information Technology One of the most critical systems issues is aligning business with IT and fulfilling business needs using data models. The authors of Data Modeling for the Business do a masterful job at simply and clearly describing the art of using data models to communicate with business representatives and meet business needs. The book provides many valuable tools, analogies, and step-by-step methods for effective data modeling and is an important contribution in bridging the much needed connection between data modeling and realizing business requirements. Len Silverston, author of The Data Model Resource Book series","language":"en","currency":"USD","id":"1634620437","title":"Data Modeling for the Business","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uyTXBgAAQBAJ&source=gbs_api","authors":["Steve Hoberman","Donna Burbank","Chris Bradley"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":532,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The truth about DevOps by the people on the front line","description":"Discover DevOps secrets from leading experts. Viktor Farcic interviews DevOps industries voices including Mike Kail, Greg Bledsoe, Jeff Sussna, James Turnbull, Kohsuke Kawaguchi, Liz Keogh, and more. Key Features Leading DevOps experts share their insights into modern DevOps practice Engage with the real-world challenges of putting DevOps to work Strengthen your DevOps practices now and prepare for future DevOps trends Book Description DevOps promises to break down silos, uniting organizations to deliver high quality output in a cross-functional way. In reality it often results in confusion and new silos: pockets of DevOps practitioners fight the status quo, senior decision-makers demand DevOps paint jobs without committing to true change. Even a clear definition of what DevOps is remains elusive. In DevOps Paradox, top DevOps consultants, industry leaders, and founders reveal their own approaches to all aspects of DevOps implementation and operation. Surround yourself with expert DevOps advisors. Viktor Farcic draws on experts from across the industry to discuss how to introduce DevOps to chaotic organizations, align incentives between teams, and make use of the latest tools and techniques. With each expert offering their own opinions on what DevOps is and how to make it work, you will be able to form your own informed view of the importance and value of DevOps as we enter a new decade. If you want to see how real DevOps experts address the challenges and resolve the paradoxes, this book is for you. What you will learn Expert opinions on: Introducing DevOps into real-world, chaotic business environments Deciding between adopting cutting edge tools or sticking with tried-and-tested methods Initiating necessary business change without positional power Managing and overcoming fear of change in DevOps implementations Anticipating future trends in DevOps and how to prepare for them Getting the most from Kubernetes, Docker, Puppet, Chef, and Ansible Creating the right incentives for DevOps success across an organization The impact of new techniques, such as Lambda, serverless, and schedulers, on DevOps practice Who this book is for Anybody interested in DevOps will gain a lot from this book. If you want to get beyond the simplistic ideals and engage with the deep challenges of putting DevOps to work in the real world, this book is for you.","language":"en","currency":"USD","id":"1789138809","title":"DevOps Paradox","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6isDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":566,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vIwoJXNUec4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Java Programming for the New Generation of Mobile Devices","description":"Get thoroughly up to speed on Android programming, and learn how to create up-to-date user experiences for both handsets and tablets. With this book's extensively revised second edition, you'll focus on Android tools and programming essentials, including best practices for using Android 4 APIs. If you're experienced with Java or Objective-C, you'll gain the knowledge necessary for building well-engineered applications. Programming Android is organized into four parts: Part One helps programmers with some Java or iOS experience get off to a fast start with the Android SDK and Android programming basics. Part Two delves into the Android framework, focusing on user interface and graphics class hierarchies, concurrency, and databases. It's a solid foundation for understanding of how the most important parts of an Android application work. Part Three features code skeletons and patterns for accelerating the development of apps that use web data and Android 4 user interface conventions and APIs. Part Four delivers practical coverage of Android's multimedia, search, location, sensor, and account APIs, plus the Native Development Kit, enabling developers to add advanced capabilities. This updated edition of Programming Android focuses on the knowledge and developer priorities that are essential for successful Android development projects.","language":"en","currency":"USD","id":"1449358470","title":"Programming Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vIwoJXNUec4C&source=gbs_api","authors":["Zigurd Mednieks","Laird Dornin","G. Blake Meike","Masumi Nakamura"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xCu4IYcWS5YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Problem-Solution Approach","description":"The Spring framework is a widely adopted enterprise and general Java framework. The release of Spring Framework 3.0 has added many improvements and new features for Spring development. Written by Gary Mak, author of the bestseller Spring Recipes, and Josh Long, an expert Spring user and developer, Spring Enterprise Recipes is one of the first books on Spring 3.0. This key book focuses on Spring Framework 3.0, the latest version available, and a framework-related suite of tools, extensions, plug-ins, modules, and more—all of which you may want and need for building three-tier Java EE applications. Build Spring enterprise and Java EE applications from the ground up using recipes from this book as templates to get you started, fast. Employ Spring Integration, Spring Batch and jBPM with Spring to bring your application's architecture to the next level. Use Spring's remoting, and messaging support to distribute your application, or bring your application to the cloud with GridGain and Terracotta.","language":"en","currency":"USD","id":"1430224983","title":"Spring Enterprise Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xCu4IYcWS5YC&source=gbs_api","authors":["Gary Mak","Josh Long"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZZ_6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A deep dive into distributed ledgers, consensus protocols, smart contracts, DApps, cryptocurrencies, Ethereum, and more, 3rd Edition","description":"Mastering Blockchain, Third Edition is the blockchain bible to equip you with extensive knowledge of distributed ledgers, cryptocurrencies, smart contracts, consensus algorithms, cryptography and blockchain platforms such as Ethereum, Bitcoin, and many more.","language":"en","currency":"USD","id":"1839211377","title":"Mastering Blockchain","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZZ_6DwAAQBAJ&source=gbs_api","authors":["Imran Bashir"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jimnez","Graham Lee","Corey Wade"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYZqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"What Every SQL Professional Needs to Know about Non-Relational Databases","description":"Joe Celko's Complete Guide to NoSQL provides a complete overview of non-relational technologies so that you can become more nimble to meet the needs of your organization. As data continues to explode and grow more complex, SQL is becoming less useful for querying data and extracting meaning. In this new world of bigger and faster data, you will need to leverage non-relational technologies to get the most out of the information you have. Learn where, when, and why the benefits of NoSQL outweigh those of SQL with Joe Celko's Complete Guide to NoSQL. This book covers three areas that make today's new data different from the data of the past: velocity, volume and variety. When information is changing faster than you can collect and query it, it simply cannot be treated the same as static data. Celko will help you understand velocity, to equip you with the tools to drink from a fire hose. Old storage and access models do not work for big data. Celko will help you understand volume, as well as different ways to store and access data such as petabytes and exabytes. Not all data can fit into a relational model, including genetic data, semantic data, and data generated by social networks. Celko will help you understand variety, as well as the alternative storage, query, and management frameworks needed by certain kinds of data. Gain a complete understanding of the situations in which SQL has more drawbacks than benefits so that you can better determine when to utilize NoSQL technologies for maximum benefit Recognize the pros and cons of columnar, streaming, and graph databases Make the transition to NoSQL with the expert guidance of best-selling SQL expert Joe Celko","language":"en","currency":"USD","id":"0124072208","title":"Joe Celko’s Complete Guide to NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYZqAAAAQBAJ&source=gbs_api","authors":["Joe Celko"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OXpzPr1C4o4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Nmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities. \"Nmap 6: Network exploration and security auditing cookbook\" will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts. \"Nmap 6: Network exploration and security auditing cookbook\" is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system. The book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.","language":"en","currency":"USD","id":"1849517495","title":"Nmap 6: Network Exploration and Security Auditing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OXpzPr1C4o4C&source=gbs_api","authors":["Paulino Calderon Pale"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k5wQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Problem - Solution Approach","description":"Big Data Application Architecture Pattern Recipes provides an insight into heterogeneous infrastructures, databases, and visualization and analytics tools used for realizing the architectures of big data solutions. Its problem-solution approach helps in selecting the right architecture to solve the problem at hand. In the process of reading through these problems, you will learn harness the power of new big data opportunities which various enterprises use to attain real-time profits. Big Data Application Architecture Pattern Recipes answers one of the most critical questions of this time 'how do you select the best end-to-end architecture to solve your big data problem?'. The book deals with various mission critical problems encountered by solution architects, consultants, and software architects while dealing with the myriad options available for implementing a typical solution, trying to extract insight from huge volumes of data in real–time and across multiple relational and non-relational data types for clients from industries like retail, telecommunication, banking, and insurance. The patterns in this book provide the strong architectural foundation required to launch your next big data application. The architectures for realizing these opportunities are based on relatively less expensive and heterogeneous infrastructures compared to the traditional monolithic and hugely expensive options that exist currently. This book describes and evaluates the benefits of heterogeneity which brings with it multiple options of solving the same problem, evaluation of trade-offs and validation of 'fitness-for-purpose' of the solution.","language":"en","currency":"USD","id":"1430262931","title":"Big Data Application Architecture Q&A","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k5wQAwAAQBAJ&source=gbs_api","authors":["Nitin Sawant","Himanshu Shah"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel guide to Python with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter for sentiment analysis, cognitive computing with IBM Watson, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop, Spark and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate, IBM Watson, Microsoft Azure, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter, IBM Watson, machine learning, deep learning, computer vision, Hadoop, Spark, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jugCDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.95,"subtitle":"Visualize Structure and Meaning","description":"Master a graph data modeling technique superior to traditional data modeling for both relational and NoSQL databases (graph, document, key-value, and column), leveraging cognitive psychology to improve big data designs. From Karen Lopez’s Foreword: In this book, Thomas Frisendal raises important questions about the continued usefulness of traditional data modeling notations and approaches: Are Entity Relationship Diagrams (ERDs) relevant to analytical data requirements? Are ERDs relevant in the new world of Big Data? Are ERDs still the best way to work with business users to understand their needs? Are Logical and Physical Data Models too closely coupled? Are we correct in using the same notations for communicating with business users and developers? Should we refine our existing notations and tools to meet these new needs, or should we start again from a blank page? What new notations and approaches will we need? How will we use those to build enterprise database systems? Frisendal takes us through the history of data modeling, enterprise data models and traditional modeling methods. He points out, quite contentiously, where he feels we have gone wrong and in a few places where we got it right. He then maps out the psychology of meaning and context, while identifying important issues about where data modeling may or may not fit in business modeling. The main subject of this work is a proposal for a new exploration-driven modeling approach and new modeling notations for business concept models, business solutions models, and physical data models with examples on how to leverage those for implementing into any target database or datastore. These new notations are based on a property graph approach to modeling data.","language":"en","currency":"USD","id":"1634621239","title":"Graph Data Modeling for NoSQL and SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jugCDQAAQBAJ&source=gbs_api","authors":["Thomas Frisendal"]},{"pageCount":761,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gFxCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Deliver eye-catching Business Intelligence with Microsoft Power BI Desktop. This new edition has been updated to cover all the latest features, including combo charts, Cartesian charts, trend lines, use of gauges, and more. Also covered are Top-N features, the ability to bin data into groupings and chart the groupings, and new techniques for detecting and handling outlier data points. You can take data from virtually any source and use it to produce stunning dashboards and compelling reports that will seize your audience’s attention. Slice and dice the data with remarkable ease and then add metrics and KPIs to project the insights that create your competitive advantage. Make raw data into clear, accurate, and interactive information with Microsoft’s free self-service business intelligence tool. Pro Power BI Desktop shows you how to choose from a wide range of built-in and third-party visualization types so that your message is always enhanced. You’ll be able to deliver those results on the PC, tablets, and smartphones, as well as share results via the cloud. This book helps you save time by preparing the underlying data correctly without needing an IT department to prepare it for you. What You'll Learn Deliver attention-grabbing information, turning data into insight Mash up data from multiple sources into a cleansed and coherent data model Create dashboards that help in monitoring key performance indicators of your business Build interdependent charts, maps, and tables to deliver visually stunning information Share business intelligence in the cloud without involving IT Deliver visually stunning and interactive charts, maps, and tables Find new insights as you chop and tweak your data as never before Adapt delivery to mobile devices such as phones and tablets Who This Book Is For Everyone from CEOs and Business Intelligence developers to power users and IT managers","language":"en","currency":"USD","id":"1484232100","title":"Pro Power BI Desktop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gFxCDwAAQBAJ&source=gbs_api","authors":["Adam Aspin"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rU5NCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":49.95,"subtitle":"A Practical Guide for Business and IT Professionals","description":"Data Modeling Made Simple will provide the business or IT professional with a practical working knowledge of data modeling concepts and best practices. This book is written in a conversational style that encourages you to read it from start to finish and master these ten objectives: Know when a data model is needed and which type of data model is most effective for each situation Read a data model of any size and complexity with the same confidence as reading a book Build a fully normalized relational data model, as well as an easily navigatable dimensional model Apply techniques to turn a logical data model into an efficient physical design Leverage several templates to make requirements gathering more efficient and accurate Explain all ten categories of the Data Model Scorecard Learn strategies to improve your working relationships with others Appreciate the impact unstructured data has, and will have, on our data modeling deliverables Learn basic UML concepts Put data modeling in context with XML, metadata, and agile development Book Review by Johnny Gay In this book review, I address each section in the book and provide what I found most valuable as a data modeler. I compare, as I go, how the book's structure eases the new data modeler into the subject much like an instructor might ease a beginning swimmer into the pool. This book begins like a Dan Brown novel. It even starts out with the protagonist, our favorite data modeler, lost on a dark road somewhere in France. In this case, what saves him isn't a cipher, but of all things, something that's very much like a data model in the form of a map! The author deems they are both way-finding tools. The chapters in the book are divided into 5 sections. The chapters in each section end with an exercise and a list of the key points covered to reinforce what you've learned. I find myself comparing the teaching structure of the book to the way most of us learn to swim.","language":"en","currency":"USD","id":"163462016X","title":"Data Modeling Made Simple","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rU5NCwAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jzvcCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"New Opportunities for Connected Data","description":"Discover how graph databases can help you manage and query highly connected data. With this practical book, you’ll learn how to design and implement a graph database that brings the power of graphs to bear on a broad range of problem domains. Whether you want to speed up your response to user queries or build a database that can adapt as your business evolves, this book shows you how to apply the schema-free graph model to real-world problems. This second edition includes new code samples and diagrams, using the latest Neo4j syntax, as well as information on new functionality. Learn how different organizations are using graph databases to outperform their competitors. With this book’s data modeling, query, and code examples, you’ll quickly be able to implement your own solution. Model data with the Cypher query language and property graph model Learn best practices and common pitfalls when modeling with graphs Plan and implement a graph database solution in test-driven fashion Explore real-world examples to learn how and why organizations use a graph database Understand common patterns and components of graph database architecture Use analytical techniques and algorithms to mine graph database information","language":"en","currency":"USD","id":"1491930845","title":"Graph Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jzvcCQAAQBAJ&source=gbs_api","authors":["Ian Robinson","Jim Webber","Emil Eifrem"]},{"pageCount":385,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J_YRmK9byy4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"Create, validate, and transform XML documents with Oracle's JDeveloper IDE using this book and eBook.","language":"en","currency":"USD","id":"1847196675","title":"Processing XML Documents with Oracle JDeveloper 11g","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J_YRmK9byy4C&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HHmBfmJRSL4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":49.56,"subtitle":null,"description":"Fully revised and updated, Relational Database Design, Second Edition is the most lucid and effective introduction to relational database design available. Here, you'll find the conceptual and practical information you need to develop a design that ensures data accuracy and user satisfaction while optimizing performance, regardless of your experience level or choice of DBMS. Supporting the book's step-by-step instruction are three case studies illustrating the planning, analysis, and design steps involved in arriving at a sound design. These real-world examples include object-relational design techniques, which are addressed in greater detail in a new chapter devoted entirely to this timely subject. * Concepts you need to master to put the book's practical instruction to work. * Methods for tailoring your design to the environment in which the database will run and the uses to which it will be put. * Design approaches that ensure data accuracy and consistency. * Examples of how design can inhibit or boost database application performance. * Object-relational design techniques, benefits, and examples. * Instructions on how to choose and use a normalization technique. * Guidelines for understanding and applying Codd's rules. * Tools to implement a relational design using SQL. * Techniques for using CASE tools for database design.","language":"en","currency":"USD","id":"0080516068","title":"Relational Database Design Clearly Explained","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HHmBfmJRSL4C&source=gbs_api","authors":["Jan L. Harrington"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FI3XBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Building Well-Designed and Supportable MongoDB Databases","description":"Congratulations! You completed the MongoDB application within the given tight timeframe and there is a party to celebrate your application’s release into production. Although people are congratulating you at the celebration, you are feeling some uneasiness inside. To complete the project on time required making a lot of assumptions about the data, such as what terms meant and how calculations are derived. In addition, the poor documentation about the application will be of limited use to the support team, and not investigating all of the inherent rules in the data may eventually lead to poorly-performing structures in the not-so-distant future. Now, what if you had a time machine and could go back and read this book. You would learn that even NoSQL databases like MongoDB require some level of data modeling. Data modeling is the process of learning about the data, and regardless of technology, this process must be performed for a successful application. You would learn the value of conceptual, logical, and physical data modeling and how each stage increases our knowledge of the data and reduces assumptions and poor design decisions. Read this book to learn how to do data modeling for MongoDB applications, and accomplish these five objectives: Understand how data modeling contributes to the process of learning about the data, and is, therefore, a required technique, even when the resulting database is not relational. That is, NoSQL does not mean NoDataModeling! Know how NoSQL databases differ from traditional relational databases, and where MongoDB fits. Explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts, and learn the basics of adding, querying, updating, and deleting data in MongoDB. Practice a streamlined, template-driven approach to performing conceptual, logical, and physical data modeling. Recognize that data modeling does not always have to lead to traditional data models! Distinguish top-down from bottom-up development approaches and complete a top-down case study which ties all of the modeling techniques together. This book is written for anyone who is working with, or will be working with MongoDB, including business analysts, data modelers, database administrators, developers, project managers, and data scientists. There are three sections: In Section I, Getting Started, we will reveal the power of data modeling and the tight connections to data models that exist when designing any type of database (Chapter 1), compare NoSQL with traditional relational databases and where MongoDB fits (Chapter 2), explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts (Chapter 3), and explain the basics of adding, querying, updating, and deleting data in MongoDB (Chapter 4). In Section II, Levels of Granularity, we cover Conceptual Data Modeling (Chapter 5), Logical Data Modeling (Chapter 6), and Physical Data Modeling (Chapter 7). Notice the “ing” at the end of each of these chapters. We focus on the process of building each of these models, which is where we gain essential business knowledge. In Section III, Case Study, we will explain both top down and bottom up development approaches and go through a top down case study where we start with business requirements and end with the MongoDB database. This case study will tie together all of the techniques in the previous seven chapters. Nike Senior Data Architect Ryan Smith wrote the foreword. Key points are included at the end of each chapter as a way to reinforce concepts. In addition, this book is loaded with hands-on exercises, along with their answers provided in Appendix A. Appendix B contains all of the book’s references and Appendix C contains a glossary of the terms used throughout the text.","language":"en","currency":"USD","id":"1634620410","title":"Data Modeling for MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FI3XBgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYZqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"What Every SQL Professional Needs to Know about Non-Relational Databases","description":"Joe Celko's Complete Guide to NoSQL provides a complete overview of non-relational technologies so that you can become more nimble to meet the needs of your organization. As data continues to explode and grow more complex, SQL is becoming less useful for querying data and extracting meaning. In this new world of bigger and faster data, you will need to leverage non-relational technologies to get the most out of the information you have. Learn where, when, and why the benefits of NoSQL outweigh those of SQL with Joe Celko's Complete Guide to NoSQL. This book covers three areas that make today's new data different from the data of the past: velocity, volume and variety. When information is changing faster than you can collect and query it, it simply cannot be treated the same as static data. Celko will help you understand velocity, to equip you with the tools to drink from a fire hose. Old storage and access models do not work for big data. Celko will help you understand volume, as well as different ways to store and access data such as petabytes and exabytes. Not all data can fit into a relational model, including genetic data, semantic data, and data generated by social networks. Celko will help you understand variety, as well as the alternative storage, query, and management frameworks needed by certain kinds of data. Gain a complete understanding of the situations in which SQL has more drawbacks than benefits so that you can better determine when to utilize NoSQL technologies for maximum benefit Recognize the pros and cons of columnar, streaming, and graph databases Make the transition to NoSQL with the expert guidance of best-selling SQL expert Joe Celko","language":"en","currency":"USD","id":"0124072208","title":"Joe Celko’s Complete Guide to NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYZqAAAAQBAJ&source=gbs_api","authors":["Joe Celko"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OXpzPr1C4o4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Nmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities. \"Nmap 6: Network exploration and security auditing cookbook\" will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts. \"Nmap 6: Network exploration and security auditing cookbook\" is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system. The book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.","language":"en","currency":"USD","id":"1849517495","title":"Nmap 6: Network Exploration and Security Auditing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OXpzPr1C4o4C&source=gbs_api","authors":["Paulino Calderon Pale"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k5wQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Problem - Solution Approach","description":"Big Data Application Architecture Pattern Recipes provides an insight into heterogeneous infrastructures, databases, and visualization and analytics tools used for realizing the architectures of big data solutions. Its problem-solution approach helps in selecting the right architecture to solve the problem at hand. In the process of reading through these problems, you will learn harness the power of new big data opportunities which various enterprises use to attain real-time profits. Big Data Application Architecture Pattern Recipes answers one of the most critical questions of this time 'how do you select the best end-to-end architecture to solve your big data problem?'. The book deals with various mission critical problems encountered by solution architects, consultants, and software architects while dealing with the myriad options available for implementing a typical solution, trying to extract insight from huge volumes of data in real–time and across multiple relational and non-relational data types for clients from industries like retail, telecommunication, banking, and insurance. The patterns in this book provide the strong architectural foundation required to launch your next big data application. The architectures for realizing these opportunities are based on relatively less expensive and heterogeneous infrastructures compared to the traditional monolithic and hugely expensive options that exist currently. This book describes and evaluates the benefits of heterogeneity which brings with it multiple options of solving the same problem, evaluation of trade-offs and validation of 'fitness-for-purpose' of the solution.","language":"en","currency":"USD","id":"1430262931","title":"Big Data Application Architecture Q&A","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k5wQAwAAQBAJ&source=gbs_api","authors":["Nitin Sawant","Himanshu Shah"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel guide to Python with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter for sentiment analysis, cognitive computing with IBM Watson, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop, Spark and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate, IBM Watson, Microsoft Azure, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter, IBM Watson, machine learning, deep learning, computer vision, Hadoop, Spark, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":213,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oBnHueFC4vcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.71,"subtitle":"Photorealistic Visualization","description":"Create high-quality photorealistic renders of architectural visualizations using 3ds Max and Vray with the project-based tutorials in this book. Learn how to combine lighting and rendering options to end-up with the most realistic final renders possible at a professional level. The tutorials in this book are filled with beautiful full-color images and they teach you how to light both interiors and exteriors and daytime and nighttime scenes. Learn how to save time without sacrificing the quality of your final renders with tips and tricks on rendering with Vray - the most accurate rendering application for 3ds Max. The companion CD includes all the project files that you need to recreate each of the projects presented within the book.","language":"en","currency":"USD","id":"1136129650","title":"Architectural Rendering with 3ds Max and V-Ray","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oBnHueFC4vcC&source=gbs_api","authors":["Markus Kuhlo"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]}]