[{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YNhOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Over 90 hands-on recipes to design Internet scalable web and mobile applications with Amazon DynamoDB About This Book Construct top-notch mobile and web applications with the Internet scalable NoSQL database and host it on cloud Integrate your applications with other AWS services like AWS EMR, AWS S3, AWS Redshift, and AWS CloudSearch etc. in order to achieve a one-stop application stack Step-by-step implementation guide that provides real-world use with hands-on recipes Who This Book Is For This book is intended for those who have a basic understanding of AWS services and want to take their knowledge to the next level by getting their hands dirty with coding recipes in DynamoDB. What You Will Learn Design DynamoDB tables to achieve high read and write throughput Discover best practices like caching, exponential back-offs and auto-retries, storing large items in AWS S3, storing compressed data etc. Effectively use DynamoDB Local in order to make your development smooth and cost effective Implement cost effective best practices to reduce the burden of DynamoDB charges Create and maintain secondary indexes to support improved data access Integrate various other AWS services like AWS EMR, AWS CloudSearch, AWS Pipeline etc. with DynamoDB In Detail AWS DynamoDB is an excellent example of a production-ready NoSQL database. In recent years, DynamoDB has been able to attract many customers because of its features like high-availability, reliability and infinite scalability. DynamoDB can be easily integrated with massive data crunching tools like Hadoop \/EMR, which is an essential part of this data-driven world and hence it is widely accepted. The cost and time-efficient design makes DynamoDB stand out amongst its peers. The design of DynamoDB is so neat and clean that it has inspired many NoSQL databases to simply follow it. This book will get your hands on some engineering best practices DynamoDB engineers use, which can be used in your day-to-day life to build robust and scalable applications. You will start by operating with DynamoDB tables and learn to manipulate items and manage indexes. You will also discover how to easily integrate applications with other AWS services like EMR, S3, CloudSearch, RedShift etc. A couple of chapters talk in detail about how to use DynamoDB as a backend database and hosting it on AWS ElasticBean. This book will also focus on security measures of DynamoDB as well by providing techniques on data encryption, masking etc. By the end of the book you'll be adroit in designing web and mobile applications using DynamoDB and host it on cloud. Style and approach An easy-to-follow guide, full of real-world examples, which takes you through the world of DynamoDB following a step-by-step, problem-solution based approach.","language":"en","currency":"USD","id":"1784391093","title":"DynamoDB Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YNhOCwAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JupaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you have interest in DynamoDB and want to know what DynamoDB is all about and become proficient in using it, this is the book for you. If you are an intermediate user who wishes to enhance your knowledge of DynamoDB, this book is aimed at you. Basic familiarity with programming, NoSQL, and cloud computing concepts would be helpful.","language":"en","currency":"USD","id":"1783551968","title":"Mastering DynamoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JupaBAAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JupaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you have interest in DynamoDB and want to know what DynamoDB is all about and become proficient in using it, this is the book for you. If you are an intermediate user who wishes to enhance your knowledge of DynamoDB, this book is aimed at you. Basic familiarity with programming, NoSQL, and cloud computing concepts would be helpful.","language":"en","currency":"USD","id":"1783551968","title":"Mastering DynamoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JupaBAAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KQMUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":2.58,"subtitle":null,"description":"What Is Amazon Dynamodb ? Amazon DynamoDB is a fully managed ‘NoSQL Database Service” that provides fast performance with seamless scalability.","language":"en","currency":"USD","id":"171650158X","title":"Amazon Dynamodb Tutorial | AWS Certified DevOps Engineer Training","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KQMUEAAAQBAJ&source=gbs_api","authors":["saravana kumar"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DCmpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"Add Intelligence to Applications with Amazon SageMaker and Amazon Rekognition","description":"Put the power of AWS Cloud machine learning services to work in your business and commercial applications! Machine Learning in the AWS Cloud introduces readers to the machine learning (ML) capabilities of the Amazon Web Services ecosystem and provides practical examples to solve real-world regression and classification problems. While readers do not need prior ML experience, they are expected to have some knowledge of Python and a basic knowledge of Amazon Web Services. Part One introduces readers to fundamental machine learning concepts. You will learn about the types of ML systems, how they are used, and challenges you may face with ML solutions. Part Two focuses on machine learning services provided by Amazon Web Services. You’ll be introduced to the basics of cloud computing and AWS offerings in the cloud-based machine learning space. Then you’ll learn to use Amazon Machine Learning to solve a simpler class of machine learning problems, and Amazon SageMaker to solve more complex problems. • Learn techniques that allow you to preprocess data, basic feature engineering, visualizing data, and model building • Discover common neural network frameworks with Amazon SageMaker • Solve computer vision problems with Amazon Rekognition • Benefit from illustrations, source code examples, and sidebars in each chapter The book appeals to both Python developers and technical\/solution architects. Developers will find concrete examples that show them how to perform common ML tasks with Python on AWS. Technical\/solution architects will find useful information on the machine learning capabilities of the AWS ecosystem.","language":"en","currency":"USD","id":"1119556724","title":"Machine Learning in the AWS Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DCmpDwAAQBAJ&source=gbs_api","authors":["Abhishek Mishra"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=irZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Get up and running with the fundamentals and functionalities of seven of the most popular NoSQL databases","description":"A beginner's guide to get you up and running with Cassandra, DynamoDB, HBase, InfluxDB, MongoDB, Neo4j, and Redis Key Features Covers the basics of 7 NoSQL databases and how they are used in the enterprises Quick introduction to MongoDB, DynamoDB, Redis, Cassandra, Neo4j, InfluxDB, and HBase Includes effective techniques for database querying and management Book Description This is the golden age of open source NoSQL databases. With enterprises having to work with large amounts of unstructured data and moving away from expensive monolithic architecture, the adoption of NoSQL databases is rapidly increasing. Being familiar with the popular NoSQL databases and knowing how to use them is a must for budding DBAs and developers. This book introduces you to the different types of NoSQL databases and gets you started with seven of the most popular NoSQL databases used by enterprises today. We start off with a brief overview of what NoSQL databases are, followed by an explanation of why and when to use them. The book then covers the seven most popular databases in each of these categories: MongoDB, Amazon DynamoDB, Redis, HBase, Cassandra, InfluxDB, and Neo4j. The book doesn't go into too much detail about each database but teaches you enough to get started with them. By the end of this book, you will have a thorough understanding of the different NoSQL databases and their functionalities, empowering you to select and use the right database according to your needs. What you will learn Understand how MongoDB provides high-performance, high-availability, and automatic scaling Interact with your Neo4j instances via database queries, Python scripts, and Java application code Get familiar with common querying and programming methods to interact with Redis Study the different types of problems Cassandra can solve Work with HBase components to support common operations such as creating tables and reading\/writing data Discover data models and work with CRUD operations using DynamoDB Discover what makes InfluxDB a great choice for working with time-series data Who this book is for If you are a budding DBA or a developer who wants to get started with the fundamentals of NoSQL databases, this book is for you. Relational DBAs who want to get insights into the various offerings of popular NoSQL databases will also find this book to be very useful.","language":"en","currency":"USD","id":"1787127141","title":"Seven NoSQL Databases in a Week","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=irZTDwAAQBAJ&source=gbs_api","authors":["Xun (Brian) Wu","Sudarshan Kadambi","Devram Kandhare","Aaron Ploetz"]},{"pageCount":604,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Your one-stop solution to pass the AWS developer's certification","description":"An effective guide to becoming an AWS Certified Developer About This Book This fast-paced guide will help you clear the exam with confidence Learn to design, develop, and deploy cloud-based solutions using AWS Enhance your AWS skills with practice questions and mock tests Who This Book Is For This book is for IT professionals and developers looking to clear the AWS Certified Developer – Associate 2017 exam. Developers looking to develop and manage their applications on the AWS platform will also find this book useful. No prior AWS experience is needed. What You Will Learn Create and manage users, groups, and permissions using AWS Identity and Access Management services Create a secured Virtual Private Cloud (VPC) with Public and Private Subnets, Network Access Control, and Security groups Get started with Elastic Compute Cloud (EC2), launching your first EC2 instance, and working with it Handle application traffic with Elastic Load Balancing (ELB) and monitor AWS resources with CloudWatch Work with AWS storage services such as Simple Storage Service (S3), Glacier, and CloudFront Get acquainted with AWS DynamoDB – a NoSQL database service Coordinate work across distributed application components using Simple Workflow Service (SWF) In Detail AWS Certified Developer - Associate Guide starts with a quick introduction to AWS and the prerequisites to get you started. Then, this book gives you a fair understanding of core AWS services and basic architecture. Next, this book will describe about getting familiar with Identity and Access Management (IAM) along with Virtual private cloud (VPC). Moving ahead you will learn about Elastic Compute cloud (EC2) and handling application traffic with Elastic Load Balancing (ELB). Going ahead you we will talk about Monitoring with CloudWatch, Simple storage service (S3) and Glacier and CloudFront along with other AWS storage options. Next we will take you through AWS DynamoDB – A NoSQL Database Service, Amazon Simple Queue Service (SQS) and CloudFormation Overview. Finally, this book covers understanding Elastic Beanstalk and overview of AWS lambda. At the end of this book, we will cover enough topics, tips and tricks along with mock tests for you to be able to pass the AWS Certified Developer - Associate exam and develop as well as manage your applications on the AWS platform. Style and approach This step-by-step guide includes exercises and mock tests to clear the AWS certification exam and become a successful AWS developer.","language":"en","currency":"USD","id":"1787122956","title":"AWS Certified Developer - Associate Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-plGDwAAQBAJ&source=gbs_api","authors":["Vipul Tankariya","Bhavin Parmar"]},{"pageCount":992,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p8mqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Associate (DVA-C01) Exam","description":"Foreword by Werner Vogels, Vice President and Corporate Technology Officer, Amazon The AWS exam has been updated. Your study guide should be, too. The AWS Certified Developer Official Study Guide–Associate Exam is your ultimate preparation resource for the latest exam! Covering all exam objectives, this invaluable resource puts a team of AWS experts at your side with expert guidance, clear explanations, and the wisdom of experience with AWS best practices. You’ll master core services and basic architecture, and equip yourself to develop, deploy, and debug cloud-based applications using AWS. The AWS Developer certification is earned by those who demonstrate the technical knowledge and skill associated with best practices for building secure, reliable cloud-based applications using AWS technology. This book is your official exam prep companion, providing everything you need to know to pass with flying colors. Study the AWS Certified Developer Exam objectives Gain expert insight on core AWS services and best practices Test your understanding of key concepts with challenging chapter questions Access online study tools including electronic flashcards, a searchable glossary, practice exams, and more Cloud computing offers businesses the opportunity to replace up-front capital infrastructure expenses with low, variable costs that scale as they grow. This customized responsiveness has negated the need for far-future infrastructure planning, putting thousands of servers at their disposal as needed—and businesses have responded, propelling AWS to the number-one spot among cloud service providers. Now these businesses need qualified AWS developers, and the AWS certification validates the exact skills and knowledge they’re looking for. When you’re ready to get serious about your cloud credentials, the AWS Certified Developer Official Study Guide–Associate Exam is the resource you need to pass the exam with flying colors. NOTE: As of October 7, 2019, the accompanying code for hands-on exercises in the book is available for downloading from the secure Resources area in the online test bank. You'll find code for Chapters 1, 2, 11, and 12.","language":"en","currency":"USD","id":"1119508215","title":"AWS Certified Developer Official Study Guide, Associate Exam","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p8mqDwAAQBAJ&source=gbs_api","authors":["Nick Alteen","Jennifer Fisher","Casey Gerena","Wes Gruver","Asim Jalis","Heiwad Osman","Marife Pagan","Santosh Patlolla","Michael Roth"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6vxwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Create and share interactive dashboards using Redash","description":"Learn how to quickly generate business intelligence, insights and create interactive dashboards for digital storytelling through various data sources with Redash Key Features Learn the best use of visualizations to build powerful interactive dashboards Create and share visualizations and data in your organization Work with different complexities of data from different data sources Book Description Data exploration and visualization is vital to Business Intelligence, the backbone of almost every enterprise or organization. Redash is a querying and visualization tool developed to simplify how marketing and business development departments are exposed to data. If you want to learn to create interactive dashboards with Redash, explore different visualizations, and share the insights with your peers, then this is the ideal book for you. The book starts with essential Business Intelligence concepts that are at the heart of data visualizations. You will learn how to find your way round Redash and its rich array of data visualization options for building interactive dashboards. You will learn how to create data storytelling and share these with peers. You will see how to connect to different data sources to process complex data, and then visualize this data to reveal valuable insights. By the end of this book, you will be confident with the Redash dashboarding tool to provide insight and communicate data storytelling. What you will learn Install Redash and troubleshoot installation errors Manage user roles and permissions Fetch data from various data sources Visualize and present data with Redash Create active alerts based on your data Understand Redash administration and customization Export, share and recount stories with Redash visualizations Interact programmatically with Redash through the Redash API Who this book is for This book is intended for Data Analysts, BI professionals and Data Developers, but can be useful to anyone who has a basic knowledge of SQL and a creative mind. Familiarity with basic BI concepts will be helpful, but no knowledge of Redash is required.","language":"en","currency":"USD","id":"1788994213","title":"Redash v5 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6vxwDwAAQBAJ&source=gbs_api","authors":["Alexander Leibzon","Yael Leibzon"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Learn how to build and deploy serverless applications on AWS","description":"Discover techniques and tools for building serverless applications with AWS Lambda Key Features Learn to write, run, and deploy Lambda functions in the AWS cloud Make the most of AWS Lambda functions to build scalable and cost-efficient systems A practical guide to developing serverless services and applications in Node.js, Java, Python, and C# Book Description AWS Lambda is a part of AWS that lets you run your code without provisioning or managing servers. This enables you to deploy applications and backend services that operate with no upfront cost. This book gets you up to speed on how to build scalable systems and deploy serverless applications with AWS Lambda. The book starts with the fundamental concepts of AWS Lambda, and then teaches you how to combine your applications with other AWS services, such as AmazonAPI Gateway and DynamoDB. This book will also give a quick walk through on how to use the Serverless Framework to build larger applications that can structure code or autogenerate boilerplate code that can be used to get started quickly for increased productivity. Toward the end of the book, you will learn how to write, run, and test Lambda functions using Node.js, Java, Python, and C#. What you will learn Understand the fundamental concepts of AWS Lambda Get to grips with the Serverless Framework and how to create a serverless project Testing and debugging Lambda functions Create a stateful, serverless backend with DynamoDB Program AWS Lambda with Java, Python, and C# Program a lambda function with Node.js Who this book is for This book is primarily for IT architects and developers who want to build scalable systems and deploy serverless applications with AWS Lambda. No prior knowledge of AWS is necessary.","language":"en","currency":"USD","id":"1789340608","title":"AWS Lambda Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LMNiDwAAQBAJ&source=gbs_api","authors":["Markus Klems"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build highly effective analytics solutions to gain valuable insight into your big data","description":"Explore big data concepts, platforms, analytics, and their applications using the power of Hadoop 3 Key Features Learn Hadoop 3 to build effective big data analytics solutions on-premise and on cloud Integrate Hadoop with other big data tools such as R, Python, Apache Spark, and Apache Flink Exploit big data using Hadoop 3 with real-world examples Book Description Apache Hadoop is the most popular platform for big data processing, and can be combined with a host of other big data tools to build powerful analytics solutions. Big Data Analytics with Hadoop 3 shows you how to do just that, by providing insights into the software as well as its benefits with the help of practical examples. Once you have taken a tour of Hadoop 3’s latest features, you will get an overview of HDFS, MapReduce, and YARN, and how they enable faster, more efficient big data processing. You will then move on to learning how to integrate Hadoop with the open source tools, such as Python and R, to analyze and visualize data and perform statistical computing on big data. As you get acquainted with all this, you will explore how to use Hadoop 3 with Apache Spark and Apache Flink for real-time data analytics and stream processing. In addition to this, you will understand how to use Hadoop to build analytics solutions on the cloud and an end-to-end pipeline to perform big data analysis using practical use cases. By the end of this book, you will be well-versed with the analytical capabilities of the Hadoop ecosystem. You will be able to build powerful solutions to perform big data analytics and get insight effortlessly. What you will learn Explore the new features of Hadoop 3 along with HDFS, YARN, and MapReduce Get well-versed with the analytical capabilities of Hadoop ecosystem using practical examples Integrate Hadoop with R and Python for more efficient big data processing Learn to use Hadoop with Apache Spark and Apache Flink for real-time data analytics Set up a Hadoop cluster on AWS cloud Perform big data analytics on AWS using Elastic Map Reduce Who this book is for Big Data Analytics with Hadoop 3 is for you if you are looking to build high-performance analytics solutions for your enterprise or business using Hadoop 3’s powerful features, or you’re new to big data analytics. A basic understanding of the Java programming language is required.","language":"en","currency":"USD","id":"1788624955","title":"Big Data Analytics with Hadoop 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHxeDwAAQBAJ&source=gbs_api","authors":["Sridhar Alla"]},{"pageCount":349,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1_rEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"With Amazon SQS, SNS, SWF and Step Functions","description":"Build reliable, asynchronous, and distributed applications using message queuing and task orchestration capabilities of Amazon Web Services (AWS) Application Integration. This book prepares you to build distributed applications and administrators, and manage queues, workflows, and state machines. You'll start by reviewing key AWS prerequisite services such as EC2, Lambda, S3, DynamoDB, CloudWatch, and IAM. Simple Queue Service (SQS) and SNS Simple Notification Service (SNS) are then covered to show how applications interact with each other in a reliable and resilient fashion. Next, workflow building with (Simple Workflow Service (SWF) for orchestration of tasks is explained and in the final chapter learn the techniques for building a state using Step Functions, Simple Workflow Service along with Flow Framework. The book illustrates all the concepts using numerous examples that work with SDK, CLI, and Console. Most of the code examples are in Java, followed by Python and JavaScript. What You Will Learn Understand the important prerequisites of AWS, such as EC2, Lambda, S3, and DynamoDB Work with SQS, SNS, and SWS functions Review Step functions Who This Book Is For AWS developers and software developers proficient in Java, Python and JavaScript.","language":"en","currency":"USD","id":"1484254015","title":"The Definitive Guide to AWS Application Integration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1_rEDwAAQBAJ&source=gbs_api","authors":["Jyothi Prasad Buddha","Reshma Beesetty"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hoc6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44,"subtitle":"Building Apps with AWS","description":"A practical, real-world introduction to AWS tools and concepts Amazon Web Services for Mobile Developers: Building Apps with AWS presents a professional view of cloud computing and AWS for experienced iOS\/Android developers and technical\/solution architects. Cloud computing is a rapidly expanding ecosystem, and working professionals need a practical resource to bring them up-to-date on tools that are rapidly becoming indispensable; this book helps expand your skill set by introducing you to AWS offerings that can make your job easier, with a focus on real-world application. Author and mobile applications developer Abhishek Mishra shows you how to create IAM accounts and try out some of the most popular services, including EC2, Lambda, Mobile Analytics, Device Farm, and more. You'll build a chat application in both Swift (iOS) and Java (Andoid), running completely off AWS Infrastructure to explore SDK installation, Xcode, Cognito authentication, DynamoDB, Amazon SNA Notifications, and other useful tools. By actually using the tools as you learn about them, you develop a more intuitive understanding that feels less like a shift and more like a streamlined integration. If you have prior experience with Swift or Java and a solid knowledge of web services, this book can help you quickly take your skills to the next level with a practical approach to learning that translates easily into real-world use. Understand the key concepts of AWS as applied to both iOS and Android developers Explore major AWS offerings for mobile developers, including DynamoDB, RDS, EC2, SNS, Cognito, and more Learn what people are talking about when they use buzzwords like PaaS, IaaS, SaaS, and APaaS Work through explanations by building apps that tie into the AWS ecosystem Any job is easier with the right tools, and Amazon Web Services for Mobile Developers: Building Apps with AWS gets you acquainted with an ever-expanding toolkit for mobile app development.","language":"en","currency":"USD","id":"1119377862","title":"Amazon Web Services for Mobile Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hoc6DwAAQBAJ&source=gbs_api","authors":["Abhishek Mishra"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9V0MEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Specialty (DAS-C01) Exam","description":"Move your career forward with AWS certification! Prepare for the AWS Certified Data Analytics Specialty Exam with this thorough study guide This comprehensive study guide will help assess your technical skills and prepare for the updated AWS Certified Data Analytics exam. Earning this AWS certification will confirm your expertise in designing and implementing AWS services to derive value from data. The AWS Certified Data Analytics Study Guide: Specialty (DAS-C01) Exam is designed for business analysts and IT professionals who perform complex Big Data analyses. This AWS Specialty Exam guide gets you ready for certification testing with expert content, real-world knowledge, key exam concepts, and topic reviews. Gain confidence by studying the subject areas and working through the practice questions. Big data concepts covered in the guide include: Collection Storage Processing Analysis Visualization Data security AWS certifications allow professionals to demonstrate skills related to leading Amazon Web Services technology. The AWS Certified Data Analytics Specialty (DAS-C01) Exam specifically evaluates your ability to design and maintain Big Data, leverage tools to automate data analysis, and implement AWS Big Data services according to architectural best practices. An exam study guide can help you feel more prepared about taking an AWS certification test and advancing your professional career. In addition to the guide’s content, you’ll have access to an online learning environment and test bank that offers practice exams, a glossary, and electronic flashcards.","language":"en","currency":"USD","id":"1119649455","title":"AWS Certified Data Analytics Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9V0MEAAAQBAJ&source=gbs_api","authors":["Asif Abbasi"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=axOxBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a system or application developer interested in learning how to solve practical problems using the Hadoop framework, then this book is ideal for you. You are expected to be familiar with the Unix\/Linux command-line interface and have some experience with the Java programming language. Familiarity with Hadoop would be a plus.","language":"en","currency":"USD","id":"1783285524","title":"Learning Hadoop 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=axOxBgAAQBAJ&source=gbs_api","authors":["Garry Turkington","Gabriele Modena"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, test, and deploy scalable and reactive microservices with Rust 2018","description":"A comprehensive guide in developing and deploying high performance microservices with Rust Key Features Start your microservices journey and get a broader perspective on microservices development using RUST 2018, Build, deploy, and test microservices using AWS Explore advanced techniques for developing microservices such as actor model, Requests Routing, and threads Book Description Microservice architecture is sweeping the world as the de facto pattern for building web-based applications. Rust is a language particularly well-suited for building microservices. It is a new system programming language that offers a practical and safe alternative to C. This book describes web development using the Rust programming language and will get you up and running with modern web frameworks and crates with examples of RESTful microservices creation. You will deep dive into Reactive programming, and asynchronous programming, and split your web application into a set of concurrent actors. The book provides several HTTP-handling examples with manageable memory allocations. You will walk through stateless high-performance microservices, which are ideally suitable for computation or caching tasks, and look at stateful microservices, which are filled with persistent data and database interactions. As we move along, you will learn how to use Rust macros to describe business or protocol entities of our application and compile them into native structs, which will be performed at full speed with the help of the server's CPU. Finally, you will be taken through examples of how to test and debug microservices and pack them into a tiny monolithic binary or put them into a container and deploy them to modern cloud platforms such as AWS. What you will learn Get acquainted with leveraging Rust web programming Get to grips with various Rust crates, such as hyper, Tokio, and Actix Explore RESTful microservices with Rust Understand how to pack Rust code to a container using Docker Familiarize yourself with Reactive microservices Deploy your microservices to modern cloud platforms such as AWS Who this book is for This book is for developers who have basic knowledge of RUST, and want to learn how to build, test, scale, and manage RUST microservices. No prior experience of writing microservices in RUST is assumed.","language":"en","currency":"USD","id":"1789341981","title":"Hands-On Microservices with Rust","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cGSGDwAAQBAJ&source=gbs_api","authors":["Denis Kolodin"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Create custom conversational and voice interfaces for your Amazon Echo devices and web platforms","description":"Build artificial intelligence (AI) powered voice and text conversational interfaces with Amazon Key Features Develop Alexa Skills to create a working voice user interface (VUI) Integrate Amazon Lex chatbots into Facebook, Slack, and text messages Learn to use AWS Lambda, Alexa Skills Kit, and Amazon Lex Book Description Have you ever wondered how Alexa apps are made, how voice-enabled technologies work, or how chatbots function? And why tech giants such as Amazon and Google are investing in voice technologies? A better question is: why should I start developing on these platforms? Hands-On Chatbot Development with Alexa Skills and Amazon Lex covers all features of the Alexa Skills kit with real-world examples that help you develop skills to integrate Echo and chatbots into Facebook, Slack, and Twilio with the Amazon Lex platform. The book starts with teaching you how to set up your local environment and AWS CLI so that you can automate the process of uploading AWS Lambda from your local machine. You will then learn to develop Alexa Skills and Lex chatbots using Lambda functions to control functionality. Once you’ve come to grips with this, you will learn to create increasingly complex chatbots, integrate Amazon S3, and change the way Alexa talks to the user. In the concluding chapters, we shift our focus to Amazon Lex and messaging chatbots. We will explore Alexa, learn about DynamoDB databases, and add cards to user conversations. By the end of this book, you will have explored a full set of technologies that will enable you to create your own voice and messaging chatbots using Amazon. What you will learn Create a development environment using Alexa Skills Kit, AWS CLI, and Node.js Build Alexa Skills and Lex chatbots from scratch Gain access to third-party APIs from your Alexa Skills and Lex chatbots Use AWS services such as Amazon S3 and DynamoDB to enhance the abilities of your Alexa Skills and Amazon Lex chatbots Publish a Lex chatbot to Facebook Messenger, Twilio SMS, and Slack Create a custom website for your Lex chatbots Develop your own skills for Alexa-enabled devices such as the Echo Who this book is for Hands-On Chatbot Development with Alexa Skills and Amazon Lex is for developers who are interested in building conversational bots and Alexa skills with Amazon. Prior experience with JavaScript programming is required.","language":"en","currency":"USD","id":"1788992431","title":"Hands-On Chatbot Development with Alexa Skills and Amazon Lex","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EP1wDwAAQBAJ&source=gbs_api","authors":["Sam Williams"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XxNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"COVERS THE NEW 2018 EXAM SAA-C01! This effective study guide provides 100% coverage of every topic on the AWS Certified Solutions Architect Associate exam. Get complete coverage of all objectives included on the February 2018 SAA-C01 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: •Design Resilient Architectures •Define Performant Architectures •Specify Secure Applications and Architectures •Design Cost-Optimized Architectures •Define Operationally Excellent Architectures Digital content includes: •130 practice exam questions•Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260108260","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide (Exam SAA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XxNqDwAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a9fHPSBxaGcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Managing Your Cloud with Python and Boto","description":"If you intend to use Amazon Web Services (AWS) for remote computing and storage, Python is an ideal programming language for developing applications and controlling your cloud-based infrastructure. This cookbook gets you started with more than two dozen recipes for using Python with AWS, based on the author’s boto library. You’ll find detailed recipes for working with the S3 storage service as well as EC2, the service that lets you design and build cloud applications. Each recipe includes a code solution you can use immediately, along with a discussion of why and how the recipe works. You also get detailed advice for using boto with AWS and other cloud services. This book’s recipes include methods to help you: Launch instances on EC2, and keep track of them with tags Associate an Elastic IP address with an instance Restore a failed Elastic Block Store volume from a snapshot Store and monitor your own custom metrics in CloudWatch Create a bucket in S3 to contain your data objects Reduce the cost of storing noncritical data Prevent accidental deletion of data in S3","language":"en","currency":"USD","id":"1449320481","title":"Python and AWS Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a9fHPSBxaGcC&source=gbs_api","authors":["Mitch Garnaat"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cB9sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build real-world, production-ready applications with AWS Lambda","description":"Learn to build, secure, deploy, and manage your serverless application in Golang with AWS Lambda Key Features Implement AWS lambda to build scalable and cost-efficient applications in Go Design and set the data flow between cloud services and custom business logic Learn to design Lambda functions using real-world examples and implementation scenarios Book Description Serverless architecture is popular in the tech community due to AWS Lambda. Go is simple to learn, straightforward to work with, and easy to read for other developers; and now it's been heralded as a supported language for AWS Lambda. This book is your optimal guide to designing a Go serverless application and deploying it to Lambda. This book starts with a quick introduction to the world of serverless architecture and its benefits, and then delves into AWS Lambda using practical examples. You'll then learn how to design and build a production-ready application in Go using AWS serverless services with zero upfront infrastructure investment. The book will help you learn how to scale up serverless applications and handle distributed serverless systems in production. You will also learn how to log and test your application. Along the way, you'll also discover how to set up a CI\/CD pipeline to automate the deployment process of your Lambda functions. Moreover, you'll learn how to troubleshoot and monitor your apps in near real-time with services such as AWS CloudWatch and X-ray. This book will also teach you how to secure the access with AWS Cognito. By the end of this book, you will have mastered designing, building, and deploying a Go serverless application. What you will learn Understand how AWS Lambda works and use it to create an application Understand how to scaleup serverless applications Design a cost-effective serverless application in AWS Build a highly scalable and fault-tolerant CI\/CD pipeline Understand how to troubleshoot and monitor serverless apps in AWS Discover the working of APIs and single page applications Build a production-ready serverless application in Go Who this book is for This book is for Go developers who would like to learn about serverless architecture. Go programming knowledge is assumed. DevOps and Solution Architects who are interested in building serverless applications in Go can also choose this book.","language":"en","currency":"USD","id":"1789133831","title":"Hands-On Serverless Applications with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cB9sDwAAQBAJ&source=gbs_api","authors":["Mohamed Labouardy"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Develop microservice-based high performance web apps for the cloud with Go","description":"Discover practical techniques to build cloud-native apps that are scalable, reliable, and always available. Key Features Build well-designed and secure microservices. Enrich your microservices with continous integration and monitoring. Containerize your application with Docker Deploy your application to AWS. Learn how to utilize the powerful AWS services from within your application Book Description Awarded as one of the best books of all time by BookAuthority, Cloud Native Programming with Golang will take you on a journey into the world of microservices and cloud computing with the help of Go. Cloud computing and microservices are two very important concepts in modern software architecture. They represent key skills that ambitious software engineers need to acquire in order to design and build software applications capable of performing and scaling. Go is a modern cross-platform programming language that is very powerful yet simple; it is an excellent choice for microservices and cloud applications. Go is gaining more and more popularity, and becoming a very attractive skill. This book starts by covering the software architectural patterns of cloud applications, as well as practical concepts regarding how to scale, distribute, and deploy those applications. You will also learn how to build a JavaScript-based front-end for your application, using TypeScript and React. From there, we dive into commercial cloud offerings by covering AWS. Finally, we conclude our book by providing some overviews of other concepts and technologies that you can explore, to move from where the book leaves off. What you will learn Understand modern software applications architectures Build secure microservices that can effectively communicate with other services Get to know about event-driven architectures by diving into message queues such as Kafka, Rabbitmq, and AWS SQS. Understand key modern database technologies such as MongoDB, and Amazon’s DynamoDB Leverage the power of containers Explore Amazon cloud services fundamentals Know how to utilize the power of the Go language to access key services in the Amazon cloud such as S3, SQS, DynamoDB and more. Build front-end applications using ReactJS with Go Implement CD for modern applications Who this book is for This book is for developers who want to begin building secure, resilient, robust, and scalable Go applications that are cloud native. Some knowledge of the Go programming language should be sufficient.To build the front-end application, you will also need some knowledge of JavaScript programming.","language":"en","currency":"USD","id":"1787127966","title":"Cloud Native Programming with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvNFDwAAQBAJ&source=gbs_api","authors":["Mina Andrawos","Martin Helmich"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=88iia_wT_NgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Data is arriving faster than you can process it and the overall volumes keep growing at a rate that keeps you awake at night. Hadoop can help you tame the data beast. Effective use of Hadoop however requires a mixture of programming, design, and system administration skills. \"Hadoop Beginner's Guide\" removes the mystery from Hadoop, presenting Hadoop and related technologies with a focus on building working systems and getting the job done, using cloud services to do so when it makes sense. From basic concepts and initial setup through developing applications and keeping the system running as the data grows, the book gives the understanding needed to effectively use Hadoop to solve real world problems. Starting with the basics of installing and configuring Hadoop, the book explains how to develop applications, maintain the system, and how to use additional products to integrate with other systems. While learning different ways to develop applications to run on Hadoop the book also covers tools such as Hive, Sqoop, and Flume that show how Hadoop can be integrated with relational databases and log collection. In addition to examples on Hadoop clusters on Ubuntu uses of cloud services such as Amazon, EC2 and Elastic MapReduce are covered.","language":"en","currency":"USD","id":"1849517304","title":"Hadoop Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=88iia_wT_NgC&source=gbs_api","authors":["Garry Turkington"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3igKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This effective self-study system delivers complete coverage of every topic on the AWS Certified Developer Associate Exam Take the challenging AWS Certified Developer Associate Exam with confidence using the comprehensive information contained in this effective test preparation guide. Written by an Amazon Web Services certified expert and experienced trainer, AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01) covers every subject on the exam and clearly explains how to create, deploy, migrate, monitor, and debug cloud-native applications. Designed to help you pass the exam with ease, this guide also serves as an ideal on-the-job reference. Covers all topics on the exam, including: Getting started with AWS Journey AWS high availability and fault tolerance Working with cloud storage Authentication and authorization Creating SQL and NoSQL databases in AWS Cloud AWS application integration and management Developing cloud-native applications in AWS Building, deploying, and debugging cloud applications Electronic content includes: 130 practice questions Test engine containing full-length practice exams and customizable quizzes","language":"en","currency":"USD","id":"1260460185","title":"AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3igKEAAAQBAJ&source=gbs_api","authors":["Kamesh Ganesan"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j86PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A complete guide to building, testing, and deploying microservices using serverless computing on AWS","description":"A practical guide for developing end-to-end serverless microservices in Python for developers, DevOps, and architects. Key Features Create a secure, cost-effective, and scalable serverless data API Use identity management and authentication for a user-specific and secure web application Go beyond traditional web hosting to explore the full range of cloud hosting options Book Description Over the last few years, there has been a massive shift from monolithic architecture to microservices, thanks to their small and independent deployments that allow increased flexibility and agile delivery. Traditionally, virtual machines and containers were the principal mediums for deploying microservices, but they involved a lot of operational effort, configuration, and maintenance. More recently, serverless computing has gained popularity due to its built-in autoscaling abilities, reduced operational costs, and increased productivity. Building Serverless Microservices in Python begins by introducing you to serverless microservice structures. You will then learn how to create your first serverless data API and test your microservice. Moving on, you'll delve into data management and work with serverless patterns. Finally, the book introduces you to the importance of securing microservices. By the end of the book, you will have gained the skills you need to combine microservices with serverless computing, making their deployment much easier thanks to the cloud provider managing the servers and capacity planning. What you will learn Discover what microservices offer above and beyond other architectures Create a serverless application with AWS Gain secure access to data and resources Run tests on your configuration and code Create a highly available serverless microservice data API Build, deploy, and run your serverless configuration and code Who this book is for If you are a developer with basic knowledge of Python and want to learn how to build, test, deploy, and secure microservices, then this book is for you. No prior knowledge of building microservices is required.","language":"en","currency":"USD","id":"1789533422","title":"Building Serverless Microservices in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j86PDwAAQBAJ&source=gbs_api","authors":["Richard Takashi Freeman"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AmSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Practical solutions to building serverless applications using Java and AWS","description":"Build, secure, and deploy real-world serverless applications in AWS and peek into the serverless cloud offerings from Azure, Google Cloud, and IBM Cloud Key Features Build serverless applications with AWS Lambda, AWS CloudFormation and AWS CloudWatch Perform data analytics and natural language processing(NLP)on the AWS serverless platform Explore various design patterns and best practices involved in serverless computing Book Description Managing physical servers will be a thing of the past once you’re able to harness the power of serverless computing. If you’re already prepped with the basics of serverless computing, Serverless Programming Cookbook will help you take the next step ahead. This recipe-based guide provides solutions to problems you might face while building serverless applications. You'll begin by setting up Amazon Web Services (AWS), the primary cloud provider used for most recipes. The next set of recipes will cover various components to build a Serverless application including REST APIs, database, user management, authentication, web hosting, domain registration, DNS management, CDN, messaging, notifications and monitoring. The book also introduces you to the latest technology trends such as Data Streams, Machine Learning and NLP. You will also see patterns and practices for using various services in a real world application. Finally, to broaden your understanding of Serverless computing, you'll also cover getting started guides for other cloud providers such as Azure, Google Cloud Platform and IBM cloud. By the end of this book, you’ll have acquired the skills you need to build serverless applications efficiently using various cloud offerings. What you will learn Serverless computing in AWS and explore services with other clouds Develop full-stack apps with API Gateway, Cognito, Lambda and DynamoDB Web hosting with S3, CloudFront, Route 53 and AWS Certificate Manager SQS and SNS for effective communication between microservices Monitoring and troubleshooting with CloudWatch logs and metrics Explore Kinesis Streams, Amazon ML models and Alexa Skills Kit Who this book is for For developers looking for practical solutions to common problems while building a serverless application, this book provides helpful recipes. To get started with this intermediate-level book, knowledge of basic programming is a must.","language":"en","currency":"USD","id":"1788621530","title":"Serverless Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AmSGDwAAQBAJ&source=gbs_api","authors":["Heartin Kanikathottu"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BCEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This up-to-date study guide offers 100% coverage of every objective for the current version of the AWS Certified Solutions Architect Professional exam Get complete coverage of all objectives included on the SAA-C02 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect – Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. You’ll also build your practical knowledge with the many hands-on labs found throughout this guide. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: Design Resilient Architectures Design High-Performing Architectures Design Secure Applications and Architectures Design Cost-Optimized Architectures Online content includes: 130 practice exam questions Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260470199","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide, Second Edition (Exam SAA-C02)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BCEOEAAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n8FffirFaQIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Data Warehouse and Query Language for Hadoop","description":"Need to move a relational database application to Hadoop? This comprehensive guide introduces you to Apache Hive, Hadoop’s data warehouse infrastructure. You’ll quickly learn how to use Hive’s SQL dialect—HiveQL—to summarize, query, and analyze large datasets stored in Hadoop’s distributed filesystem. This example-driven guide shows you how to set up and configure Hive in your environment, provides a detailed overview of Hadoop and MapReduce, and demonstrates how Hive works within the Hadoop ecosystem. You’ll also find real-world case studies that describe how companies have used Hive to solve unique problems involving petabytes of data. Use Hive to create, alter, and drop databases, tables, views, functions, and indexes Customize data formats and storage options, from files to external databases Load and extract data from tables—and use queries, grouping, filtering, joining, and other conventional query methods Gain best practices for creating user defined functions (UDFs) Learn Hive patterns you should use and anti-patterns you should avoid Integrate Hive with other data processing programs Use storage handlers for NoSQL databases and other datastores Learn the pros and cons of running Hive on Amazon’s Elastic MapReduce","language":"en","currency":"USD","id":"1449326978","title":"Programming Hive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n8FffirFaQIC&source=gbs_api","authors":["Edward Capriolo","Dean Wampler","Jason Rutherglen"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jimnez","Graham Lee","Corey Wade"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ZlUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Develop a scalable, reliable, and highly available cloud environment with AWS","description":"This fast-paced guide will quickly enhance your skills to develop a highly scalable Cloud environment Key Features Efficiently build a highly scalable and reliable cloud environment for your applications with AWS Leverage the various AWS components and services to build a secure, reliable, and robust environment to host your applications on This quick-start guide will quickly enhance your skills to develop highly scalable services Book Description AWS is at the forefront of Cloud Computing today. Businesses are adopting AWS Cloud because of its reliability, versatility, and flexible design. The main focus of this book is teaching you how to build and manage highly reliable and scalable applications and services on AWS. It will provide you with all the necessary skills to design, deploy, and manage your applications and services on the AWS cloud platform. We’ll start by exploring Amazon S3, EC2, and so on to get you well-versed with core Amazon services. Moving on, we’ll teach you how to design and deploy highly scalable and optimized workloads. You’ll also discover easy-to-follow, hands-on steps, tips, and recommendations throughout the book and get to know essential security and troubleshooting concepts. By the end of the book, you’ll be able to create a highly secure, fault tolerant, and scalable environment for your applications to run on. What you will learn Find out about IAM to access AWS services securely Explore EC2 (virtual server) and scale up\/down your application based on heavy traffic Learn about unlimited data storage service S3 and host a static website within minutes Get to grips with Relational Databases and NoSQL databases under the AWS ecosystem Understand the caching mechanism Get to know about notifications service and monitor AWS services Secure and troubleshoot your AWS architecture Who this book is for This book is for IT professionals and system administrators looking to design, deploy, and manage your applications and services on the AWS cloud platform. It’s also ideal for developers looking to build highly scalable cloud-based services. A basic understanding of AWS would be beneficial.","language":"en","currency":"USD","id":"1788291816","title":"Amazon Web Services Bootcamp","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ZlUDwAAQBAJ&source=gbs_api","authors":["Sunil Gulabani"]},{"pageCount":54,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2_JMcrKVqSgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.A short and precise guide to get you started with EaselJS, helping you to create some cool applications and games. EaselJS greatly simplifies application development in HTML5 Canvas using a syntax and an architecture very similar to the ActionScript 3.0 language. As a result, Flash \/ Flex developers will immediately feel at home but it's very easy to learn even if you've never opened Flash in your life. The book targets Web designers, animators, Digital content producers, and Flash and Flex developers. It's assumed that you will have some experience in HTML and pure JavaScript.","language":"en","currency":"USD","id":"1782165193","title":"Instant Easeljs Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2_JMcrKVqSgC&source=gbs_api","authors":["Fabio Biondi"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dYqbBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is intended for expert programmers and architects who want to learn how to migrate the existing infrastructure to AWS Cloud and start using AWS services in all application tiers. Basic knowledge of Java and competence in cloud computing will be needed to follow the examples in this book.","language":"en","currency":"USD","id":"1782173625","title":"AWS Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dYqbBQAAQBAJ&source=gbs_api","authors":["Prabhakaran Kuppusamy","Uchit Vyas"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dYqbBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is intended for expert programmers and architects who want to learn how to migrate the existing infrastructure to AWS Cloud and start using AWS services in all application tiers. Basic knowledge of Java and competence in cloud computing will be needed to follow the examples in this book.","language":"en","currency":"USD","id":"1782173625","title":"AWS Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dYqbBQAAQBAJ&source=gbs_api","authors":["Prabhakaran Kuppusamy","Uchit Vyas"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fOgtAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book contains an extensive set of practical examples and an easy-to-follow approach to creating 3D objects.This book is great for anyone who already knows JavaScript and who wants to start creating 3D graphics that run in any browser. You don’t need to know anything about advanced math or WebGL; all that is needed is a general knowledge of JavaScript and HTML. The required materials and examples can be freely downloaded and all tools used in this book are open source.","language":"en","currency":"USD","id":"1782166335","title":"Mastering Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fOgtAgAAQBAJ&source=gbs_api","authors":["Sandro Pasquali"]},{"pageCount":505,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fQJ2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Real-World Scalable Web Apps","description":"Learn how to build a wide range of scalable real-world web applications using a professional development toolkit. If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages.With this book, you'll work with a varied collection of standards and frameworks and see how all those pieces fit together. Practical Node.js takes you from installing all the necessary modules to writing full-stack web applications. You'll harness the power of the Express.js and Hapi frameworks, the MongoDB database with Mongoskin and Mongoose. You'll also work with Pug and Handlebars template engines, Stylus and LESS CSS lanaguages, OAuth and Everyauth libraries, and the Socket.IO and Derby libraries, and everything in between. This exciting second edition is fully updated for ES6\/ES2015 and also covers how to deploy to Heroku and AWS, daemonize apps, and write REST APIs. You’ll build full-stack real-world Node.js apps from scratch, and also discover how to write your own Node.js modules and publish them on NPM. Fully supported by a continuously updated source code repository on GitHub and with full-color code examples, learn what you can do with Node.js and how far you can take it! What You'll Learn Manipulate data from the mongo console Use the Mongoskin and Mongoose MongoDB libraries Build REST API servers with Express and Hapi Deploy apps to Heroku and AWS Test services with Mocha, Expect and TravisCI Implement a third-party OAuth strategy with Everyauth Web developers who have some familiarity with the basics of Node.js and want to learn how to use it to build apps in a professional environment.","language":"en","currency":"USD","id":"1484230396","title":"Practical Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fQJ2DwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":812,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PnGbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Your one-stop solution to passing the AWS developer's 2019 (DVA-C01) certification, 2nd Edition","description":"Learn from the AWS subject-matter experts, explore real-world scenarios, and pass the AWS Certified Developer – Associate exam Key Features This fast-paced guide will help you clear the AWS Certified Developer – Associate (DVA-C01) exam with confidence Gain valuable insights to design, develop, and deploy cloud-based solutions using AWS Develop expert core AWS skills with practice questions and mock tests Book Description This book will focus on the revised version of AWS Certified Developer Associate exam. The 2019 version of this exam guide includes all the recent services and offerings from Amazon that benefits developers. AWS Certified Developer - Associate Guide starts with a quick introduction to AWS and the prerequisites to get you started. Then, this book will describe about getting familiar with Identity and Access Management (IAM) along with Virtual private cloud (VPC). Next, this book will teach you about microservices, serverless architecture, security best practices, advanced deployment methods and more. Going ahead we will take you through AWS DynamoDB A NoSQL Database Service, Amazon Simple Queue Service (SQS) and CloudFormation Overview. Lastly, this book will help understand Elastic Beanstalk and will also walk you through AWS lambda. At the end of this book, we will cover enough topics, tips and tricks along with mock tests for you to be able to pass the AWS Certified Developer - Associate exam and develop as well as manage your applications on the AWS platform. What you will learn Create and manage users, groups, and permissions using AWS IAM services Create a secured VPC with Public and Private Subnets, NAC, and Security groups Launching your first EC2 instance, and working with it Handle application traffic with ELB and monitor AWS resources with CloudWatch Work with AWS storage services such as S3, Glacier, and CloudFront Get acquainted with AWS DynamoDB a NoSQL database service Use SWS to coordinate work across distributed application components Who this book is for This book is for IT professionals and developers looking to clear the AWS Certified Developer Associate 2019 exam. Developers looking to develop and manage their applications on the AWS platform will also find this book useful. No prior AWS experience is needed.","language":"en","currency":"USD","id":"178961371X","title":"AWS Certified Developer – Associate Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PnGbDwAAQBAJ&source=gbs_api","authors":["Vipul Tankariya","Bhavin Parmar"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LkFKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.95,"subtitle":"How the Application-Centric Mindset is Hobbling our Enterprises","description":"Know what’s causing application development waste so you can turn the tide. This is the book your Systems Integrator and your Application Software vendor don’t want you to read. Enterprise IT (Information Technology) is a $3.8 trillion per year industry worldwide. Most of it is waste. We've grown used to projects costing tens of millions or even billions of dollars, and routinely running over budget and schedule many times over. These overages in both time and money are almost all wasted resources. However, the waste is hard to see, after being so marbled through all the products, processes, and guiding principles. That is what this book is about. We must see, understand, and agree about the problem before we can take coordinated action to address it. The trajectory of this book is as follows: In Chapter 1, we explore how bad the current state is. The three industries that address software waste are discussed, including the legacy software industry, neo-legacy software industry, and legacy modernization industry. Examples of application waste are illustrated from both public and private sectors. In Chapter 2, we explore the economics of the software industry. Although the economic tradeoffs are changing at the speed of Moore’s Law, our approaches are not keeping pace. Learn how information systems really behave in terms of actual application development. In Chapter 3 we use “root cause analysis” to reveal the real contributors to this situation, which are dependency, redundancy, complexity, and application centricity. Chapter 4 recounts the many failed attempts we’ve made in the past to deal with information system complexity, including relational databases, ERP systems, enterprise data modeling, service oriented architectures, and APIs, Agile, data warehouse and business intelligence, outsourcing and offshoring, cloud, Software as a Service (SaaS), data lakes, machine learning, and artificial intelligence. Chapter 5 dismantles seven fallacies that contribute to our remaining stuck. For example, the first fallacy is “We need detailed requirements or we won’t get what we want.” The quagmire is not affecting all sectors of the economy equally. Chapter 6 looks at how this is playing out in the government and private sectors, large and small companies, and various parts of the IT industry itself. Chapter 7 outlines some action you can take now to begin to extricate yourself, including a detailed assessment and defining metrics for measuring and preventing software development waste.","language":"en","currency":"USD","id":"1634623185","title":"Software Wasteland","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LkFKDwAAQBAJ&source=gbs_api","authors":["Dave McComb"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2brVAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The go-to guidebook for deploying Big Data solutions withHadoop Today's enterprise architects need to understand how the Hadoopframeworks and APIs fit together, and how they can be integrated todeliver real-world solutions. This book is a practical, detailedguide to building and implementing those solutions, with code-levelinstruction in the popular Wrox tradition. It covers storing datawith HDFS and Hbase, processing data with MapReduce, and automatingdata processing with Oozie. Hadoop security, running Hadoop withAmazon Web Services, best practices, and automating Hadoopprocesses in real time are also covered in depth. With in-depth code examples in Java and XML and the latest onrecent additions to the Hadoop ecosystem, this complete resourcealso covers the use of APIs, exposing their inner workings andallowing architects and developers to better leverage and customizethem. The ultimate guide for developers, designers, and architectswho need to build and deploy Hadoop applications Covers storing and processing data with various technologies,automating data processing, Hadoop security, and deliveringreal-time solutions Includes detailed, real-world examples and code-levelguidelines Explains when, why, and how to use these tools effectively Written by a team of Hadoop experts in theprogrammer-to-programmer Wrox style Professional Hadoop Solutions is the reference enterprisearchitects and developers need to maximize the power of Hadoop.","language":"en","currency":"USD","id":"1118824180","title":"Professional Hadoop Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2brVAAAAQBAJ&source=gbs_api","authors":["Boris Lublinsky","Kevin T. Smith","Alexey Yakubovich"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eXWBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Discover how you can migrate from traditional deployments to serverless architectures with AWS","description":"Don't waste your energy thinking about servers; use AWS to build enterprise-grade serverless applications. Key Features Learn how to quickly and easily go serverless Explore AWS and Lambda: the first building blocks of serverless applications on AWS Study different approaches to deploy and maintain serverless applications Book Description Serverless Architecture with AWS begins with an introduction to the serverless model and helps you get started with AWS and Lambda. You'll also get to grips with other capabilities of the AWS Serverless Platform and see how AWS supports enterprise-grade serverless applications with and without Lambda. This book will guide you in deploying your first serverless project and exploring the capabilities of serverless Amazon Athena, an interactive query service that makes it easy to analyze data in Amazon Simple Storage Service (S3 Amazon) using standard SQL. You’ll also learn about AWS Glue, a fully managed ETL service that makes categorizing data easy and cost-effective. You'll study how Amazon Kinesis makes it possible to unleash the potential of real-time data insights and analytics with capabilities such as video streams, data streams, data firehose, and data analytics. Last but not least, you’ll be equipped to combine Amazon Kinesis capabilities with AWS Lambda to create lightweight serverless architectures. By the end of the book, you will be ready to create and run your first serverless application that takes advantage of the high availability, security, performance, and scalability of AWS. What you will learn Explore AWS services for supporting a serverless environment Set up AWS services to make applications scalable and highly available Deploy a static website with a serverless architecture Build your first serverless web application Study the changes in a deployed serverless web application Apply best practices to ensure overall security, availability, and reliability Who this book is for This book is for you if you want to develop serverless applications and have some prior coding experience. Though no prior experience of AWS is needed, basic knowledge of Java or Node.js will be an added advantage.","language":"en","currency":"USD","id":"1789802237","title":"Serverless Architectures with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eXWBDwAAQBAJ&source=gbs_api","authors":["Mohit Gupta"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p78uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Everything you need to get running with IaaS for Amazon Web Services Modern businesses rely on Infrastructure-as-a-Service (IaaS)—a setup in which someone else foots the bill to create application environments—and developers are expected to know how to write both platform-specific and IaaS-supported applications. If you're a developer who writes desktop and web applications but have little-to-no experience with cloud development, this book is an essential tool in getting started in the IaaS environment with Amazon Web Services. In Amazon Web Services For Developers For Dummies, you'll quickly and easily get up to speed on which language or platform will work best to meet a specific need, how to work with management consoles, ways you'll interact with services at the command line, how to create applications with the AWS API, and so much more. Assess development options to produce the kind of result that's actually needed Use the simplest approach to accomplish any given task Automate tasks using something as simple as the batch processing features offered by most platforms Create example applications using JavaScript, Python, and R Discover how to use the XML files that appear in the management console to fine tune your configuration Making sense of Amazon Web Services doesn't have to be as difficult as it seems—and this book shows you how.","language":"en","currency":"USD","id":"1119371864","title":"AWS for Developers For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p78uDwAAQBAJ&source=gbs_api","authors":["John Paul Mueller"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wBQEp6ruIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"From Journeyman to Master","description":"What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” —Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” —Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” —Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” —John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” —Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” —Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” —Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” —Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” —Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.","language":"en","currency":"USD","id":"013211917X","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wBQEp6ruIAC&source=gbs_api","authors":["Andrew Hunt","David Thomas"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zyOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":"A hands-on guide to creating clean web applications with code examples in Java","description":"Gain insight into how hexagonal architecture can help to keep the cost of development low over the complete lifetime of an application Key Features Explore ways to make your software flexible, extensible, and adaptable Learn new concepts that you can easily blend with your own software development style Develop the mindset of building maintainable solutions instead of taking shortcuts Book Description We would all like to build software architecture that yields adaptable and flexible software with low development costs. But, unreasonable deadlines and shortcuts make it very hard to create such an architecture. Get Your Hands Dirty on Clean Architecture starts with a discussion about the conventional layered architecture style and its disadvantages. It also talks about the advantages of the domain-centric architecture styles of Robert C. Martin's Clean Architecture and Alistair Cockburn's Hexagonal Architecture. Then, the book dives into hands-on chapters that show you how to manifest a hexagonal architecture in actual code. You'll learn in detail about different mapping strategies between the layers of a hexagonal architecture and see how to assemble the architecture elements into an application. The later chapters demonstrate how to enforce architecture boundaries. You'll also learn what shortcuts produce what types of technical debt and how, sometimes, it is a good idea to willingly take on those debts. After reading this book, you'll have all the knowledge you need to create applications using the hexagonal architecture style of web development. What you will learn Identify potential shortcomings of using a layered architecture Apply methods to enforce architecture boundaries Find out how potential shortcuts can affect the software architecture Produce arguments for when to use which style of architecture Structure your code according to the architecture Apply various types of tests that will cover each element of the architecture Who this book is for This book is for you if you care about the architecture of the software you are building. To get the most out of this book, you must have some experience with web development. The code examples in this book are in Java. If you are not a Java programmer but can read object-oriented code in other languages, you will be fine. In the few places where Java or framework specifics are needed, they are thoroughly explained.","language":"en","currency":"USD","id":"1839212713","title":"Get Your Hands Dirty on Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zyOzDwAAQBAJ&source=gbs_api","authors":["Tom Hombergs"]},{"pageCount":88,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qZg-yyo7k_0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Simple Cloud Scaling for Java Developers","description":"While it's always been possible to run Java applications on Amazon EC2, Amazon's Elastic Beanstalk makes the process easier—especially if you understand how it works beneath the surface. This concise, hands-on book not only walks you through Beanstalk for deploying and managing web applications in the cloud, you'll also learn how to use this AWS tool in other phases of development. Ideal if you're a developer familiar with Java applications or AWS, Elastic Beanstalk provides step-by-step instructions and numerous code samples for building cloud applications on Beanstalk that can handle lots of traffic. Learn how to use Beanstalk with the Eclipse IDE, Hudson for continuous integration, and several AWS tools for load balancing, auto scaling, storage, and other services. Learn how Beanstalk provides an entry into Infrastructure as a Service (IaaS) Design your Java web application for the cloud—and for Beanstalk Get an overview of AWS services that power Beanstalk, and learn how to use them independently Use Beanstalk to set up your development, testing, production, and staging environments Learn advanced hacking techniques for customizing Beanstalk","language":"en","currency":"USD","id":"1449315437","title":"Elastic Beanstalk","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qZg-yyo7k_0C&source=gbs_api","authors":["Jurg van Vliet","Flavia Paganelli","Steven van Wel","Dara Dowd"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":190,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6D64DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.01,"subtitle":null,"description":"Looking for the big picture of building APIs? This book is for you! Building APIs that consumers love should certainly be the goal of any API initiative. However, it is easier said than done. It requires getting the architecture for your APIs right. This book equips you with both foundations and best practices for API architecture. This book is for you if you want to understand the big picture of API design and development, you want to define an API architecture, establish a platform for APIs or simply want to build APIs your consumers love. This book is NOT for you, if you are looking for a step-by step guide for building APIs, focusing on every detail of the correct application of REST principles. In this case I recommend the book \"API Design\" of the API-University Series. What is API architecture? Architecture spans the bigger picture of APIs and can be seen from several perspectives: API architecture may refer to the architecture of the complete solution consisting not only of the API itself, but also of an API client such as a mobile app and several other components. API solution architecture explains the components and their relations within the software solution. API architecture may refer to the technical architecture of the API platform. When building, running and exposing not only one, but several APIs, it becomes clear that certain building blocks of the API, runtime functionality and management functionality for the API need to be used over and over again. An API platform provides an infrastructure for developing, running and managing APIs. API architecture may refer to the architecture of the API portfolio. The API portfolio contains all APIs of the enterprise and needs to be managed like a product. API portfolio architecture analyzes the functionality of the API and organizes, manages and reuses the APIs. API architecture may refer to the design decisions for a particular API proxy. To document the design decisions, API description languages are used. We explain the use of API description languages (RAML and Swagger) on many examples. This book covers all of the above perspectives on API architecture. However, to become useful, the architecture needs to be put into practice. This is why this book covers an API methodology for design and development. An API methodology provides practical guidelines for putting API architecture into practice. It explains how to develop an API architecture into an API that consumers love. A lot of the information on APIs is available on the web. Most of it is published by vendors of API products. I am always a bit suspicious of technical information pushed by product vendors. This book is different. In this book, a product-independent view on API architecture is presented. The API-University Series is a modular series of books on API-related topics. Each book focuses on a particular API topic, so you can select the topics within APIs, which are relevant for you.","language":"en","currency":"USD","id":"150867664X","title":"API Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6D64DwAAQBAJ&source=gbs_api","authors":["Matthias Biehl"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ULZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Efficiently develop, deploy, and manage your enterprise apps on the Amazon Web Services platform","description":"Key concepts, sample applications, best practices, and troubleshooting tips to build highly scalable applications in AWS. Key Features Design highly available, cost efficient, fault tolerant, and scalable distributed systems A practical guide that will help you build, deploy, and manage applications with ease. Develop effective solutions with AWS SDK and Lambda Book Description Continuous deployment and Agile methodology have enabled huge advances in modern applications. This book will enable the reader to make use of this rapidly evolving technology to build highly scalable applications within AWS using different architectures. You will begin with installation of AWS SDK and you will get hands-on experience on creating an application using AWS Management Console and AWS Command Line Interface (CLI). Next you will be integrating Applications with AWS services such as DynamoDB, Amazon Kinesis, AWS Lambda, Amazon SQS and Amazon SWF Following this you will get well versed with CI\/CD workflow and work with four major phases in Release processes – Source, Build, Test and Production. Next you will learn to apply AWS developer tools in your Continuous Integration (CI) and Continuous Deployment (CD) WorkFlow. Later you will learn about User Authentication using Amazon Cognito and also how you can evaluate the best architecture as per your infrastructure costs. You will learn about Amazon EC2 service and deploy an app using Amazon EC2.You will also get well versed with container service which is Amazon EC2 Container Service (Amazon ECS) and you will learn to deploy an app using Amazon ECS. Along with EC2 and ECS, you will also deploying a practical real-world example of a CI\/CD application with the Serverless Application Framework which is known as AWS Lambda. Finally you will learn how to build, develop and deploy the Application using AWS Developer tools like AWS CodeCommit, AWS CodeBuild, AWS CodeDeploy and AWS CodePipeline as per project needs. Also you can develop and deploy applications within minutes using AWS CodeStar from wizard. By the end of this book, the reader will effectively build, deploy, and manage applications on AWS along with scaling and securing applications with best practices and troubleshooting tips. What you will learn Learn how to get up and running with AWS Developer Tools. Integrate the four major phases in the Release Processes. Source, Build, Test and Production. Learn how to integrate Continuous Integration, Continuous Delivery, and Continuous Deployment in AWS. Make secure, scalable and fault tolerant applications. Understand different architectures and deploy complex architectures within minutes Who this book is for This book targets developers who would like to build and manage web and mobile applications and services on the AWS platform. If you are an architect you will be able to take a deep dive and use examples that can be readily applied to real world scenarios. Some prior programming experience is assumed along with familiarity of cloud computing.","language":"en","currency":"USD","id":"1788474597","title":"Expert AWS Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ULZTDwAAQBAJ&source=gbs_api","authors":["Atul Mistry"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QBVMDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Easily get your head in the Cloud with Amazon Web Services With Amazon Web Services (AWS), you can do everything from backing up your personal hard drive to creating a full-fledged IT department in the Cloud. And while major corporations like Adobe and Netflix have turned to AWS for their Cloud computing needs, it isn't just for private companies. Amazon Web Services For Dummies is the singular resource that shows real people with real businesses how to use on-demand IT resources to help their companies grow. If you're like most people just getting their feet wet with this service, your first question is likely to be, \"How do I get started with AWS?\" This book answers that question—and a multitude more—in language you can understand and shows you how to put this Cloud computing service to work for you right away. AWS is immense and, naturally, intimidating, but with the help of this book, you'll peel back its many layers in no time! Provides overviews that explain what tasks the services perform and how they relate to each other Offers specific paths to follow in order to obtain a particular installation result Gets you started without making a huge investment Reduces the risk of failure by ensuring you understand available options as part of the configuration and usage process Stop wasting time and resources on hardware and software that's quickly outdated. Get started with AWS today!","language":"en","currency":"USD","id":"1119312493","title":"AWS For Admins For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QBVMDQAAQBAJ&source=gbs_api","authors":["John Paul Mueller"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vWLjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Plan, develop, and deploy your cloud infrastructure effectively using AWS CloudFormation","description":"Build scalable and production-ready infrastructure in Amazon Web Services with CloudFormation Key Features Leverage AWS CloudFormation templates to manage your entire infrastructure Get up and running with writing your infrastructure as code and automating your environment Simplify infrastructure management and increase productivity with AWS CloudFormation Book Description DevOps and the cloud revolution have forced software engineers and operations teams to rethink how to manage infrastructures. With this AWS book, you'll understand how you can use Infrastructure as Code (IaC) to simplify IT operations and manage the modern cloud infrastructure effectively with AWS CloudFormation. This comprehensive guide will help you explore AWS CloudFormation from template structures through to developing complex and reusable infrastructure stacks. You'll then delve into validating templates, deploying stacks, and handling deployment failures. The book will also show you how to leverage AWS CodeBuild and CodePipeline to automate resource delivery and apply continuous integration and continuous delivery (CI\/CD) practices to the stack. As you advance, you'll learn how to generate templates on the fly using macros and create resources outside AWS with custom resources. Finally, you'll improve the way you manage the modern cloud in AWS by extending CloudFormation using AWS serverless application model (SAM) and AWS cloud development kit (CDK). By the end of this book, you'll have mastered all the major AWS CloudFormation concepts and be able to simplify infrastructure management. What you will learn Understand modern approaches to IaC Develop universal and reusable CloudFormation templates Discover ways to apply continuous delivery with CloudFormation Implement IaC best practices for the AWS Cloud Provision massive applications across multiple regions and accounts Automate template generation and software provisioning for AWS Extend CloudFormation with custom resources and template macros Who this book is for If you are a developer who wants to learn how to write templates, a DevOps engineer interested in deployment and orchestration, or a solutions architect looking to understand the benefits of managing infrastructure with ease, this book is for you. Prior understanding of the AWS Cloud is necessary.","language":"en","currency":"USD","id":"1789135311","title":"Mastering AWS CloudFormation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vWLjDwAAQBAJ&source=gbs_api","authors":["Karen Tovmasyan"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YeH2k26PjtAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Engineering at Cloud Scale","description":"Cloud services are just as susceptible to network outages as any other platform. This concise book shows you how to prepare for potentially devastating interruptions by building your own resilient and reliable applications in the public cloud. Guided by engineers from 9apps—an independent provider of Amazon Web Services and Eucalyptus cloud solutions—you’ll learn how to combine AWS with open source tools such as PostgreSQL, MongoDB, and Redis. This isn’t a book on theory. With detailed examples, sample scripts, and solid advice, software engineers with operations experience will learn specific techniques that 9apps routinely uses in its cloud infrastructures. Build cloud applications with the \"rip, mix, and burn\" approach Get a crash course on Amazon Web Services Learn the top ten tips for surviving outages in the cloud Use elasticsearch to build a dependable NoSQL data store Combine AWS and PostgreSQL to build an RDBMS that scales well Create a highly available document database with MongoDB Replica Set and SimpleDB Augment Redis with AWS to provide backup\/restore, failover, and monitoring capabilities Work with CloudFront and Route 53 to safeguard global content delivery","language":"en","currency":"USD","id":"1449339255","title":"Resilience and Reliability on AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YeH2k26PjtAC&source=gbs_api","authors":["Jurg van Vliet","Flavia Paganelli","Jasper Geurtsen"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LPbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"How the World's Best Companies Ship Software and Work Differently","description":"Today's tech unicorns develop software differently. They've developed a way of working that lets them scale like an enterprise while working like a startup. These techniques can be learned. This book takes you behind the scenes and shows you how companies like Google, Facebook, and Spotify do it. Leverage their insights, so your teams can work better together, ship higher-quality product faster, innovate more quickly, and compete with the unicorns. Massively successful tech companies, or Unicorns, have discovered how to take the techniques that made them successful as a startup and scale them to the enterprise level. Amazon, Facebook, Google, and Spotify all work like startups, despite having workforces numbering in the tens of thousands. Ex-Spotify engineer and coach, Jonathan Rasmusson, takes you behind the scenes and shows you how to develop software the way the best companies do it. Learn how to give teams purpose through Missions, empower and trust with Squads, and align large scale efforts through Bets. Create the culture necessary to make it happen. If you're a tech or product lead and you want to ship product better, this is your playbook on how the world's best do it. If you're an engineer, tester, analyst, or project manager, and you suspect there are better ways you could be working, you are correct. This book will show you how. And if you're a manager, Agile coach, or someone just charged with improving how your company ships software, this book will give you the tools, techniques, and practices of the world's most innovative, delivery-focused companies. Don't just admire the top companies - learn from them.","language":"en","currency":"USD","id":"1680507672","title":"Competing with Unicorns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LPbkDwAAQBAJ&source=gbs_api","authors":["Jonathan Rasmusson"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qIZvBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.89,"subtitle":"  AWS   !","description":"      !     !    ,                .      !      EC2, S3, EBS, Elastic IP         .    AMI, CloudWatch, CloudFront, Route 53, RDS, DynamoDB, VPC, CloudFormation    .  ,    !            .            ,   .  : https:\/\/github.com\/gilbutitbook\/006736","language":"ko","currency":"USD","id":"8966188672","title":"    ","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qIZvBQAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-vRBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":53.56,"subtitle":"Staying Safe in a Digital World","description":"Computer users have a significant impact on the security of their computer and personal information as a result of the actions they perform (or do not perform). Helping the average user of computers, or more broadly information technology, make sound security decisions, Computer Security Literacy: Staying Safe in a Digital World focuses on practica","language":"en","currency":"USD","id":"1439856192","title":"Computer Security Literacy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-vRBQAAQBAJ&source=gbs_api","authors":["Douglas Jacobson","Joseph Idziorek"]},{"pageCount":294,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DYC3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.01,"subtitle":null,"description":"Looking for Best Practices for RESTful APIs? This book is for you! Why? Because this book is packed with practical experience on what works best for RESTful API Design. You want to design APIs like a Pro? Use API description languages to both design APIs and develop APIs efficiently. The book introduces the two most common API description languages RAML, OpenAPI, and Swagger. Your company cares about its customers? Learn API product management with a customer-centric design and development approach for APIs. Learn how to manage APIs as a product and how to follow an API-first approach. Build APIs your customers love! You want to manage the complete API lifecycle? An API development methodology is proposed to guide you through the lifecycle: API inception, API design, API development, API publication, API evolution, and maintenance. You want to build APIs right? This book shows best practices for REST design, such as the correct use of resources, URIs, representations, content types, data formats, parameters, HTTP status codes, and HTTP methods. Your APIs connect to legacy systems? The book shows best practices for connecting APIs to existing backend systems. Your APIs connect to a mesh of microservices? The book shows the principles for designing APIs for scalable, autonomous microservices. You expect lots of traffic on your API? The book shows you how to achieve high performance, availability and maintainability. You want to build APIs that last for decades? We study API versioning, API evolution, backward- and forward-compatibility and show API design patterns for versioning. The API-University Series is a modular series of books on API-related topics. Each book focuses on a particular API topic, so you can select the topics within APIs, which are relevant for you.","language":"en","currency":"USD","id":"1514735164","title":"RESTful API Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DYC3DwAAQBAJ&source=gbs_api","authors":["Matthias Biehl"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUhiQxUXVpMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Random Access to Your Planet-Size Data","description":"If you're looking for a scalable storage solution to accommodate a virtually endless amount of data, this book shows you how Apache HBase can fulfill your needs. As the open source implementation of Google's BigTable architecture, HBase scales to billions of rows and millions of columns, while ensuring that write and read performance remain constant. Many IT executives are asking pointed questions about HBase. This book provides meaningful answers, whether you’re evaluating this non-relational database or planning to put it into practice right away. Discover how tight integration with Hadoop makes scalability with HBase easier Distribute large datasets across an inexpensive cluster of commodity servers Access HBase with native Java clients, or with gateway servers providing REST, Avro, or Thrift APIs Get details on HBase’s architecture, including the storage format, write-ahead log, background processes, and more Integrate HBase with Hadoop's MapReduce framework for massively parallelized data processing jobs Learn how to tune clusters, design schemas, copy tables, import bulk data, decommission nodes, and many other tasks","language":"en","currency":"USD","id":"1449315224","title":"HBase: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUhiQxUXVpMC&source=gbs_api","authors":["Lars George"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ux_QAOxg_rUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Become a Rock Star DBA","description":"DBA Survivor is a book to help new database administrators understand more about the world of database administration. More and more people are moving into the DBA profession, and many are looking for a getting-started guide. Blogs are written about how to be an exceptional DBA and what to do in your first 100 days. This book takes a different approach, injecting some humor into helping you understand how to hit the ground running, and most importantly how to survive as a DBA. And it’s not just survival that matters. Author Thomas LaRock wants much more for you than mere survival. He wants you to have excellence, competence, visibility, confidence, and service. These are the traits and characteristics of DBAs who truly succeed and become respected in their profession. Don’t settle for just muddling through your job each day. Strive to excel. Aim to make a difference, for your clients, and for your colleagues. Focuses on the soft skills that distinguish truly exceptional DBAs Takes a humorous approach to keep readers engaged Written by a SQL Server \"Most Valuable Professional\" and board member of PASS","language":"en","currency":"USD","id":"1430227885","title":"DBA Survivor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ux_QAOxg_rUC&source=gbs_api","authors":["Thomas LaRock"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hiLHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A beginner's guide to using AWS Lambda, Amazon API Gateway, and services from Amazon Web Services","description":"Build, deploy, test, and run cloud-native serverless applications using AWS Lambda and other popular AWS services Key Features Learn how to write, run, and deploy serverless applications in Amazon Web Services Make the most of AWS Lambda functions to build scalable and cost-efficient systems Build and deploy serverless applications with Amazon API Gateway and AWS Lambda functions Book Description Serverless computing is a way to run your code without having to provision or manage servers. Amazon Web Services provides serverless services that you can use to build and deploy cloud-native applications. Starting with the basics of AWS Lambda, this book takes you through combining Lambda with other services from AWS, such as Amazon API Gateway, Amazon DynamoDB, and Amazon Step Functions. You’ll learn how to write, run, and test Lambda functions using examples in Node.js, Java, Python, and C# before you move on to developing and deploying serverless APIs efficiently using the Serverless Framework. In the concluding chapters, you’ll discover tips and best practices for leveraging Serverless Framework to increase your development productivity. By the end of this book, you’ll have become well-versed in building, securing, and running serverless applications using Amazon API Gateway and AWS Lambda without having to manage any servers. What you will learn Understand the core concepts of serverless computing in AWS Create your own AWS Lambda functions and build serverless APIs using Amazon API Gateway Explore best practices for developing serverless applications at scale using Serverless Framework Discover the DevOps patterns in a modern CI\/CD pipeline with AWS CodePipeline Build serverless data processing jobs to extract, transform, and load data Enforce resource tagging policies with continuous compliance and AWS Config Create chatbots with natural language understanding to perform automated tasks Who this book is for This AWS book is for cloud architects and developers who want to build and deploy serverless applications using AWS Lambda. A basic understanding of AWS is required to get the most out of this book.","language":"en","currency":"USD","id":"1789959950","title":"Learn AWS Serverless Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hiLHDwAAQBAJ&source=gbs_api","authors":["Scott Patterson"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xqSLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Associate SAA-C01 Exam","description":"Everything you need to know for the Solutions Architect - Associate Exam, fully updated The AWS Certified Solutions Architect Study Guide: Associate (SAA-C01) Exam is your complete and fully updated resource to the AWS Solutions Architect - Associate certification. This invaluable Sybex study guide covers all relevant aspects of the AWS Solutions Architect job role, including mapping multi-tier architectures to AWS services, loose coupling and stateless systems, applying AWS security features, deploying and managing services, designing large scale distributed systems, and many more. Written by two AWS subject-matter experts, this self-study guide and reference provides all the tools and information necessary to master the exam, earn your certification, and gain insights into the job of an AWS Solutions Architect. Efficient and logical presentation of exam objectives allows for flexible study of topics, and powerful learning tools increase comprehension and retention of key exam elements. Practice questions, chapter reviews, and detailed examination of essential concepts fully prepare you for the AWS Solutions Architect – Associate certification. The certification is highly valued in IT and cloud computing professionals. Now in a new edition—reflecting the latest changes, additions, and updates to the AWS Solutions Architect – Associate certification exam guide—this book is your complete, one-stop resource: Access the Sybex interactive learning environment and test bank, including chapter tests, practice exams, electronic flashcards, and a searchable glossary of key terms. Learn all the components of the AWS exam and know what to expect on exam day Review challenging exam topics and focus on the areas that need improvement Expand your AWS skillset and keep pace with current cloud computing technologies The AWS Certified Solutions Architect Study Guide: Associate (SAA-C01) Exam enables you to validate your skills, increase your competitive advantage, and take the next step on your career path. Comprehensive and up-to-date content and superior study tools make this guide a must-have resource for those seeking AWS Solutions Architect – Associate certification.","language":"en","currency":"USD","id":"1119504198","title":"AWS Certified Solutions Architect Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xqSLDwAAQBAJ&source=gbs_api","authors":["Ben Piper","David Clinton"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OySOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Triples Storage and SPARQL Query Processing","description":"RDF Database Systems is a cutting-edge guide that distills everything you need to know to effectively use or design an RDF database. This book starts with the basics of linked open data and covers the most recent research, practice, and technologies to help you leverage semantic technology. With an approach that combines technical detail with theoretical background, this book shows how to design and develop semantic web applications, data models, indexing and query processing solutions. Understand the Semantic Web, RDF, RDFS, SPARQL, and OWL within the context of relational database management and NoSQL systems Learn about the prevailing RDF triples solutions for both relational and non-relational databases, including column family, document, graph, and NoSQL Implement systems using RDF data with helpful guidelines and various storage solutions for RDF Process SPARQL queries with detailed explanations of query optimization, query plans, caching, and more Evaluate which approaches and systems to use when developing Semantic Web applications with a helpful description of commercial and open-source systems","language":"en","currency":"USD","id":"0128004703","title":"RDF Database Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OySOAwAAQBAJ&source=gbs_api","authors":["Olivier Cur","Guillaume Blin"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OmeEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.99,"subtitle":"Building Artificial Intelligence We Can Trust","description":"Two leaders in the field offer a compelling analysis of the current state of the art and reveal the steps we must take to achieve a truly robust artificial intelligence. Despite the hype surrounding AI, creating an intelligence that rivals or exceeds human levels is far more complicated than we have been led to believe. Professors Gary Marcus and Ernest Davis have spent their careers at the forefront of AI research and have witnessed some of the greatest milestones in the field, but they argue that a computer beating a human in Jeopardy! does not signal that we are on the doorstep of fully autonomous cars or superintelligent machines. The achievements in the field thus far have occurred in closed systems with fixed sets of rules, and these approaches are too narrow to achieve genuine intelligence. The real world, in contrast, is wildly complex and open-ended. How can we bridge this gap? What will the consequences be when we do? Taking inspiration from the human mind, Marcus and Davis explain what we need to advance AI to the next level, and suggest that if we are wise along the way, we won't need to worry about a future of machine overlords. If we focus on endowing machines with common sense and deep understanding, rather than simply focusing on statistical analysis and gatherine ever larger collections of data, we will be able to create an AI we can trust—in our homes, our cars, and our doctors' offices. Rebooting AI provides a lucid, clear-eyed assessment of the current science and offers an inspiring vision of how a new generation of AI can make our lives better.","language":"en","currency":"USD","id":"1524748269","title":"Rebooting AI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OmeEDwAAQBAJ&source=gbs_api","authors":["Gary Marcus","Ernest Davis"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t-laBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a web application developer interested in using AngularJS for a real-life project, then this book is for you. As a prerequisite, knowledge of JavaScript and HTML is expected, and a working knowledge of AngularJS is preferred.","language":"en","currency":"USD","id":"1783285621","title":"AngularJS Web Application Development Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t-laBAAAQBAJ&source=gbs_api","authors":["Vinci Rufus"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sEgOCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"This book is a practical guide to developing, administering, and managing applications and infrastructures with AWS. With this, you'll be able to create, design, and manage an entire application life cycle on AWS by using the AWS SDKs, APIs, and the AWS Management Console. You'll start with the basics of the AWS development platform and look into creating stable and scalable infrastructures using EC2, EBS, and Elastic Load Balancers. You'll then deep-dive into designing and developing your own web app and learn about the alarm mechanism, disaster recovery plan, and connecting AWS services through REST-based APIs. Following this, you'll get to grips with CloudFormation, auto scaling, bootstrap AWS EC2 instances, automation and deployment with Chef, and develop your knowledge of big data and Apache Hadoop on AWS Cloud. At the end, you'll have learned about AWS billing, cost-control architecture designs, AWS Security features and troubleshooting methods, and developed AWS-centric applications based on an underlying AWS infrastructure.","language":"en","currency":"USD","id":"1782173641","title":"Mastering AWS Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sEgOCgAAQBAJ&source=gbs_api","authors":["Uchit Vyas"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build cost-effective and highly scalable Serverless applications using AWS Lambda. About This Book Leverage AWS Lambda to significantly lower your infrastructure costs and deploy out massively scalable, event-driven systems and applications Learn how to design and build Lambda functions using real-world examples and implementation scenarios Explore the Serverless ecosystem with a variety of toolsets and AWS services including DynamoDB, API Gateway, and much more! Who This Book Is For If you are a Cloud administrator and\/or developer who wishes to explore, learn, and leverage AWS Lambda to design, build, and deploy Serverless applications in the cloud, then this is the book for you! The book assumes you have some prior knowledge and hands-on experience with AWS core services such as EC2, IAM, S3, along with the knowledge to work with any popular programming language such as Node.Js, Java, C#, and so on. What You Will Learn Understand the hype, significance, and business benefits of Serverless computing and applications Plunge into the Serverless world of AWS Lambda and master its core components and how it works Find out how to effectively and efficiently design, develop, and test Lambda functions using Node.js, along with some keen coding insights and best practices Explore best practices to effectively monitor and troubleshoot Serverless applications using AWS CloudWatch and other third-party services in the form of Datadog and Loggly Quickly design and develop Serverless applications by leveraging AWS Lambda, DynamoDB, and API Gateway using the Serverless Application Framework (SAF) and other AWS services such as Step Functions Explore a rich variety of real-world Serverless use cases with Lambda and see how you can apply it to your environments In Detail AWS is recognized as one of the biggest market leaders for cloud computing and why not? It has evolved a lot since the time it started out by providing just basic services such as EC2 and S3 and today; they go all the way from IoT to Machine Learning, Image recognition, Chatbot Frameworks, and much more! One of those recent services that is also gaining a lot of traction is AWS Lambda! Although seemingly simple and easy to use, Lambda is a highly effective and scalable compute service that provides developers with a powerful platform to design and develop Serverless event-driven systems and applications. The book begins with a high-level introduction into the world of Serverless computing and its advantages and use cases, followed by a deep dive into AWS Lambda! You'll learn what services AWS Lambda provides to developers; how to design, write, and test Lambda functions; as well as monitor and troubleshoot them. The book is designed and accompanied with a vast variety of real-world examples, use cases, and code samples that will enable you to get started on your Serverless applications quickly. By the end of the book, you will have gained all the skills required to work with AWS Lambda services! Style and approach This step-by-step guide will help you build Serverless applications and run Serverless workloads using the AWS Lambda service. You'll be able to get started with it in a matter of minutes with easy-to-follow code snippets and examples.","language":"en","currency":"USD","id":"178646683X","title":"Mastering AWS Lambda","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LpZGDwAAQBAJ&source=gbs_api","authors":["Yohan Wadia","Udita Gupta"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t-laBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a web application developer interested in using AngularJS for a real-life project, then this book is for you. As a prerequisite, knowledge of JavaScript and HTML is expected, and a working knowledge of AngularJS is preferred.","language":"en","currency":"USD","id":"1783285621","title":"AngularJS Web Application Development Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t-laBAAAQBAJ&source=gbs_api","authors":["Vinci Rufus"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mn9cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Use Hadoop to solve business problems by learning from a rich set of real-life case studies About This Book Solve real-world business problems using Hadoop and other Big Data technologies Build efficient data lakes in Hadoop, and develop systems for various business cases like improving marketing campaigns, fraud detection, and more Power packed with six case studies to get you going with Hadoop for Business Intelligence Who This Book Is For If you are interested in building efficient business solutions using Hadoop, this is the book for you This book assumes that you have basic knowledge of Hadoop, Java, and any scripting language. What You Will Learn Learn about the evolution of Hadoop as the big data platform Understand the basics of Hadoop architecture Build a 360 degree view of your customer using Sqoop and Hive Build and run classification models on Hadoop using BigML Use Spark and Hadoop to build a fraud detection system Develop a churn detection system using Java and MapReduce Build an IoT-based data collection and visualization system Get to grips with building a Hadoop-based Data Lake for large enterprises Learn about the coexistence of NoSQL and In-Memory databases in the Hadoop ecosystem In Detail If you have a basic understanding of Hadoop and want to put your knowledge to use to build fantastic Big Data solutions for business, then this book is for you. Build six real-life, end-to-end solutions using the tools in the Hadoop ecosystem, and take your knowledge of Hadoop to the next level. Start off by understanding various business problems which can be solved using Hadoop. You will also get acquainted with the common architectural patterns which are used to build Hadoop-based solutions. Build a 360-degree view of the customer by working with different types of data, and build an efficient fraud detection system for a financial institution. You will also develop a system in Hadoop to improve the effectiveness of marketing campaigns. Build a churn detection system for a telecom company, develop an Internet of Things (IoT) system to monitor the environment in a factory, and build a data lake – all making use of the concepts and techniques mentioned in this book. The book covers other technologies and frameworks like Apache Spark, Hive, Sqoop, and more, and how they can be used in conjunction with Hadoop. You will be able to try out the solutions explained in the book and use the knowledge gained to extend them further in your own problem space. Style and approach This is an example-driven book where each chapter covers a single business problem and describes its solution by explaining the structure of a dataset and tools required to process it. Every project is demonstrated with a step-by-step approach, and explained in a very easy-to-understand manner.","language":"en","currency":"USD","id":"1783980311","title":"Hadoop Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mn9cDgAAQBAJ&source=gbs_api","authors":["Anurag Shrivastava","Tanmay Deshpande"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AwpnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Your stepping stone to penetration testing","description":"Learn how to hack systems like black hat hackers and secure them like security experts Key Features Understand how computer systems work and their vulnerabilities Exploit weaknesses and hack into machines to test their security Learn how to secure systems from hackers Book Description This book starts with the basics of ethical hacking, how to practice hacking safely and legally, and how to install and interact with Kali Linux and the Linux terminal. You will explore network hacking, where you will see how to test the security of wired and wireless networks. You’ll also learn how to crack the password for any Wi-Fi network (whether it uses WEP, WPA, or WPA2) and spy on the connected devices. Moving on, you will discover how to gain access to remote computer systems using client-side and server-side attacks. You will also get the hang of post-exploitation techniques, including remotely controlling and interacting with the systems that you compromised. Towards the end of the book, you will be able to pick up web application hacking techniques. You'll see how to discover, exploit, and prevent a number of website vulnerabilities, such as XSS and SQL injections. The attacks covered are practical techniques that work against real systems and are purely for educational purposes. At the end of each section, you will learn how to detect, prevent, and secure systems from these attacks. What you will learn Understand ethical hacking and the different fields and types of hackers Set up a penetration testing lab to practice safe and legal hacking Explore Linux basics, commands, and how to interact with the terminal Access password-protected networks and spy on connected clients Use server and client-side attacks to hack and control remote computers Control a hacked system remotely and use it to hack other systems Discover, exploit, and prevent a number of web application vulnerabilities such as XSS and SQL injections Who this book is for Learning Ethical Hacking from Scratch is for anyone interested in learning how to hack and test the security of systems like professional hackers and security experts.","language":"en","currency":"USD","id":"1788624785","title":"Learn Ethical Hacking from Scratch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AwpnDwAAQBAJ&source=gbs_api","authors":["Zaid Sabih"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w7LjCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Over 90 hands-on recipes to help you learn and master the intricacies of Apache Hadoop 2.X, YARN, Hive, Pig, Oozie, Flume, Sqoop, Apache Spark, and Mahout About This Book Implement outstanding Machine Learning use cases on your own analytics models and processes. Solutions to common problems when working with the Hadoop ecosystem. Step-by-step implementation of end-to-end big data use cases. Who This Book Is For Readers who have a basic knowledge of big data systems and want to advance their knowledge with hands-on recipes. What You Will Learn Installing and maintaining Hadoop 2.X cluster and its ecosystem. Write advanced Map Reduce programs and understand design patterns. Advanced Data Analysis using the Hive, Pig, and Map Reduce programs. Import and export data from various sources using Sqoop and Flume. Data storage in various file formats such as Text, Sequential, Parquet, ORC, and RC Files. Machine learning principles with libraries such as Mahout Batch and Stream data processing using Apache Spark In Detail Big data is the current requirement. Most organizations produce huge amount of data every day. With the arrival of Hadoop-like tools, it has become easier for everyone to solve big data problems with great efficiency and at minimal cost. Grasping Machine Learning techniques will help you greatly in building predictive models and using this data to make the right decisions for your organization. Hadoop Real World Solutions Cookbook gives readers insights into learning and mastering big data via recipes. The book not only clarifies most big data tools in the market but also provides best practices for using them. The book provides recipes that are based on the latest versions of Apache Hadoop 2.X, YARN, Hive, Pig, Sqoop, Flume, Apache Spark, Mahout and many more such ecosystem tools. This real-world-solution cookbook is packed with handy recipes you can apply to your own everyday issues. Each chapter provides in-depth recipes that can be referenced easily. This book provides detailed practices on the latest technologies such as YARN and Apache Spark. Readers will be able to consider themselves as big data experts on completion of this book. This guide is an invaluable tutorial if you are planning to implement a big data warehouse for your business. Style and approach An easy-to-follow guide that walks you through world of big data. Each tool in the Hadoop ecosystem is explained in detail and the recipes are placed in such a manner that readers can implement them sequentially. Plenty of reference links are provided for advanced reading.","language":"en","currency":"USD","id":"1784398004","title":"Hadoop Real-World Solutions Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w7LjCwAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sEgOCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"This book is a practical guide to developing, administering, and managing applications and infrastructures with AWS. With this, you'll be able to create, design, and manage an entire application life cycle on AWS by using the AWS SDKs, APIs, and the AWS Management Console. You'll start with the basics of the AWS development platform and look into creating stable and scalable infrastructures using EC2, EBS, and Elastic Load Balancers. You'll then deep-dive into designing and developing your own web app and learn about the alarm mechanism, disaster recovery plan, and connecting AWS services through REST-based APIs. Following this, you'll get to grips with CloudFormation, auto scaling, bootstrap AWS EC2 instances, automation and deployment with Chef, and develop your knowledge of big data and Apache Hadoop on AWS Cloud. At the end, you'll have learned about AWS billing, cost-control architecture designs, AWS Security features and troubleshooting methods, and developed AWS-centric applications based on an underlying AWS infrastructure.","language":"en","currency":"USD","id":"1782173641","title":"Mastering AWS Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sEgOCgAAQBAJ&source=gbs_api","authors":["Uchit Vyas"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vaNMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Specialty Exam","description":"The official study guide for the AWS certification specialty exam The AWS Certified Advanced Networking Official Study Guide – Specialty Exam helps to ensure your preparation for the AWS Certified Advanced Networking – Specialty Exam. Expert review of AWS fundamentals align with the exam objectives, and detailed explanations of key exam topics merge with real-world scenarios to help you build the robust knowledge base you need to succeed on the exam—and in the field as an AWS Certified Networking specialist. Coverage includes the design, implementation, and deployment of cloud-based solutions; core AWS services implementation and knowledge of architectural best practices; AWS service architecture design and maintenance; networking automation; and more. You also get one year of free access to Sybex’s online interactive learning environment and study tools, which features flashcards, a glossary, chapter tests, practice exams, and a test bank to help you track your progress and gauge your readiness as exam day grows near. The AWS credential validates your skills surrounding AWS and hybrid IT network architectures at scale. The exam assumes existing competency with advanced networking tasks, and assesses your ability to apply deep technical knowledge to the design and implementation of AWS services. This book provides comprehensive review and extensive opportunities for practice, so you can polish your skills and approach exam day with confidence. Study key exam essentials with expert insight Understand how AWS skills translate to real-world solutions Test your knowledge with challenging review questions Access online study tools, chapter tests, practice exams, and more Technical expertise in cloud computing, using AWS, is in high demand, and the AWS certification shows employers that you have the knowledge and skills needed to deliver practical, forward-looking cloud-based solutions. The AWS Certified Advanced Networking Official Study Guide – Specialty Exam helps you learn what you need to take this next big step for your career.","language":"en","currency":"USD","id":"1119439884","title":"AWS Certified Advanced Networking Official Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vaNMDwAAQBAJ&source=gbs_api","authors":["Sidhartha Chauhan","James Devine","Alan Halachmi","Matt Lehwess","Nick Matthews","Steve Morad","Steve Seymour"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k9zIDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.59,"subtitle":null,"description":"Domain-Driven Design (DDD) software modeling delivers powerful results in practice, not just in theory, which is why developers worldwide are rapidly moving to adopt it. Now, for the first time, there’s an accessible guide to the basics of DDD: What it is, what problems it solves, how it works, and how to quickly gain value from it. Concise, readable, and actionable, Domain-Driven Design Distilled never buries you in detail–it focuses on what you need to know to get results. Vaughn Vernon, author of the best-selling Implementing Domain-Driven Design, draws on his twenty years of experience applying DDD principles to real-world situations. He is uniquely well-qualified to demystify its complexities, illuminate its subtleties, and help you solve the problems you might encounter. Vernon guides you through each core DDD technique for building better software. You’ll learn how to segregate domain models using the powerful Bounded Contexts pattern, to develop a Ubiquitous Language within an explicitly bounded context, and to help domain experts and developers work together to create that language. Vernon shows how to use Subdomains to handle legacy systems and to integrate multiple Bounded Contexts to define both team relationships and technical mechanisms. Domain-Driven Design Distilled brings DDD to life. Whether you’re a developer, architect, analyst, consultant, or customer, Vernon helps you truly understand it so you can benefit from its remarkable power. Coverage includes What DDD can do for you and your organization–and why it’s so important The cornerstones of strategic design with DDD: Bounded Contexts and Ubiquitous Language Strategic design with Subdomains Context Mapping: helping teams work together and integrate software more strategically Tactical design with Aggregates and Domain Events Using project acceleration and management tools to establish and maintain team cadence","language":"en","currency":"USD","id":"0134434994","title":"Domain-Driven Design Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k9zIDAAAQBAJ&source=gbs_api","authors":["Vaughn Vernon"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f-ANEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"Get ready for C++20 with all you need to know for complete mastery! Your comprehensive and updated guide to one of the world’s most popular programming languages is here! Whether you’re a novice or expert, you’ll find what you need to get going with the latest features of C++20. The workhorse of programming languages, C++ gives you the utmost control of data usage and interface and resource allocation. If your job involves data, proficiency in C++ means you’re indispensable! This edition gives you 8 books in 1 for total C++ mastery. Inside, internationally renowned expert John Paul Mueller takes you from the fundamentals of working with objects and classes to writing applications that use paradigms not normally associated with C++, such as those used for functional programming strategies. The book also includes online resources such as source code. You discover how to use a C++ GNU compiler to build applications and even how to use your mobile device for coding. Conquer advanced programming and troubleshooting Streamline your code with lambda expressions Use C++ where you need it: for gaming, enterprise applications, and Web services Uncover object secrets including the use of design patterns Discover how to use functional programming techniques to make code concise and easy to read If you want to be your organization’s C++ guru, C++ All-In-One for Dummies is where it’s at!","language":"en","currency":"USD","id":"1119601754","title":"C++ All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f-ANEAAAQBAJ&source=gbs_api","authors":["John Paul Mueller"]},{"pageCount":979,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LWzWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unlock the power of your data with Hadoop 2.X ecosystem and its data warehousing techniques across large data sets About This Book Conquer the mountain of data using Hadoop 2.X tools The authors succeed in creating a context for Hadoop and its ecosystem Hands-on examples and recipes giving the bigger picture and helping you to master Hadoop 2.X data processing platforms Overcome the challenging data processing problems using this exhaustive course with Hadoop 2.X Who This Book Is For This course is for Java developers, who know scripting, wanting a career shift to Hadoop - Big Data segment of the IT industry. So if you are a novice in Hadoop or an expert, this book will make you reach the most advanced level in Hadoop 2.X. What You Will Learn Best practices for setup and configuration of Hadoop clusters, tailoring the system to the problem at hand Integration with relational databases, using Hive for SQL queries and Sqoop for data transfer Installing and maintaining Hadoop 2.X cluster and its ecosystem Advanced Data Analysis using the Hive, Pig, and Map Reduce programs Machine learning principles with libraries such as Mahout and Batch and Stream data processing using Apache Spark Understand the changes involved in the process in the move from Hadoop 1.0 to Hadoop 2.0 Dive into YARN and Storm and use YARN to integrate Storm with Hadoop Deploy Hadoop on Amazon Elastic MapReduce and Discover HDFS replacements and learn about HDFS Federation In Detail As Marc Andreessen has said “Data is eating the world,” which can be witnessed today being the age of Big Data, businesses are producing data in huge volumes every day and this rise in tide of data need to be organized and analyzed in a more secured way. With proper and effective use of Hadoop, you can build new-improved models, and based on that you will be able to make the right decisions. The first module, Hadoop beginners Guide will walk you through on understanding Hadoop with very detailed instructions and how to go about using it. Commands are explained using sections called “What just happened” for more clarity and understanding. The second module, Hadoop Real World Solutions Cookbook, 2nd edition, is an essential tutorial to effectively implement a big data warehouse in your business, where you get detailed practices on the latest technologies such as YARN and Spark. Big data has become a key basis of competition and the new waves of productivity growth. Hence, once you get familiar with the basics and implement the end-to-end big data use cases, you will start exploring the third module, Mastering Hadoop. So, now the question is if you need to broaden your Hadoop skill set to the next level after you nail the basics and the advance concepts, then this course is indispensable. When you finish this course, you will be able to tackle the real-world scenarios and become a big data expert using the tools and the knowledge based on the various step-by-step tutorials and recipes. Style and approach This course has covered everything right from the basic concepts of Hadoop till you master the advance mechanisms to become a big data expert. The goal here is to help you learn the basic essentials using the step-by-step tutorials and from there moving toward the recipes with various real-world solutions for you. It covers all the important aspects of Hadoop from system designing and configuring Hadoop, machine learning principles with various libraries with chapters illustrated with code fragments and schematic diagrams. This is a compendious course to explore Hadoop from the basics to the most advanced techniques available in Hadoop 2.X.","language":"en","currency":"USD","id":"1787120457","title":"Hadoop: Data Processing and Modelling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LWzWDQAAQBAJ&source=gbs_api","authors":["Garry Turkington","Tanmay Deshpande","Sandeep Karanth"]},{"pageCount":794,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-NCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Bring your data to life with the powerful features of Microsoft Power BI","description":"Design, develop, and master efficient Power BI solutions for impactful business insights Key Features Get to grips with the fundamentals of Microsoft Power BI Combine data from multiple sources, create visuals, and publish reports across platforms Understand Power BI concepts with real-world use cases Book Description Microsoft Power BI Complete Reference Guide gets you started with business intelligence by showing you how to install the Power BI toolset, design effective data models, and build basic dashboards and visualizations that make your data come to life. In this Learning Path, you will learn to create powerful interactive reports by visualizing your data and learn visualization styles, tips and tricks to bring your data to life. You will be able to administer your organization's Power BI environment to create and share dashboards. You will also be able to streamline deployment by implementing security and regular data refreshes. Next, you will delve deeper into the nuances of Power BI and handling projects. You will get acquainted with planning a Power BI project, development, and distribution of content, and deployment. You will learn to connect and extract data from various sources to create robust datasets, reports, and dashboards. Additionally, you will learn how to format reports and apply custom visuals, animation and analytics to further refine your data. By the end of this Learning Path, you will learn to implement the various Power BI tools such as on-premises gateway together along with staging and securely distributing content via apps. This Learning Path includes content from the following Packt products: Microsoft Power BI Quick Start Guide by Devin Knight et al. Mastering Microsoft Power BI by Brett Powell What you will learn Connect to data sources using both import and DirectQuery options Leverage built-in and custom visuals to design effective reports Administer a Power BI cloud tenant for your organization Deploy your Power BI Desktop files into the Power BI Report Server Build efficient data retrieval and transformation processes Who this book is for Microsoft Power BI Complete Reference Guide is for those who want to learn and use the Power BI features to extract maximum information and make intelligent decisions that boost their business. If you have a basic understanding of BI concepts and want to learn how to apply them using Microsoft Power BI, then Learning Path is for you. It consists of real-world examples on Power BI and goes deep into the technical issues, covers additional protocols, and much more.","language":"en","currency":"USD","id":"1789955637","title":"Microsoft Power BI Complete Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-NCBDwAAQBAJ&source=gbs_api","authors":["Devin Knight","Brian Knight","Mitchell Pearson","Manuel Quintana","Brett Powell"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zxykAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.49,"subtitle":"From Data Integration to Analytics","description":"Between the high-level concepts of business intelligence and the nitty-gritty instructions for using vendors’ tools lies the essential, yet poorly-understood layer of architecture, design and process. Without this knowledge, Big Data is belittled – projects flounder, are late and go over budget. Business Intelligence Guidebook: From Data Integration to Analytics shines a bright light on an often neglected topic, arming you with the knowledge you need to design rock-solid business intelligence and data integration processes. Practicing consultant and adjunct BI professor Rick Sherman takes the guesswork out of creating systems that are cost-effective, reusable and essential for transforming raw data into valuable information for business decision-makers. After reading this book, you will be able to design the overall architecture for functioning business intelligence systems with the supporting data warehousing and data-integration applications. You will have the information you need to get a project launched, developed, managed and delivered on time and on budget – turning the deluge of data into actionable information that fuels business knowledge. Finally, you’ll give your career a boost by demonstrating an essential knowledge that puts corporate BI projects on a fast-track to success. Provides practical guidelines for building successful BI, DW and data integration solutions. Explains underlying BI, DW and data integration design, architecture and processes in clear, accessible language. Includes the complete project development lifecycle that can be applied at large enterprises as well as at small to medium-sized businesses Describes best practices and pragmatic approaches so readers can put them into action. Companion website includes templates and examples, further discussion of key topics, instructor materials, and references to trusted industry sources.","language":"en","currency":"USD","id":"0124115284","title":"Business Intelligence Guidebook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zxykAwAAQBAJ&source=gbs_api","authors":["Rick Sherman"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build cost-effective and highly scalable Serverless applications using AWS Lambda. About This Book Leverage AWS Lambda to significantly lower your infrastructure costs and deploy out massively scalable, event-driven systems and applications Learn how to design and build Lambda functions using real-world examples and implementation scenarios Explore the Serverless ecosystem with a variety of toolsets and AWS services including DynamoDB, API Gateway, and much more! Who This Book Is For If you are a Cloud administrator and\/or developer who wishes to explore, learn, and leverage AWS Lambda to design, build, and deploy Serverless applications in the cloud, then this is the book for you! The book assumes you have some prior knowledge and hands-on experience with AWS core services such as EC2, IAM, S3, along with the knowledge to work with any popular programming language such as Node.Js, Java, C#, and so on. What You Will Learn Understand the hype, significance, and business benefits of Serverless computing and applications Plunge into the Serverless world of AWS Lambda and master its core components and how it works Find out how to effectively and efficiently design, develop, and test Lambda functions using Node.js, along with some keen coding insights and best practices Explore best practices to effectively monitor and troubleshoot Serverless applications using AWS CloudWatch and other third-party services in the form of Datadog and Loggly Quickly design and develop Serverless applications by leveraging AWS Lambda, DynamoDB, and API Gateway using the Serverless Application Framework (SAF) and other AWS services such as Step Functions Explore a rich variety of real-world Serverless use cases with Lambda and see how you can apply it to your environments In Detail AWS is recognized as one of the biggest market leaders for cloud computing and why not? It has evolved a lot since the time it started out by providing just basic services such as EC2 and S3 and today; they go all the way from IoT to Machine Learning, Image recognition, Chatbot Frameworks, and much more! One of those recent services that is also gaining a lot of traction is AWS Lambda! Although seemingly simple and easy to use, Lambda is a highly effective and scalable compute service that provides developers with a powerful platform to design and develop Serverless event-driven systems and applications. The book begins with a high-level introduction into the world of Serverless computing and its advantages and use cases, followed by a deep dive into AWS Lambda! You'll learn what services AWS Lambda provides to developers; how to design, write, and test Lambda functions; as well as monitor and troubleshoot them. The book is designed and accompanied with a vast variety of real-world examples, use cases, and code samples that will enable you to get started on your Serverless applications quickly. By the end of the book, you will have gained all the skills required to work with AWS Lambda services! Style and approach This step-by-step guide will help you build Serverless applications and run Serverless workloads using the AWS Lambda service. You'll be able to get started with it in a matter of minutes with easy-to-follow code snippets and examples.","language":"en","currency":"USD","id":"178646683X","title":"Mastering AWS Lambda","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LpZGDwAAQBAJ&source=gbs_api","authors":["Yohan Wadia","Udita Gupta"]},{"pageCount":121,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vpmiBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Issues and Current Trends","description":"This book offers readers a quick, comprehensive and up-to-date overview of the most important methodologies, technologies, APIs and standards related to the portability and interoperability of cloud applications and services, illustrated by a number of use cases representing a variety of interoperability and portability scenarios. The lack of portability and interoperability between cloud platforms at different service levels is the main issue affecting cloud-based services today. The brokering, negotiation, management, monitoring and reconfiguration of cloud resources are challenging tasks for developers and users of cloud applications due to the different business models associated with resource consumption, and to the variety of services and features offered by different cloud providers. In chapter 1 the concepts of cloud portability and interoperability are introduced, together with the issues and limitations arising when such features are lacking or ignored. Subsequently, chapter 2 provides an overview of the state-of-the-art methodologies and technologies that are currently used or being explored to enable cloud portability and interoperability. Chapter 3 illustrates the main cross-platform cloud APIs and how they can solve interoperability and portability issues. In turn, chapter 4 presents a set of ready-to-use solutions which, either because of their broad-scale use in cloud computing scenarios or because they utilize established or emerging standards, play a fundamental part in providing interoperable and portable solutions. Lastly, chapter 5 presents an overview of emerging standards for cloud Interoperability and portability. Researchers and developers of cloud-based services will find here a brief survey of the relevant methodologies, APIs and standards, illustrated by case studies and complemented by an extensive reference list for more detailed descriptions of every topic covered.","language":"en","currency":"USD","id":"3319137018","title":"Cloud Portability and Interoperability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vpmiBwAAQBAJ&source=gbs_api","authors":["Beniamino Di Martino","Giuseppina Cretella","Antonio Esposito"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=syPHBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Scala, Java, or Python developer with an interest in machine learning and data analysis and are eager to learn how to apply common machine learning techniques at scale using the Spark framework, this is the book for you. While it may be useful to have a basic understanding of Spark, no previous experience is required.","language":"en","currency":"USD","id":"1783288523","title":"Machine Learning with Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=syPHBgAAQBAJ&source=gbs_api","authors":["Nick Pentreath"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sL1nAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.41,"subtitle":null,"description":"Intended as a textbook for undergraduate students of computer science, computer science and engineering, and information technology for a course on distributed systems\/operating systems, this up-to-date text provides a thorough understanding of the fundamental principles and technologies pertinent to the design and construction of the distributed systems. Beginning with an introduction to the subject, the book discusses the techniques of software and network architectures and presents the issues pertaining to the handling and accessing of resources. This also focuses on major application areas. Finally, the book provides the examples for explaining the concepts discussed. The book would also be useful to postgraduate students of computer science, computer science and engineering, and information technology as well as to postgraduate students of computer applications. The book can also be used by software engineers, programmers, analysts, scientists and researchers for reference. New to This Edition This second edition highlights some of the latest distributed system technologies. It includes discussions on: • Cloud Computing • Social Networks • Big Data In addition to this, It presents some current key software tools, viz. BitTorrent, Amazon Dynamo, Amazon DynamoDB, Apache Cassandra, Apache Server, Apache Zookeeper, Google BigTable and others. Key Features • Introduces Internet, The World Wide Web, Web services and network technologies, viz. WAN, LAN and MAN. • Discusses software development tools, like PVM, MPI, DCE, CORBA and the Globus toolkit. • Provides discussions on network protocol suites, i.e. TCP\/IP, SMTP and HTTP. • Deals with grid computing, wireless computing and client-server model. • Presents applications of NFS, Coda, Microsoft SQL Server, Oracle, Amoeba, Chorus, Mach, Windows NT and Orbix technologies. • Emphasizes the programming languages, like Ada, C++ and Java.","language":"en","currency":"USD","id":"812034877X","title":"DISTRIBUTED SYSTEMS COMPUTING OVER NETWORKS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sL1nAgAAQBAJ&source=gbs_api","authors":["JOEL M. CRICHLOW"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ka_wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"Cloud computing is typically associated with backend development and DevOps. But with the rise of serverless technologies and a new generation of services and frameworks, frontend and mobile developers can build robust applications with production-ready features such as authentication and authorization, API gateways, chatbots, augmented reality scenes, and more. This hands-on guide shows you how. Nader Dabit, developer advocate at Amazon Web Services, guides you through the process of building full stack applications using React, AWS, GraphQL, and AWS Amplify. You’ll learn how to create and incorporate services into your client applications while learning general best practices, deployment strategies, rich media management, and continuous integration and delivery along the way. Learn how to build serverless applications that solve real problems Understand what is (and isn’t) possible when using these technologies Create a GraphQL API that interacts with DynamoDB and a NoSQL database Examine how authentication works—and learn the difference between authentication and authorization Get an in-depth view of how serverless functions work and why they’re important Build full stack applications on AWS and create offline apps with Amplify DataStore","language":"en","currency":"USD","id":"1492059846","title":"Full Stack Serverless","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ka_wDwAAQBAJ&source=gbs_api","authors":["Nader Dabit"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel guide to Python with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter for sentiment analysis, cognitive computing with IBM Watson, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop, Spark and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate, IBM Watson, Microsoft Azure, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter, IBM Watson, machine learning, deep learning, computer vision, Hadoop, Spark, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-twkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at developers and system administrators who want to learn about Big Data analysis using Amazon Elastic MapReduce. Basic Java programming knowledge is required. You should be comfortable with using command-line tools. Prior knowledge of AWS, API, and CLI tools is not assumed. Also, no exposure to Hadoop and MapReduce is expected.","language":"en","currency":"USD","id":"1782173447","title":"Learning Big Data with Amazon Elastic MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-twkBQAAQBAJ&source=gbs_api","authors":["Amarkant Singh","Vijay Rayapati"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wN0AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Implementing Cloud Privacy and Security","description":"CSA Guide to Cloud Computing brings you the most current and comprehensive understanding of cloud security issues and deployment techniques from industry thought leaders at the Cloud Security Alliance (CSA). For many years the CSA has been at the forefront of research and analysis into the most pressing security and privacy related issues associated with cloud computing. CSA Guide to Cloud Computing provides you with a one-stop source for industry-leading content, as well as a roadmap into the future considerations that the cloud presents. The authors of CSA Guide to Cloud Computing provide a wealth of industry expertise you won't find anywhere else. Author Raj Samani is the Chief Technical Officer for McAfee EMEA; author Jim Reavis is the Executive Director of CSA; and author Brian Honan is recognized as an industry leader in the ISO27001 standard. They will walk you through everything you need to understand to implement a secure cloud computing structure for your enterprise or organization. Your one-stop source for comprehensive understanding of cloud security from the foremost thought leaders in the industry Insight into the most current research on cloud privacy and security, compiling information from CSA's global membership Analysis of future security and privacy issues that will impact any enterprise that uses cloud computing","language":"en","currency":"USD","id":"0124201857","title":"CSA Guide to Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wN0AwAAQBAJ&source=gbs_api","authors":["Raj Samani","Jim Reavis","Brian Honan"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Aq4LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Associate SAA-C02 Exam","description":"Master the intricacies of Amazon Web Services and efficiently prepare for the SAA-C02 Exam with this comprehensive study guide AWS Certified Solutions Study Guide: Associate (SAA-C02) Exam, Third Edition comprehensively and efficiently prepares you for the SAA-C02 Exam. The study guide contains robust and effective study tools that will help you succeed on the exam. The guide grants you access to the regularly updated Sybex online learning environment and test bank, which contains hundreds of test questions, bonus practice exams, electronic flashcards, and a glossary of key terms. In this study guide, accomplished and experienced authors Ben Piper and David Clinton show you how to: Design resilient architectures Create high-performing architectures Craft secure applications and architectures Design cost-optimized architectures Perfect for anyone who hopes to begin a new career as an Amazon Web Services cloud professional, the study guide also belongs on the bookshelf of any existing AWS professional who wants to brush up on the fundamentals of their profession.","language":"en","currency":"USD","id":"1119713099","title":"AWS Certified Solutions Architect Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Aq4LEAAAQBAJ&source=gbs_api","authors":["Ben Piper","David Clinton"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=slwLAqkT_Y0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Rails 3 Way is a comprehensive resource that digs into the new features in Rails 3 and perhaps more importantly, the rationale behind them. —Yehuda Katz, Rails Core The Bible for Ruby on Rails Application Development Ruby on Rails strips complexity from the development process, enabling professional developers to focus on what matters most: delivering business value via clean and maintainable code. The Rails 3 Way is the only comprehensive, authoritative guide to delivering production-quality code with Rails 3. Pioneering Rails expert Obie Fernandez and a team of leading experts illuminate the entire Rails 3 API, along with the idioms, design approaches, and libraries that make developing applications with Rails so powerful. Drawing on their unsurpassed experience and track record, they address the real challenges development teams face, showing how to use Rails 3 to maximize your productivity. Using numerous detailed code examples, the author systematically covers Rails 3 key capabilities and subsystems, making this book a reference that you will turn to again and again. He presents advanced Rails programming techniques that have been proven effective in day-to-day usage on dozens of production Rails systems and offers important insights into behavior-driven development and production considerations such as scalability. Dive deep into the Rails 3 codebase and discover why Rails is designed the way it is—and how to make it do what you want it to do. This book will help you Learn what’s new in Rails 3 Increase your productivity as a web application developer Realize the overall joy in programming with Rails Leverage Rails’ powerful capabilities for building REST-compliant APIs Drive implementation and protect long-term maintainability using RSpec Design and manipulate your domain layer using Active Record Understand and program complex program flows using Action Controller Master sophisticated URL routing concepts Use Ajax techniques via Rails 3 support for unobtrusive JavaScript Learn to extend Rails with popular gems and plugins, and how to write your own Extend Rails with the best third-party plug-ins and write your own Integrate email services into your applications with Action Mailer Improve application responsiveness with background processing Create your own non-Active Record domain classes using Active Model Master Rails’ utility classes and extensions in Active Support","language":"en","currency":"USD","id":"9780132480314","title":"The Rails 3 Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=slwLAqkT_Y0C&source=gbs_api","authors":["Obed (Obie) Fernandez"]},{"pageCount":366,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z0bcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Redefining the Architect's Role in the Digital Enterprise","description":"As the digital economy changes the rules of the game for enterprises, the role of software and IT architects is also transforming. Rather than focus on technical decisions alone, architects and senior technologists need to combine organizational and technical knowledge to effect change in their company’s structure and processes. To accomplish that, they need to connect the IT engine room to the penthouse, where the business strategy is defined. In this guide, author Gregor Hohpe shares real-world advice and hard-learned lessons from actual IT transformations. His anecdotes help architects, senior developers, and other IT professionals prepare for a more complex but rewarding role in the enterprise. This book is ideal for: Software architects and senior developers looking to shape the company’s technology direction or assist in an organizational transformation Enterprise architects and senior technologists searching for practical advice on how to navigate technical and organizational topics CTOs and senior technical architects who are devising an IT strategy that impacts the way the organization works IT managers who want to learn what’s worked and what hasn’t in large-scale transformation","language":"en","currency":"USD","id":"1492077496","title":"The Software Architect Elevator","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z0bcDwAAQBAJ&source=gbs_api","authors":["Gregor Hohpe"]},{"pageCount":121,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vpmiBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Issues and Current Trends","description":"This book offers readers a quick, comprehensive and up-to-date overview of the most important methodologies, technologies, APIs and standards related to the portability and interoperability of cloud applications and services, illustrated by a number of use cases representing a variety of interoperability and portability scenarios. The lack of portability and interoperability between cloud platforms at different service levels is the main issue affecting cloud-based services today. The brokering, negotiation, management, monitoring and reconfiguration of cloud resources are challenging tasks for developers and users of cloud applications due to the different business models associated with resource consumption, and to the variety of services and features offered by different cloud providers. In chapter 1 the concepts of cloud portability and interoperability are introduced, together with the issues and limitations arising when such features are lacking or ignored. Subsequently, chapter 2 provides an overview of the state-of-the-art methodologies and technologies that are currently used or being explored to enable cloud portability and interoperability. Chapter 3 illustrates the main cross-platform cloud APIs and how they can solve interoperability and portability issues. In turn, chapter 4 presents a set of ready-to-use solutions which, either because of their broad-scale use in cloud computing scenarios or because they utilize established or emerging standards, play a fundamental part in providing interoperable and portable solutions. Lastly, chapter 5 presents an overview of emerging standards for cloud Interoperability and portability. Researchers and developers of cloud-based services will find here a brief survey of the relevant methodologies, APIs and standards, illustrated by case studies and complemented by an extensive reference list for more detailed descriptions of every topic covered.","language":"en","currency":"USD","id":"3319137018","title":"Cloud Portability and Interoperability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vpmiBwAAQBAJ&source=gbs_api","authors":["Beniamino Di Martino","Giuseppina Cretella","Antonio Esposito"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=syPHBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Scala, Java, or Python developer with an interest in machine learning and data analysis and are eager to learn how to apply common machine learning techniques at scale using the Spark framework, this is the book for you. While it may be useful to have a basic understanding of Spark, no previous experience is required.","language":"en","currency":"USD","id":"1783288523","title":"Machine Learning with Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=syPHBgAAQBAJ&source=gbs_api","authors":["Nick Pentreath"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sL1nAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.41,"subtitle":null,"description":"Intended as a textbook for undergraduate students of computer science, computer science and engineering, and information technology for a course on distributed systems\/operating systems, this up-to-date text provides a thorough understanding of the fundamental principles and technologies pertinent to the design and construction of the distributed systems. Beginning with an introduction to the subject, the book discusses the techniques of software and network architectures and presents the issues pertaining to the handling and accessing of resources. This also focuses on major application areas. Finally, the book provides the examples for explaining the concepts discussed. The book would also be useful to postgraduate students of computer science, computer science and engineering, and information technology as well as to postgraduate students of computer applications. The book can also be used by software engineers, programmers, analysts, scientists and researchers for reference. New to This Edition This second edition highlights some of the latest distributed system technologies. It includes discussions on: • Cloud Computing • Social Networks • Big Data In addition to this, It presents some current key software tools, viz. BitTorrent, Amazon Dynamo, Amazon DynamoDB, Apache Cassandra, Apache Server, Apache Zookeeper, Google BigTable and others. Key Features • Introduces Internet, The World Wide Web, Web services and network technologies, viz. WAN, LAN and MAN. • Discusses software development tools, like PVM, MPI, DCE, CORBA and the Globus toolkit. • Provides discussions on network protocol suites, i.e. TCP\/IP, SMTP and HTTP. • Deals with grid computing, wireless computing and client-server model. • Presents applications of NFS, Coda, Microsoft SQL Server, Oracle, Amoeba, Chorus, Mach, Windows NT and Orbix technologies. • Emphasizes the programming languages, like Ada, C++ and Java.","language":"en","currency":"USD","id":"812034877X","title":"DISTRIBUTED SYSTEMS COMPUTING OVER NETWORKS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sL1nAgAAQBAJ&source=gbs_api","authors":["JOEL M. CRICHLOW"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ka_wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"Cloud computing is typically associated with backend development and DevOps. But with the rise of serverless technologies and a new generation of services and frameworks, frontend and mobile developers can build robust applications with production-ready features such as authentication and authorization, API gateways, chatbots, augmented reality scenes, and more. This hands-on guide shows you how. Nader Dabit, developer advocate at Amazon Web Services, guides you through the process of building full stack applications using React, AWS, GraphQL, and AWS Amplify. You’ll learn how to create and incorporate services into your client applications while learning general best practices, deployment strategies, rich media management, and continuous integration and delivery along the way. Learn how to build serverless applications that solve real problems Understand what is (and isn’t) possible when using these technologies Create a GraphQL API that interacts with DynamoDB and a NoSQL database Examine how authentication works—and learn the difference between authentication and authorization Get an in-depth view of how serverless functions work and why they’re important Build full stack applications on AWS and create offline apps with Amplify DataStore","language":"en","currency":"USD","id":"1492059846","title":"Full Stack Serverless","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ka_wDwAAQBAJ&source=gbs_api","authors":["Nader Dabit"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel guide to Python with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter for sentiment analysis, cognitive computing with IBM Watson, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop, Spark and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate, IBM Watson, Microsoft Azure, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter, IBM Watson, machine learning, deep learning, computer vision, Hadoop, Spark, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GcRiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build exciting projects with Amazon Alexa and integrate it with Internet of Things","description":"Get up and running with the fundamentals of Amazon Alexa and build exciting IoT projects Key Features Gain hands-on experience of working with Amazon Echo and Alexa Build exciting IoT projects using Amazon Echo Learn about voice-enabled smart devices Book Description Amazon Echo is a smart speaker developed by Amazon, which connects to Amazon’s Alexa Voice Service and is entirely controlled by voice commands. Amazon Echo is currently being used for a variety of purposes such as home automation, asking generic queries, and even ordering a cab or pizza. Alexa Skills Projects starts with a basic introduction to Amazon Alexa and Echo. You will then deep dive into Alexa Programming concepts such as Intents, Slots, Lambdas and maintaining your skill’s state using DynamoDB. You will get a clear understanding of how some of the most popular Alexa Skills work, and gain experience of working with real-world Amazon Echo applications. In the concluding chapters, you will explore the future of voice-enabled applications and their coverage with respect to the Internet of Things. By the end of the book, you will have learned to design Alexa Skills for specific purposes and interact with Amazon Echo to execute these skills. What you will learn Understand how Amazon Echo is already being used in various domains Discover how an Alexa Skill is architected Get a clear understanding of how some of the most popular Alexa Skills work Design Alexa Skills for specific purposes and interact with Amazon Echo to execute them Gain experience of programming for Amazon Echo Explore future applications of Amazon Echo and other voice-activated devices Who this book is for Alexa Skills Projects is for individuals who want to have a deep understanding of the underlying technology that drives Amazon Echo and Alexa, and how it can be integrated with the Internet of Things to develop hands-on projects.","language":"en","currency":"USD","id":"1788997581","title":"Alexa Skills Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GcRiDwAAQBAJ&source=gbs_api","authors":["Madhur Bhargava"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":584,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pQGGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Your one-stop solution for passing the AWS SysOps Administrator certification","description":"An effective guide to becoming an AWS Certified SysOps Administrator Key Features Not only pass the certification with confidence but also enhance your skills to solving real-world scenarios. A practical guide to getting you hands-on experience with application management, deployment, operation. Enhance your AWS skills with practice questions and mock tests. Book Description AWS certifications are becoming one of the must have certifications for any IT professional working on an AWS Cloud platform. This book will act as your one stop preparation guide to validate your technical expertise in deployment, management, and operations on the AWS platform. Along with exam specific content this book will also deep dive into real world scenarios and hands-on instructions. This book will revolve around concepts like teaching you to deploy, manage, and operate scalable, highly available, and fault tolerant systems on AWS. You will also learn to migrate an existing on-premises application to AWS. You get hands-on experience in selecting the appropriate AWS service based on compute, data, or security requirements. This book will also get you well versed with estimating AWS usage costs and identifying operational cost control mechanisms. By the end of this book, you will be all prepared to implement and manage resources efficiently on the AWS cloud along with confidently passing the AWS Certified SysOps Administrator – Associate exam. What you will learn Create and manage users, groups, and permissions using AWS IAM services Create a secure VPC with public and private subnets, Network Access Control, and security groups Get started with launching your first EC2 instance, and working with it Handle application traffic with ELB and monitor AWS resources with CloudWatch Work with S3, Glacier, and CloudFront Work across distributed application components using SWF Understand event-based processing with Lambda and messaging SQS and SNS in AWS Get familiar with AWS deployment concepts and tools including Elastic Beanstalk, CloudFormation and AWS OpsWorks Who this book is for If you are a system administrator or a system engineer interested in leveraging the AWS platform to deploy applications then, this book is for you. IT professionals interested in passing the AWS Certified Sysops Administrator will also benefit from this book. Some basic understanding of working AWS components would do wonders.","language":"en","currency":"USD","id":"1788996380","title":"AWS Certified SysOps Administrator – Associate Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pQGGDwAAQBAJ&source=gbs_api","authors":["Marko Sluga"]},{"pageCount":194,"thumbnail":"http:\/\/books.google.com\/books\/content?id=u_WoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Over 40 hands-on recipes to develop and deploy real-world applications using Amazon EC2 About This Book Design and build applications using Amazon EC2 and a range of supporting AWS tools Find highly effective solutions to your AWS Cloud-based application development, deployment, and infrastructural issues A comprehensive set of recipes to implement your product's functional and non-functional requirements Who This Book Is For This book is targeted at Cloud-based developers who have prior exposure to AWS concepts and features. Some experience in building small applications and creating some proof-of-concept applications is required. What You Will Learn Select and configure the right EC2 instances Create, configure, and secure a Virtual Private Cloud Create an AWS CloudFormation template Use AWS Identity and Access Management to secure access to EC2 instances Configure auto-scaling groups using CloudWatch Choose and use the right data service such as SimpleDB and DynamoDB for your cloud applications Access key AWS services using client tools and AWS SDKs Deploy AWS applications using Docker containers In Detail Amazon Elastic Compute Cloud (Amazon EC2) is a web service that provides flexible and resizable compute capacity in the cloud. The main purpose of Amazon EC2 is to make web-scale cloud computing easier for the developers. It offers developers and companies the raw building blocks like load balancers, object stores and virtual machines running on general hardware (that is, Amazon runs a multitude of hardware components but presents them as a generic utility to its users) with accessible APIs in order to create scalable software products This book covers designing, developing, and deploying scalable, highly available, and secure applications on the AWS platform. By following the steps in the recipes, you will be able to effectively and systematically resolve issues related to development, deployment, and infrastructure for enterprise-grade cloud applications or products. This book starts with helping you choose and configure the right EC2 instances to meet your application-specific requirements. The book then moves on to creating a CloudFormation template and will teach you how to work with stacks. You will then be introduced to using IAM services to configure users, groups, roles, and multi-factor authentication. You will also learn how to connect AD to AWS IAM. Next, you will be using AWS data services and accessing other AWS services including Route 53, Amazon S3, and AWS SES (Amazon Simple Email Service). Finally, you will be deploying AWS applications using Docker containers. Style and approach This book contains a rich set of recipes that cover not only the full spectrum of real-world cloud application development using Amazon EC2, but also the services and security of the applications. The book contains easy-to-follow recipes with step-by-step instructions to leverage EC2 within your applications.","language":"en","currency":"USD","id":"1785282255","title":"Amazon EC2 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=u_WoCwAAQBAJ&source=gbs_api","authors":["Sekhar Reddy","Aurobindo Sarkar"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K7FKDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn to design, build, and manage your infrastructure on the most popular of all the Cloud platforms—Amazon Web Services About This Book Learn how to leverage various Amazon Web Services (AWS) components and services to build a secure, reliable, and robust environment to host your applications on Deep dive into the core AWS service offerings with hands-on tutorials, real-world use case scenarios, and best practices A self-paced, systematic, and step-by-step guide to learning and implementing AWS in your own environment Who This Book Is For This book is for those who want to learn and leverage AWS. Although no prior experience with AWS is required, it is recommended that you have some hands-on experienceofLinux, Web Services, and basic networking What You Will Learn A brief introduction to Cloud Computing and AWS accompanied by steps to sign up for your first AWS account Create and manage users, groups, and permissions using AWSS Identity and Access Management services Get started with deploying and accessing EC2 instances, working with EBS Volumes and Snapshots Customize and create your very own Amazon Machine Image Design and deploy your instances on a highly secured, network isolated environment using Amazon VPC Effectively monitor your AWS environment using specialized alarms, custom monitoring metrics, and much more Explore the various benefits of Database-as-a-Service offerings and leverage them using Amazon RDS and Amazon DynamoDB Take an in-depth look at what's new with AWS, including EC2 Container Service and Elastic File System In Detail AWS is at the forefront of Cloud Computing today. Many businesses are moving away from traditional datacenters and toward AWS because of its reliability, vast service offerings, lower costs, and high rate of innovation. Because of its versatility and flexible design, AWS can be used to accomplish a variety of simple and complicated tasks such as hosting multitier websites, running large scale parallel processing, content delivery, petabyte storage and archival, and lots more. Whether you are a seasoned sysadmin or a rookie, this book will provide you with all the necessary skills to design, deploy, and manage your applications on the AWS cloud platform. The book guides you through the core AWS services such as IAM, EC2, VPC, RDS, and S3 using a simple real world application hosting example that you can relate to. Each chapter is designed to provide you with the most information possible about a particular AWS service coupled with easy to follow hands-on steps, best practices, tips, and recommendations. By the end of the book, you will be able to create a highly secure, fault tolerant, and scalable environment for your applications to run on. Style and approach This in-depth and insightful guide is filled with easy-to-follow examples, real-world use cases, best practices, and recommendations that will help you design and leverage AWS.","language":"en","currency":"USD","id":"1782173765","title":"AWS Administration – The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K7FKDAAAQBAJ&source=gbs_api","authors":["Yohan Wadia"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnnlCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This invaluable roadmap for startup engineers reveals how to successfully handle web application scalability challenges to meet increasing product and traffic demands. Web Scalability for Startup Engineers shows engineers working at startups and small companies how to plan and implement a comprehensive scalability strategy. It presents broad and holistic view of infrastructure and architecture of a scalable web application. Successful startups often face the challenge of scalability, and the core concepts driving a scalable architecture are language and platform agnostic. The book covers scalability of HTTP-based systems (websites, REST APIs, SaaS, and mobile application backends), starting with a high-level perspective before taking a deep dive into common challenges and issues. This approach builds a holistic view of the problem, helping you see the big picture, and then introduces different technologies and best practices for solving the problem at hand. The book is enriched with the author's real-world experience and expert advice, saving you precious time and effort by learning from others' mistakes and successes. Language-agnostic approach addresses universally challenging concepts in Web development\/scalability—does not require knowledge of a particular language Fills the gap for engineers in startups and smaller companies who have limited means for getting to the next level in terms of accomplishing scalability Strategies presented help to decrease time to market and increase the efficiency of web applications","language":"en","currency":"USD","id":"0071843663","title":"Web Scalability for Startup Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnnlCQAAQBAJ&source=gbs_api","authors":["Artur Ejsmont"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xRcaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Everything you need to succeed on the Google Cloud Certified Professional Cloud Architect exam in one accessible study guide Take the challenging Google Cloud Certified Professional Cloud Architect exam with confidence using the comprehensive information contained in this invaluable self-study guide. The book provides a thorough overview of cloud architecture and Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Professional Cloud Architect All-In-One Exam Guideis based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and in-depth explanations. You will discover how to design, develop, and manage robust, secure, scalable, and highly available solutions to drive business objectives. Offers 100% coverage of every objective for the Google Cloud Certified Professional Cloud Architect exam Online content includes 100 additional practice questions in the TotalTester customizable exam engine Written by a Google Cloud Certified Professional Cloud Architect","language":"en","currency":"USD","id":"1264257287","title":"Google Cloud Certified Professional Cloud Architect All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xRcaEAAAQBAJ&source=gbs_api","authors":["Iman Ghanizada"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=if1vAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":null,"description":"Create dynamic cloud-based websites with Amazon Web Services and this friendly guide! As the largest cloud computing platform in the world, Amazon Web Services (AWS) provides one of the most popular web services options available. This easy-to-understand guide is the perfect introduction to the Amazon Web Services platform and all it can do for you. You'll learn about the Amazon Web Services tool set; how different web services (including S3, Amazon EC2, and Amazon Flexible Payments) and Glacier work; and how you can implement AWS in your organization. Explains how to use Amazon Web Services to store objects, take payments, manage large quantities of data, send e-mails, deploy push notifications, and more from your website Details how AWS can reduce costs, improve efficiency, increase productivity, and cut down on expensive hardware investments - and administrative headaches - in your organization Includes practical examples and helpful step-by-step lists to help you experiment with different AWS features and create a robust website that meets your needs Amazon Web Services For Dummies is exactly what you need to get your head in the cloud with Amazon Web Services!","language":"en","currency":"USD","id":"1118651987","title":"Amazon Web Services For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=if1vAAAAQBAJ&source=gbs_api","authors":["Bernard Golden"]},{"pageCount":690,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZNOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Leverage AWS features to build highly secure, fault-tolerant, and scalable cloud environments","description":"Work through exciting recipes to administer your AWS cloud Key Features Build secure environments using AWS components and services Explore core AWS features with real-world applications and best practices Design and build Lambda functions using real-world examples Book Description With this Learning Path, you’ll explore techniques to easily manage applications on the AWS cloud. You’ll begin with an introduction to serverless computing, its advantages, and the fundamentals of AWS. The following chapters will guide you on how to manage multiple accounts by setting up consolidated billing, enhancing your application delivery skills, with the latest AWS services such as CodeCommit, CodeDeploy, and CodePipeline to provide continuous delivery and deployment, while also securing and monitoring your environment's workflow. It’ll also add to your understanding of the services AWS Lambda provides to developers. To refine your skills further, it demonstrates how to design, write, test, monitor, and troubleshoot Lambda functions. By the end of this Learning Path, you’ll be able to create a highly secure, fault-tolerant, and scalable environment for your applications. This Learning Path includes content from the following Packt products: AWS Administration: The Definitive Guide, Second Edition by Yohan Wadia AWS Administration Cookbook by Rowan Udell, Lucas Chan Mastering AWS Lambda by Yohan Wadia, Udita Gupta What you will learn Explore the benefits of serverless computing and applications Deploy apps with AWS Elastic Beanstalk and Amazon Elastic File System Secure environments with AWS CloudTrail, AWSConfig, and AWS Shield Run big data analytics with Amazon EMR and Amazon Redshift Back up and safeguard data using AWS Data Pipeline Create monitoring and alerting dashboards using CloudWatch Effectively monitor and troubleshoot serverless applications with AWS Design serverless apps via AWS Lambda, DynamoDB, and API Gateway Who this book is for This Learning Path is specifically designed for IT system and network administrators, AWS architects, and DevOps engineers who want to effectively implement AWS in their organization and easily manage daily activities. Familiarity with Linux, web services, cloud computing platforms, virtualization, networking, and other administration-related tasks will assist in understanding the concepts in the book. Prior hands-on experience with AWS core services such as EC2, IAM, S3, and programming languages, such as Node.Js, Java, and C#, will also prove beneficial.","language":"en","currency":"USD","id":"1788831063","title":"Implementing AWS: Design, Build, and Manage your Infrastructure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZNOGDwAAQBAJ&source=gbs_api","authors":["Yohan Wadia","Rowan Udell","Lucas Chan","Udita Gupta"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7D64DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.01,"subtitle":null,"description":"This book gets you a running start with serverless GraphQL APIs on Amazon's AWS AppSync. Whether you are new to GraphQL, or you are an experienced GraphQL developer, this book will provide you with the knowledge needed to get started with AWS AppSync. Do you like learning by doing? After quickly covering the GraphQL foundations, you will dive into the practice of developing APIs with AWS AppSync with in-depth walkthroughs, screenshots, and code samples. Do I learn everything I need to get started? The book guides you through the step-by-step process of designing GraphQL APIs: creating a GraphQL schema, developing GraphQL APIs, connecting data sources, developing resolvers with AppSync templates, securing your API, offering real-time data, developing offline support and synchronization for your apps and much more. Why GraphQL? GraphQL is now a viable option for modern API design. And since Facebook, Yelp, and Shopify have built successful APIs with GraphQL, many companies consider following in the technological footsteps of these tech giants. Using GraphQL is great, but by itself, it is only half the rent: It requires the manual installation and maintenance of software infrastructure components. Why Serverless GraphQL with AppSync? AppSync is a cloud-based platform for GraphQL APIs. It is serverless, so you waste no time setting up infrastructure. It scales up and down dynamically depending on the load. It supports your app developers with an SDK for synchronization and offline support. You pay only what you use, so no upfront investment is needed and it may save your organizations thousands of dollars in IT costs.","language":"en","currency":"USD","id":"1717110703","title":"Serverless GraphQL APIs with Amazon’s AWS AppSync","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7D64DwAAQBAJ&source=gbs_api","authors":["Matthias Biehl"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=31MoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Discover the definitive guide to crafting lightning-fast data processing for distributed systems with Apache Flink About This Book Build your expertize in processing real-time data with Apache Flink and its ecosystem Gain insights into the working of all components of Apache Flink such as FlinkML, Gelly, and Table API filled with real world use cases Exploit Apache Flink's capabilities like distributed data streaming, in-memory processing, pipelining and iteration operators to improve performance. Solve real world big-data problems with real time in-memory and disk-based processing capabilities of Apache Flink. Who This Book Is For Big data developers who are looking to process batch and real-time data on distributed systems. Basic knowledge of Hadoop and big data is assumed. Reasonable knowledge of Java or Scala is expected. What You Will Learn Learn how to build end to end real time analytics projects Integrate with existing big data stack and utilize existing infrastructure Build predictive analytics applications using FlinkML Use graph library to perform graph querying and search. Understand Flink's - \"Streaming First\" architecture to implementing real streaming applications Learn Flink Logging and Monitoring best practices in order to efficiently design your data pipelines Explore the detailed processes to deploy Flink cluster on Amazon Web Services(AWS) and Google Cloud Platform (GCP). In Detail With the advent of massive computer systems, organizations in different domains generate large amounts of data on a real-time basis. The latest entrant to big data processing, Apache Flink, is designed to process continuous streams of data at a lightning fast pace. This book will be your definitive guide to batch and stream data processing with Apache Flink. The book begins with introducing the Apache Flink ecosystem, setting it up and using the DataSet and DataStream API for processing batch and streaming datasets. Bringing the power of SQL to Flink, this book will then explore the Table API for querying and manipulating data. In the latter half of the book, readers will get to learn the remaining ecosystem of Apache Flink to achieve complex tasks such as event processing, machine learning, and graph processing. The final part of the book would consist of topics such as scaling Flink solutions, performance optimization and integrating Flink with other tools such as ElasticSearch. Whether you want to dive deeper into Apache Flink, or want to investigate how to get more out of this powerful technology, you'll find everything you need inside. Style and approach This book is a comprehensive guide that covers advanced features of the Apache Flink, and communicates them with a practical understanding of the underlying concepts for how, when, and why to use them.","language":"en","currency":"USD","id":"1786467267","title":"Learning Apache Flink","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=31MoDwAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Spring BootSpring Data JPA 12JPAJPA@EntityJpaRepositoryJPAMVCRESTDataSourceSpELSpring DataSpring Data RediscacheableIntelliJ IDEASpring Data REST JavaJavaJava","language":"zh-CN","currency":"USD","id":"7302499489","title":"Spring Data JPA","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VSf7DwAAQBAJ&source=gbs_api","authors":[""]}]