[{"pageCount":724,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ul9aBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Distributed Real-Time Search and Analytics Engine","description":"Whether you need full-text search or real-time analytics of structured data—or both—the Elasticsearch distributed search engine is an ideal way to put your data to work. This practical guide not only shows you how to search, analyze, and explore data with Elasticsearch, but also helps you deal with the complexities of human language, geolocation, and relationships. If you’re a newcomer to both search and distributed systems, you’ll quickly learn how to integrate Elasticsearch into your application. More experienced users will pick up lots of advanced techniques. Throughout the book, you’ll follow a problem-based approach to learn why, when, and how to use Elasticsearch features. Understand how Elasticsearch interprets data in your documents Index and query your data to take advantage of search concepts such as relevance and word proximity Handle human language through the effective use of analyzers and queries Summarize and group data to show overall trends, with aggregations and analytics Use geo-points and geo-shapes—Elasticsearch’s approaches to geolocation Model your data to take advantage of Elasticsearch’s horizontal scalability Learn how to configure and monitor your cluster in production","language":"en","currency":"USD","id":"1449358500","title":"Elasticsearch: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ul9aBgAAQBAJ&source=gbs_api","authors":["Clinton Gormley","Zachary Tong"]},{"pageCount":724,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qzCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Over 100 recipes for fast, scalable, and reliable search for your enterprise, 4th Edition","description":"Search, analyze, and manage data effectively with Elasticsearch 7 Key Features Extend Elasticsearch functionalities and learn how to deploy on Elastic Cloud Deploy and manage simple Elasticsearch nodes as well as complex cluster topologies Explore the capabilities of Elasticsearch 7 with easy-to-follow recipes Book Description Elasticsearch is a Lucene-based distributed search server that allows users to index and search unstructured content with petabytes of data. With this book, you'll be guided through comprehensive recipes on what's new in Elasticsearch 7, and see how to create and run complex queries and analytics. Packed with recipes on performing index mapping, aggregation, and scripting using Elasticsearch, this fourth edition of Elasticsearch Cookbook will get you acquainted with numerous solutions and quick techniques for performing both every day and uncommon tasks such as deploying Elasticsearch nodes, integrating other tools to Elasticsearch, and creating different visualizations. You will install Kibana to monitor a cluster and also extend it using a variety of plugins. Finally, you will integrate your Java, Scala, Python, and big data applications such as Apache Spark and Pig with Elasticsearch, and create efficient data applications powered by enhanced functionalities and custom plugins. By the end of this book, you will have gained in-depth knowledge of implementing Elasticsearch architecture, and you'll be able to manage, search, and store data efficiently and effectively using Elasticsearch. What you will learn Create an efficient architecture with Elasticsearch Optimize search results by executing analytics aggregations Build complex queries by managing indices and documents Monitor the performance of your cluster and nodes Design advanced mapping to take full control of index steps Integrate Elasticsearch in Java, Scala, Python, and big data applications Install Kibana to monitor clusters and extend it for plugins Who this book is for If you’re a software engineer, big data infrastructure engineer, or Elasticsearch developer, you'll find this book useful. This Elasticsearch book will also help data professionals working in the e-commerce and FMCG industry who use Elastic for metrics evaluation and search analytics to get deeper insights for better business decisions. Prior experience with Elasticsearch will help you get the most out of this book.","language":"en","currency":"USD","id":"1789959020","title":"Elasticsearch 7.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qzCWDwAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2nc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Store, search, and analyze your data with ease using Elasticsearch 5.x About This Book Get to grips with the basics of Elasticsearch concepts and its APIs, and use them to create efficient applications Create large-scale Elasticsearch clusters and perform analytics using aggregation This comprehensive guide will get you up and running with Elasticsearch 5.x in no time Who This Book Is For If you want to build efficient search and analytics applications using Elasticsearch, this book is for you. It will also benefit developers who have worked with Lucene or Solr before and now want to work with Elasticsearch. No previous knowledge of Elasticsearch is expected. What You Will Learn See how to set up and configure Elasticsearch and Kibana Know how to ingest structured and unstructured data using Elasticsearch Understand how a search engine works and the concepts of relevance and scoring Find out how to query Elasticsearch with a high degree of performance and scalability Improve the user experience by using autocomplete, geolocation queries, and much more See how to slice and dice your data using Elasticsearch aggregations. Grasp how to use Kibana to explore and visualize your data Know how to host on Elastic Cloud and how to use the latest X-Pack features such as Graph and Alerting In Detail Elasticsearch is a modern, fast, distributed, scalable, fault tolerant, and open source search and analytics engine. You can use Elasticsearch for small or large applications with billions of documents. It is built to scale horizontally and can handle both structured and unstructured data. Packed with easy-to- follow examples, this book will ensure you will have a firm understanding of the basics of Elasticsearch and know how to utilize its capabilities efficiently. You will install and set up Elasticsearch and Kibana, and handle documents using the Distributed Document Store. You will see how to query, search, and index your data, and perform aggregation-based analytics with ease. You will see how to use Kibana to explore and visualize your data. Further on, you will learn to handle document relationships, work with geospatial data, and much more, with this easy-to-follow guide. Finally, you will see how you can set up and scale your Elasticsearch clusters in production environments. Style and approach This comprehensive guide will get you started with Elasticsearch 5.x, so you build a solid understanding of the basics. Every topic is explained in depth and is supplemented with practical examples to enhance your understanding.","language":"en","currency":"USD","id":"1787129918","title":"Learning Elasticsearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2nc5DwAAQBAJ&source=gbs_api","authors":["Abhishek Andhavarapu"]},{"pageCount":186,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7g-5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Get up and running with the distributed search and analytics capabilities of Elasticsearch","description":"Get the most out of Elasticsearch 7’s new features to build, deploy, and manage efficient applications Key Features Discover the new features introduced in Elasticsearch 7 Explore techniques for distributed search, indexing, and clustering Gain hands-on knowledge of implementing Elasticsearch for your enterprise Book Description Elasticsearch is one of the most popular tools for distributed search and analytics. This Elasticsearch book highlights the latest features of Elasticsearch 7 and helps you understand how you can use them to build your own search applications with ease. Starting with an introduction to the Elastic Stack, this book will help you quickly get up to speed with using Elasticsearch. You'll learn how to install, configure, manage, secure, and deploy Elasticsearch clusters, as well as how to use your deployment to develop powerful search and analytics solutions. As you progress, you'll also understand how to troubleshoot any issues that you may encounter along the way. Finally, the book will help you explore the inner workings of Elasticsearch and gain insights into queries, analyzers, mappings, and aggregations as you learn to work with search results. By the end of this book, you'll have a basic understanding of how to build and deploy effective search and analytics solutions using Elasticsearch. What you will learn Install Elasticsearch and use it to safely store data and retrieve it when needed Work with a variety of analyzers and filters Discover techniques to improve search results in Elasticsearch Understand how to perform metric and bucket aggregations Implement best practices for moving clusters and applications to production Explore various techniques to secure your Elasticsearch clusters Who this book is for This book is for software developers, engineers, data architects, system administrators, and anyone who wants to get up and running with Elasticsearch 7. No prior experience with Elasticsearch is required.","language":"en","currency":"USD","id":"1789801885","title":"Elasticsearch 7 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7g-5DwAAQBAJ&source=gbs_api","authors":["Anurag Srivastava","Douglas Miller"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practical guide to designing, indexing, and querying advanced distributed search engines","description":"Master the intricacies of Elasticsearch 7.0 and use it to create flexible and scalable search solutions Key Features Master the latest distributed search and analytics capabilities of Elasticsearch 7.0 Perform searching, indexing, and aggregation of your data at scale Discover tips and techniques for speeding up your search query performance Book Description Building enterprise-grade distributed applications and executing systematic search operations call for a strong understanding of Elasticsearch and expertise in using its core APIs and latest features. This book will help you master the advanced functionalities of Elasticsearch and understand how you can develop a sophisticated, real-time search engine confidently. In addition to this, you'll also learn to run machine learning jobs in Elasticsearch to speed up routine tasks. You'll get started by learning to use Elasticsearch features on Hadoop and Spark and make search results faster, thereby improving the speed of query results and enhancing the customer experience. You'll then get up to speed with performing analytics by building a metrics pipeline, defining queries, and using Kibana for intuitive visualizations that help provide decision-makers with better insights. The book will later guide you through using Logstash with examples to collect, parse, and enrich logs before indexing them in Elasticsearch. By the end of this book, you will have comprehensive knowledge of advanced topics such as Apache Spark support, machine learning using Elasticsearch and scikit-learn, and real-time analytics, along with the expertise you need to increase business productivity, perform analytics, and get the very best out of Elasticsearch. What you will learn Pre-process documents before indexing in ingest pipelines Learn how to model your data in the real world Get to grips with using Elasticsearch for exploratory data analysis Understand how to build analytics and RESTful services Use Kibana, Logstash, and Beats for dashboard applications Get up to speed with Spark and Elasticsearch for real-time analytics Explore the basics of Spring Data Elasticsearch, and understand how to index, search, and query in a Spring application Who this book is for This book is for Elasticsearch developers and data engineers who want to take their basic knowledge of Elasticsearch to the next level and use it to build enterprise-grade distributed search applications. Prior experience of working with Elasticsearch will be useful to get the most out of this book.","language":"en","currency":"USD","id":"1789956560","title":"Advanced Elasticsearch 7.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fyisDwAAQBAJ&source=gbs_api","authors":["Wai Tak Wong"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oV4dDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Harness the power of ElasticSearch to build and manage scalable search and analytics solutions with this fast-paced guide About This Book New to ElasticSearch? Here's what you need—a highly practical guide that gives you a quick start with ElasticSearch using easy-to-follow examples; get up and running with ElasticSearch APIs in no time Get the latest guide on ElasticSearch 2.0.0, which contains concise and adequate information on handling all the issues a developer needs to know while handling data in bulk with search relevancy Learn to create large-scale ElasticSearch clusters using best practices Learn from our experts—written by Bharvi Dixit who has extensive experience in working with search servers (especially ElasticSearch) Who This Book Is For Anyone who wants to build efficient search and analytics applications can choose this book. This book is also beneficial for skilled developers, especially ones experienced with Lucene or Solr, who now want to learn Elasticsearch quickly. What You Will Learn Get to know about advanced Elasticsearch concepts and its REST APIs Write CRUD operations and other search functionalities using the ElasticSearch Python and Java clients Dig into wide range of queries and find out how to use them correctly Design schema and mappings with built-in and custom analyzers Excel in data modeling concepts and query optimization Master document relationships and geospatial data Build analytics using aggregations Setup and scale Elasticsearch clusters using best practices Learn to take data backups and secure Elasticsearch clusters In Detail With constantly evolving and growing datasets, organizations have the need to find actionable insights for their business. ElasticSearch, which is the world's most advanced search and analytics engine, brings the ability to make massive amounts of data usable in a matter of milliseconds. It not only gives you the power to build blazing fast search solutions over a massive amount of data, but can also serve as a NoSQL data store. This guide will take you on a tour to become a competent developer quickly with a solid knowledge level and understanding of the ElasticSearch core concepts. Starting from the beginning, this book will cover these core concepts, setting up ElasticSearch and various plugins, working with analyzers, and creating mappings. This book provides complete coverage of working with ElasticSearch using Python and performing CRUD operations and aggregation-based analytics, handling document relationships in the NoSQL world, working with geospatial data, and taking data backups. Finally, we'll show you how to set up and scale ElasticSearch clusters in production environments as well as providing some best practices. Style and approach This is an easy-to-follow guide with practical examples and clear explanations of the concepts. This fast-paced book believes in providing very rich content focusing majorly on practical implementation. This book will provide you with step-by-step practical examples, letting you know about the common errors and solutions along with ample screenshots and code to ensure your success.","language":"en","currency":"USD","id":"1784390887","title":"Elasticsearch Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oV4dDAAAQBAJ&source=gbs_api","authors":["Bharvi Dixit"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PEFK3MuwBsIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"ElasticSearch is an open source search server built on Apache Lucene. It was built to provide a scalable search solution with built-in support for near real-time search and multi-tenancy.Jumping into the world of ElasticSearch by setting up your own custom cluster, this book will show you how to create a fast, scalable, and flexible search solution. By learning the ins-and-outs of data indexing and analysis, \"ElasticSearch Server\" will start you on your journey to mastering the powerful capabilities of ElasticSearch. With practical chapters covering how to search data, extend your search, and go deep into cluster administration and search analysis, this book is perfect for those new and experienced with search servers.In \"ElasticSearch Server\" you will learn how to revolutionize your website or application with faster, more accurate, and flexible search functionality. Starting with chapters on setting up your own ElasticSearch cluster and searching and extending your search parameters you will quickly be able to create a fast, scalable, and completely custom search solution.Building on your knowledge further you will learn about ElasticSearch's query API and become confident using powerful filtering and faceting capabilities. You will develop practical knowledge on how to make use of ElasticSearch's near real-time capabilities and support for multi-tenancy.Your journey then concludes with chapters that help you monitor and tune your ElasticSearch cluster as well as advanced topics such as shard allocation, gateway configuration, and the discovery module.","language":"en","currency":"USD","id":"1849518440","title":"Elasticsearch Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PEFK3MuwBsIC&source=gbs_api","authors":["Rafal Kuc","Marek Rogozinski"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A beginner’s guide to distributed search, analytics, and visualization using Elasticsearch, Logstash and Kibana","description":"Deliver end-to-end real-time distributed data processing solutions by leveraging the power of Elastic Stack 6.0 Key Features - Get to grips with the new features introduced in Elastic Stack 6.0 - Get valuable insights from your data by working with the different components of the Elastic stack such as Elasticsearch, Logstash, Kibana, X-Pack, and Beats - Includes handy tips and techniques to build, deploy and manage your Elastic applications efficiently on-premise or on the cloud Book Description The Elastic Stack is a powerful combination of tools for distributed search, analytics, logging, and visualization of data from medium to massive data sets. The newly released Elastic Stack 6.0 brings new features and capabilities that empower users to find unique, actionable insights through these techniques. This book will give you a fundamental understanding of what the stack is all about, and how to use it efficiently to build powerful real-time data processing applications. After a quick overview of the newly introduced features in Elastic Stack 6.0, you’ll learn how to set up the stack by installing the tools, and see their basic configurations. Then it shows you how to use Elasticsearch for distributed searching and analytics, along with Logstash for logging, and Kibana for data visualization. It also demonstrates the creation of custom plugins using Kibana and Beats. You’ll find out about Elastic X-Pack, a useful extension for effective security and monitoring. We also provide useful tips on how to use the Elastic Cloud and deploy the Elastic Stack in production environments. On completing this book, you’ll have a solid foundational knowledge of the basic Elastic Stack functionalities. You’ll also have a good understanding of the role of each component in the stack to solve different data processing problems. What you will learn - Familiarize yourself with the different components of the Elastic Stack - Get to know the new functionalities introduced in Elastic Stack 6.0 - Effectively build your data pipeline to get data from terabytes or petabytes of data into Elasticsearch and Logstash for searching and logging - Use Kibana to visualize data and tell data stories in real-time - Secure, monitor, and use the alerting and reporting capabilities of Elastic Stack - Take your Elastic application to an on-premise or cloud-based production environment Who this book is for This book is for data professionals who want to get amazing insights and business metrics from their data sources. If you want to get a fundamental understanding of the Elastic Stack for distributed, real-time processing of data, this book will help you. A fundamental knowledge of JSON would be useful, but is not mandatory. No previous experience with the Elastic Stack is required.","language":"en","currency":"USD","id":"1787285863","title":"Learning Elastic Stack 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UvNFDwAAQBAJ&source=gbs_api","authors":["Pranav Shukla","Sharath Kumar M N"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AzqbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Distributed search, analytics, and visualization using Elasticsearch, Logstash, Beats, and Kibana, 2nd Edition","description":"A beginner's guide to storing, managing, and analyzing data with the updated features of Elastic 7.0 Key Features Gain access to new features and updates introduced in Elastic Stack 7.0 Grasp the fundamentals of Elastic Stack including Elasticsearch, Logstash, and Kibana Explore useful tips for using Elastic Cloud and deploying Elastic Stack in production environments Book Description The Elastic Stack is a powerful combination of tools for techniques such as distributed search, analytics, logging, and visualization of data. Elastic Stack 7.0 encompasses new features and capabilities that will enable you to find unique insights into analytics using these techniques. This book will give you a fundamental understanding of what the stack is all about, and help you use it efficiently to build powerful real-time data processing applications. The first few sections of the book will help you understand how to set up the stack by installing tools, and exploring their basic configurations. You’ll then get up to speed with using Elasticsearch for distributed searching and analytics, Logstash for logging, and Kibana for data visualization. As you work through the book, you will discover the technique of creating custom plugins using Kibana and Beats. This is followed by coverage of the Elastic X-Pack, a useful extension for effective security and monitoring. You’ll also find helpful tips on how to use Elastic Cloud and deploy Elastic Stack in production environments. By the end of this book, you’ll be well versed with the fundamental Elastic Stack functionalities and the role of each component in the stack to solve different data processing problems. What you will learn Install and configure an Elasticsearch architecture Solve the full-text search problem with Elasticsearch Discover powerful analytics capabilities through aggregations using Elasticsearch Build a data pipeline to transfer data from a variety of sources into Elasticsearch for analysis Create interactive dashboards for effective storytelling with your data using Kibana Learn how to secure, monitor and use Elastic Stack’s alerting and reporting capabilities Take applications to an on-premise or cloud-based production environment with Elastic Stack Who this book is for This book is for entry-level data professionals, software engineers, e-commerce developers, and full-stack developers who want to learn about Elastic Stack and how the real-time processing and search engine works for business analytics and enterprise search applications. Previous experience with Elastic Stack is not required, however knowledge of data warehousing and database concepts will be helpful.","language":"en","currency":"USD","id":"1789958539","title":"Learning Elastic Stack 7.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AzqbDwAAQBAJ&source=gbs_api","authors":["Pranav Shukla","Sharath Kumar M N"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PYmkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build powerful Elastic dashboards with Kibana's data visualization capabilities, 2nd Edition","description":"A beginner's guide to analyzing and visualizing your Elasticsearch data using Kibana 7 and Timelion Key Features Gain a fundamental understanding of how Kibana operates within the Elastic Stack Explore your data with Elastic Graph and create rich dashboards in Kibana Learn scalable data visualization techniques in Kibana 7 Book Description Kibana is a window into the Elastic Stack, that enables the visual exploration and real-time analysis of your data in Elasticsearch. This book will help you understand the core concepts of the use of Kibana 7 for rich analytics and data visualization. If you’re new to the tool or want to get to grips with the latest features introduced in Kibana 7, this book is the perfect beginner's guide. You’ll learn how to set up and configure the Elastic Stack and understand where Kibana sits within the architecture. As you advance, you’ll learn how to ingest data from different sources using Beats or Logstash into Elasticsearch, followed by exploring and visualizing data in Kibana. Whether working with time series data to create complex graphs using Timelion or embedding visualizations created in Kibana into your web applications, this book covers it all. It also covers topics that every Elastic developer needs to be aware of, such as installing and configuring Application Performance Monitoring (APM) servers and agents. Finally, you’ll also learn how to create effective machine learning jobs in Kibana to find anomalies in your data. By the end of this book, you’ll have a solid understanding of Kibana, and be able to create your own visual analytics solutions from scratch. What you will learn Explore the data-driven architecture of the Elastic Stack Install and set up Kibana 7 and other Elastic Stack components Use Beats and Logstash to get input from different data sources Create different visualizations using Kibana Build enterprise-grade Elastic dashboards from scratch Use Timelion to play with time series data Install and configure APM servers and APM agents Work with Dev Tools, Spaces, Graph, and other important tools Who this book is for If you’re an aspiring Elastic developer or data analysts, this book is for you. You’ll also find it useful if you want to get up to speed with the new features of Kibana 7 and perform data visualization on enterprise data. No prior knowledge of Kibana is expected, but some experience with Elasticsearch will be helpful.","language":"en","currency":"USD","id":"1838556559","title":"Learning Kibana 7","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PYmkDwAAQBAJ&source=gbs_api","authors":["Anurag Srivastava","Bahaaldine Azarmi"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practical guide to designing, indexing, and querying advanced distributed search engines","description":"Master the intricacies of Elasticsearch 7.0 and use it to create flexible and scalable search solutions Key Features Master the latest distributed search and analytics capabilities of Elasticsearch 7.0 Perform searching, indexing, and aggregation of your data at scale Discover tips and techniques for speeding up your search query performance Book Description Building enterprise-grade distributed applications and executing systematic search operations call for a strong understanding of Elasticsearch and expertise in using its core APIs and latest features. This book will help you master the advanced functionalities of Elasticsearch and understand how you can develop a sophisticated, real-time search engine confidently. In addition to this, you'll also learn to run machine learning jobs in Elasticsearch to speed up routine tasks. You'll get started by learning to use Elasticsearch features on Hadoop and Spark and make search results faster, thereby improving the speed of query results and enhancing the customer experience. You'll then get up to speed with performing analytics by building a metrics pipeline, defining queries, and using Kibana for intuitive visualizations that help provide decision-makers with better insights. The book will later guide you through using Logstash with examples to collect, parse, and enrich logs before indexing them in Elasticsearch. By the end of this book, you will have comprehensive knowledge of advanced topics such as Apache Spark support, machine learning using Elasticsearch and scikit-learn, and real-time analytics, along with the expertise you need to increase business productivity, perform analytics, and get the very best out of Elasticsearch. What you will learn Pre-process documents before indexing in ingest pipelines Learn how to model your data in the real world Get to grips with using Elasticsearch for exploratory data analysis Understand how to build analytics and RESTful services Use Kibana, Logstash, and Beats for dashboard applications Get up to speed with Spark and Elasticsearch for real-time analytics Explore the basics of Spring Data Elasticsearch, and understand how to index, search, and query in a Spring application Who this book is for This book is for Elasticsearch developers and data engineers who want to take their basic knowledge of Elasticsearch to the next level and use it to build enterprise-grade distributed search applications. Prior experience of working with Elasticsearch will be useful to get the most out of this book.","language":"en","currency":"USD","id":"1789956560","title":"Advanced Elasticsearch 7.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fyisDwAAQBAJ&source=gbs_api","authors":["Wai Tak Wong"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8kLfBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"This book is for Elasticsearch users who want to extend their knowledge and develop new skills. Prior knowledge of the Query DSL and data indexing is expected.","language":"en","currency":"USD","id":"1783553804","title":"Mastering Elasticsearch - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8kLfBgAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vNANEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Index, Analyze, Search and Aggregate Your Data Using Elasticsearch (English Edition)","description":"A step-by-step guide that will teach you how to use Elasticsearch in your application effectively KEY FEATURES ● Get familiar with the core concepts of Elasticsearch. ● Understand how the search engine works and how Elasticsearch is different from other similar tools. ● Learn to install Elasticsearch on different operating systems. ● Get familiar with the components of Elastic Stack such as Kibana, Logstash, and Beats, etc. ● Learn how to import data from different sources such as RDBMS, and files, etc DESCRIPTION In the modern Information Technology age, we are flooded with loads of data so we should know how to handle those data and transform them to fetch meaningful information. This book is here to help you manage the data using Elasticsearch. The book starts by covering the fundamentals of Elasticsearch and the concept behind it. After the introduction, you will learn how to install Elasticsearch on different platforms. You will then get to know about Index Management where you will learn to create, update, and delete Elasticsearch indices. Then you will understand how the Query DSL works and how to write some complex search queries using the Query DSL. After completing these basic features, you will move to some advanced topics. Under advanced topics, you will learn to handle Geodata which can be used to plot the data on a map. The book then focuses on Data Analysis using Aggregation. You will then learn how to tune Elasticsearch performance. The book ends with a chapter on Elasticsearch administration. WHAT YOU WILL LEARN ● Learn how to create and manage a cluster ● Work with different components of Elastic Stack ● Review the list of top Information Security certifications. ● Get to know more about Elasticsearch Index Management. ● Understand how to improve the performance by tuning Elasticsearch WHO THIS BOOK IS FOR This book is for developers, architects, DBA, DevOps, and other readers who want to learn Elasticsearch efficiently and want to apply that in their application whether it is a new one or an existing one. It is also beneficial to those who want to play with their data using Elasticsearch. Basic computer programming is a prerequisite. TABLE OF CONTENTS 1 Getting started with Elasticsearch 2 Installation Elasticsearch 3 Working with Elastic Stack 4 Preparing your data 5 Importing Data into Elasticsearch 6 Managing Your Index 7 Apply Search on Your Data 8 Handling Geo with Elasticsearch 9 Aggregating Your Data 10 Improving the Performance 11 Administer Elasticsearch","language":"en","currency":"USD","id":"9389898307","title":"Learning Elasticsearch 7.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vNANEAAAQBAJ&source=gbs_api","authors":["Anurag Srivastava"]},{"pageCount":230,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lhMKBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Updated for Logstash and ELK 5.0.0! A book designed for SysAdmins, Operations staff, Developers and DevOps who are interested in deploying a log management solution using the open source Elasticsearch, Logstash & Kibana (ELK) stack. In this book we will walk you through installing, deploying, managing and extending Logstash. We're going to do that by introducing you to Example.com, where you're going to start a new job as one of its SysAdmins. The first project you'll be in charge of is developing its new log management solution. We'll teach you how to: * Install and deploy Logstash. * Ship events from a Logstash Shipper to a central Logstash server. * Filter incoming events using a variety of techniques. * Add structured logging to your applications. * Output those events to a selection of useful destinations. * Use Logstash's awesome web interface Kibana. * Scale out your Logstash implementation as your environment grows. * Quickly and easily extend Logstash to deliver additional functionality that you might need. By the end of the book, you should have a functional and effective log management solution that you can deploy into your own environment. Updated for Logstash and ELK 5.0.0!","language":"en","currency":"USD","id":"0988820218","title":"The Logstash Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lhMKBAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NRO8AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A practical tutorial that covers the difficult design, implementation, and management of search solutions.Mastering ElasticSearch is aimed at to intermediate users who want to extend their knowledge about ElasticSearch. The topics that are described in the book are detailed, but we assume that you already know the basics, like the query DSL or data indexing. Advanced users will also find this book useful, as the examples are getting deep into the internals where it is needed.","language":"en","currency":"USD","id":"1783281448","title":"Mastering ElasticSearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NRO8AQAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nk5sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is a detailed, practical, hands-on guide packed with real-life scenarios and examples which will show you how to implement an ElasticSearch search engine on your own websites. If you are a web developer or a user who wants to learn more about ElasticSearch, then this is the book for you. You do not need to know anything about ElastiSeach, Java, or Apache Lucene in order to use this book, though basic knowledge about databases and queries is required.","language":"en","currency":"USD","id":"1783980532","title":"Elasticsearch Server: Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nk5sAwAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to integrate machine learning with distributed search and analytics","description":"Leverage Elastic Stack’s machine learning features to gain valuable insight from your data Key Features Combine machine learning with the analytic capabilities of Elastic Stack Analyze large volumes of search data and gain actionable insight from them Use external analytical tools with your Elastic Stack to improve its performance Book Description Machine Learning with the Elastic Stack is a comprehensive overview of the embedded commercial features of anomaly detection and forecasting. The book starts with installing and setting up Elastic Stack. You will perform time series analysis on varied kinds of data, such as log files, network flows, application metrics, and financial data. As you progress through the chapters, you will deploy machine learning within the Elastic Stack for logging, security, and metrics. In the concluding chapters, you will see how machine learning jobs can be automatically distributed and managed across the Elasticsearch cluster and made resilient to failure. By the end of this book, you will understand the performance aspects of incorporating machine learning within the Elastic ecosystem and create anomaly detection jobs and view results from Kibana directly. What you will learn Install the Elastic Stack to use machine learning features Understand how Elastic machine learning is used to detect a variety of anomaly types Apply effective anomaly detection to IT operations and security analytics Leverage the output of Elastic machine learning in custom views, dashboards, and proactive alerting Combine your created jobs to correlate anomalies of different layers of infrastructure Learn various tips and tricks to get the most out of Elastic machine learning Who this book is for If you are a data professional eager to gain insight on Elasticsearch data without having to rely on a machine learning specialist or custom development, Machine Learning with the Elastic Stack is for you. Those looking to integrate machine learning within their search and analytics applications will also find this book very useful. Prior experience with the Elastic Stack is needed to get the most out of this book.","language":"en","currency":"USD","id":"1788471776","title":"Machine Learning with the Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyOGDwAAQBAJ&source=gbs_api","authors":["Rich Collier","Bahaaldine Azarmi"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-TblCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Improve search experiences with ElasticSearch's powerful indexing functionality – learn how with this practical ElasticSearch tutorial, packed with tips! About This Book Improve user's search experience with the correct configuration Deliver relevant search results – fast! Save time and system resources by creating stable clusters Who This Book Is For If you understand the importance of a great search experience this book will show you exactly how to build one with ElasticSearch, one of the world's leading search servers. What You Will Learn Learn how ElasticSearch efficiently stores data – and find out how it can reduce costs Control document metadata with the correct mapping strategies and by configuring indices Use ElasticSearch analysis and analyzers to incorporate greater intelligence and organization across your documents and data Find out how an ElasticSearch cluster works – and learn the best way to configure it Perform high-speed indexing with low system resource cost Improve query relevance with appropriate mapping, suggest API, and other ElasticSearch functionalities In Detail Beginning with an overview of the way ElasticSearch stores data, you'll begin to extend your knowledge to tackle indexing and mapping, and learn how to configure ElasticSearch to meet your users' needs. You'll then find out how to use analysis and analyzers for greater intelligence in how you organize and pull up search results – to guarantee that every search query is met with the relevant results! You'll explore the anatomy of an ElasticSearch cluster, and learn how to set up configurations that give you optimum availability as well as scalability. Once you've learned how these elements work, you'll find real-world solutions to help you improve indexing performance, as well as tips and guidance on safety so you can back up and restore data. Once you've learned each component outlined throughout, you will be confident that you can help to deliver an improved search experience – exactly what modern users demand and expect. Style and approach This is a comprehensive guide to performing efficient indexing and providing relevant search results using mapping, analyzers, and other ElasticSearch functionalities.","language":"en","currency":"USD","id":"1783987030","title":"Elasticsearch Indexing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-TblCwAAQBAJ&source=gbs_api","authors":["Huseyin Akdogan"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2nc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Store, search, and analyze your data with ease using Elasticsearch 5.x About This Book Get to grips with the basics of Elasticsearch concepts and its APIs, and use them to create efficient applications Create large-scale Elasticsearch clusters and perform analytics using aggregation This comprehensive guide will get you up and running with Elasticsearch 5.x in no time Who This Book Is For If you want to build efficient search and analytics applications using Elasticsearch, this book is for you. It will also benefit developers who have worked with Lucene or Solr before and now want to work with Elasticsearch. No previous knowledge of Elasticsearch is expected. What You Will Learn See how to set up and configure Elasticsearch and Kibana Know how to ingest structured and unstructured data using Elasticsearch Understand how a search engine works and the concepts of relevance and scoring Find out how to query Elasticsearch with a high degree of performance and scalability Improve the user experience by using autocomplete, geolocation queries, and much more See how to slice and dice your data using Elasticsearch aggregations. Grasp how to use Kibana to explore and visualize your data Know how to host on Elastic Cloud and how to use the latest X-Pack features such as Graph and Alerting In Detail Elasticsearch is a modern, fast, distributed, scalable, fault tolerant, and open source search and analytics engine. You can use Elasticsearch for small or large applications with billions of documents. It is built to scale horizontally and can handle both structured and unstructured data. Packed with easy-to- follow examples, this book will ensure you will have a firm understanding of the basics of Elasticsearch and know how to utilize its capabilities efficiently. You will install and set up Elasticsearch and Kibana, and handle documents using the Distributed Document Store. You will see how to query, search, and index your data, and perform aggregation-based analytics with ease. You will see how to use Kibana to explore and visualize your data. Further on, you will learn to handle document relationships, work with geospatial data, and much more, with this easy-to-follow guide. Finally, you will see how you can set up and scale your Elasticsearch clusters in production environments. Style and approach This comprehensive guide will get you started with Elasticsearch 5.x, so you build a solid understanding of the basics. Every topic is explained in depth and is supplemented with practical examples to enhance your understanding.","language":"en","currency":"USD","id":"1787129918","title":"Learning Elasticsearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2nc5DwAAQBAJ&source=gbs_api","authors":["Abhishek Andhavarapu"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PEFK3MuwBsIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"ElasticSearch is an open source search server built on Apache Lucene. It was built to provide a scalable search solution with built-in support for near real-time search and multi-tenancy.Jumping into the world of ElasticSearch by setting up your own custom cluster, this book will show you how to create a fast, scalable, and flexible search solution. By learning the ins-and-outs of data indexing and analysis, \"ElasticSearch Server\" will start you on your journey to mastering the powerful capabilities of ElasticSearch. With practical chapters covering how to search data, extend your search, and go deep into cluster administration and search analysis, this book is perfect for those new and experienced with search servers.In \"ElasticSearch Server\" you will learn how to revolutionize your website or application with faster, more accurate, and flexible search functionality. Starting with chapters on setting up your own ElasticSearch cluster and searching and extending your search parameters you will quickly be able to create a fast, scalable, and completely custom search solution.Building on your knowledge further you will learn about ElasticSearch's query API and become confident using powerful filtering and faceting capabilities. You will develop practical knowledge on how to make use of ElasticSearch's near real-time capabilities and support for multi-tenancy.Your journey then concludes with chapters that help you monitor and tune your ElasticSearch cluster as well as advanced topics such as shard allocation, gateway configuration, and the discovery module.","language":"en","currency":"USD","id":"1849518440","title":"Elasticsearch Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PEFK3MuwBsIC&source=gbs_api","authors":["Rafal Kuc","Marek Rogozinski"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nk5sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is a detailed, practical, hands-on guide packed with real-life scenarios and examples which will show you how to implement an ElasticSearch search engine on your own websites. If you are a web developer or a user who wants to learn more about ElasticSearch, then this is the book for you. You do not need to know anything about ElastiSeach, Java, or Apache Lucene in order to use this book, though basic knowledge about databases and queries is required.","language":"en","currency":"USD","id":"1783980532","title":"Elasticsearch Server: Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nk5sAwAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vIOxDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Learn how to install, configure and implement the Elastic Stack (Elasticsearch, Logstash and Kibana) – the invaluable tool for anyone deploying a centralized log management solution for servers and apps. You will see how to use and configure Elastic Stack independently and alongside Puppet. Each chapter includes real-world examples and practical troubleshooting tips, enabling you to get up and running with Elastic Stack in record time. Fully customizable and easy to use, Elastic Stack enables you to be on top of your servers all the time, and resolve problems for your clients as fast as possible. Supported by Puppet and available with various plugins. Get started with Beginning Elastic Stack today and see why many consider Elastic Stack the best option for server log management. What You Will Learn: Install and configure Logstash Use Logstash with Elasticsearch and Kibana Use Logstash with Puppet and Foreman Centralize data processing Who This Book Is For: Anyone working on multiple servers who needs to search their logs using a web interface. It is ideal for server administrators who have just started their job and need to look after multiple servers efficiently.","language":"en","currency":"USD","id":"1484216946","title":"Beginning Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vIOxDQAAQBAJ&source=gbs_api","authors":["Vishal Sharma"]},{"pageCount":60,"thumbnail":"http:\/\/books.google.com\/books\/content?id=N9iYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Event Data, Stream Processing, and Data Integration","description":"Why a book about logs? That’s easy: the humble log is an abstraction that lies at the heart of many systems, from NoSQL databases to cryptocurrencies. Even though most engineers don’t think much about them, this short book shows you why logs are worthy of your attention. Based on his popular blog posts, LinkedIn principal engineer Jay Kreps shows you how logs work in distributed systems, and then delivers practical applications of these concepts in a variety of common uses—data integration, enterprise architecture, real-time stream processing, data system design, and abstract computing models. Go ahead and take the plunge with logs; you’re going love them. Learn how logs are used for programmatic access in databases and distributed systems Discover solutions to the huge data integration problem when more data of more varieties meet more systems Understand why logs are at the heart of real-time stream processing Learn the role of a log in the internals of online data systems Explore how Jay Kreps applies these ideas to his own work on data infrastructure systems at LinkedIn","language":"en","currency":"USD","id":"1491909331","title":"I Heart Logs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=N9iYBAAAQBAJ&source=gbs_api","authors":["Jay Kreps"]},{"pageCount":724,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ul9aBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Distributed Real-Time Search and Analytics Engine","description":"Whether you need full-text search or real-time analytics of structured data—or both—the Elasticsearch distributed search engine is an ideal way to put your data to work. This practical guide not only shows you how to search, analyze, and explore data with Elasticsearch, but also helps you deal with the complexities of human language, geolocation, and relationships. If you’re a newcomer to both search and distributed systems, you’ll quickly learn how to integrate Elasticsearch into your application. More experienced users will pick up lots of advanced techniques. Throughout the book, you’ll follow a problem-based approach to learn why, when, and how to use Elasticsearch features. Understand how Elasticsearch interprets data in your documents Index and query your data to take advantage of search concepts such as relevance and word proximity Handle human language through the effective use of analyzers and queries Summarize and group data to show overall trends, with aggregations and analytics Use geo-points and geo-shapes—Elasticsearch’s approaches to geolocation Model your data to take advantage of Elasticsearch’s horizontal scalability Learn how to configure and monitor your cluster in production","language":"en","currency":"USD","id":"1449358500","title":"Elasticsearch: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ul9aBgAAQBAJ&source=gbs_api","authors":["Clinton Gormley","Zachary Tong"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=om1LDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Leverage Elasticsearch to create a robust, fast, and flexible search solution with ease About This Book Boost the searching capabilities of your system through synonyms, multilingual data handling, nested objects and parent-child documents Deep dive into the world of data aggregation and data analysis with ElasticSearch Explore a wide range of ElasticSearch modules that define the behavior of a cluster Who This Book Is For If you are a competent developer and want to learn about the great and exciting world of ElasticSearch, then this book is for you. No prior knowledge of Java or Apache Lucene is needed. What You Will Learn Configure, create, and retrieve data from your indices Use an ElasticSearch query DSL to create a wide range of queries Discover the highlighting and geographical search features offered by ElasticSearch Find out how to index data that is not flat or data that has a relationship Exploit a prospective search to search for queries not documents Use the aggregations framework to get more from your data and improve your client's search experience Monitor your cluster state and health using the ElasticSearch API as well as third-party monitoring solutions Discover how to properly set up ElasticSearch for various use cases In Detail ElasticSearch is a very fast and scalable open source search engine, designed with distribution and cloud in mind, complete with all the goodies that Apache Lucene has to offer. ElasticSearch's schema-free architecture allows developers to index and search unstructured content, making it perfectly suited for both small projects and large big data warehouses, even those with petabytes of unstructured data. This book will guide you through the world of the most commonly used ElasticSearch server functionalities. You'll start off by getting an understanding of the basics of ElasticSearch and its data indexing functionality. Next, you will see the querying capabilities of ElasticSearch, followed by a through explanation of scoring and search relevance. After this, you will explore the aggregation and data analysis capabilities of ElasticSearch and will learn how cluster administration and scaling can be used to boost your application performance. You'll find out how to use the friendly REST APIs and how to tune ElasticSearch to make the most of it. By the end of this book, you will have be able to create amazing search solutions as per your project's specifications. Style and approach This step-by-step guide is full of screenshots and real-world examples to take you on a journey through the wonderful world of full text search provided by ElasticSearch.","language":"en","currency":"USD","id":"1785883623","title":"Elasticsearch Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=om1LDAAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogozinski"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NRO8AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A practical tutorial that covers the difficult design, implementation, and management of search solutions.Mastering ElasticSearch is aimed at to intermediate users who want to extend their knowledge about ElasticSearch. The topics that are described in the book are detailed, but we assume that you already know the basics, like the query DSL or data indexing. Advanced users will also find this book useful, as the examples are getting deep into the internals where it is needed.","language":"en","currency":"USD","id":"1783281448","title":"Mastering ElasticSearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NRO8AQAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":422,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fF5uAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"Written in an engaging, easy-to-follow style, the recipes will help you to extend the capabilities of ElasticSearch to manage your data effectively. If you are a developer who implements ElasticSearch in your web applications, manage data, or have decided to start using ElasticSearch, this book is ideal for you. This book assumes that you’ve got working knowledge of JSON and Java","language":"en","currency":"USD","id":"1782166637","title":"ElasticSearch Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fF5uAgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HP5_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Integrate Elasticsearch into Hadoop to effectively visualize and analyze your data About This Book Build production-ready analytics applications by integrating the Hadoop ecosystem with Elasticsearch Learn complex Elasticsearch queries and develop real-time monitoring Kibana dashboards to visualize your data Use Elasticsearch and Kibana to search data in Hadoop easily with this comprehensive, step-by-step guide Who This Book Is For This book is targeted at Java developers with basic knowledge on Hadoop. No prior Elasticsearch experience is expected. What You Will Learn Set up the Elasticsearch-Hadoop environment Import HDFS data into Elasticsearch with MapReduce jobs Perform full-text search and aggregations efficiently using Elasticsearch Visualize data and create interactive dashboards using Kibana Check and detect anomalies in streaming data using Storm and Elasticsearch Inject and classify real-time streaming data into Elasticsearch Get production-ready for Elasticsearch-Hadoop based projects Integrate with Hadoop eco-system such as Pig, Storm, Hive, and Spark In Detail The Hadoop ecosystem is a de-facto standard for processing terra-bytes and peta-bytes of data. Lucene-enabled Elasticsearch is becoming an industry standard for its full-text search and aggregation capabilities. Elasticsearch-Hadoop serves as a perfect tool to bridge the worlds of Elasticsearch and Hadoop ecosystem to get best out of both the worlds. Powered with Kibana, this stack makes it a cakewalk to get surprising insights out of your massive amount of Hadoop ecosystem in a flash. In this book, you'll learn to use Elasticsearch, Kibana and Elasticsearch-Hadoop effectively to analyze and understand your HDFS and streaming data. You begin with an in-depth understanding of the Hadoop, Elasticsearch, Marvel, and Kibana setup. Right after this, you will learn to successfully import Hadoop data into Elasticsearch by writing MapReduce job in a real-world example. This is then followed by a comprehensive look at Elasticsearch essentials, such as full-text search analysis, queries, filters and aggregations; after which you gain an understanding of creating various visualizations and interactive dashboard using Kibana. Classifying your real-world streaming data and identifying trends in it using Storm and Elasticsearch are some of the other topics that we'll cover. You will also gain an insight about key concepts of Elasticsearch and Elasticsearch-hadoop in distributed mode, advanced configurations along with some common configuration presets you may need for your production deployments. You will have “Go production checklist” and high-level view for cluster administration for post-production. Towards the end, you will learn to integrate Elasticsearch with other Hadoop eco-system tools, such as Pig, Hive and Spark. Style and approach A concise yet comprehensive approach has been adopted with real-time examples to help you grasp the concepts easily.","language":"en","currency":"USD","id":"1785282247","title":"Elasticsearch for Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HP5_CwAAQBAJ&source=gbs_api","authors":["Vishal Shukla"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Visualize your Elasticsearch data with ease","description":"A quick start guide to visualize your Elasticsearch data Key Features Your hands-on guide to visualizing the Elasticsearch data as well as navigating the Elastic stack Work with different Kibana plugins and create effective machine learning jobs using Kibana Build effective dashboards and reports without any hassle Book Description The Elastic Stack is growing rapidly and, day by day, additional tools are being added to make it more effective. This book endeavors to explain all the important aspects of Kibana, which is essential for utilizing its full potential. This book covers the core concepts of Kibana, with chapters set out in a coherent manner so that readers can advance their learning in a step-by-step manner. The focus is on a practical approach, thereby enabling the reader to apply those examples in real time for a better understanding of the concepts and to provide them with the correct skills in relation to the tool. With its succinct explanations, it is quite easy for a reader to use this book as a reference guide for learning basic to advanced implementations of Kibana. The practical examples, such as the creation of Kibana dashboards from CSV data, application RDBMS data, system metrics data, log file data, APM agents, and search results, can provide readers with a number of different drop-off points from where they can fetch any type of data into Kibana for the purpose of analysis or dashboarding. What you will learn Explore how Logstash is configured to fetch CSV data Understand how to create index patterns in Kibana Become familiar with how to apply filters on data Discover how to create ML jobs Explore how to analyze APM data from APM agents Get to grips with how to save, share, inspect, and edit visualizations Understand how to find an anomaly in data Who this book is for Kibana 7 Quick Start Guide is for developers new to Kibana who want to learn the fundamentals of using the tool for visualization, as well as existing Elastic developers.","language":"en","currency":"USD","id":"1789808499","title":"Kibana 7 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZGSGDwAAQBAJ&source=gbs_api","authors":["Anurag Srivastava"]},{"pageCount":522,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Get the most out of the Elastic Stack for various complex analytics using this comprehensive and practical guide About This Book Your one-stop solution to perform advanced analytics with Elasticsearch, Logstash, and Kibana Learn how to make better sense of your data by searching, analyzing, and logging data in a systematic way This highly practical guide takes you through an advanced implementation on the ELK stack in your enterprise environment Who This Book Is For This book cater to developers using the Elastic stack in their day-to-day work who are familiar with the basics of Elasticsearch, Logstash, and Kibana, and now want to become an expert at using the Elastic stack for data analytics. What You Will Learn Build a pipeline with help of Logstash and Beats to visualize Elasticsearch data in Kibana Use Beats to ship any type of data to the Elastic stack Understand Elasticsearch APIs, modules, and other advanced concepts Explore Logstash and it's plugins Discover how to utilize the new Kibana UI for advanced analytics See how to work with the Elastic Stack using other advanced configurations Customize the Elastic Stack and plugin development for each of the component Work with the Elastic Stack in a production environment Explore the various components of X-Pack in detail. In Detail Even structured data is useless if it can't help you to take strategic decisions and improve existing system. If you love to play with data, or your job requires you to process custom log formats, design a scalable analysis system, and manage logs to do real-time data analysis, this book is your one-stop solution. By combining the massively popular Elasticsearch, Logstash, Beats, and Kibana, elastic.co has advanced the end-to-end stack that delivers actionable insights in real time from almost any type of structured or unstructured data source. If your job requires you to process custom log formats, design a scalable analysis system, explore a variety of data, and manage logs, this book is your one-stop solution. You will learn how to create real-time dashboards and how to manage the life cycle of logs in detail through real-life scenarios. This book brushes up your basic knowledge on implementing the Elastic Stack and then dives deeper into complex and advanced implementations of the Elastic Stack. We'll help you to solve data analytics challenges using the Elastic Stack and provide practical steps on centralized logging and real-time analytics with the Elastic Stack in production. You will get to grip with advanced techniques for log analysis and visualization. Newly announced features such as Beats and X-Pack are also covered in detail with examples. Toward the end, you will see how to use the Elastic stack for real-world case studies and we'll show you some best practices and troubleshooting techniques for the Elastic Stack. Style and approach This practical guide shows you how to perform advanced analytics with the Elastic stack through real-world use cases. It includes common and some not so common scenarios to use the Elastic stack for data analysis.","language":"en","currency":"USD","id":"1786468050","title":"Mastering Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVQoDwAAQBAJ&source=gbs_api","authors":["Yuvraj Gupta","Ravi Kumar Gupta"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BJdMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 90 proven recipes to get you scraping with Python, microservices, Docker, and AWS","description":"Untangle your web scraping complexities and access web data with ease using Python scripts Key Features Hands-on recipes for advancing your web scraping skills to expert level One-stop solution guide to address complex and challenging web scraping tasks using Python Understand web page structures and collect data from a website with ease Book Description Python Web Scraping Cookbook is a solution-focused book that will teach you techniques to develop high-performance Scrapers, and deal with cookies, hidden form fields, Ajax-based sites and proxies. You'll explore a number of real-world scenarios where every part of the development or product life cycle will be fully covered. You will not only develop the skills to design reliable, high-performing data flows, but also deploy your codebase to Amazon Web Services (AWS). If you are involved in software engineering, product development, or data mining or in building data-driven products, you will find this book useful as each recipe has a clear purpose and objective. Right from extracting data from websites to writing a sophisticated web crawler, the book's independent recipes will be extremely helpful while on the job. This book covers Python libraries, requests, and BeautifulSoup. You will learn about crawling, web spidering, working with AJAX websites, and paginated items. You will also understand to tackle problems such as 403 errors, working with proxy, scraping images, and LXML. By the end of this book, you will be able to scrape websites more efficiently and deploy and operate your scraper in the cloud. What you will learn Use a variety of tools to scrape any website and data, including Scrapy and Selenium Master expression languages, such as XPath and CSS, and regular expressions to extract web data Deal with scraping traps such as hidden form fields, throttling, pagination, and different status codes Build robust scraping pipelines with SQS and RabbitMQ Scrape assets like image media and learn what to do when Scraper fails to run Explore ETL techniques of building a customized crawler, parser, and convert structured and unstructured data from websites Deploy and run your scraper as a service in AWS Elastic Container Service Who this book is for This book is ideal for Python programmers, web administrators, security professionals, and anyone who wants to perform web analytics. Familiarity with Python and basic understanding of web scraping will be useful to make the best of this book.","language":"en","currency":"USD","id":"1787286630","title":"Python Web Scraping Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BJdMDwAAQBAJ&source=gbs_api","authors":["Michael Heydt"]},{"pageCount":596,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.34,"subtitle":null,"description":"A practical guide to implementing your enterprise data lake using Lambda Architecture as the base About This Book Build a full-fledged data lake for your organization with popular big data technologies using the Lambda architecture as the base Delve into the big data technologies required to meet modern day business strategies A highly practical guide to implementing enterprise data lakes with lots of examples and real-world use-cases Who This Book Is For Java developers and architects who would like to implement a data lake for their enterprise will find this book useful. If you want to get hands-on experience with the Lambda Architecture and big data technologies by implementing a practical solution using these technologies, this book will also help you. What You Will Learn Build an enterprise-level data lake using the relevant big data technologies Understand the core of the Lambda architecture and how to apply it in an enterprise Learn the technical details around Sqoop and its functionalities Integrate Kafka with Hadoop components to acquire enterprise data Use flume with streaming technologies for stream-based processing Understand stream- based processing with reference to Apache Spark Streaming Incorporate Hadoop components and know the advantages they provide for enterprise data lakes Build fast, streaming, and high-performance applications using ElasticSearch Make your data ingestion process consistent across various data formats with configurability Process your data to derive intelligence using machine learning algorithms In Detail The term \"Data Lake\" has recently emerged as a prominent term in the big data industry. Data scientists can make use of it in deriving meaningful insights that can be used by businesses to redefine or transform the way they operate. Lambda architecture is also emerging as one of the very eminent patterns in the big data landscape, as it not only helps to derive useful information from historical data but also correlates real-time data to enable business to take critical decisions. This book tries to bring these two important aspects — data lake and lambda architecture—together. This book is divided into three main sections. The first introduces you to the concept of data lakes, the importance of data lakes in enterprises, and getting you up-to-speed with the Lambda architecture. The second section delves into the principal components of building a data lake using the Lambda architecture. It introduces you to popular big data technologies such as Apache Hadoop, Spark, Sqoop, Flume, and ElasticSearch. The third section is a highly practical demonstration of putting it all together, and shows you how an enterprise data lake can be implemented, along with several real-world use-cases. It also shows you how other peripheral components can be added to the lake to make it more efficient. By the end of this book, you will be able to choose the right big data technologies using the lambda architectural patterns to build your enterprise data lake. Style and approach The book takes a pragmatic approach, showing ways to leverage big data technologies and lambda architecture to build an enterprise-level data lake.","language":"en","currency":"USD","id":"1787282651","title":"Data Lake for Enterprises","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nHc5DwAAQBAJ&source=gbs_api","authors":["Tomcy John","Pankaj Misra"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9JlGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Distributed Computing and Event Processing using Apache Spark, Flink, Storm, and Kafka","description":"A practical guide to help you tackle different real-time data processing and analytics problems using the best tools for each scenario About This Book Learn about the various challenges in real-time data processing and use the right tools to overcome them This book covers popular tools and frameworks such as Spark, Flink, and Apache Storm to solve all your distributed processing problems A practical guide filled with examples, tips, and tricks to help you perform efficient Big Data processing in real-time Who This Book Is For If you are a Java developer who would like to be equipped with all the tools required to devise an end-to-end practical solution on real-time data streaming, then this book is for you. Basic knowledge of real-time processing would be helpful, and knowing the fundamentals of Maven, Shell, and Eclipse would be great. What You Will Learn Get an introduction to the established real-time stack Understand the key integration of all the components Get a thorough understanding of the basic building blocks for real-time solution designing Garnish the search and visualization aspects for your real-time solution Get conceptually and practically acquainted with real-time analytics Be well equipped to apply the knowledge and create your own solutions In Detail With the rise of Big Data, there is an increasing need to process large amounts of data continuously, with a shorter turnaround time. Real-time data processing involves continuous input, processing and output of data, with the condition that the time required for processing is as short as possible. This book covers the majority of the existing and evolving open source technology stack for real-time processing and analytics. You will get to know about all the real-time solution aspects, from the source to the presentation to persistence. Through this practical book, you'll be equipped with a clear understanding of how to solve challenges on your own. We'll cover topics such as how to set up components, basic executions, integrations, advanced use cases, alerts, and monitoring. You'll be exposed to the popular tools used in real-time processing today such as Apache Spark, Apache Flink, and Storm. Finally, you will put your knowledge to practical use by implementing all of the techniques in the form of a practical, real-world use case. By the end of this book, you will have a solid understanding of all the aspects of real-time data processing and analytics, and will know how to deploy the solutions in production environments in the best possible manner. Style and Approach In this practical guide to real-time analytics, each chapter begins with a basic high-level concept of the topic, followed by a practical, hands-on implementation of each concept, where you can see the working and execution of it. The book is written in a DIY style, with plenty of practical use cases, well-explained code examples, and relevant screenshots and diagrams.","language":"en","currency":"USD","id":"1787289869","title":"Practical Real-time Data Processing and Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9JlGDwAAQBAJ&source=gbs_api","authors":["Shilpi Saxena","Saurabh Gupta"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EfqoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mesmerizing visualizations, analytics, and logs from your data using Elasticsearch, Logstash, and Kibana About This Book Solve all your data analytics problems with the ELK stack Explore the power of Kibana4 search and visualizations built over Elasticsearch queries and learn about the features and plugins of Logstash Develop a complete data pipeline using the ELK stack Who This Book Is For If you are a developer or DevOps engineer interested in building a system that provides amazing insights and business metrics out of data sources, of various formats and types, using the open source technology stack that ELK provides, then this book is for you. Basic knowledge of Unix or any programming language will be helpful to make the most out of this book. What You Will Learn Install, configure, and run Elasticsearch, Logstash, and Kibana Understand the need for log analytics and the current challenges in log analysis Build your own data pipeline using the ELK stack Familiarize yourself with the key features of Logstash and the variety of input, filter, and output plugins it provides Build your own custom Logstash plugin Create actionable insights using charts, histograms, and quick search features in Kibana4 Understand the role of Elasticsearch in the ELK stack In Detail The ELK stack—Elasticsearch, Logstash, and Kibana, is a powerful combination of open source tools. Elasticsearch is for deep search and data analytics. Logstash is for centralized logging, log enrichment, and parsing. Kibana is for powerful and beautiful data visualizations. In short, the Elasticsearch ELK stack makes searching and analyzing data easier than ever before. This book will introduce you to the ELK (Elasticsearch, Logstash, and Kibana) stack, starting by showing you how to set up the stack by installing the tools, and basic configuration. You'll move on to building a basic data pipeline using the ELK stack. Next, you'll explore the key features of Logstash and its role in the ELK stack, including creating Logstash plugins, which will enable you to use your own customized plugins. The importance of Elasticsearch and Kibana in the ELK stack is also covered, along with various types of advanced data analysis, and a variety of charts, tables ,and maps. Finally, by the end of the book you will be able to develop full-fledged data pipeline using the ELK stack and have a solid understanding of the role of each of the components. Style and approach This book is a step-by-step guide, complete with various examples to solve your data analytics problems by using the ELK stack to explore and visualize data.","language":"en","currency":"USD","id":"1785886703","title":"Learning ELK Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EfqoCwAAQBAJ&source=gbs_api","authors":["Saurabh Chhajed"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T1fTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Big Data enthusiast and wish to use Hadoop v2 to solve your problems, then this book is for you. This book is for Java programmers with little to moderate knowledge of Hadoop MapReduce. This is also a one-stop reference for developers and system admins who want to quickly get up to speed with using Hadoop v2. It would be helpful to have a basic knowledge of software development using Java and a basic working knowledge of Linux.","language":"en","currency":"USD","id":"1783285486","title":"Hadoop MapReduce v2 Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T1fTBgAAQBAJ&source=gbs_api","authors":["Thilina Gunarathne"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=u1bTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.94,"subtitle":null,"description":"If you are a Hadoop programmer who wants to learn about Flume to be able to move datasets into Hadoop in a timely and replicable manner, then this book is ideal for you. No prior knowledge about Apache Flume is necessary, but a basic knowledge of Hadoop and the Hadoop File System (HDFS) is assumed.","language":"en","currency":"USD","id":"1784399140","title":"Apache Flume: Distributed Log Collection for Hadoop - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=u1bTBgAAQBAJ&source=gbs_api","authors":["Steve Hoffman"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-MyqDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Monitor your Elasticsearch cluster's health, and diagnose and solve its performance and reliability issues About This Book Understand common performance and reliability pitfalls in ElasticSearch Use popular monitoring tools such as ElasticSearch-head, BigDesk, Marvel, Kibana, and more This is a step-by-step guide with lots of case studies on solving real-world ElasticSearch cluster issues Who This Book Is For This book is for developers and system administrators who use ElasticSearch in a wide range of capacities. Prior knowledge of ElasticSearch and related technologies would be helpful, but is not necessary. What You Will Learn Explore your cluster with ElasticSearch-head and BigDesk Access the underlying data of the ElasticSearch monitoring plugins using the ElasticSearch API Analyze your cluster's performance with Marvel Troubleshoot some of the common performance and reliability issues that come up when using ElasticSearch Analyze a cluster's historical performance, and get to the bottom of and recover from system failures Use and install various other tools and plugins such as Kibana and Kopf, which is helpful to monitor ElasticSearch In Detail ElasticSearch is a distributed search server similar to Apache Solr with a focus on large datasets, a schema-less setup, and high availability. This schema-free architecture allows ElasticSearch to index and search unstructured content, making it perfectly suited for both small projects and large big data warehouses with petabytes of unstructured data. This book is your toolkit to teach you how to keep your cluster in good health, and show you how to diagnose and treat unexpected issues along the way. You will start by getting introduced to ElasticSearch, and look at some common performance issues that pop up when using the system. You will then see how to install and configure ElasticSearch and the ElasticSearch monitoring plugins. Then, you will proceed to install and use the Marvel dashboard to monitor ElasticSearch. You will find out how to troubleshoot some of the common performance and reliability issues that come up when using ElasticSearch. Finally, you will analyze your cluster's historical performance, and get to know how to get to the bottom of and recover from system failures. This book will guide you through several monitoring tools, and utilizes real-world cases and dilemmas faced when using ElasticSearch, showing you how to solve them simply, quickly, and cleanly. Style and approach This is a step-by-step guide to monitoring your ElasticSearch cluster and correcting performance issues. It is filled with lots of in-depth, real-world use-cases on solving different ElasticSearch cluster issues.","language":"en","currency":"USD","id":"1784391816","title":"Monitoring Elasticsearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-MyqDQAAQBAJ&source=gbs_api","authors":["Dan Noble"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J4fiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Fundamental Technology Concepts that Protect Containerized Applications","description":"To facilitate scalability and resilience, many organizations now run applications in cloud native environments using containers and orchestration. But how do you know if the deployment is secure? This practical book examines key underlying technologies to help developers, operators, and security professionals assess security risks and determine appropriate solutions. Author Liz Rice, VP of open source engineering at Aqua Security, looks at how the building blocks commonly used in container-based systems are constructed in Linux. You’ll understand what’s happening when you deploy containers and learn how to assess potential security risks that could affect your deployments. If you run container applications with kubectl or docker and use Linux command-line tools such as ps and grep, you’re ready to get started. Explore attack vectors that affect container deployments Dive into the Linux constructs that underpin containers Examine measures for hardening containers Understand how misconfigurations can compromise container isolation Learn best practices for building container images Identify container images that have known software vulnerabilities Leverage secure connections between containers Use security tooling to prevent attacks on your deployment","language":"en","currency":"USD","id":"1492056715","title":"Container Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J4fiDwAAQBAJ&source=gbs_api","authors":["Liz Rice"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LiJ-BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"DevOps for VMware® Administrators is the first book focused on using DevOps tools and practices with VMware technologies. The authors introduce high-value tools from third parties and VMware itself, and guide you through using them to improve the performance of all your virtualized systems and applications. You’ll walk through automating and optimizing configuration management, provisioning, log management, continuous integration, and more. The authors also offer step-by-step coverage of deploying and managing applications at scale with Docker containers and Google Kubernetes. They conclude with an up-to-the-minute discussion of VMware’s newest DevOps initiatives, including VMware vRealize Automation and VMware vRealize Code Stream. Coverage includes • Understanding the challenges that DevOps tools and practices can help VMware administrators to solve • Using Vagrant to quickly deploy Dev and Test environments that match production system specifications • Writing Chef “recipes” that streamline server configuration and maintenance • Simplifying Unix\/Linux configuration management and orchestration with Ansible • Implementing Docker containers for faster and easier application management • Automating provisioning across the full lifecycle with Razor • Integrating Microsoft PowerShell Desired State Configuration (DSC) and VMware PowerCLI to automate key Windows Server and vSphere VM admin tasks • Using Puppet to automate infrastructure provisioning, configuration, orchestration, and reporting • Supercharging log management with ELK (Elasticsearch, Logstash, Kibana) • Supporting DevOps source code management with Git and continuous integration practices with Jenkins • Achieving continuous integration, delivery, and deployment with VMware’s vRealize Code Stream","language":"en","currency":"USD","id":"0133795268","title":"DevOps for VMware Administrators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LiJ-BwAAQBAJ&source=gbs_api","authors":["Trevor A. Roberts Jr.","Josh Atwell","Egle Sigler","Yvo van Doorn"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kU_lAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"This book is an easy-to-understand, practical guide to designing, testing, and implementing complex MapReduce applications in Scala using the Scalding framework. It is packed with examples featuring log-processing, ad-targeting, and machine learning. This book is for developers who are willing to discover how to effectively develop MapReduce applications. Prior knowledge of Hadoop or Scala is not required; however, investing some time on those topics would certainly be beneficial.","language":"en","currency":"USD","id":"1783287020","title":"Programming MapReduce with Scalding","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kU_lAwAAQBAJ&source=gbs_api","authors":["Antonios Chalkiopoulos"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x9hpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a .NET developer who is looking for a simpler way to build services, this is the book for you. It will show you how to write fast, maintainable APIs that are a pleasure to use and maintain starting from the database to the client and everything in-between.","language":"en","currency":"USD","id":"1783986573","title":"ServiceStack 4 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x9hpBgAAQBAJ&source=gbs_api","authors":["Kyle Hodgson","Darren Reid"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K7FKDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn to design, build, and manage your infrastructure on the most popular of all the Cloud platforms—Amazon Web Services About This Book Learn how to leverage various Amazon Web Services (AWS) components and services to build a secure, reliable, and robust environment to host your applications on Deep dive into the core AWS service offerings with hands-on tutorials, real-world use case scenarios, and best practices A self-paced, systematic, and step-by-step guide to learning and implementing AWS in your own environment Who This Book Is For This book is for those who want to learn and leverage AWS. Although no prior experience with AWS is required, it is recommended that you have some hands-on experienceofLinux, Web Services, and basic networking What You Will Learn A brief introduction to Cloud Computing and AWS accompanied by steps to sign up for your first AWS account Create and manage users, groups, and permissions using AWSS Identity and Access Management services Get started with deploying and accessing EC2 instances, working with EBS Volumes and Snapshots Customize and create your very own Amazon Machine Image Design and deploy your instances on a highly secured, network isolated environment using Amazon VPC Effectively monitor your AWS environment using specialized alarms, custom monitoring metrics, and much more Explore the various benefits of Database-as-a-Service offerings and leverage them using Amazon RDS and Amazon DynamoDB Take an in-depth look at what's new with AWS, including EC2 Container Service and Elastic File System In Detail AWS is at the forefront of Cloud Computing today. Many businesses are moving away from traditional datacenters and toward AWS because of its reliability, vast service offerings, lower costs, and high rate of innovation. Because of its versatility and flexible design, AWS can be used to accomplish a variety of simple and complicated tasks such as hosting multitier websites, running large scale parallel processing, content delivery, petabyte storage and archival, and lots more. Whether you are a seasoned sysadmin or a rookie, this book will provide you with all the necessary skills to design, deploy, and manage your applications on the AWS cloud platform. The book guides you through the core AWS services such as IAM, EC2, VPC, RDS, and S3 using a simple real world application hosting example that you can relate to. Each chapter is designed to provide you with the most information possible about a particular AWS service coupled with easy to follow hands-on steps, best practices, tips, and recommendations. By the end of the book, you will be able to create a highly secure, fault tolerant, and scalable environment for your applications to run on. Style and approach This in-depth and insightful guide is filled with easy-to-follow examples, real-world use cases, best practices, and recommendations that will help you design and leverage AWS.","language":"en","currency":"USD","id":"1782173765","title":"AWS Administration – The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K7FKDAAAQBAJ&source=gbs_api","authors":["Yohan Wadia"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S-ZrBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"If you want to discover one of the latest tools designed to produce stunning Big Data insights, this book features everything you need to get to grips with your data. Whether you are a data architect, developer, or a business strategist, HDInsight adds value in everything from development, administration, and reporting.","language":"en","currency":"USD","id":"1784396664","title":"HDInsight Essentials - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S-ZrBgAAQBAJ&source=gbs_api","authors":["Rajesh Nadipalli"]},{"pageCount":532,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The truth about DevOps by the people on the front line","description":"Discover DevOps secrets from leading experts. Viktor Farcic interviews DevOps industries voices including Mike Kail, Greg Bledsoe, Jeff Sussna, James Turnbull, Kohsuke Kawaguchi, Liz Keogh, and more. Key Features Leading DevOps experts share their insights into modern DevOps practice Engage with the real-world challenges of putting DevOps to work Strengthen your DevOps practices now and prepare for future DevOps trends Book Description DevOps promises to break down silos, uniting organizations to deliver high quality output in a cross-functional way. In reality it often results in confusion and new silos: pockets of DevOps practitioners fight the status quo, senior decision-makers demand DevOps paint jobs without committing to true change. Even a clear definition of what DevOps is remains elusive. In DevOps Paradox, top DevOps consultants, industry leaders, and founders reveal their own approaches to all aspects of DevOps implementation and operation. Surround yourself with expert DevOps advisors. Viktor Farcic draws on experts from across the industry to discuss how to introduce DevOps to chaotic organizations, align incentives between teams, and make use of the latest tools and techniques. With each expert offering their own opinions on what DevOps is and how to make it work, you will be able to form your own informed view of the importance and value of DevOps as we enter a new decade. If you want to see how real DevOps experts address the challenges and resolve the paradoxes, this book is for you. What you will learn Expert opinions on: Introducing DevOps into real-world, chaotic business environments Deciding between adopting cutting edge tools or sticking with tried-and-tested methods Initiating necessary business change without positional power Managing and overcoming fear of change in DevOps implementations Anticipating future trends in DevOps and how to prepare for them Getting the most from Kubernetes, Docker, Puppet, Chef, and Ansible Creating the right incentives for DevOps success across an organization The impact of new techniques, such as Lambda, serverless, and schedulers, on DevOps practice Who this book is for Anybody interested in DevOps will gain a lot from this book. If you want to get beyond the simplistic ideals and engage with the deep challenges of putting DevOps to work in the real world, this book is for you.","language":"en","currency":"USD","id":"1789138809","title":"DevOps Paradox","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6isDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=othpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is for intermediate Solr Developers who are willing to learn and implement Pro-level practices, techniques, and solutions. This edition will specifically appeal to developers who wish to quickly get to grips with the changes and new features of Apache Solr 5.","language":"en","currency":"USD","id":"1783553162","title":"Solr Cookbook - Third Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=othpBgAAQBAJ&source=gbs_api","authors":["Rafał Kuć"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zyOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":"A hands-on guide to creating clean web applications with code examples in Java","description":"Gain insight into how hexagonal architecture can help to keep the cost of development low over the complete lifetime of an application Key Features Explore ways to make your software flexible, extensible, and adaptable Learn new concepts that you can easily blend with your own software development style Develop the mindset of building maintainable solutions instead of taking shortcuts Book Description We would all like to build software architecture that yields adaptable and flexible software with low development costs. But, unreasonable deadlines and shortcuts make it very hard to create such an architecture. Get Your Hands Dirty on Clean Architecture starts with a discussion about the conventional layered architecture style and its disadvantages. It also talks about the advantages of the domain-centric architecture styles of Robert C. Martin's Clean Architecture and Alistair Cockburn's Hexagonal Architecture. Then, the book dives into hands-on chapters that show you how to manifest a hexagonal architecture in actual code. You'll learn in detail about different mapping strategies between the layers of a hexagonal architecture and see how to assemble the architecture elements into an application. The later chapters demonstrate how to enforce architecture boundaries. You'll also learn what shortcuts produce what types of technical debt and how, sometimes, it is a good idea to willingly take on those debts. After reading this book, you'll have all the knowledge you need to create applications using the hexagonal architecture style of web development. What you will learn Identify potential shortcomings of using a layered architecture Apply methods to enforce architecture boundaries Find out how potential shortcuts can affect the software architecture Produce arguments for when to use which style of architecture Structure your code according to the architecture Apply various types of tests that will cover each element of the architecture Who this book is for This book is for you if you care about the architecture of the software you are building. To get the most out of this book, you must have some experience with web development. The code examples in this book are in Java. If you are not a Java programmer but can read object-oriented code in other languages, you will be fine. In the few places where Java or framework specifics are needed, they are thoroughly explained.","language":"en","currency":"USD","id":"1839212713","title":"Get Your Hands Dirty on Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zyOzDwAAQBAJ&source=gbs_api","authors":["Tom Hombergs"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kub2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Ein praktischer Einstieg","description":"Elasticsearch ist ein auf Apache Lucene basierender Suchserver, der JSON-Dokumente speichern und durchsuchen kann. Durch den verteilten Aufbau ist die Ablage sehr großer Datenmengen möglich. Neben Volltextinhalten können auch strukturierte Daten verwaltet und mit Aggregationen leicht gruppiert und ausgelesen werden. Dokumente, Suchanfragen und administrative Aufgaben werden in JSON formuliert und per HTTP oder über die Java-API ausgetauscht. Das Buch stellt anhand eines durchgehenden Beispiels die Nutzung von Elasticsearch vor. Nach einem einführenden Kapitel, in dem eine klassische Suchanwendung von Grund auf aufgebaut wird, werden in den anschließenden Kapiteln jeweils unterschiedliche Aspekte genauer beleuchtet. Unter anderem werden die folgenden Themenbereiche angesprochen: • Umgang mit Text • Relevanz in Suchergebnissen • Möglichkeiten der Indizierung • Verteilung der Daten • Datenmodellierung • Aggregationen • Aspekte des Produktivbetriebs • Logdaten in Elasticsearch Der Großteil des Buches ist unabhängig von der Programmiersprache gehalten, es wird jedoch auch auf die Java- und JavaScript-APIs zum Zugriff auf Elasticsearch eingegangen. Der Leser hat nach der Lektüre das notwendige Rüstzeug, um eigene Anwendungen auf Basis von Elasticsearch umzusetzen.","language":"de","currency":"USD","id":"386491826X","title":"Elasticsearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kub2DwAAQBAJ&source=gbs_api","authors":["Florian Hopf"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AmSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Practical solutions to building serverless applications using Java and AWS","description":"Build, secure, and deploy real-world serverless applications in AWS and peek into the serverless cloud offerings from Azure, Google Cloud, and IBM Cloud Key Features Build serverless applications with AWS Lambda, AWS CloudFormation and AWS CloudWatch Perform data analytics and natural language processing(NLP)on the AWS serverless platform Explore various design patterns and best practices involved in serverless computing Book Description Managing physical servers will be a thing of the past once you’re able to harness the power of serverless computing. If you’re already prepped with the basics of serverless computing, Serverless Programming Cookbook will help you take the next step ahead. This recipe-based guide provides solutions to problems you might face while building serverless applications. You'll begin by setting up Amazon Web Services (AWS), the primary cloud provider used for most recipes. The next set of recipes will cover various components to build a Serverless application including REST APIs, database, user management, authentication, web hosting, domain registration, DNS management, CDN, messaging, notifications and monitoring. The book also introduces you to the latest technology trends such as Data Streams, Machine Learning and NLP. You will also see patterns and practices for using various services in a real world application. Finally, to broaden your understanding of Serverless computing, you'll also cover getting started guides for other cloud providers such as Azure, Google Cloud Platform and IBM cloud. By the end of this book, you’ll have acquired the skills you need to build serverless applications efficiently using various cloud offerings. What you will learn Serverless computing in AWS and explore services with other clouds Develop full-stack apps with API Gateway, Cognito, Lambda and DynamoDB Web hosting with S3, CloudFront, Route 53 and AWS Certificate Manager SQS and SNS for effective communication between microservices Monitoring and troubleshooting with CloudWatch logs and metrics Explore Kinesis Streams, Amazon ML models and Alexa Skills Kit Who this book is for For developers looking for practical solutions to common problems while building a serverless application, this book provides helpful recipes. To get started with this intermediate-level book, knowledge of basic programming is a must.","language":"en","currency":"USD","id":"1788621530","title":"Serverless Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AmSGDwAAQBAJ&source=gbs_api","authors":["Heartin Kanikathottu"]},{"pageCount":294,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6TDYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you have created websites with Django, but you want to sharpen your knowledge and learn some good approaches for how to treat different aspects of web development, you should definitely read this book. It is intended for intermediate and professional Django users who need to build projects which must be multilingual, functional on devices of different screen sizes, and which scale over time.","language":"en","currency":"USD","id":"1783286903","title":"Web Development with Django Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6TDYBAAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4xQKBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Containerization Is the New Virtualization","description":"Updated for Docker Community Edition v18.09! Docker book designed for SysAdmins, SREs, Operations staff, Developers and DevOps who are interested in deploying the open source container service Docker. In this book, we'll walk you through installing, deploying, managing, and extending Docker. We're going to do that by first introducing you to the basics of Docker and its components. Then we'll start to use Docker to build containers and services to perform a variety of tasks. We're going to take you through the development lifecycle, from testing to production, and see where Docker fits in and how it can make your life easier. We'll make use of Docker to build test environments for new projects, demonstrate how to integrate Docker with continuous integration workflow, and then how to build application services and platforms. Finally, we'll show you how to use Docker's API and how to extend Docker yourself. We'll teach you how to: * Install Docker. * Take your first steps with a Docker container. * Build Docker images. * Manage and share Docker images. * Run and manage more complex Docker containers. * Deploy Docker containers as part of your testing pipeline. * Build multi-container applications and environments. * Learn about orchestration using Compose and Swarm for the orchestration of Docker containers and Consul for service discovery. * Explore the Docker API. * Getting Help and Extending Docker.","language":"en","currency":"USD","id":"098882020X","title":"The Docker Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4xQKBAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t1PoSh4uwVcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":45.6,"subtitle":null,"description":"Class-tested and coherent, this textbook teaches classical and web information retrieval, including web search and the related areas of text classification and text clustering from basic concepts. It gives an up-to-date treatment of all aspects of the design and implementation of systems for gathering, indexing, and searching documents; methods for evaluating systems; and an introduction to the use of machine learning methods on text collections. All the important ideas are explained using examples and figures, making it perfect for introductory courses in information retrieval for advanced undergraduates and graduate students in computer science. Based on feedback from extensive classroom experience, the book has been carefully structured in order to make teaching more natural and effective. Slides and additional exercises (with solutions for lecturers) are also available through the book's supporting website to help course instructors prepare their lectures.","language":"en","currency":"USD","id":"1139472100","title":"Introduction to Information Retrieval","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t1PoSh4uwVcC&source=gbs_api","authors":["Christopher D. Manning","Prabhakar Raghavan","Hinrich Schütze"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=slwLAqkT_Y0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Rails™ 3 Way is a comprehensive resource that digs into the new features in Rails 3 and perhaps more importantly, the rationale behind them. —Yehuda Katz, Rails Core The Bible for Ruby on Rails Application Development Ruby on Rails strips complexity from the development process, enabling professional developers to focus on what matters most: delivering business value via clean and maintainable code. The Rails™ 3 Way is the only comprehensive, authoritative guide to delivering production-quality code with Rails 3. Pioneering Rails expert Obie Fernandez and a team of leading experts illuminate the entire Rails 3 API, along with the idioms, design approaches, and libraries that make developing applications with Rails so powerful. Drawing on their unsurpassed experience and track record, they address the real challenges development teams face, showing how to use Rails 3 to maximize your productivity. Using numerous detailed code examples, the author systematically covers Rails 3 key capabilities and subsystems, making this book a reference that you will turn to again and again. He presents advanced Rails programming techniques that have been proven effective in day-to-day usage on dozens of production Rails systems and offers important insights into behavior-driven development and production considerations such as scalability. Dive deep into the Rails 3 codebase and discover why Rails is designed the way it is—and how to make it do what you want it to do. This book will help you Learn what’s new in Rails 3 Increase your productivity as a web application developer Realize the overall joy in programming with Rails Leverage Rails’ powerful capabilities for building REST-compliant APIs Drive implementation and protect long-term maintainability using RSpec Design and manipulate your domain layer using Active Record Understand and program complex program flows using Action Controller Master sophisticated URL routing concepts Use Ajax techniques via Rails 3 support for unobtrusive JavaScript Learn to extend Rails with popular gems and plugins, and how to write your own Extend Rails with the best third-party plug-ins and write your own Integrate email services into your applications with Action Mailer Improve application responsiveness with background processing Create your own non-Active Record domain classes using Active Model Master Rails’ utility classes and extensions in Active Support","language":"en","currency":"USD","id":"9780132480314","title":"The Rails 3 Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=slwLAqkT_Y0C&source=gbs_api","authors":["Obed (Obie) Fernandez"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xcaiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for both novice developers in general and experienced Spring developers. It will teach you how to override Spring Boot's opinions and frees you from the need to define complicated configurations.","language":"en","currency":"USD","id":"1784397482","title":"Learning Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xcaiBQAAQBAJ&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":170,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVvTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is for those application developers who want to achieve greater flexibility and scalability from their software. Whether you are familiar with other NoSQL databases or have only used relational systems, this book will provide you with enough background to move you along at your own pace. If you are new to NoSQL document databases, the design discussions and introductory material will give you the information you need to get started with Couchbase.","language":"en","currency":"USD","id":"1784397857","title":"Couchbase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVvTBgAAQBAJ&source=gbs_api","authors":["John Zablocki"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnnlCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This invaluable roadmap for startup engineers reveals how to successfully handle web application scalability challenges to meet increasing product and traffic demands. Web Scalability for Startup Engineers shows engineers working at startups and small companies how to plan and implement a comprehensive scalability strategy. It presents broad and holistic view of infrastructure and architecture of a scalable web application. Successful startups often face the challenge of scalability, and the core concepts driving a scalable architecture are language and platform agnostic. The book covers scalability of HTTP-based systems (websites, REST APIs, SaaS, and mobile application backends), starting with a high-level perspective before taking a deep dive into common challenges and issues. This approach builds a holistic view of the problem, helping you see the big picture, and then introduces different technologies and best practices for solving the problem at hand. The book is enriched with the author's real-world experience and expert advice, saving you precious time and effort by learning from others' mistakes and successes. Language-agnostic approach addresses universally challenging concepts in Web development\/scalability—does not require knowledge of a particular language Fills the gap for engineers in startups and smaller companies who have limited means for getting to the next level in terms of accomplishing scalability Strategies presented help to decrease time to market and increase the efficiency of web applications","language":"en","currency":"USD","id":"0071843663","title":"Web Scalability for Startup Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnnlCQAAQBAJ&source=gbs_api","authors":["Artur Ejsmont"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dnBlz-FLEnIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Working With Stakeholders Using Viewpoints and Perspectives","description":"Software Systems Architecture is a practitioner-oriented guide to designing and implementing effective architectures for information systems. It is both a readily accessible introduction to software architecture and an invaluable handbook of well-established best practices. It shows why the role of the architect is central to any successful information-systems development project, and, by presenting a set of architectural viewpoints and perspectives, provides specific direction for improving your own and your organization's approach to software systems architecture. With this book you will learn how to Design an architecture that reflects and balances the different needs of its stakeholders Communicate the architecture to stakeholders and demonstrate that it has met their requirements Focus on architecturally significant aspects of design, including frequently overlooked areas such as performance, resilience, and location Use scenarios and patterns to drive the creation and validation of your architecture Document your architecture as a set of related views Use perspectives to ensure that your architecture exhibits important qualities such as performance, scalability, and security The architectural viewpoints and perspectives presented in the book also provide a valuable long-term reference source for new and experienced architects alike. Whether you are an aspiring or practicing software architect, you will find yourself referring repeatedly to the practical advice in this book throughout the lifecycle of your projects. A supporting Web site containing further information can be found at www.viewpoints-and-perspectives.info","language":"en","currency":"USD","id":"9780768684995","title":"Software Systems Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dnBlz-FLEnIC&source=gbs_api","authors":["Nick Rozanski","Eóin Woods"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVMqBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"LCPD 2013, SUEDL 2013, DataCur 2013, Held in Valletta, Malta, September 22-26, 2013. Revised Selected Papers","description":"This book constitutes the refereed proceedings of the selected workshops co-located with the 17th International Conference on Theory and Practice of Digital Libraries, TPDL 2013, held in Valletta, Malta, in September 2013. The volume is organized in three parts, containing the 26 revised full papers of the three workshops: Linking and Contextualizing Publications and Datasets (LCPD 2013); Supporting Users Exploration of Digital Libraries (SUEDL 2013); Moving beyond technology: iSchools and education in data curation. Is Data Curator a new role? (DataCur 2013).","language":"en","currency":"USD","id":"3319084259","title":"Theory and Practice of Digital Libraries -- TPDL 2013 Selected Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVMqBAAAQBAJ&source=gbs_api","authors":["Łukasz Bolikowski","Vittore Casarosa","Paula Goodale","Nikos Houssos","Paolo Manghi","Jochen Schirrwagen"]},{"pageCount":511,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TKOfDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"The Art of Automatic Memory Management","description":"Published in 1996, Richard Jones’s Garbage Collection was a milestone in the area of automatic memory management. The field has grown considerably since then, sparking a need for an updated look at the latest state-of-the-art developments. The Garbage Collection Handbook: The Art of Automatic Memory Management brings together a wealth of knowledge gathered by automatic memory management researchers and developers over the past fifty years. The authors compare the most important approaches and state-of-the-art techniques in a single, accessible framework. The book addresses new challenges to garbage collection made by recent advances in hardware and software. It explores the consequences of these changes for designers and implementers of high performance garbage collectors. Along with simple and traditional algorithms, the book covers parallel, incremental, concurrent, and real-time garbage collection. Algorithms and concepts are often described with pseudocode and illustrations. The nearly universal adoption of garbage collection by modern programming languages makes a thorough understanding of this topic essential for any programmer. This authoritative handbook gives expert insight on how different collectors work as well as the various issues currently facing garbage collectors. Armed with this knowledge, programmers can confidently select and configure the many choices of garbage collectors. Web Resource The book’s online bibliographic database at www.gchandbook.org includes over 2,500 garbage collection-related publications. Continually updated, it contains abstracts for some entries and URLs or DOIs for most of the electronically available ones. The database can be searched online or downloaded as BibTeX, PostScript, or PDF. E-book This edition enhances the print version with copious clickable links to algorithms, figures, original papers and definitions of technical terms. In addition, each index entry links back to where it was mentioned in the text, and each entry in the bibliography includes links back to where it was cited.","language":"en","currency":"USD","id":"1315388014","title":"The Garbage Collection Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TKOfDQAAQBAJ&source=gbs_api","authors":["Richard Jones","Antony Hosking","Eliot Moss"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JGHGdv2NET8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 100 practical recipes to make Apache Solr faster, more reliable and return better results.","language":"en","currency":"USD","id":"1782161333","title":"Apache Solr 4 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JGHGdv2NET8C&source=gbs_api","authors":["Rafał Kuć"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EAlnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Visualize your Elastic Stack data with histograms, maps, charts, and graphs","description":"Get to grips with Kibana and its advanced functions to create interactive visualizations and dashboards Key Features Explore visualizations and perform histograms, stats, and map analytics Unleash X-Pack and Timelion, and learn alerting, monitoring, and reporting features Manage dashboards with Beats and create machine learning jobs for faster analytics Book Description Kibana is one of the popular tools among data enthusiasts for slicing and dicing large datasets and uncovering Business Intelligence (BI) with the help of its rich and powerful visualizations. To begin with, Mastering Kibana 6.x quickly introduces you to the features of Kibana 6.x, before teaching you how to create smart dashboards in no time. You will explore metric analytics and graph exploration, followed by understanding how to quickly customize Kibana dashboards. In addition to this, you will learn advanced analytics such as maps, hits, and list analytics. All this will help you enhance your skills in running and comparing multiple queries and filters, influencing your data visualization skills at scale. With Kibana’s Timelion feature, you can analyze time series data with histograms and stats analytics. By the end of this book, you will have created a speedy machine learning job using X-Pack capabilities. What you will learn Create unique dashboards with various intuitive data visualizations Visualize Timelion expressions with added histograms and stats analytics Integrate X-Pack with your Elastic Stack in simple steps Extract data from Elasticsearch for advanced analysis and anomaly detection using dashboards Build dashboards from web applications for application logs Create monitoring and alerting dashboards using Beats Who this book is for Mastering Kibana 6.x is for you if you are a big data engineer, DevOps engineer, or data scientist aspiring to go beyond data visualization at scale and gain maximum insights from their large datasets. Basic knowledge of Elasticstack will be an added advantage, although not mandatory.","language":"en","currency":"USD","id":"1788834038","title":"Mastering Kibana 6.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EAlnDwAAQBAJ&source=gbs_api","authors":["Anurag Srivastava"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ys4GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you're a JavaScript developer interested in a deeper understanding of how to create and design Node.js applications, this is the book for you.","language":"en","currency":"USD","id":"1783287322","title":"Node.js Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ys4GBgAAQBAJ&source=gbs_api","authors":["Mario Casciaro"]},{"pageCount":344,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pqTfXeOopQIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":"Beginner's Guide","description":"Create smashing SilverStripe applications by extending modules, creating themes, and adding widgets.","language":"en","currency":"USD","id":"1849515018","title":"Silverstripe 2.4 Module Extension, Themes, and Widgets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pqTfXeOopQIC&source=gbs_api","authors":["Philipp Krenn"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WkyMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.39,"subtitle":"Building, Deploying, and Scaling Modern Applications in the Cloud","description":"Kubernetes is the operating system of the cloud native world, providing a reliable and scalable platform for running containerized workloads. In this friendly, pragmatic book, cloud experts John Arundel and Justin Domingus show you what Kubernetes can do—and what you can do with it. You’ll learn all about the Kubernetes ecosystem, and use battle-tested solutions to everyday problems. You’ll build, step by step, an example cloud native application and its supporting infrastructure, along with a development environment and continuous deployment pipeline that you can use for your own applications. Understand containers and Kubernetes from first principles; no experience necessary Run your own clusters or choose a managed Kubernetes service from Amazon, Google, and others Use Kubernetes to manage resource usage and the container lifecycle Optimize clusters for cost, performance, resilience, capacity, and scalability Learn the best tools for developing, testing, and deploying your applications Apply the latest industry practices for security, observability, and monitoring Adopt DevOps principles to help make your development teams lean, fast, and effective","language":"en","currency":"USD","id":"1492040711","title":"Cloud Native DevOps with Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WkyMDwAAQBAJ&source=gbs_api","authors":["John Arundel","Justin Domingus"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NdwDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Lucene 4 Cookbook is a practical guide that shows you how to build a scalable search engine for your application, from an internal documentation search to a wide-scale web implementation with millions of records. Starting with helping you to successfully install Apache Lucene, it will guide you through creating your first search application. Furthermore, the book walks you through analyzing your text and indexing your data to leverage the performance of your search application. As you progress through the chapters, you will learn to effectively search your indexes and successfully employ real-time searching. The chapters start off with simple concepts and build up to complex solutions that should help you on your way to becoming a search engine expert.","language":"en","currency":"USD","id":"1782162291","title":"Lucene 4 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NdwDCgAAQBAJ&source=gbs_api","authors":["Edwood Ng","Vineeth Mohan"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":663,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YLS9BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":null,"description":"Web technologies are increasingly relevant to scientists working with data, for both accessing data and creating rich dynamic and interactive displays. The XML and JSON data formats are widely used in Web services, regular Web pages and JavaScript code, and visualization formats such as SVG and KML for Google Earth and Google Maps. In addition, scientists use HTTP and other network protocols to scrape data from Web pages, access REST and SOAP Web Services, and interact with NoSQL databases and text search applications. This book provides a practical hands-on introduction to these technologies, including high-level functions the authors have developed for data scientists. It describes strategies and approaches for extracting data from HTML, XML, and JSON formats and how to programmatically access data from the Web. Along with these general skills, the authors illustrate several applications that are relevant to data scientists, such as reading and writing spreadsheet documents both locally and via Google Docs, creating interactive and dynamic visualizations, displaying spatial-temporal displays with Google Earth, and generating code from descriptions of data structures to read and write data. These topics demonstrate the rich possibilities and opportunities to do new things with these modern technologies. The book contains many examples and case-studies that readers can use directly and adapt to their own work. The authors have focused on the integration of these technologies with the R statistical computing environment. However, the ideas and skills presented here are more general, and statisticians who use other computing environments will also find them relevant to their work. Deborah Nolan is Professor of Statistics at University of California, Berkeley. Duncan Temple Lang is Associate Professor of Statistics at University of California, Davis and has been a member of both the S and R development teams.","language":"en","currency":"USD","id":"1461479002","title":"XML and Web Technologies for Data Sciences with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YLS9BAAAQBAJ&source=gbs_api","authors":["Deborah Nolan","Duncan Temple Lang"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LhOlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.39,"subtitle":"your journey to mastery, 20th Anniversary Edition","description":"“One of the most significant books in my life.” –Obie Fernandez, Author, The Rails Way “Twenty years ago, the first edition of The Pragmatic Programmer completely changed the trajectory of my career. This new edition could do the same for yours.” –Mike Cohn, Author of Succeeding with Agile, Agile Estimating and Planning, and User Stories Applied “. . . filled with practical advice, both technical and professional, that will serve you and your projects well for years to come.” –Andrea Goulet, CEO, Corgibytes, Founder, LegacyCode.Rocks “. . . lightning does strike twice, and this book is proof.” –VM (Vicky) Brasseur, Director of Open Source Strategy, Juniper Networks The Pragmatic Programmer is one of those rare tech books you’ll read, re-read, and read again over the years. Whether you’re new to the field or an experienced practitioner, you’ll come away with fresh insights each and every time. Dave Thomas and Andy Hunt wrote the first edition of this influential book in 1999 to help their clients create better software and rediscover the joy of coding. These lessons have helped a generation of programmers examine the very essence of software development, independent of any particular language, framework, or methodology, and the Pragmatic philosophy has spawned hundreds of books, screencasts, and audio books, as well as thousands of careers and success stories. Now, twenty years later, this new edition re-examines what it means to be a modern programmer. Topics range from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you’ll learn how to: Fight software rot Learn continuously Avoid the trap of duplicating knowledge Write flexible, dynamic, and adaptable code Harness the power of basic tools Avoid programming by coincidence Learn real requirements Solve the underlying problems of concurrent code Guard against security vulnerabilities Build teams of Pragmatic Programmers Take responsibility for your work and career Test ruthlessly and effectively, including property-based testing Implement the Pragmatic Starter Kit Delight your users Written as a series of self-contained sections and filled with classic and fresh anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best approaches and major pitfalls of many different aspects of software development. Whether you’re a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you’ll quickly see improvements in personal productivity, accuracy, and job satisfaction. You’ll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You’ll become a Pragmatic Programmer. Register your book for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for details.","language":"en","currency":"USD","id":"0135956919","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LhOlDwAAQBAJ&source=gbs_api","authors":["David Thomas","Andrew Hunt"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t72uBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.65,"subtitle":"Using the CloudStack Ecosystem","description":"Planning to deploy and maintain a public, private, or hybrid cloud service? This cookbook’s handy how-to recipes help you quickly learn and install Apache CloudStack, along with several API clients, API wrappers, data architectures, and configuration management technologies that work as part of CloudStack’s ecosystem. You’ll learn how to use Vagrant, Ansible, Chef, Fluentd, Libcloud, and several other open source tools that let you build and operate CloudStack better and faster. If you’re an experienced programmer, system administrator, or DevOps practitioner familiar with bash, Git, package management, and some Python, you’re ready to go. Learn basic CloudStack installation from source, including features such as DevCloud, the CloudStack sandbox Get a step-by-step guide for installing CloudStack from packages on Ubuntu 14.04 using KVM Write your own applications on top of the CloudStack API, using CloudMonkey, Libcloud, jclouds, and CloStack Expose different APIs on CloudStack with the EC2Stack, Boto, and Eutester API wrappers Deploy applications easily, using Puppet, Salt, Ansible, Chef, and Vagrant Dive into cloud monitoring and storage with RiakCS, Fluentd, and Apache Whirr","language":"en","currency":"USD","id":"1491910100","title":"60 Recipes for Apache CloudStack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t72uBAAAQBAJ&source=gbs_api","authors":["Sébastien Goasguen"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QesxXj_ecD0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"A Beginner's Guide","description":"It's all in the name: Learn You a Haskell for Great Good! is a hilarious, illustrated guide to this complex functional language. Packed with the author's original artwork, pop culture references, and most importantly, useful example code, this book teaches functional fundamentals in a way you never thought possible. You'll start with the kid stuff: basic syntax, recursion, types and type classes. Then once you've got the basics down, the real black belt master-class begins: you'll learn to use applicative functors, monads, zippers, and all the other mythical Haskell constructs you've only read about in storybooks. As you work your way through the author's imaginative (and occasionally insane) examples, you'll learn to: –Laugh in the face of side effects as you wield purely functional programming techniques –Use the magic of Haskell's \"laziness\" to play with infinite sets of data –Organize your programs by creating your own types, type classes, and modules –Use Haskell's elegant input\/output system to share the genius of your programs with the outside world Short of eating the author's brain, you will not find a better way to learn this powerful language than reading Learn You a Haskell for Great Good!","language":"en","currency":"USD","id":"1593272952","title":"Learn You a Haskell for Great Good!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QesxXj_ecD0C&source=gbs_api","authors":["Miran Lipovaca"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8YLoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Mitigate exploits, malware, phishing, and other social engineering attacks","description":"After scrutinizing numerous cybersecurity strategies, Microsoft’s former Global Chief Security Advisor provides unique insights on the evolution of the threat landscape and how enterprises can address modern cybersecurity challenges. Key Features Protect your organization from cybersecurity threats with field-tested strategies by the former most senior security advisor at Microsoft Discover the most common ways enterprises initially get compromised Measure the effectiveness of your organization’s current cybersecurity program against cyber attacks Book Description Cybersecurity Threats, Malware Trends, and Strategies shares numerous insights about the threats that both public and private sector organizations face and the cybersecurity strategies that can mitigate them. The book provides an unprecedented long-term view of the global threat landscape by examining the twenty-year trend in vulnerability disclosures and exploitation, nearly a decade of regional differences in malware infections, the socio-economic factors that underpin them, and how global malware has evolved. This will give you further perspectives into malware protection for your organization. It also examines internet-based threats that CISOs should be aware of. The book will provide you with an evaluation of the various cybersecurity strategies that have ultimately failed over the past twenty years, along with one or two that have actually worked. It will help executives and security and compliance professionals understand how cloud computing is a game changer for them. By the end of this book, you will know how to measure the effectiveness of your organization’s cybersecurity strategy and the efficacy of the vendors you employ to help you protect your organization and yourself. What you will learn Discover cybersecurity strategies and the ingredients critical to their success Improve vulnerability management by reducing risks and costs for your organization Learn how malware and other threats have evolved over the past decade Mitigate internet-based threats, phishing attacks, and malware distribution sites Weigh the pros and cons of popular cybersecurity strategies of the past two decades Implement and then measure the outcome of a cybersecurity strategy Learn how the cloud provides better security capabilities than on-premises IT environments Who this book is for This book is for senior management at commercial sector and public sector organizations, including Chief Information Security Officers (CISOs) and other senior managers of cybersecurity groups, Chief Information Officers (CIOs), Chief Technology Officers (CTOs) and senior IT managers who want to explore the entire spectrum of cybersecurity, from threat hunting and security risk management to malware analysis. Governance, risk, and compliance professionals will also benefit. Cybersecurity experts that pride themselves on their knowledge of the threat landscape will come to use this book as a reference.","language":"en","currency":"USD","id":"1800205899","title":"Cybersecurity Threats, Malware Trends, and Strategies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8YLoDwAAQBAJ&source=gbs_api","authors":["Tim Rains"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ka2VUBqHiWkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day. This highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing. Each chapter in the book consists of several “items” presented in the form of a short, standalone essay that provides specific advice, insight into Java platform subtleties, and outstanding code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why. Highlights include: New coverage of generics, enums, annotations, autoboxing, the for-each loop, varargs, concurrency utilities, and much more Updated techniques and best practices on classic topics, including objects, classes, libraries, methods, and serialization How to avoid the traps and pitfalls of commonly misunderstood subtleties of the language Focus on the language and its most fundamental libraries: java.lang, java.util, and, to a lesser extent, java.util.concurrent and java.io Simply put, Effective Java™, Second Edition, presents the most practical, authoritative guidelines available for writing efficient, well-designed programs.","language":"en","currency":"USD","id":"9780132778046","title":"Effective Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ka2VUBqHiWkC&source=gbs_api","authors":["Joshua Bloch"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IfOoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Use the functionalities of Kibana to discover data and build attractive visualizations and dashboards for real-world scenarios About This Book Perform real-time data analytics and visualizations, on streaming data, using Kibana Build beautiful visualizations and dashboards with simplicity and ease without any type of coding involved Learn all the core concepts as well as detailed information about each component used in Kibana Who This Book Is For Whether you are new to the world of data analytics and data visualization or an expert, this book will provide you with the skills required to use Kibana with ease and simplicity for real-time data visualization of streaming data. This book is intended for those professionals who are interested in learning about Kibana,its installations, and how to use it . As Kibana provides a user-friendly web page, no prior experience is required. What You Will Learn Understand the basic concepts of elasticsearch used in Kibana along with step by step guide to install Kibana in Windows and Ubuntu Explore the functionality of all the components used in Kibana in detail, such as the Discover, Visualize, Dashboard,and Settings pages Analyze data using the powerful search capabilities of elasticsearch Understand the different types of aggregations used in Kibana for visualization Create and build different types of amazing visualizations and dashboards easily Create, save, share, embed, and customize the visualizations added to the dashboard Customize and tweak the advanced settings of Kibana to ensure ease of use In Detail With the increasing interest in data analytics and visualization of large data around the globe, Kibana offers the best features to analyze data and create attractive visualizations and dashboards through simple-to-use web pages. The variety of visualizations provided, combined with the powerful underlying elasticsearch capabilities will help professionals improve their skills with this technology. This book will help you quickly familiarize yourself to Kibana and will also help you to understand the core concepts of this technology to build visualizations easily. Starting with setting up of Kibana and elasticsearch in Windows and Ubuntu, you will then use the Discover page to analyse your data intelligently. Next, you will learn to use the Visualization page to create beautiful visualizations without the need for any coding. Then, you will learn how to use the Dashboard page to create a dashboard and instantly share and embed the dashboards. You will see how to tweak the basic and advanced settings provided in Kibana to manage searches, visualizations, and dashboards. Finally, you will use Kibana to build visualizations and dashboards for real-world scenarios. You will quickly master the functionalities and components used in Kibana to create amazing visualizations based on real-world scenarios. With ample screenshots to guide you through every step, this book will assist you in creating beautiful visualizations with ease. Style and approach This book is a comprehensive step-by-step guide to help you understand Kibana. It's explained in an easy-to-follow style along with supporting images. Every chapter is explained sequentially , covering the basics of each component of Kibana and providing detailed explanations of all the functionalities of Kibana that appeal.","language":"en","currency":"USD","id":"1784392448","title":"Kibana Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IfOoCwAAQBAJ&source=gbs_api","authors":["Yuvraj Gupta"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8l9p6znXiKMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":null,"description":"Learn to leverage the features of the newest version of SharePoint, in this update to the bestseller More than simply a portal, SharePoint is Microsoft's popular content management solution for building intranets and Web sites or hosting wikis and blogs. Offering broad coverage on all aspects of development for the SharePoint platform, this comprehensive book shows you exactly what SharePoint does, how to build solutions, and what features are accessible within SharePoint. Written by one of the most recognized names in SharePoint development, Professional SharePoint 2010 Development offers an extensive selection of field-tested best practices that shows you how to leverage the vast power of this multi-faceted tool to build custom workflow and content management applications. Plus, you'll discover how to take advantage of the new features to roll out new SharePoint sites or upgrade existing sites. SharePoint guru Tom Rizzo offers broad coverage of the newest version of SharePoint, Microsoft's popular content management solution Addresses how the new version adds enhanced developer support for ASP.NET, Ajax, LINQ, and Silverlight Demonstrates how to take advantage of new features, including improvements to offline and mobile client capabilities, social networking additions, and more Covers user experience development, platform services, social media features, event handling, the business data catalog, forms and workflow, business intelligence, and more With this book, you'll get exhaustive coverage on the many possibilities that exist with SharePoint.","language":"en","currency":"USD","id":"9780470881385","title":"Professional SharePoint 2010 Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8l9p6znXiKMC&source=gbs_api","authors":["Thomas Rizzo","Reza Alirezaei","Jeff Fried","Paul Swider","Scot Hillier","Kenneth Schaefer"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g1jBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Advanced techniques to build and administer scalable and reliable PostgreSQL database applications, 3rd Edition","description":"Master PostgreSQL 12 features such as advanced indexing, high availability, monitoring, and much more to efficiently manage and maintain your database Key Features Grasp advanced PostgreSQL 12 concepts with real-world examples and sample datasets Explore query parallelism, data replication, database administration, and more Extend PostgreSQL functionalities to suit your organization’s needs with minimal effort Book Description Thanks to its reliability, robustness, and high performance, PostgreSQL has become the most advanced open source database on the market. This third edition of Mastering PostgreSQL helps you build dynamic database solutions for enterprise applications using the latest release of PostgreSQL, which enables database analysts to design both physical and technical aspects of system architecture with ease. Starting with an introduction to the newly released features in PostgreSQL 12, this book will help you build efficient and fault-tolerant PostgreSQL applications. You’ll thoroughly examine the advanced features of PostgreSQL, including logical replication, database clusters, performance tuning, monitoring, and user management. You’ll also work with the PostgreSQL optimizer, configure PostgreSQL for high speed, and understand how to move from Oracle to PostgreSQL. As you progress through the chapters, you’ll cover transactions, locking, indexes, and how to optimize queries for improved performance. Additionally, you’ll learn how to manage network security and explore backups and replications while understanding useful PostgreSQL extensions to help you in optimizing the performance of large databases. By the end of this PostgreSQL book, you’ll be able to get the most out of your database by implementing advanced administrative tasks effortlessly. What you will learn Understand the advanced SQL functions in PostgreSQL 12 Use indexing features in PostgreSQL to fine-tune the performance of queries Work with stored procedures and manage backup and recovery Master replication and failover techniques to reduce data loss Replicate PostgreSQL database systems to create backups and to scale your database Manage and improve the security of your server to protect your data Troubleshoot your PostgreSQL instance for solutions to common and not-so-common problems Who this book is for This book is for PostgreSQL developers and administrators and database professionals who want to implement advanced functionalities and master complex administrative tasks with PostgreSQL 12. Prior exposure to PostgreSQL as well as familiarity with the basics of database administration is expected.","language":"en","currency":"USD","id":"1838985271","title":"Mastering PostgreSQL 12","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g1jBDwAAQBAJ&source=gbs_api","authors":["Hans-Jürgen Schönig"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RHkuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.87,"subtitle":null,"description":"This comprehensive self-study guide offers complete coverage of the new CompTIA Cybersecurity Analyst+ certification exam Note: This guide has been updated to reflect CompTIA's exam acronym CySA+. This highly effective self-study system provides complete coverage of every objective for the challenging CompTIA CySA+ Cybersecurity Analyst exam. You'll find learning objectives at the beginning of each chapter, exam tips, in-depth explanations, and practice exam questions. All questions closely mirror those on the live test in content, format, and tone. Designed to help you pass exam CS0-001 with ease, this definitive guide also serves as an essential on-the-job reference. Covers every topic on the exam, including: •Threat and vulnerability management •Conducting and analyzing reconnaissance •Responding to network-based threats •Securing a cooperate network •Cyber incident response •Determining the impact of incidents •Preparing the incident response toolkit •Security architectures •Policies, procedures, and controls •Assuring identity and access management •Putting in compensating controls •Secure software development Electronic content includes: •200 practice questions •Secured book PDF","language":"en","currency":"USD","id":"1260011801","title":"CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RHkuDwAAQBAJ&source=gbs_api","authors":["Fernando Maymi","Brent Chapman"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bvSoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Design, develop, and solve real world automation and orchestration needs by unlocking the automation capabilities of Ansible About This Book Discover how Ansible works in detail Explore use cases for Ansible's advanced features including task delegation, fast failures, and serial task execution Extend Ansible with custom modules, plugins, and inventory sources Who This Book Is For This book is intended for Ansible developers and operators who have an understanding of the core elements and applications but are now looking to enhance their skills in applying automation using Ansible. What You Will Learn Understand Ansible's code and logic flow Safeguard sensitive data within Ansible Access and manipulate complex variable data within Ansible playbooks Handle task results to manipulate change and failure definitions Organize Ansible content into a simple structure Craft a multi-tier rollout playbook utilizing load balancers and manipulating your monitoring system Utilize advanced Ansible features to orchestrate rolling updates with almost no service disruptions Troubleshoot Ansible failures to understand and resolve issues Extend Ansible with custom modules, plugins, or inventory sources In Detail Automation is critical to success in the world of DevOps. How quickly and efficiently an application deployment can be automated, or a new infrastructure can be built up, can be the difference between a successful product or a failure. Ansible provides a simple yet powerful automation engine. Beyond the basics of Ansible lie a host of advanced features which are available to help you increase efficiency and accomplish complex orchestrations with ease. This book provides you with the knowledge you need to understand how Ansible works at a fundamental level and leverage its advanced capabilities. You'll learn how to encrypt Ansible content at rest and decrypt data at runtime. You will master the advanced features and capabilities required to tackle the complex automation challenges of today and beyond. You will gain detailed knowledge of Ansible workflows, explore use cases for advanced features, craft well thought out orchestrations, troubleshoot unexpected behaviour, and extend Ansible through customizations. Finally, you will discover the methods used to examine and debug Ansible operations, helping you to understand and resolve issues. Style and approach A clear, practical guide that covers best practise, system architecture and design aspects that will help you master Ansible with ease.","language":"en","currency":"USD","id":"1784398241","title":"Mastering Ansible","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bvSoCwAAQBAJ&source=gbs_api","authors":["Jesse Keating"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A9ODDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":null,"description":"Prepare for the challenging CySA+ certification exam with this money-saving, comprehensive study package Designed as a complete self-study program, this collection offers a variety of proven resources to use in preparation for the CompTIA Cybersecurity Analyst (CySA+) certification exam. Comprised of CompTIA CySA+ Cybersecurity Analyst Certification All-In-One Exam Guide (CS0-001) and CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001), this bundle thoroughly covers every topic on the exam. CompTIA CySA+ Cybersecurity Analyst Certification Bundle contains more than 800 practice questions that match those on the live exam in content, difficulty, tone, and format. The set includes detailed coverage of performance-based questions. You will get exam-focused “Tip,” “Note,” and “Caution” elements as well as end of chapter reviews. This authoritative, cost-effective bundle serves both as a study tool AND a valuable on-the-job reference for computer security professionals. •This bundle is 25% cheaper than purchasing the books individually and includes a 10% off the exam voucher•Written by a team of computer security experts•Electronic content includes 800+ practice exam questions and secured PDF copies of both books","language":"en","currency":"USD","id":"126045326X","title":"CompTIA CySA+ Cybersecurity Analyst Certification Bundle (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A9ODDwAAQBAJ&source=gbs_api","authors":["Fernando Maymi","Brent Chapman","Jeff T. Parker"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rOxBCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Elasticsearch is a distributed search server similar to Apache Solr with a focus on large datasets, schemaless setup, and high availability. Utilizing the Apache Lucene library (also used in Apache Solr), Elasticsearch enables powerful full-text search, as well as autocomplete \"morelikethis\" search, multilingual functionality, and an extensive search query DSL. This book starts with the creation of a Google-like web search service, enabling you to generate your own search results. You will then learn how an e-commerce website can be built using Elasticsearch. We will discuss various approaches in getting relevant content up the results, such as relevancy based on how well a query matched the text, time-based recent documents, geographically nearer items, and other frequently used approaches. Finally, the book will cover various geocapabilities of Elasticsearch to make your searches similar to real-world scenarios.","language":"en","currency":"USD","id":"1783984937","title":"Elasticsearch Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rOxBCgAAQBAJ&source=gbs_api","authors":["Vineeth Mohan"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QW1jDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Infrastructure and Application Performance Monitoring","description":"Get up to speed with Prometheus, the metrics-based monitoring system used by tens of thousands of organizations in production. This practical guide provides application developers, sysadmins, and DevOps practitioners with a hands-on introduction to the most important aspects of Prometheus, including dashboarding and alerting, direct code instrumentation, and metric collection from third-party systems with exporters. This open source system has gained popularity over the past few years for good reason. With its simple yet powerful data model and query language, Prometheus does one thing, and it does it well. Author and Prometheus developer Brian Brazil guides you through Prometheus setup, the Node exporter, and the Alertmanager, then demonstrates how to use them for application and infrastructure monitoring. Know where and how much to apply instrumentation to your application code Identify metrics with labels using unique key-value pairs Get an introduction to Grafana, a popular tool for building dashboards Learn how to use the Node Exporter to monitor your infrastructure Use service discovery to provide different views of your machines and services Use Prometheus with Kubernetes and examine exporters you can use with containers Convert data from other monitoring systems into the Prometheus format","language":"en","currency":"USD","id":"1492034096","title":"Prometheus: Up & Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QW1jDwAAQBAJ&source=gbs_api","authors":["Brian Brazil"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Exploit the visualization capabilities of Kibana and build powerful interactive dashboards About This Book Introduction to data-driven architecture and the Elastic stack Build effective dashboards for data visualization and explore datasets with Elastic Graph A comprehensive guide to learning scalable data visualization techniques in Kibana Who This Book Is For If you are a developer, data visualization engineer, or data scientist who wants to get the best of data visualization at scale then this book is perfect for you. A basic understanding of Elasticsearch and Logstash is required to make the best use of this book. What You Will Learn How to create visualizations in Kibana Ingest log data, structure an Elasticsearch cluster, and create visualization assets in Kibana Embed Kibana visualization on web pages Scaffold, develop, and deploy new Kibana & Timelion customizations Build a metrics dashboard in Timelion based on time series data Use the Graph plugin visualization feature and leverage a graph query Create, implement, package, and deploy a new custom plugin Use Prelert to solve anomaly detection challenges In Detail Kibana is an open source data visualization platform that allows you to interact with your data through stunning, powerful graphics. Its simple, browser-based interface enables you to quickly create and share dynamic dashboards that display changes to Elasticsearch queries in real time. In this book, you'll learn how to use the Elastic stack on top of a data architecture to visualize data in real time. All data architectures have different requirements and expectations when it comes to visualizing the data, whether it's logging analytics, metrics, business analytics, graph analytics, or scaling them as per your business requirements. This book will help you master Elastic visualization tools and adapt them to the requirements of your project. You will start by learning how to use the basic visualization features of Kibana 5. Then you will be shown how to implement a pure metric analytics architecture and visualize it using Timelion, a very recent and trendy feature of the Elastic stack. You will learn how to correlate data using the brand-new Graph visualization and build relationships between documents. Finally, you will be familiarized with the setup of a Kibana development environment so that you can build a custom Kibana plugin. By the end of this book you will have all the information needed to take your Elastic stack skills to a new level of data visualization. Style and approach This book takes a comprehensive, step-by-step approach to working with the visualization aspects of the Elastic stack. Every concept is presented in a very easy-to-follow manner that shows you both the logic and method of implementation. Real world cases are referenced to highlight how each of the key concepts can be put to practical use.","language":"en","currency":"USD","id":"1786465795","title":"Learning Kibana 5.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OVQoDwAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n0zSKp4MA5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Grails is a full stack framework which aims to greatly simplify the task of building serious web applications for the JVM. The concepts within Grails, like interceptors, tag libs, and Groovy Server Pages (GSP), make those in the Java community feel right at home. Grails’ foundation is on solid open source technologies such as Spring, Hibernate, and SiteMesh, which gives it even more potential in the Java space: Spring provides powerful inversion of control and MVC, Hibernate brings a stable, mature object relational mapping technology with the ability to integrate with legacy systems, and SiteMesh handles flexible layout control and page decoration. Grails complements these with additional features that take advantage of the coding–by–convention paradigm such as dynamic tag libraries, Grails object relational mapping, Groovy Server Pages, and scaffolding. Graeme Rocher, Grails lead and founder, and Jeff Brown bring you completely up–to–date with their authoritative and fully comprehensive guide to the Grails 2 framework. You’ll get to know all the core features, services, and Grails extensions via plug–ins, and understand the roles that Groovy and Grails are playing in the changing Web.","language":"en","currency":"USD","id":"1430243783","title":"The Definitive Guide to Grails 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n0zSKp4MA5sC&source=gbs_api","authors":["Jeff Scott Brown","Graeme Rocher"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Use React and React Native to build applications for desktop browsers, mobile browsers, and even as native mobile apps About This Book Build React and React Native applications using familiar component concepts Dive deep into each platform, from routing in React to creating native mobile applications that can run offline Use Facebook's Relay, React and GraphQL technologies, to create a unified architecture that powers both web and native applications Who This Book Is For This book is written for any JavaScript developer—beginner or expert—who wants to start learning how to put both of Facebook's UI libraries to work. No knowledge of React is needed, though a working knowledge of ES2015 will help you follow along better. What You Will Learn Craft reusable React components Control navigation using the React Router to help keep your UI in sync with URLs Build isomorphic web applications using Node.js Use the Flexbox layout model to create responsive mobile designs Leverage the native APIs of Android and iOS to build engaging applications with React Native Respond to gestures in a way that's intuitive for the user Use Relay to build a unified data architecture for your React UIs In Detail React and React Native allow you to build cross-platform desktop and mobile applications using Facebook's innovative UI libraries. Combined with the Flux data architecture and Relay, you can now create powerful and feature-complete applications from just one code base! This book is split into three parts. The first part shows you how to start crafting composable UIs using React, from rendering with JSX and creating reusable components through to routing and creating isomorphic applications that run on Node. We then move on to showing you how to take the concepts of React and apply them to building Native UIs using React Native. You'll find out how to build responsive and streamlined UIs that can properly handle user interactions in a mobile environment. You'll also learn how to access device-specific APIs such as the geolocation API, and how to handle offline development with React Native. Finally, we'll tie all of these skills together and shows you how you can create React applications that run on every major platform. As well as understanding application state in depth, you'll learn how to leverage Relay to make feature-complete, data-driven web and native mobile applications. Style and approach Split into three major sections to help organize your learning, this hands-on, code-first book will help you get up to speed with React and React Native—the UI framework that powers Netflix, Yahoo, and Facebook.","language":"en","currency":"USD","id":"178646957X","title":"React and React Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jLkrDwAAQBAJ&source=gbs_api","authors":["Adam Boduch"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-uiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Fully updated coverage of every topic on the current version of the GSEC exam Get complete coverage of all the objectives on Global Information Assurance Certification’s Security Essentials (GSEC) exam inside this comprehensive resource. GSEC GIAC Security Essentials Certification All-in-One Exam Guide, Second Edition provides learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this authoritative resource also serves as an essential on-the-job reference. Covers all exam topics, including: •Networking fundamentals •Network design •Cloud computing •Authentication and access control •Unix\/Linux •Windows •Encryption •Risk management •Virtual machines •Vulnerability control •Malware •Incident response •Wireless technologies •Log Management •IoT and embedded devices Online content features: •Two practice exams •Test engine that provides full-length practice exams and customizable quizzes •Author videos","language":"en","currency":"USD","id":"1260453219","title":"GSEC GIAC Security Essentials Certification All-in-One Exam Guide, Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-uiDwAAQBAJ&source=gbs_api","authors":["Ric Messier"]},{"pageCount":194,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qtcnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"A Tidy Approach","description":"Much of the data available today is unstructured and text-heavy, making it challenging for analysts to apply their usual data wrangling and visualization tools. With this practical book, you’ll explore text-mining techniques with tidytext, a package that authors Julia Silge and David Robinson developed using the tidy principles behind R packages like ggraph and dplyr. You’ll learn how tidytext and other tidy tools in R can make text analysis easier and more effective. The authors demonstrate how treating text as data frames enables you to manipulate, summarize, and visualize characteristics of text. You’ll also learn how to integrate natural language processing (NLP) into effective workflows. Practical code examples and data explorations will help you generate real insights from literature, news, and social media. Learn how to apply the tidy text format to NLP Use sentiment analysis to mine the emotional content of text Identify a document’s most important terms with frequency measurements Explore relationships and connections between words with the ggraph and widyr packages Convert back and forth between R’s tidy and non-tidy text formats Use topic modeling to classify document collections into natural groups Examine case studies that compare Twitter archives, dig into NASA metadata, and analyze thousands of Usenet messages","language":"en","currency":"USD","id":"1491981601","title":"Text Mining with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qtcnDwAAQBAJ&source=gbs_api","authors":["Julia Silge","David Robinson"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HnxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build web applications with MongoDB, Express.js, React, and Node","description":"Build web applications with MongoDB, ExpressJS, React, and Node Key Features Build applications with the MERN stack Work with each component of the MERN stack Become confident with MERN and ready for more! Book Description The MERN stack is a collection of great tools—MongoDB, Express.js, React, and Node—that provide a strong base for a developer to build easily maintainable web applications. With each of them a JavaScript or JavaScript-based technology, having a shared programming language means it takes less time to develop web applications. This book focuses on providing key tasks that can help you get started, learn, understand, and build full-stack web applications. It walks you through the process of installing all the requirements and project setup to build client-side React web applications, managing synchronous and asynchronous data flows with Redux, and building real-time web applications with Socket.IO, RESTful APIs, and other concepts. This book gives you practical and clear hands-on experience so you can begin building a full-stack MERN web application. Quick Start Guides are focused, shorter titles that provide a faster paced introduction to a technology. They are for people who don't need all the detail at this point in their learning curve. The presentation has been streamlined to concentrate on the things you really need to know. What you will learn Get started with the MERN stack Install Node.js and configure MongoDB Build RESTful APIs with Express.js and Mongoose Build real-time applications with Socket.IO Manage synchronous and asynchronous data flows with Redux Build web applications with React Who this book is for The book is for JavaScript developers who want to get stated with the MERN Stack.","language":"en","currency":"USD","id":"1787280047","title":"MERN Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HnxeDwAAQBAJ&source=gbs_api","authors":["Eddy Wilson"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvt1qQ_aU7YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Best Practices for Experienced Grails Developers","description":"Dig deeper into Grails architecture and discover how this application framework works its magic. Written by a core developer on the Grails team, this practical guide takes you behind the curtain to reveal the inner workings of its 2.0 feature set. You’ll learn best practices for building and deploying Grails applications, including performance, security, scaling, tuning, debugging, and monitoring. Understand how Grails integrates with Groovy, Spring, Hibernate, and other JVM technologies, and learn how to create and use plugins to augment your application’s functionality. Once you know how Grails adds behavior by convention, you can solve problems more easily and develop applications more intuitively. Write simpler, more powerful code with the Groovy language Manage persistence in Grails, using Hibernate or a NoSQL datastore Learn how Grails uses Spring’s functionality and optional modules Discover how Hibernate handles details for storing and retrieving data Integrate technologies for messaging, mail, creating web services, and other JEE technologies Bypass convention and configure Grails manually Learn a general approach to upgrading applications and plugins Use Grails to develop and deploy IaaS and PaaS applications","language":"en","currency":"USD","id":"1449324533","title":"Programming Grails","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvt1qQ_aU7YC&source=gbs_api","authors":["Burt Beckwith"]},{"pageCount":808,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UMFeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Beginner's Guide to HTML, CSS, JavaScript, and Web Graphics","description":"Do you want to build web pages but have no prior experience? This friendly guide is the perfect place to start. You’ll begin at square one, learning how the web and web pages work, and then steadily build from there. By the end of the book, you’ll have the skills to create a simple site with multicolumn pages that adapt for mobile devices. Each chapter provides exercises to help you learn various techniques and short quizzes to make sure you understand key concepts. This thoroughly revised edition is ideal for students and professionals of all backgrounds and skill levels. It is simple and clear enough for beginners, yet thorough enough to be a useful reference for experienced developers keeping their skills up to date. Build HTML pages with text, links, images, tables, and forms Use style sheets (CSS) for colors, backgrounds, formatting text, page layout, and even simple animation effects Learn how JavaScript works and why the language is so important in web design Create and optimize web images so they’ll download as quickly as possible NEW! Use CSS Flexbox and Grid for sophisticated and flexible page layout NEW! Learn the ins and outs of Responsive Web Design to make web pages look great on all devices NEW! Become familiar with the command line, Git, and other tools in the modern web developer’s toolkit NEW! Get to know the super-powers of SVG graphics","language":"en","currency":"USD","id":"1491960159","title":"Learning Web Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UMFeDwAAQBAJ&source=gbs_api","authors":["Jennifer Robbins"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y83aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.49,"subtitle":"Build powerful and reliable Python web applications from scratch, 3rd Edition","description":"Learn Django 3 with four end-to-end web projects Key Features Learn Django 3 by building real-world web applications from scratch in Python, using coding best practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Implement advanced functionalities like a full-text search engine, a user activity stream, or a recommendation engine Add real-time features with Django Channels and WebSockets Book Description If you want to learn the entire process of developing professional web applications with Python and Django, then this book is for you. In the process of building four professional Django projects, you will learn about Django 3 features, how to solve common web development problems, how to implement best practices, and how to successfully deploy your applications. In this book, you will build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Step-by-step guidance will teach you how to integrate popular technologies, enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. By the end of this book, you will have mastered Django 3 by building advanced web applications. What you will learn Build real-world web applications Learn Django essentials, including models, views, ORM, templates, URLs, forms, and authentication Implement advanced features such as custom model fields, custom template tags, cache, middleware, localization, and more Create complex functionalities, such as AJAX interactions, social authentication, a full-text search engine, a payment system, a CMS, a RESTful API, and more Integrate other technologies, including Redis, Celery, RabbitMQ, PostgreSQL, and Channels, into your projects Deploy Django projects in production using NGINX, uWSGI, and Daphne Who this book is for This book is intended for developers with Python knowledge who wish to learn Django in a pragmatic way. Perhaps you are completely new to Django, or you already know a little but you want to get the most out of it. This book will help you to master the most relevant areas of the framework by building practical projects from scratch. You need to have familiarity with programming concepts in order to read this book. Some previous knowledge of HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1838989323","title":"Django 3 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y83aDwAAQBAJ&source=gbs_api","authors":["Antonio Melé"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Perform fast and efficient data analysis with the power of SQL","description":"SQL for Data Analytics teaches everything you need to know to progress from basic SQL to identifying trends and creating compelling narratives with data. With this book, you will be able to look at data with the critical eye of an analytics professional and extract meaningful insights that will improve your business.","language":"en","currency":"USD","id":"1789803845","title":"SQL for Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VyisDwAAQBAJ&source=gbs_api","authors":["Upom Malik","Matt Goldwasser","Benjamin Johnston"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZX0WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":60,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Prepare for the challenging CySA+ certification exam with this money-saving, up-to-date study package Designed as a complete self-study program, this collection offers a variety of proven resources to use in preparation for the latest edition of the CompTIA Cybersecurity Analyst (CySA+) certification exam. Comprised of CompTIA CySA+ Cybersecurity Analyst Certification All-In-One Exam Guide, Second Edition (Exam CS0-002) and CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-002), this bundle thoroughly covers every topic on the exam. CompTIA CySA+ Cybersecurity Analyst Certification Bundle, Second Edition (Exam CS0-002) contains more than 800 practice questions that match those on the live exam in content, difficulty, tone, and format. The collection includes detailed explanations of both multiple choice and performance-based questions. This authoritative, cost-effective bundle serves both as a study tool and a valuable on-the-job reference for computer security professionals. •This bundle is 25% cheaper than purchasing the books individually and includes a 10% off the exam voucher offer •Online content includes additional practice questions, a cybersecurity audit checklist, and a quick review guide •Written by a team of recognized cybersecurity experts","language":"en","currency":"USD","id":"1260473821","title":"CompTIA CySA+ Cybersecurity Analyst Certification Bundle (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZX0WEAAAQBAJ&source=gbs_api","authors":["Brent Chapman","Fernando Maymi","Jeff T. Parker"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=V5qzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"Dive into the Future of Infrastructure","description":"Kubernetes radically changes the way applications are built and deployed in the cloud. Since its introduction in 2014, this container orchestrator has become one of the largest and most popular open source projects in the world. The updated edition of this practical book shows developers and ops personnel how Kubernetes and container technology can help you achieve new levels of velocity, agility, reliability, and efficiency. Kelsey Hightower, Brendan Burns, and Joe Beda—who’ve worked on Kubernetes at Google and beyond—explain how this system fits into the lifecycle of a distributed application. You’ll learn how to use tools and APIs to automate scalable distributed systems, whether it’s for online services, machine learning applications, or a cluster of Raspberry Pi computers. Create a simple cluster to learn how Kubernetes works Dive into the details of deploying an application using Kubernetes Learn specialized objects in Kubernetes, such as DaemonSets, jobs, ConfigMaps, and secrets Explore deployments that tie together the lifecycle of a complete application Get practical examples of how to develop and deploy real-world applications in Kubernetes","language":"en","currency":"USD","id":"1492046485","title":"Kubernetes: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=V5qzDwAAQBAJ&source=gbs_api","authors":["Brendan Burns","Joe Beda","Kelsey Hightower"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZZ_6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A deep dive into distributed ledgers, consensus protocols, smart contracts, DApps, cryptocurrencies, Ethereum, and more, 3rd Edition","description":"Mastering Blockchain, Third Edition is the blockchain bible to equip you with extensive knowledge of distributed ledgers, cryptocurrencies, smart contracts, consensus algorithms, cryptography and blockchain platforms such as Ethereum, Bitcoin, and many more.","language":"en","currency":"USD","id":"1839211377","title":"Mastering Blockchain","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZZ_6DwAAQBAJ&source=gbs_api","authors":["Imran Bashir"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=egRd1BqPw7MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Extend and enhance your Java applications with Domain Specific Languages in Groovy.","language":"en","currency":"USD","id":"1847196918","title":"Groovy for Domain-Specific Languages","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=egRd1BqPw7MC&source=gbs_api","authors":["Fergal Dearle"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7d6cAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book follows a Cookbook style and is packed with intermediate and advanced level recipes.This book is for Java developers who have an interest in discovering new ways to quickly get the job done using a new language that shares many similarities with Java. The book’s recipes start simple, therefore no previous Groovy experience is required to understand the code and the explanations accompanying the examples.","language":"en","currency":"USD","id":"1849519374","title":"Groovy 2 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7d6cAQAAQBAJ&source=gbs_api","authors":["Andrey Adamovich","Luciano Fiandesio"]},{"pageCount":96,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YznoAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book is written in a concise and easy-to-understand manner, and acts as a comprehensive guide on data analytics and integration with Talend big data processing jobs. If you are a chief information officer, enterprise architect, data architect, data scientist, software developer, software engineer, or a data analyst who is familiar with data processing projects and who wants to use Talend to get your first big data job executed in a reliable, quick, and graphical way, then Talend for Big Data is perfect for you.","language":"en","currency":"USD","id":"1782169504","title":"Talend for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YznoAgAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]}]