[{"pageCount":141,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q6xPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practitioners guide to choosing relevant Big Data architecture","description":"This book highlights the different types of data architecture and illustrates the many possibilities hidden behind the term \"Big Data\", from the usage of No-SQL databases to the deployment of stream analytics architecture, machine learning, and governance. Scalable Big Data Architecture covers real-world, concrete industry use cases that leverage complex distributed applications , which involve web applications, RESTful API, and high throughput of large amount of data stored in highly scalable No-SQL data stores such as Couchbase and Elasticsearch. This book demonstrates how data processing can be done at scale from the usage of NoSQL datastores to the combination of Big Data distribution. When the data processing is too complex and involves different processing topology like long running jobs, stream processing, multiple data sources correlation, and machine learning, it’s often necessary to delegate the load to Hadoop or Spark and use the No-SQL to serve processed data in real time. This book shows you how to choose a relevant combination of big data technologies available within the Hadoop ecosystem. It focuses on processing long jobs, architecture, stream data patterns, log analysis, and real time analytics. Every pattern is illustrated with practical examples, which use the different open sourceprojects such as Logstash, Spark, Kafka, and so on. Traditional data infrastructures are built for digesting and rendering data synthesis and analytics from large amount of data. This book helps you to understand why you should consider using machine learning algorithms early on in the project, before being overwhelmed by constraints imposed by dealing with the high throughput of Big data. Scalable Big Data Architecture is for developers, data architects, and data scientists looking for a better understanding of how to choose the most relevant pattern for a Big Data project and which tools to integrate into that pattern.","language":"en","currency":"USD","id":"1484213262","title":"Scalable Big Data Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q6xPCwAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]},{"pageCount":1272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnPiKXCRciMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"A comprehensive guide to programming for Access 2010 and 2007 Millions of people use the Access database applications, and hundreds of thousands of developers work with Access daily. Access 2010 brings better integration with SQL Server and enhanced XML support; this Wrox guide shows developers how to take advantage of these and other improvements. With in-depth coverage of VBA, macros, and other programming methods for building Access applications, this book also provides real-world code examples to demonstrate each topic. Access 2010 Programmer's Referenceis a comprehensive guide to the best-of-breed techniques for programming Access applications. Coverage Includes: Introduction to Microsoft Access 2010 New Features Upgrading and Converting to Access 2010 Macros in Access 2010 Using the VBA Editor VBA Basics Using VBA in Access Creating Classes in VBA Extending VBA with APIs Working with the Windows Registry Using DAO to Access Data Using ADO to Access Data Using SQL with VBA Using VBA to Enhance Forms Enhancing Reports with VBA Customizing the Ribbon Customizing the Office Backstage Working with Office 2010 Working with SharePoint Working with .NET Building Client-Server Applications with Access The Access 2010 Templates Access Runtime Deployment Database Security Access 2010 Security Features","language":"en","currency":"USD","id":"9780470938966","title":"Access 2010 Programmer's Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnPiKXCRciMC&source=gbs_api","authors":["Teresa Hennig","Rob Cooper","Geoffrey L. Griffith","Jerry Dennison"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Extract patterns and knowledge from your data in easy way using MATLAB About This Book Get your first steps into machine learning with the help of this easy-to-follow guide Learn regression, clustering, classification, predictive analytics, artificial neural networks and more with MATLAB Understand how your data works and identify hidden layers in the data with the power of machine learning. Who This Book Is For This book is for data analysts, data scientists, students, or anyone who is looking to get started with machine learning and want to build efficient data processing and predicting applications. A mathematical and statistical background will really help in following this book well. What You Will Learn Learn the introductory concepts of machine learning. Discover different ways to transform data using SAS XPORT, import and export tools, Explore the different types of regression techniques such as simple & multiple linear regression, ordinary least squares estimation, correlations and how to apply them to your data. Discover the basics of classification methods and how to implement Naive Bayes algorithm and Decision Trees in the Matlab environment. Uncover how to use clustering methods like hierarchical clustering to grouping data using the similarity measures. Know how to perform data fitting, pattern recognition, and clustering analysis with the help of MATLAB Neural Network Toolbox. Learn feature selection and extraction for dimensionality reduction leading to improved performance. In Detail MATLAB is the language of choice for many researchers and mathematics experts for machine learning. This book will help you build a foundation in machine learning using MATLAB for beginners. You'll start by getting your system ready with t he MATLAB environment for machine learning and you'll see how to easily interact with the Matlab workspace. We'll then move on to data cleansing, mining and analyzing various data types in machine learning and you'll see how to display data values on a plot. Next, you'll get to know about the different types of regression techniques and how to apply them to your data using the MATLAB functions. You'll understand the basic concepts of neural networks and perform data fitting, pattern recognition, and clustering analysis. Finally, you'll explore feature selection and extraction techniques for dimensionality reduction for performance improvement. At the end of the book, you will learn to put it all together into real-world cases covering major machine learning algorithms and be comfortable in performing machine learning with MATLAB. Style and approach The book takes a very comprehensive approach to enhance your understanding of machine learning using MATLAB. Sufficient real-world examples and use cases are included in the book to help you grasp the concepts quickly and apply them easily in your day-to-day work.","language":"en","currency":"USD","id":"1788399390","title":"MATLAB for Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gJZGDwAAQBAJ&source=gbs_api","authors":["Giuseppe Ciaburro"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jiménez","Graham Lee","Corey Wade"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q22uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Secure Your Systems Using the Latest IT Auditing Techniques Fully updated to cover leading-edge tools and technologies, IT Auditing: Using Controls to Protect Information Assets, Third Edition explains, step by step, how to implement a successful, enterprise-wide IT audit program. New chapters on auditing cybersecurity programs, big data and data repositories, and new technologies are included. This comprehensive guide describes how to assemble an effective IT audit team and maximize the value of the IT audit function. In-depth details on performing specific audits are accompanied by real-world examples, ready-to-use checklists, and valuable templates. Standards, frameworks, regulations, and risk management techniques are also covered in this definitive resource. • Build and maintain an internal IT audit function with maximum effectiveness and value • Audit entity-level controls and cybersecurity programs • Assess data centers and disaster recovery • Examine switches, routers, and firewalls • Evaluate Windows, UNIX, and Linux operating systems • Audit Web servers and applications • Analyze databases and storage solutions • Review big data and data repositories • Assess end user computer devices, including PCs and mobile devices • Audit virtualized environments • Evaluate risks associated with cloud computing and outsourced operations • Drill down into applications and projects to find potential control weaknesses • Learn best practices for auditing new technologies • Use standards and frameworks, such as COBIT, ITIL, and ISO • Understand regulations, including Sarbanes-Oxley, HIPAA, and PCI • Implement proven risk management practices","language":"en","currency":"USD","id":"1260453235","title":"IT Auditing Using Controls to Protect Information Assets, Third Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q22uDwAAQBAJ&source=gbs_api","authors":["Mike Kegerreis","Mike Schiller","Chris Davis"]},{"pageCount":722,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JM-KDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Understand key data structures and use Python in object-oriented programming","description":"Harness the power of Python objects and data structures to implement algorithms for analyzing your data and efficiently extracting information Key Features Turn your designs into working software by learning the Python syntax Write robust code with a solid understanding of Python data structures Understand when to use the functional or the OOP approach Book Description This Learning Path helps you get comfortable with the world of Python. It starts with a thorough and practical introduction to Python. You’ll quickly start writing programs, building websites, and working with data by harnessing Python's renowned data science libraries. With the power of linked lists, binary searches, and sorting algorithms, you'll easily create complex data structures, such as graphs, stacks, and queues. After understanding cooperative inheritance, you'll expertly raise, handle, and manipulate exceptions. You will effortlessly integrate the object-oriented and not-so-object-oriented aspects of Python, and create maintainable applications using higher level design patterns. Once you’ve covered core topics, you’ll understand the joy of unit testing and just how easy it is to create unit tests. By the end of this Learning Path, you will have built components that are easy to understand, debug, and can be used across different applications. This Learning Path includes content from the following Packt products: Learn Python Programming - Second Edition by Fabrizio Romano Python Data Structures and Algorithms by Benjamin Baka Python 3 Object-Oriented Programming by Dusty Phillips What you will learn Use data structures and control flow to write code Use functions to bundle together a sequence of instructions Implement objects in Python by creating classes and defining methods Design public interfaces using abstraction, encapsulation and information hiding Raise, define, and manipulate exceptions using special error objects Create bulletproof and reliable software by writing unit tests Learn the common programming patterns and algorithms used in Python Who this book is for If you are relatively new to coding and want to write scripts or programs to accomplish tasks using Python, or if you are an object-oriented programmer for other languages and seeking a leg up in the world of Python, then this Learning Path is for you. Though not essential, it will help you to have basic knowledge of programming and OOP.","language":"en","currency":"USD","id":"1838559981","title":"Getting Started with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JM-KDwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano","Benjamin Baka","Dusty Phillips"]},{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8FHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"See a Mesos-based big data stack created and the components used. You will use currently available Apache full and incubating systems. The components are introduced by example and you learn how they work together. In the Complete Guide to Open Source Big Data Stack, the author begins by creating a private cloud and then installs and examines Apache Brooklyn. After that, he uses each chapter to introduce one piece of the big data stack—sharing how to source the software and how to install it. You learn by simple example, step by step and chapter by chapter, as a real big data stack is created. The book concentrates on Apache-based systems and shares detailed examples of cloud storage, release management, resource management, processing, queuing, frameworks, data visualization, and more. What You’ll Learn Install a private cloud onto the local cluster using Apache cloud stack Source, install, and configure Apache: Brooklyn, Mesos, Kafka, and Zeppelin See how Brooklyn can be used to install Mule ESB on a cluster and Cassandra in the cloud Install and use DCOS for big data processing Use Apache Spark for big data stack data processing Who This Book Is For Developers, architects, IT project managers, database administrators, and others charged with developing or supporting a big data system. It is also for anyone interested in Hadoop or big data, and those experiencing problems with data size.","language":"en","currency":"USD","id":"1484221494","title":"Complete Guide to Open Source Big Data Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8FHDwAAQBAJ&source=gbs_api","authors":["Michael Frampton"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LR2CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Safeguard your system by making your machines intelligent using the Python ecosystem","description":"Get into the world of smart data security using machine learning algorithms and Python libraries Key Features Learn machine learning algorithms and cybersecurity fundamentals Automate your daily workflow by applying use cases to many facets of security Implement smart machine learning solutions to detect various cybersecurity problems Book Description Cyber threats today are one of the costliest losses that an organization can face. In this book, we use the most efficient tool to solve the big problems that exist in the cybersecurity domain. The book begins by giving you the basics of ML in cybersecurity using Python and its libraries. You will explore various ML domains (such as time series analysis and ensemble modeling) to get your foundations right. You will implement various examples such as building system to identify malicious URLs, and building a program to detect fraudulent emails and spam. Later, you will learn how to make effective use of K-means algorithm to develop a solution to detect and alert you to any malicious activity in the network. Also learn how to implement biometrics and fingerprint to validate whether the user is a legitimate user or not. Finally, you will see how we change the game with TensorFlow and learn how deep learning is effective for creating models and training systems What you will learn Use machine learning algorithms with complex datasets to implement cybersecurity concepts Implement machine learning algorithms such as clustering, k-means, and Naive Bayes to solve real-world problems Learn to speed up a system using Python libraries with NumPy, Scikit-learn, and CUDA Understand how to combat malware, detect spam, and fight financial fraud to mitigate cyber crimes Use TensorFlow in the cybersecurity domain and implement real-world examples Learn how machine learning and Python can be used in complex cyber issues Who this book is for This book is for the data scientists, machine learning developers, security researchers, and anyone keen to apply machine learning to up-skill computer security. Having some working knowledge of Python and being familiar with the basics of machine learning and cybersecurity fundamentals will help to get the most out of the book","language":"en","currency":"USD","id":"178899096X","title":"Hands-On Machine Learning for Cybersecurity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LR2CDwAAQBAJ&source=gbs_api","authors":["Soma Halder","Sinan Ozdemir"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRl1CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Invoke TDD principles for end-to-end application development with Java About This Book Explore the most popular TDD tools and frameworks and become more proficient in building applications Create applications with better code design, fewer bugs, and higher test coverage, enabling you to get them to market quickly Implement test-driven programming methods into your development workflows Who This Book Is For If you're an experienced Java developer and want to implement more effective methods of programming systems and applications, then this book is for you. What You Will Learn Explore the tools and frameworks required for effective TDD development Perform the Red-Green-Refactor process efficiently, the pillar around which all other TDD procedures are based Master effective unit testing in isolation from the rest of your code Design simple and easily maintainable codes by implementing different techniques Use mocking frameworks and techniques to easily write and quickly execute tests Develop an application to implement behaviour-driven development in conjunction with unit testing Enable and disable features using Feature Toggles In Detail Test-driven development (TDD) is a development approach that relies on a test-first procedure that emphasises writing a test before writing the necessary code, and then refactoring the code to optimize it. The value of performing TDD with Java, one of the most established programming languages, is to improve the productivity of programmers, the maintainability and performance of code, and develop a deeper understanding of the language and how to employ it effectively. Starting with the basics of TDD and reasons why its adoption is beneficial, this book will take you from the first steps of TDD with Java until you are confident enough to embrace the practice in your day-to-day routine. You'll be guided through setting up tools, frameworks, and the environment you need, and will dive right in to hands-on exercises with the goal of mastering one practice, tool, or framework at a time. You'll learn about the Red-Green-Refactor procedure, how to write unit tests, and how to use them as executable documentation. With this book you'll also discover how to design simple and easily maintainable code, work with mocks, utilise behaviour-driven development, refactor old legacy code, and release a half-finished feature to production with feature toggles. You will finish this book with a deep understanding of the test-driven development methodology and the confidence to apply it to application programming with Java. Style and approach An easy-to-follow, hands-on guide to building applications through effective coding practices. This book covers practical examples by introducing different problems, each one designed as a learning exercise to help you understand each aspect of TDD.","language":"en","currency":"USD","id":"178398743X","title":"Test-Driven Java Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRl1CgAAQBAJ&source=gbs_api","authors":["Viktor Farcic","Alex Garcia"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxFYuVZHG60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Our world is being revolutionized by data-driven methods: access to large amounts of data has generated new insights and opened exciting new opportunities in commerce, science, and computing applications. Processing the enormous quantities of data necessary for these advances requires large clusters, making distributed computing paradigms more crucial than ever. MapReduce is a programming model for expressing distributed computations on massive datasets and an execution framework for large-scale data processing on clusters of commodity servers. The programming model provides an easy-to-understand abstraction for designing scalable algorithms, while the execution framework transparently handles many system-level details, ranging from scheduling to synchronization to fault tolerance. This book focuses on MapReduce algorithm design, with an emphasis on text processing algorithms common in natural language processing, information retrieval, and machine learning. We introduce the notion of MapReduce design patterns, which represent general reusable solutions to commonly occurring problems across a variety of problem domains. This book not only intends to help the reader \"think in MapReduce\", but also discusses limitations of the programming model as well. This volume is a printed version of a work that appears in the Synthesis Digital Library of Engineering and Computer Science. Synthesis Lectures provide concise, original presentations of important research and development topics, published quickly, in digital and print formats. For more information visit www.morganclaypool.com","language":"en","currency":"USD","id":"1608453421","title":"Data-intensive Text Processing with MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxFYuVZHG60C&source=gbs_api","authors":["Jimmy Lin","Chris Dyer"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YTCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build complete data analysis flows, from data collection to visualization","description":"A practical guide to getting the most out of Excel, using it for data preparation, applying machine learning models (including cloud services) and understanding the outcome of the data analysis. Key Features Use Microsoft's product Excel to build advanced forecasting models using varied examples Cover range of machine learning tasks such as data mining, data analytics, smart visualization, and more Derive data-driven techniques using Excel plugins and APIs without much code required Book Description We have made huge progress in teaching computers to perform difficult tasks, especially those that are repetitive and time-consuming for humans. Excel users, of all levels, can feel left behind by this innovation wave. The truth is that a large amount of the work needed to develop and use a machine learning model can be done in Excel. The book starts by giving a general introduction to machine learning, making every concept clear and understandable. Then, it shows every step of a machine learning project, from data collection, reading from different data sources, developing models, and visualizing the results using Excel features and offerings. In every chapter, there are several examples and hands-on exercises that will show the reader how to combine Excel functions, add-ins, and connections to databases and to cloud services to reach the desired goal: building a full data analysis flow. Different machine learning models are shown, tailored to the type of data to be analyzed. At the end of the book, the reader is presented with some advanced use cases using Automated Machine Learning, and artificial neural network, which simplifies the analysis task and represents the future of machine learning. What you will learn Use Excel to preview and cleanse datasets Understand correlations between variables and optimize the input to machine learning models Use and evaluate different machine learning models from Excel Understand the use of different visualizations Learn the basic concepts and calculations to understand how artificial neural networks work Learn how to connect Excel to the Microsoft Azure cloud Get beyond proof of concepts and build fully functional data analysis flows Who this book is for This book is for data analysis, machine learning enthusiasts, project managers, and someone who doesn't want to code much for performing core tasks of machine learning. Each example will help you perform end-to-end smart analytics. Working knowledge of Excel is required.","language":"en","currency":"USD","id":"178934512X","title":"Hands-On Machine Learning with Microsoft Excel 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YTCWDwAAQBAJ&source=gbs_api","authors":["Julio Cesar Rodriguez Martino"]},{"pageCount":380,"thumbnail":"http:\/\/books.google.com\/books\/content?id=udfjatRRqroC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":null,"description":"If you’ve surfed the Web more than once, you’veprobably visited Amazon.com. Originally you may have gone theresearching for books, but Amazon.com is so much more than abookstore. The author of Amazon.com For Dummies®, whohas been involved with the site from its beginnings, describes itas a shopping mall\/home improvement store\/bazaar\/travelagency\/newsstand\/car lot, but most importantly, a community ofbuyers and sellers—people like you. Countless opportunities exist for those who join this community,and Amazon.com For Dummies® gives you a smorgasbordsampling of what they are and how to take advantage of every one.For example, you can Set up an account and buy things Bid on an auction Sell your items Personalize your shopping experience Open your own online “store” Join the Amazon.com community Written by Mara Friedman, who has held several positions withAmazon.com including marketing communications manager,Amazon.com For Dummies® takes you from your firstventure into the Amazon all the way to making money from yourAmazon.com experience. Discover how to Find your way around the marketplace and scout out the bestdeals Get local movie showtimes, view restaurant menus, chat withother shoppers, send free e-cards, or sign up for a free reminderservice Track orders and manage your account Browse specialty shops and check out internationalmerchandise Take advantage of reviews from other shoppers Set up and use wish lists—for yourself and yourfriends Create your own online Zshop, set the right prices, and takephotos that help sell your items Take advantage of the Amazon.com Advantage or become anAssociate Whether you’re a complete novice who’d like a guideto help you with your first online purchases, or a longtimeAmazon.com shopper who wants to become an online entrepreneur,Amazon.com For Dummies® has what you need. Use it todayto get started, and tomorrow to help you manage your own successfulonline business.","language":"en","currency":"USD","id":"0764568663","title":"Amazon.com For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=udfjatRRqroC&source=gbs_api","authors":["Mara Friedman"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build strong foundation for entering the world of Machine Learning and data science with the help of this comprehensive guide About This Book Get started in the field of Machine Learning with the help of this solid, concept-rich, yet highly practical guide. Your one-stop solution for everything that matters in mastering the whats and whys of Machine Learning algorithms and their implementation. Get a solid foundation for your entry into Machine Learning by strengthening your roots (algorithms) with this comprehensive guide. Who This Book Is For This book is for IT professionals who want to enter the field of data science and are very new to Machine Learning. Familiarity with languages such as R and Python will be invaluable here. What You Will Learn Acquaint yourself with important elements of Machine Learning Understand the feature selection and feature engineering process Assess performance and error trade-offs for Linear Regression Build a data model and understand how it works by using different types of algorithm Learn to tune the parameters of Support Vector machines Implement clusters to a dataset Explore the concept of Natural Processing Language and Recommendation Systems Create a ML architecture from scratch. In Detail As the amount of data continues to grow at an almost incomprehensible rate, being able to understand and process data is becoming a key differentiator for competitive organizations. Machine learning applications are everywhere, from self-driving cars, spam detection, document search, and trading strategies, to speech recognition. This makes machine learning well-suited to the present-day era of Big Data and Data Science. The main challenge is how to transform data into actionable knowledge. In this book you will learn all the important Machine Learning algorithms that are commonly used in the field of data science. These algorithms can be used for supervised as well as unsupervised learning, reinforcement learning, and semi-supervised learning. A few famous algorithms that are covered in this book are Linear regression, Logistic Regression, SVM, Naive Bayes, K-Means, Random Forest, TensorFlow, and Feature engineering. In this book you will also learn how these algorithms work and their practical implementation to resolve your problems. This book will also introduce you to the Natural Processing Language and Recommendation systems, which help you run multiple algorithms simultaneously. On completion of the book you will have mastered selecting Machine Learning algorithms for clustering, classification, or regression based on for your problem. Style and approach An easy-to-follow, step-by-step guide that will help you get to grips with real -world applications of Algorithms for Machine Learning.","language":"en","currency":"USD","id":"1785884514","title":"Machine Learning Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-ZDDwAAQBAJ&source=gbs_api","authors":["Giuseppe Bonaccorso"]},{"pageCount":462,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UanWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Automating the Continuous Deployment Pipeline with Containerized Microservices About This Book First principles of devops, Ansible, Docker, Kubernetes, microservices Architect your software in a better and more efficient way with microservices packed as immutable containers Practical guide describing an extremely modern and advanced devops toolchain that can be improved continuously Who This Book Is For If you are an intermediate-level developer who wants to master the whole microservices development and deployment lifecycle using some of the latest and greatest practices and tools, this is the book for you. Familiarity with the basics of Devops and Continuous Deployment will be useful. What You Will Learn Get to grips with the fundamentals of Devops Architect efficient software in a better and more efficient way with the help of microservices Use Docker, Kubernetes, Ansible, Ubuntu, Docker Swarm and more Implement fast, reliable and continuous deployments with zero-downtime and ability to roll-back Learn about centralized logging and monitoring of your cluster Design self-healing systems capable of recovery from both hardware and software failures In Detail Building a complete modern devops toolchain requires not only the whole microservices development and a complete deployment lifecycle, but also the latest and greatest practices and tools. Victor Farcic argues from first principles how to build a devops toolchain. This book shows you how to chain together Docker, Kubernetes, Ansible, Ubuntu, and other tools to build the complete devops toolkit. Style and approach This book follows a unique, hands-on approach familiarizing you to the Devops 2.0 toolkit in a very practical manner. Although there will be a lot of theory, you won't be able to complete this book by reading it in a metro on a way to work. You'll need to be in front of your computer and get your hands dirty.","language":"en","currency":"USD","id":"1785280317","title":"The DevOps 2.0 Toolkit","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UanWDQAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xTpUCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"A General Management Perspective","description":"Business Intelligence Strategy and Big Data Analytics is written for business leaders, managers, and analysts - people who are involved with advancing the use of BI at their companies or who need to better understand what BI is and how it can be used to improve profitability. It is written from a general management perspective, and it draws on observations at 12 companies whose annual revenues range between $500 million and $20 billion. Over the past 15 years, my company has formulated vendor-neutral business-focused BI strategies and program execution plans in collaboration with manufacturers, distributors, retailers, logistics companies, insurers, investment companies, credit unions, and utilities, among others. It is through these experiences that we have validated business-driven BI strategy formulation methods and identified common enterprise BI program execution challenges. In recent years, terms like “big data” and “big data analytics” have been introduced into the business and technical lexicon. Upon close examination, the newer terminology is about the same thing that BI has always been about: analyzing the vast amounts of data that companies generate and\/or purchase in the course of business as a means of improving profitability and competitiveness. Accordingly, we will use the terms BI and business intelligence throughout the book, and we will discuss the newer concepts like big data as appropriate. More broadly, the goal of this book is to share methods and observations that will help companies achieve BI success and thereby increase revenues, reduce costs, or both. Provides ideas for improving the business performance of one’s company or business functions Emphasizes proven, practical, step-by-step methods that readers can readily apply in their companies Includes exercises and case studies with road-tested advice about formulating BI strategies and program plans","language":"en","currency":"USD","id":"0128094893","title":"Business Intelligence Strategy and Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xTpUCwAAQBAJ&source=gbs_api","authors":["Steve Williams"]},{"pageCount":516,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tx2CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.91,"subtitle":"Design and implement investment strategies based on smart algorithms that learn from data using Python","description":"Explore effective trading strategies in real-world markets using NumPy, spaCy, pandas, scikit-learn, and Keras Key Features Implement machine learning algorithms to build, train, and validate algorithmic models Create your own algorithmic design process to apply probabilistic machine learning approaches to trading decisions Develop neural networks for algorithmic trading to perform time series forecasting and smart analytics Book Description The explosive growth of digital data has boosted the demand for expertise in trading strategies that use machine learning (ML). This book enables you to use a broad range of supervised and unsupervised algorithms to extract signals from a wide variety of data sources and create powerful investment strategies. This book shows how to access market, fundamental, and alternative data via API or web scraping and offers a framework to evaluate alternative data. You’ll practice the ML workflow from model design, loss metric definition, and parameter tuning to performance evaluation in a time series context. You will understand ML algorithms such as Bayesian and ensemble methods and manifold learning, and will know how to train and tune these models using pandas, statsmodels, sklearn, PyMC3, xgboost, lightgbm, and catboost. This book also teaches you how to extract features from text data using spaCy, classify news and assign sentiment scores, and to use gensim to model topics and learn word embeddings from financial reports. You will also build and evaluate neural networks, including RNNs and CNNs, using Keras and PyTorch to exploit unstructured data for sophisticated strategies. Finally, you will apply transfer learning to satellite images to predict economic activity and use reinforcement learning to build agents that learn to trade in the OpenAI Gym. What you will learn Implement machine learning techniques to solve investment and trading problems Leverage market, fundamental, and alternative data to research alpha factors Design and fine-tune supervised, unsupervised, and reinforcement learning models Optimize portfolio risk and performance using pandas, NumPy, and scikit-learn Integrate machine learning models into a live trading strategy on Quantopian Evaluate strategies using reliable backtesting methodologies for time series Design and evaluate deep neural networks using Keras, PyTorch, and TensorFlow Work with reinforcement learning for trading strategies in the OpenAI Gym Who this book is for Hands-On Machine Learning for Algorithmic Trading is for data analysts, data scientists, and Python developers, as well as investment analysts and portfolio managers working within the finance and investment industry. If you want to perform efficient algorithmic trading by developing smart investigating strategies using machine learning algorithms, this is the book for you. Some understanding of Python and machine learning techniques is mandatory.","language":"en","currency":"USD","id":"1789342716","title":"Hands-On Machine Learning for Algorithmic Trading","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tx2CDwAAQBAJ&source=gbs_api","authors":["Stefan Jansen"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C-dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build Machine Learning models with a sound statistical understanding. About This Book Learn about the statistics behind powerful predictive models with p-value, ANOVA, and F- statistics. Implement statistical computations programmatically for supervised and unsupervised learning through K-means clustering. Master the statistical aspect of Machine Learning with the help of this example-rich guide to R and Python. Who This Book Is For This book is intended for developers with little to no background in statistics, who want to implement Machine Learning in their systems. Some programming knowledge in R or Python will be useful. What You Will Learn Understand the Statistical and Machine Learning fundamentals necessary to build models Understand the major differences and parallels between the statistical way and the Machine Learning way to solve problems Learn how to prepare data and feed models by using the appropriate Machine Learning algorithms from the more-than-adequate R and Python packages Analyze the results and tune the model appropriately to your own predictive goals Understand the concepts of required statistics for Machine Learning Introduce yourself to necessary fundamentals required for building supervised & unsupervised deep learning models Learn reinforcement learning and its application in the field of artificial intelligence domain In Detail Complex statistics in Machine Learning worry a lot of developers. Knowing statistics helps you build strong Machine Learning models that are optimized for a given problem statement. This book will teach you all it takes to perform complex statistical computations required for Machine Learning. You will gain information on statistics behind supervised learning, unsupervised learning, reinforcement learning, and more. Understand the real-world examples that discuss the statistical side of Machine Learning and familiarize yourself with it. You will also design programs for performing tasks such as model, parameter fitting, regression, classification, density collection, and more. By the end of the book, you will have mastered the required statistics for Machine Learning and will be able to apply your new skills to any sort of industry problem. Style and approach This practical, step-by-step guide will give you an understanding of the Statistical and Machine Learning fundamentals you'll need to build models.","language":"en","currency":"USD","id":"1788291220","title":"Statistics for Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C-dDDwAAQBAJ&source=gbs_api","authors":["Pratap Dangeti"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHINEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Focused coverage of every topic on the current version of the CompTIA CySA+ exam Get on the fast track to becoming CompTIA CySA+ certified with this affordable, portable study tool. Inside, cybersecurity professional Bobby Rogers guides you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA CySA+ Exam CS0-002, this certification passport is your ticket to success on exam day. Designed for focus on key topics and exam success: List of official exam objectives covered by domain Exam Tip element offers expert pointers for success on the test Key Term highlights specific term or acronym definitions key to passing the exam Caution notes common pitfalls and real-world issues as well as warnings about the exam Tables, bulleted lists, and figures throughout focus on quick reference and review Cross-References point to an essential, related concept covered elsewhere in the book Practice questions and content review after each objective section prepare you for exam mastery Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: Customizable practice exam test engine for CS0-002 200+ realistic multiple-choice and performance-based practice questions and in-depth explanations","language":"en","currency":"USD","id":"1260462250","title":"CompTIA CySA+ Cybersecurity Analyst Certification Passport (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHINEAAAQBAJ&source=gbs_api","authors":["Bobby E. Rogers"]},{"pageCount":276,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bXJiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Develop an extensive skill set to break self-learning systems using Python","description":"Become a master at penetration testing using machine learning with Python Key Features Identify ambiguities and breach intelligent security systems Perform unique cyber attacks to breach robust systems Learn to leverage machine learning algorithms Book Description Cyber security is crucial for both businesses and individuals. As systems are getting smarter, we now see machine learning interrupting computer security. With the adoption of machine learning in upcoming security products, it’s important for pentesters and security researchers to understand how these systems work, and to breach them for testing purposes. This book begins with the basics of machine learning and the algorithms used to build robust systems. Once you’ve gained a fair understanding of how security products leverage machine learning, you'll dive into the core concepts of breaching such systems. Through practical use cases, you’ll see how to find loopholes and surpass a self-learning security system. As you make your way through the chapters, you’ll focus on topics such as network intrusion detection and AV and IDS evasion. We’ll also cover the best practices when identifying ambiguities, and extensive techniques to breach an intelligent system. By the end of this book, you will be well-versed with identifying loopholes in a self-learning security system and will be able to efficiently breach a machine learning system. What you will learn Take an in-depth look at machine learning Get to know natural language processing (NLP) Understand malware feature engineering Build generative adversarial networks using Python libraries Work on threat hunting with machine learning and the ELK stack Explore the best practices for machine learning Who this book is for This book is for pen testers and security professionals who are interested in learning techniques to break an intelligent security system. Basic knowledge of Python is needed, but no prior knowledge of machine learning is necessary.","language":"en","currency":"USD","id":"178899311X","title":"Mastering Machine Learning for Penetration Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bXJiDwAAQBAJ&source=gbs_api","authors":["Chiheb Chebbi"]},{"pageCount":458,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iNuSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques for predictive modeling, 3rd Edition","description":"Solve real-world data problems with R and machine learning Key Features Third edition of the bestselling, widely acclaimed R machine learning book, updated and improved for R 3.6 and beyond Harness the power of R to build flexible, effective, and transparent machine learning models Learn quickly with a clear, hands-on guide by experienced machine learning teacher and practitioner, Brett Lantz Book Description Machine learning, at its core, is concerned with transforming data into actionable knowledge. R offers a powerful set of machine learning methods to quickly and easily gain insight from your data. Machine Learning with R, Third Edition provides a hands-on, readable guide to applying machine learning to real-world problems. Whether you are an experienced R user or new to the language, Brett Lantz teaches you everything you need to uncover key insights, make new predictions, and visualize your findings. This new 3rd edition updates the classic R data science book to R 3.6 with newer and better libraries, advice on ethical and bias issues in machine learning, and an introduction to deep learning. Find powerful new insights in your data; discover machine learning with R. What you will learn Discover the origins of machine learning and how exactly a computer learns by example Prepare your data for machine learning work with the R programming language Classify important outcomes using nearest neighbor and Bayesian methods Predict future events using decision trees, rules, and support vector machines Forecast numeric data and estimate financial values using regression methods Model complex processes with artificial neural networks — the basis of deep learning Avoid bias in machine learning models Evaluate your models and improve their performance Connect R to SQL databases and emerging big data technologies such as Spark, H2O, and TensorFlow Who this book is for Data scientists, students, and other practitioners who want a clear, accessible guide to machine learning with R.","language":"en","currency":"USD","id":"1788291557","title":"Machine Learning with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iNuSDwAAQBAJ&source=gbs_api","authors":["Brett Lantz"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vLIvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":215.2,"subtitle":"Proceedings of ICACNI 2016","description":"The book focuses on both theory and applications in the broad areas of communication technology, computer science and information security. This two volume book contains the Proceedings of 4th International Conference on Advanced Computing, Networking and Informatics. This book brings together academic scientists, professors, research scholars and students to share and disseminate information on knowledge and scientific research works related to computing, networking, and informatics to discuss the practical challenges encountered and the solutions adopted. The book also promotes translation of basic research into applied investigation and convert applied investigation into practice.","language":"en","currency":"USD","id":"9811033765","title":"Progress in Intelligent Computing Techniques: Theory, Practice, and Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vLIvDwAAQBAJ&source=gbs_api","authors":["Pankaj Kumar Sa","Manmath Narayan Sahoo","M. Murugappan","Yulei Wu","Banshidhar Majhi"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unleash the combination of Docker and Jenkins in order to enhance the DevOps workflow About This Book Build reliable and secure applications using Docker containers. Create a complete Continuous Delivery pipeline using Docker, Jenkins, and Ansible. Deliver your applications directly on the Docker Swarm cluster. Create more complex solutions using multi-containers and database migrations. Who This Book Is For This book is indented to provide a full overview of deep learning. From the beginner in deep learning and artificial intelligence to the data scientist who wants to become familiar with Theano and its supporting libraries, or have an extended understanding of deep neural nets. Some basic skills in Python programming and computer science will help, as well as skills in elementary algebra and calculus. What You Will Learn Get to grips with docker fundamentals and how to dockerize an application for the Continuous Delivery process Configure Jenkins and scale it using Docker-based agents Understand the principles and the technical aspects of a successful Continuous Delivery pipeline Create a complete Continuous Delivery process using modern tools: Docker, Jenkins, and Ansible Write acceptance tests using Cucumber and run them in the Docker ecosystem using Jenkins Create multi-container applications using Docker Compose Managing database changes inside the Continuous Delivery process and understand effective frameworks such as Cucumber and Flyweight Build clustering applications with Jenkins using Docker Swarm Publish a built Docker image to a Docker Registry and deploy cycles of Jenkins pipelines using community best practices In Detail The combination of Docker and Jenkins improves your Continuous Delivery pipeline using fewer resources. It also helps you scale up your builds, automate tasks and speed up Jenkins performance with the benefits of Docker containerization. This book will explain the advantages of combining Jenkins and Docker to improve the continuous integration and delivery process of app development. It will start with setting up a Docker server and configuring Jenkins on it. It will then provide steps to build applications on Docker files and integrate them with Jenkins using continuous delivery processes such as continuous integration, automated acceptance testing, and configuration management. Moving on you will learn how to ensure quick application deployment with Docker containers along with scaling Jenkins using Docker Swarm. Next, you will get to know how to deploy applications using Docker images and testing them with Jenkins. By the end of the book, you will be enhancing the DevOps workflow by integrating the functionalities of Docker and Jenkins. Style and approach The book is aimed at DevOps Engineers, developers and IT Operations who want to enhance the DevOps culture using Docker and Jenkins.","language":"en","currency":"USD","id":"1787126145","title":"Continuous Delivery with Docker and Jenkins","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RpZGDwAAQBAJ&source=gbs_api","authors":["Rafal Leszko"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=439Is75pU5cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A Project Lifecycle Approach Using Oracle Technology","description":"Over 80 quick and advanced recipes that focus on real world techniques and solutions to manage, design, and build data warehouse and business intelligence projects with this book and ebook.","language":"en","currency":"USD","id":"1849685495","title":"Business Intelligence Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=439Is75pU5cC&source=gbs_api","authors":["John Heaton"]},{"pageCount":492,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BsNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Foundations and Challenges","description":"This handbook offers a comprehensive overview of cloud computing security technology and implementation, while exploring practical solutions to a wide range of cloud computing security issues. With more organizations using cloud computing and cloud providers for data operations, proper security in these and other potentially vulnerable areas have become a priority for organizations of all sizes across the globe. Research efforts from both academia and industry in all security aspects related to cloud computing are gathered within one reference guide.","language":"en","currency":"USD","id":"1482260956","title":"Cloud Computing Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BsNDgAAQBAJ&source=gbs_api","authors":["John R. Vacca"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AOxzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.4,"subtitle":"Architecture as Strategy","description":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business—without really knowing what that is. This book’s toolkit provides architects, product managers, technology managers, and executives with a shared language—in the form of repeatable, practical patterns and templates—to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","language":"en","currency":"USD","id":"1492040827","title":"Technology Strategy Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AOxzDwAAQBAJ&source=gbs_api","authors":["Eben Hewitt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Gain Essential Linux Administration Skills Easily Effectively set up and manage popular Linux distributions on individual servers and build entire network infrastructures using this practical resource. Fully updated to cover the latest tools and techniques, Linux Administration: A Beginner’s Guide, Eighth Edition features clear explanations, step-by-step instructions, and real-world examples. Find out how to configure hardware and software, work from the command line or GUI, maintain Internet and network services, and secure your data. Performance tuning, virtualization, containers, software management, security, and backup solutions are covered in detail. Install and configure Linux, including the latest distributions from Fedora, Ubuntu, CentOS, openSUSE, Debian, and RHEL. Set up and administer core system services, daemons, users, and groups. Manage software applications from source code or binary packages. Customize, build, or patch the Linux kernel. Understand and manage the Linux network stack and networking protocols, including TCP\/IP, ARP, IPv4, and IPv6. Minimize security threats and build reliable firewalls and routers with Netfilter (iptables and nftables) and Linux. Create and maintain DNS, FTP, web, e-mail, print, LDAP, VoIP, and SSH servers and services. Share resources using GlusterFS, NFS, and Samba. Spin-up and manage Linux-based servers in popular cloud environments, such as OpenStack, AWS, Azure, Linode, and GCE. Explore virtualization and container technologies using KVM, Docker, Kubernetes, and Open Container Initiative (OCI) tooling. Download specially curated Virtual Machine image and containers that replicate various exercises, software, servers, commands, and concepts covered in the book. Wale Soyinka is a father, system administrator, a DevOps\/SecOps aficionado, an open source evangelist, a hacker, and a well-respected world-renowned chef (in his mind). He is the author of Advanced Linux Administration as well as other Linux, Network, and Windows administration training materials.","language":"en","currency":"USD","id":"1260441717","title":"Linux Administration: A Beginner’s Guide, Eighth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yubWDwAAQBAJ&source=gbs_api","authors":["Wale Soyinka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ib24BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"If you are a security professional whose workload is increasing, or a Puppet professional looking to increase your knowledge of security, or even an experienced systems administrator, then this book is for you. This book will take you to the next level of security automation using Puppet. The book requires no prior knowledge of Puppet to get started.","language":"en","currency":"USD","id":"1784398896","title":"Learning Puppet Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ib24BwAAQBAJ&source=gbs_api","authors":["Jason Slagle"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f1v2Vpuh8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A step-by-step tutorial-based approach.This book is of great help for agile teams who are already using or planning to use the GreenHopper tooling system to execute agile projects. It suits all roles in an agile project including system administrators, stakeholders, product owners, scrum masters, and team members. Fundamental knowledge of JIRA is essential.","language":"en","currency":"USD","id":"1849699747","title":"Agile Project Management with GreenHopper 6 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f1v2Vpuh8ZQC&source=gbs_api","authors":["Jaibeer Malik"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Master the techniques and sophisticated analytics used to construct Spark-based solutions that scale to deliver production-grade data science products About This Book Develop and apply advanced analytical techniques with Spark Learn how to tell a compelling story with data science using Spark's ecosystem Explore data at scale and work with cutting edge data science methods Who This Book Is For This book is for those who have beginner-level familiarity with the Spark architecture and data science applications, especially those who are looking for a challenge and want to learn cutting edge techniques. This book assumes working knowledge of data science, common machine learning methods, and popular data science tools, and assumes you have previously run proof of concept studies and built prototypes. What You Will Learn Learn the design patterns that integrate Spark into industrialized data science pipelines See how commercial data scientists design scalable code and reusable code for data science services Explore cutting edge data science methods so that you can study trends and causality Discover advanced programming techniques using RDD and the DataFrame and Dataset APIs Find out how Spark can be used as a universal ingestion engine tool and as a web scraper Practice the implementation of advanced topics in graph processing, such as community detection and contact chaining Get to know the best practices when performing Extended Exploratory Data Analysis, commonly used in commercial data science teams Study advanced Spark concepts, solution design patterns, and integration architectures Demonstrate powerful data science pipelines In Detail Data science seeks to transform the world using data, and this is typically achieved through disrupting and changing real processes in real industries. In order to operate at this level you need to build data science solutions of substance –solutions that solve real problems. Spark has emerged as the big data platform of choice for data scientists due to its speed, scalability, and easy-to-use APIs. This book deep dives into using Spark to deliver production-grade data science solutions. This process is demonstrated by exploring the construction of a sophisticated global news analysis service that uses Spark to generate continuous geopolitical and current affairs insights.You will learn all about the core Spark APIs and take a comprehensive tour of advanced libraries, including Spark SQL, Spark Streaming, MLlib, and more. You will be introduced to advanced techniques and methods that will help you to construct commercial-grade data products. Focusing on a sequence of tutorials that deliver a working news intelligence service, you will learn about advanced Spark architectures, how to work with geographic data in Spark, and how to tune Spark algorithms so they scale linearly. Style and approach This is an advanced guide for those with beginner-level familiarity with the Spark architecture and working with Data Science applications. Mastering Spark for Data Science is a practical tutorial that uses core Spark APIs and takes a deep dive into advanced libraries including: Spark SQL, visual streaming, and MLlib. This book expands on titles like: Machine Learning with Spark and Learning Spark. It is the next learning curve for those comfortable with Spark and looking to improve their skills.","language":"en","currency":"USD","id":"1785888285","title":"Mastering Spark for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prkrDwAAQBAJ&source=gbs_api","authors":["Andrew Morgan","Antoine Amend","David George","Matthew Hallett"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AOxzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.4,"subtitle":"Architecture as Strategy","description":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business—without really knowing what that is. This book’s toolkit provides architects, product managers, technology managers, and executives with a shared language—in the form of repeatable, practical patterns and templates—to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","language":"en","currency":"USD","id":"1492040827","title":"Technology Strategy Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AOxzDwAAQBAJ&source=gbs_api","authors":["Eben Hewitt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Gain Essential Linux Administration Skills Easily Effectively set up and manage popular Linux distributions on individual servers and build entire network infrastructures using this practical resource. Fully updated to cover the latest tools and techniques, Linux Administration: A Beginner’s Guide, Eighth Edition features clear explanations, step-by-step instructions, and real-world examples. Find out how to configure hardware and software, work from the command line or GUI, maintain Internet and network services, and secure your data. Performance tuning, virtualization, containers, software management, security, and backup solutions are covered in detail. Install and configure Linux, including the latest distributions from Fedora, Ubuntu, CentOS, openSUSE, Debian, and RHEL. Set up and administer core system services, daemons, users, and groups. Manage software applications from source code or binary packages. Customize, build, or patch the Linux kernel. Understand and manage the Linux network stack and networking protocols, including TCP\/IP, ARP, IPv4, and IPv6. Minimize security threats and build reliable firewalls and routers with Netfilter (iptables and nftables) and Linux. Create and maintain DNS, FTP, web, e-mail, print, LDAP, VoIP, and SSH servers and services. Share resources using GlusterFS, NFS, and Samba. Spin-up and manage Linux-based servers in popular cloud environments, such as OpenStack, AWS, Azure, Linode, and GCE. Explore virtualization and container technologies using KVM, Docker, Kubernetes, and Open Container Initiative (OCI) tooling. Download specially curated Virtual Machine image and containers that replicate various exercises, software, servers, commands, and concepts covered in the book. Wale Soyinka is a father, system administrator, a DevOps\/SecOps aficionado, an open source evangelist, a hacker, and a well-respected world-renowned chef (in his mind). He is the author of Advanced Linux Administration as well as other Linux, Network, and Windows administration training materials.","language":"en","currency":"USD","id":"1260441717","title":"Linux Administration: A Beginner’s Guide, Eighth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yubWDwAAQBAJ&source=gbs_api","authors":["Wale Soyinka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ib24BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"If you are a security professional whose workload is increasing, or a Puppet professional looking to increase your knowledge of security, or even an experienced systems administrator, then this book is for you. This book will take you to the next level of security automation using Puppet. The book requires no prior knowledge of Puppet to get started.","language":"en","currency":"USD","id":"1784398896","title":"Learning Puppet Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ib24BwAAQBAJ&source=gbs_api","authors":["Jason Slagle"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f1v2Vpuh8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A step-by-step tutorial-based approach.This book is of great help for agile teams who are already using or planning to use the GreenHopper tooling system to execute agile projects. It suits all roles in an agile project including system administrators, stakeholders, product owners, scrum masters, and team members. Fundamental knowledge of JIRA is essential.","language":"en","currency":"USD","id":"1849699747","title":"Agile Project Management with GreenHopper 6 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f1v2Vpuh8ZQC&source=gbs_api","authors":["Jaibeer Malik"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Master the techniques and sophisticated analytics used to construct Spark-based solutions that scale to deliver production-grade data science products About This Book Develop and apply advanced analytical techniques with Spark Learn how to tell a compelling story with data science using Spark's ecosystem Explore data at scale and work with cutting edge data science methods Who This Book Is For This book is for those who have beginner-level familiarity with the Spark architecture and data science applications, especially those who are looking for a challenge and want to learn cutting edge techniques. This book assumes working knowledge of data science, common machine learning methods, and popular data science tools, and assumes you have previously run proof of concept studies and built prototypes. What You Will Learn Learn the design patterns that integrate Spark into industrialized data science pipelines See how commercial data scientists design scalable code and reusable code for data science services Explore cutting edge data science methods so that you can study trends and causality Discover advanced programming techniques using RDD and the DataFrame and Dataset APIs Find out how Spark can be used as a universal ingestion engine tool and as a web scraper Practice the implementation of advanced topics in graph processing, such as community detection and contact chaining Get to know the best practices when performing Extended Exploratory Data Analysis, commonly used in commercial data science teams Study advanced Spark concepts, solution design patterns, and integration architectures Demonstrate powerful data science pipelines In Detail Data science seeks to transform the world using data, and this is typically achieved through disrupting and changing real processes in real industries. In order to operate at this level you need to build data science solutions of substance –solutions that solve real problems. Spark has emerged as the big data platform of choice for data scientists due to its speed, scalability, and easy-to-use APIs. This book deep dives into using Spark to deliver production-grade data science solutions. This process is demonstrated by exploring the construction of a sophisticated global news analysis service that uses Spark to generate continuous geopolitical and current affairs insights.You will learn all about the core Spark APIs and take a comprehensive tour of advanced libraries, including Spark SQL, Spark Streaming, MLlib, and more. You will be introduced to advanced techniques and methods that will help you to construct commercial-grade data products. Focusing on a sequence of tutorials that deliver a working news intelligence service, you will learn about advanced Spark architectures, how to work with geographic data in Spark, and how to tune Spark algorithms so they scale linearly. Style and approach This is an advanced guide for those with beginner-level familiarity with the Spark architecture and working with Data Science applications. Mastering Spark for Data Science is a practical tutorial that uses core Spark APIs and takes a deep dive into advanced libraries including: Spark SQL, visual streaming, and MLlib. This book expands on titles like: Machine Learning with Spark and Learning Spark. It is the next learning curve for those comfortable with Spark and looking to improve their skills.","language":"en","currency":"USD","id":"1785888285","title":"Mastering Spark for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prkrDwAAQBAJ&source=gbs_api","authors":["Andrew Morgan","Antoine Amend","David George","Matthew Hallett"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AOxzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.4,"subtitle":"Architecture as Strategy","description":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business—without really knowing what that is. This book’s toolkit provides architects, product managers, technology managers, and executives with a shared language—in the form of repeatable, practical patterns and templates—to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","language":"en","currency":"USD","id":"1492040827","title":"Technology Strategy Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AOxzDwAAQBAJ&source=gbs_api","authors":["Eben Hewitt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Gain Essential Linux Administration Skills Easily Effectively set up and manage popular Linux distributions on individual servers and build entire network infrastructures using this practical resource. Fully updated to cover the latest tools and techniques, Linux Administration: A Beginner’s Guide, Eighth Edition features clear explanations, step-by-step instructions, and real-world examples. Find out how to configure hardware and software, work from the command line or GUI, maintain Internet and network services, and secure your data. Performance tuning, virtualization, containers, software management, security, and backup solutions are covered in detail. Install and configure Linux, including the latest distributions from Fedora, Ubuntu, CentOS, openSUSE, Debian, and RHEL. Set up and administer core system services, daemons, users, and groups. Manage software applications from source code or binary packages. Customize, build, or patch the Linux kernel. Understand and manage the Linux network stack and networking protocols, including TCP\/IP, ARP, IPv4, and IPv6. Minimize security threats and build reliable firewalls and routers with Netfilter (iptables and nftables) and Linux. Create and maintain DNS, FTP, web, e-mail, print, LDAP, VoIP, and SSH servers and services. Share resources using GlusterFS, NFS, and Samba. Spin-up and manage Linux-based servers in popular cloud environments, such as OpenStack, AWS, Azure, Linode, and GCE. Explore virtualization and container technologies using KVM, Docker, Kubernetes, and Open Container Initiative (OCI) tooling. Download specially curated Virtual Machine image and containers that replicate various exercises, software, servers, commands, and concepts covered in the book. Wale Soyinka is a father, system administrator, a DevOps\/SecOps aficionado, an open source evangelist, a hacker, and a well-respected world-renowned chef (in his mind). He is the author of Advanced Linux Administration as well as other Linux, Network, and Windows administration training materials.","language":"en","currency":"USD","id":"1260441717","title":"Linux Administration: A Beginner’s Guide, Eighth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yubWDwAAQBAJ&source=gbs_api","authors":["Wale Soyinka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ib24BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"If you are a security professional whose workload is increasing, or a Puppet professional looking to increase your knowledge of security, or even an experienced systems administrator, then this book is for you. This book will take you to the next level of security automation using Puppet. The book requires no prior knowledge of Puppet to get started.","language":"en","currency":"USD","id":"1784398896","title":"Learning Puppet Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ib24BwAAQBAJ&source=gbs_api","authors":["Jason Slagle"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f1v2Vpuh8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A step-by-step tutorial-based approach.This book is of great help for agile teams who are already using or planning to use the GreenHopper tooling system to execute agile projects. It suits all roles in an agile project including system administrators, stakeholders, product owners, scrum masters, and team members. Fundamental knowledge of JIRA is essential.","language":"en","currency":"USD","id":"1849699747","title":"Agile Project Management with GreenHopper 6 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f1v2Vpuh8ZQC&source=gbs_api","authors":["Jaibeer Malik"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Master the techniques and sophisticated analytics used to construct Spark-based solutions that scale to deliver production-grade data science products About This Book Develop and apply advanced analytical techniques with Spark Learn how to tell a compelling story with data science using Spark's ecosystem Explore data at scale and work with cutting edge data science methods Who This Book Is For This book is for those who have beginner-level familiarity with the Spark architecture and data science applications, especially those who are looking for a challenge and want to learn cutting edge techniques. This book assumes working knowledge of data science, common machine learning methods, and popular data science tools, and assumes you have previously run proof of concept studies and built prototypes. What You Will Learn Learn the design patterns that integrate Spark into industrialized data science pipelines See how commercial data scientists design scalable code and reusable code for data science services Explore cutting edge data science methods so that you can study trends and causality Discover advanced programming techniques using RDD and the DataFrame and Dataset APIs Find out how Spark can be used as a universal ingestion engine tool and as a web scraper Practice the implementation of advanced topics in graph processing, such as community detection and contact chaining Get to know the best practices when performing Extended Exploratory Data Analysis, commonly used in commercial data science teams Study advanced Spark concepts, solution design patterns, and integration architectures Demonstrate powerful data science pipelines In Detail Data science seeks to transform the world using data, and this is typically achieved through disrupting and changing real processes in real industries. In order to operate at this level you need to build data science solutions of substance –solutions that solve real problems. Spark has emerged as the big data platform of choice for data scientists due to its speed, scalability, and easy-to-use APIs. This book deep dives into using Spark to deliver production-grade data science solutions. This process is demonstrated by exploring the construction of a sophisticated global news analysis service that uses Spark to generate continuous geopolitical and current affairs insights.You will learn all about the core Spark APIs and take a comprehensive tour of advanced libraries, including Spark SQL, Spark Streaming, MLlib, and more. You will be introduced to advanced techniques and methods that will help you to construct commercial-grade data products. Focusing on a sequence of tutorials that deliver a working news intelligence service, you will learn about advanced Spark architectures, how to work with geographic data in Spark, and how to tune Spark algorithms so they scale linearly. Style and approach This is an advanced guide for those with beginner-level familiarity with the Spark architecture and working with Data Science applications. Mastering Spark for Data Science is a practical tutorial that uses core Spark APIs and takes a deep dive into advanced libraries including: Spark SQL, visual streaming, and MLlib. This book expands on titles like: Machine Learning with Spark and Learning Spark. It is the next learning curve for those comfortable with Spark and looking to improve their skills.","language":"en","currency":"USD","id":"1785888285","title":"Mastering Spark for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prkrDwAAQBAJ&source=gbs_api","authors":["Andrew Morgan","Antoine Amend","David George","Matthew Hallett"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AOxzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.4,"subtitle":"Architecture as Strategy","description":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business—without really knowing what that is. This book’s toolkit provides architects, product managers, technology managers, and executives with a shared language—in the form of repeatable, practical patterns and templates—to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","language":"en","currency":"USD","id":"1492040827","title":"Technology Strategy Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AOxzDwAAQBAJ&source=gbs_api","authors":["Eben Hewitt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Gain Essential Linux Administration Skills Easily Effectively set up and manage popular Linux distributions on individual servers and build entire network infrastructures using this practical resource. Fully updated to cover the latest tools and techniques, Linux Administration: A Beginner’s Guide, Eighth Edition features clear explanations, step-by-step instructions, and real-world examples. Find out how to configure hardware and software, work from the command line or GUI, maintain Internet and network services, and secure your data. Performance tuning, virtualization, containers, software management, security, and backup solutions are covered in detail. Install and configure Linux, including the latest distributions from Fedora, Ubuntu, CentOS, openSUSE, Debian, and RHEL. Set up and administer core system services, daemons, users, and groups. Manage software applications from source code or binary packages. Customize, build, or patch the Linux kernel. Understand and manage the Linux network stack and networking protocols, including TCP\/IP, ARP, IPv4, and IPv6. Minimize security threats and build reliable firewalls and routers with Netfilter (iptables and nftables) and Linux. Create and maintain DNS, FTP, web, e-mail, print, LDAP, VoIP, and SSH servers and services. Share resources using GlusterFS, NFS, and Samba. Spin-up and manage Linux-based servers in popular cloud environments, such as OpenStack, AWS, Azure, Linode, and GCE. Explore virtualization and container technologies using KVM, Docker, Kubernetes, and Open Container Initiative (OCI) tooling. Download specially curated Virtual Machine image and containers that replicate various exercises, software, servers, commands, and concepts covered in the book. Wale Soyinka is a father, system administrator, a DevOps\/SecOps aficionado, an open source evangelist, a hacker, and a well-respected world-renowned chef (in his mind). He is the author of Advanced Linux Administration as well as other Linux, Network, and Windows administration training materials.","language":"en","currency":"USD","id":"1260441717","title":"Linux Administration: A Beginner’s Guide, Eighth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yubWDwAAQBAJ&source=gbs_api","authors":["Wale Soyinka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ib24BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"If you are a security professional whose workload is increasing, or a Puppet professional looking to increase your knowledge of security, or even an experienced systems administrator, then this book is for you. This book will take you to the next level of security automation using Puppet. The book requires no prior knowledge of Puppet to get started.","language":"en","currency":"USD","id":"1784398896","title":"Learning Puppet Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ib24BwAAQBAJ&source=gbs_api","authors":["Jason Slagle"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f1v2Vpuh8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A step-by-step tutorial-based approach.This book is of great help for agile teams who are already using or planning to use the GreenHopper tooling system to execute agile projects. It suits all roles in an agile project including system administrators, stakeholders, product owners, scrum masters, and team members. Fundamental knowledge of JIRA is essential.","language":"en","currency":"USD","id":"1849699747","title":"Agile Project Management with GreenHopper 6 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f1v2Vpuh8ZQC&source=gbs_api","authors":["Jaibeer Malik"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Master the techniques and sophisticated analytics used to construct Spark-based solutions that scale to deliver production-grade data science products About This Book Develop and apply advanced analytical techniques with Spark Learn how to tell a compelling story with data science using Spark's ecosystem Explore data at scale and work with cutting edge data science methods Who This Book Is For This book is for those who have beginner-level familiarity with the Spark architecture and data science applications, especially those who are looking for a challenge and want to learn cutting edge techniques. This book assumes working knowledge of data science, common machine learning methods, and popular data science tools, and assumes you have previously run proof of concept studies and built prototypes. What You Will Learn Learn the design patterns that integrate Spark into industrialized data science pipelines See how commercial data scientists design scalable code and reusable code for data science services Explore cutting edge data science methods so that you can study trends and causality Discover advanced programming techniques using RDD and the DataFrame and Dataset APIs Find out how Spark can be used as a universal ingestion engine tool and as a web scraper Practice the implementation of advanced topics in graph processing, such as community detection and contact chaining Get to know the best practices when performing Extended Exploratory Data Analysis, commonly used in commercial data science teams Study advanced Spark concepts, solution design patterns, and integration architectures Demonstrate powerful data science pipelines In Detail Data science seeks to transform the world using data, and this is typically achieved through disrupting and changing real processes in real industries. In order to operate at this level you need to build data science solutions of substance –solutions that solve real problems. Spark has emerged as the big data platform of choice for data scientists due to its speed, scalability, and easy-to-use APIs. This book deep dives into using Spark to deliver production-grade data science solutions. This process is demonstrated by exploring the construction of a sophisticated global news analysis service that uses Spark to generate continuous geopolitical and current affairs insights.You will learn all about the core Spark APIs and take a comprehensive tour of advanced libraries, including Spark SQL, Spark Streaming, MLlib, and more. You will be introduced to advanced techniques and methods that will help you to construct commercial-grade data products. Focusing on a sequence of tutorials that deliver a working news intelligence service, you will learn about advanced Spark architectures, how to work with geographic data in Spark, and how to tune Spark algorithms so they scale linearly. Style and approach This is an advanced guide for those with beginner-level familiarity with the Spark architecture and working with Data Science applications. Mastering Spark for Data Science is a practical tutorial that uses core Spark APIs and takes a deep dive into advanced libraries including: Spark SQL, visual streaming, and MLlib. This book expands on titles like: Machine Learning with Spark and Learning Spark. It is the next learning curve for those comfortable with Spark and looking to improve their skills.","language":"en","currency":"USD","id":"1785888285","title":"Mastering Spark for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prkrDwAAQBAJ&source=gbs_api","authors":["Andrew Morgan","Antoine Amend","David George","Matthew Hallett"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AOxzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.4,"subtitle":"Architecture as Strategy","description":"Technologists who want their ideas heard, understood, and funded are often told to speak the language of business—without really knowing what that is. This book’s toolkit provides architects, product managers, technology managers, and executives with a shared language—in the form of repeatable, practical patterns and templates—to produce great technology strategies. Author Eben Hewitt developed 39 patterns over the course of a decade in his work as CTO, CIO, and chief architect for several global tech companies. With these proven tools, you can define, create, elaborate, refine, and communicate your architecture goals, plans, and approach in a way that executives can readily understand, approve, and execute. This book covers: Architecture and strategy: Adopt a strategic architectural mindset to make a meaningful material impact Creating your strategy: Define the components of your technology strategy using proven patterns Communicating the strategy: Convey your technology strategy in a compelling way to a variety of audiences Bringing it all together: Employ patterns individually or in clusters for specific problems; use the complete framework for a comprehensive strategy","language":"en","currency":"USD","id":"1492040827","title":"Technology Strategy Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AOxzDwAAQBAJ&source=gbs_api","authors":["Eben Hewitt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tbYTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A hands-on guide to threat hunting with the ATT&CK™ Framework and open source tools","description":"Get to grips with cyber threat intelligence and data-driven threat hunting while exploring expert tips and techniques Key Features Set up an environment to centralize all data in an Elasticsearch, Logstash, and Kibana (ELK) server that enables threat hunting Carry out atomic hunts to start the threat hunting process and understand the environment Perform advanced hunting using MITRE ATT&CK Evals emulations and Mordor datasets Book Description Threat hunting (TH) provides cybersecurity analysts and enterprises with the opportunity to proactively defend themselves by getting ahead of threats before they can cause major damage to their business. This book is not only an introduction for those who don't know much about the cyber threat intelligence (CTI) and TH world, but also a guide for those with more advanced knowledge of other cybersecurity fields who are looking to implement a TH program from scratch. You will start by exploring what threat intelligence is and how it can be used to detect and prevent cyber threats. As you progress, you'll learn how to collect data, along with understanding it by developing data models. The book will also show you how to set up an environment for TH using open source tools. Later, you will focus on how to plan a hunt with practical examples, before going on to explore the MITRE ATT&CK framework. By the end of this book, you'll have the skills you need to be able to carry out effective hunts in your own environment. What you will learn Understand what CTI is, its key concepts, and how it is useful for preventing threats and protecting your organization Explore the different stages of the TH process Model the data collected and understand how to document the findings Simulate threat actor activity in a lab environment Use the information collected to detect breaches and validate the results of your queries Use documentation and strategies to communicate processes to senior management and the wider business Who this book is for If you are looking to start out in the cyber intelligence and threat hunting domains and want to know more about how to implement a threat hunting division with open-source tools, then this cyber threat intelligence book is for you.","language":"en","currency":"USD","id":"1838551638","title":"Practical Threat Intelligence and Data-Driven Threat Hunting","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tbYTEAAAQBAJ&source=gbs_api","authors":["Valentina Palacin"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jh5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this effective self-study resource Don’t Let the Real Test Be Your First Test! Pass the new Cybersecurity Analyst+ certification exam and obtain the latest security credential from CompTIA using the accurate practice questions contained in this guide. CompTIA CySA+® Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and electronic content, you will get more than 500 practice questions that will fully prepare you for the challenging exam. Designed to help you pass the exam, this is the perfect companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide (Exam CS0-001). Covers all exam topics including: •Threat management•Reconnaissance techniques•Securing a corporate network•Vulnerability management•Cyber incident response•Security architectures•Identity and access management•Secure software development•And much more Digital content includes: •200+ accurate practice questions•A valuable pre-assessment test•Performance-based questions•Fully customizable test engine","language":"en","currency":"USD","id":"1260117006","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jh5sDwAAQBAJ&source=gbs_api","authors":["Jeff T. Parker"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yubWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Gain Essential Linux Administration Skills Easily Effectively set up and manage popular Linux distributions on individual servers and build entire network infrastructures using this practical resource. Fully updated to cover the latest tools and techniques, Linux Administration: A Beginner’s Guide, Eighth Edition features clear explanations, step-by-step instructions, and real-world examples. Find out how to configure hardware and software, work from the command line or GUI, maintain Internet and network services, and secure your data. Performance tuning, virtualization, containers, software management, security, and backup solutions are covered in detail. Install and configure Linux, including the latest distributions from Fedora, Ubuntu, CentOS, openSUSE, Debian, and RHEL. Set up and administer core system services, daemons, users, and groups. Manage software applications from source code or binary packages. Customize, build, or patch the Linux kernel. Understand and manage the Linux network stack and networking protocols, including TCP\/IP, ARP, IPv4, and IPv6. Minimize security threats and build reliable firewalls and routers with Netfilter (iptables and nftables) and Linux. Create and maintain DNS, FTP, web, e-mail, print, LDAP, VoIP, and SSH servers and services. Share resources using GlusterFS, NFS, and Samba. Spin-up and manage Linux-based servers in popular cloud environments, such as OpenStack, AWS, Azure, Linode, and GCE. Explore virtualization and container technologies using KVM, Docker, Kubernetes, and Open Container Initiative (OCI) tooling. Download specially curated Virtual Machine image and containers that replicate various exercises, software, servers, commands, and concepts covered in the book. Wale Soyinka is a father, system administrator, a DevOps\/SecOps aficionado, an open source evangelist, a hacker, and a well-respected world-renowned chef (in his mind). He is the author of Advanced Linux Administration as well as other Linux, Network, and Windows administration training materials.","language":"en","currency":"USD","id":"1260441717","title":"Linux Administration: A Beginner’s Guide, Eighth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yubWDwAAQBAJ&source=gbs_api","authors":["Wale Soyinka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ib24BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"If you are a security professional whose workload is increasing, or a Puppet professional looking to increase your knowledge of security, or even an experienced systems administrator, then this book is for you. This book will take you to the next level of security automation using Puppet. The book requires no prior knowledge of Puppet to get started.","language":"en","currency":"USD","id":"1784398896","title":"Learning Puppet Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ib24BwAAQBAJ&source=gbs_api","authors":["Jason Slagle"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f1v2Vpuh8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A step-by-step tutorial-based approach.This book is of great help for agile teams who are already using or planning to use the GreenHopper tooling system to execute agile projects. It suits all roles in an agile project including system administrators, stakeholders, product owners, scrum masters, and team members. Fundamental knowledge of JIRA is essential.","language":"en","currency":"USD","id":"1849699747","title":"Agile Project Management with GreenHopper 6 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f1v2Vpuh8ZQC&source=gbs_api","authors":["Jaibeer Malik"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Master the techniques and sophisticated analytics used to construct Spark-based solutions that scale to deliver production-grade data science products About This Book Develop and apply advanced analytical techniques with Spark Learn how to tell a compelling story with data science using Spark's ecosystem Explore data at scale and work with cutting edge data science methods Who This Book Is For This book is for those who have beginner-level familiarity with the Spark architecture and data science applications, especially those who are looking for a challenge and want to learn cutting edge techniques. This book assumes working knowledge of data science, common machine learning methods, and popular data science tools, and assumes you have previously run proof of concept studies and built prototypes. What You Will Learn Learn the design patterns that integrate Spark into industrialized data science pipelines See how commercial data scientists design scalable code and reusable code for data science services Explore cutting edge data science methods so that you can study trends and causality Discover advanced programming techniques using RDD and the DataFrame and Dataset APIs Find out how Spark can be used as a universal ingestion engine tool and as a web scraper Practice the implementation of advanced topics in graph processing, such as community detection and contact chaining Get to know the best practices when performing Extended Exploratory Data Analysis, commonly used in commercial data science teams Study advanced Spark concepts, solution design patterns, and integration architectures Demonstrate powerful data science pipelines In Detail Data science seeks to transform the world using data, and this is typically achieved through disrupting and changing real processes in real industries. In order to operate at this level you need to build data science solutions of substance –solutions that solve real problems. Spark has emerged as the big data platform of choice for data scientists due to its speed, scalability, and easy-to-use APIs. This book deep dives into using Spark to deliver production-grade data science solutions. This process is demonstrated by exploring the construction of a sophisticated global news analysis service that uses Spark to generate continuous geopolitical and current affairs insights.You will learn all about the core Spark APIs and take a comprehensive tour of advanced libraries, including Spark SQL, Spark Streaming, MLlib, and more. You will be introduced to advanced techniques and methods that will help you to construct commercial-grade data products. Focusing on a sequence of tutorials that deliver a working news intelligence service, you will learn about advanced Spark architectures, how to work with geographic data in Spark, and how to tune Spark algorithms so they scale linearly. Style and approach This is an advanced guide for those with beginner-level familiarity with the Spark architecture and working with Data Science applications. Mastering Spark for Data Science is a practical tutorial that uses core Spark APIs and takes a deep dive into advanced libraries including: Spark SQL, visual streaming, and MLlib. This book expands on titles like: Machine Learning with Spark and Learning Spark. It is the next learning curve for those comfortable with Spark and looking to improve their skills.","language":"en","currency":"USD","id":"1785888285","title":"Mastering Spark for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prkrDwAAQBAJ&source=gbs_api","authors":["Andrew Morgan","Antoine Amend","David George","Matthew Hallett"]}]