[{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build highly effective analytics solutions to gain valuable insight into your big data","description":"Explore big data concepts, platforms, analytics, and their applications using the power of Hadoop 3 Key Features Learn Hadoop 3 to build effective big data analytics solutions on-premise and on cloud Integrate Hadoop with other big data tools such as R, Python, Apache Spark, and Apache Flink Exploit big data using Hadoop 3 with real-world examples Book Description Apache Hadoop is the most popular platform for big data processing, and can be combined with a host of other big data tools to build powerful analytics solutions. Big Data Analytics with Hadoop 3 shows you how to do just that, by providing insights into the software as well as its benefits with the help of practical examples. Once you have taken a tour of Hadoop 3’s latest features, you will get an overview of HDFS, MapReduce, and YARN, and how they enable faster, more efficient big data processing. You will then move on to learning how to integrate Hadoop with the open source tools, such as Python and R, to analyze and visualize data and perform statistical computing on big data. As you get acquainted with all this, you will explore how to use Hadoop 3 with Apache Spark and Apache Flink for real-time data analytics and stream processing. In addition to this, you will understand how to use Hadoop to build analytics solutions on the cloud and an end-to-end pipeline to perform big data analysis using practical use cases. By the end of this book, you will be well-versed with the analytical capabilities of the Hadoop ecosystem. You will be able to build powerful solutions to perform big data analytics and get insight effortlessly. What you will learn Explore the new features of Hadoop 3 along with HDFS, YARN, and MapReduce Get well-versed with the analytical capabilities of Hadoop ecosystem using practical examples Integrate Hadoop with R and Python for more efficient big data processing Learn to use Hadoop with Apache Spark and Apache Flink for real-time data analytics Set up a Hadoop cluster on AWS cloud Perform big data analytics on AWS using Elastic Map Reduce Who this book is for Big Data Analytics with Hadoop 3 is for you if you are looking to build high-performance analytics solutions for your enterprise or business using Hadoop 3’s powerful features, or you’re new to big data analytics. A basic understanding of the Java programming language is required.","language":"en","currency":"USD","id":"1788624955","title":"Big Data Analytics with Hadoop 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHxeDwAAQBAJ&source=gbs_api","authors":["Sridhar Alla"]},{"pageCount":311,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BHGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"Data Virtualization with SQL Server, Hadoop, Apache Spark, and Beyond","description":"Harness the power of PolyBase data virtualization software to make data from a variety of sources easily accessible through SQL queries while using the T-SQL skills you already know and have mastered. PolyBase Revealed shows you how to use the PolyBase feature of SQL Server 2019 to integrate SQL Server with Azure Blob Storage, Apache Hadoop, other SQL Server instances, Oracle, Cosmos DB, Apache Spark, and more. You will learn how PolyBase can help you reduce storage and other costs by avoiding the need for ETL processes that duplicate data in order to make it accessible from one source. PolyBase makes SQL Server into that one source, and T-SQL is your golden ticket. The book also covers PolyBase scale-out clusters, allowing you to distribute PolyBase queries among several SQL Server instances, thus improving performance. With great flexibility comes great complexity, and this book shows you where to look when queries fail, complete with coverage of internals, troubleshooting techniques, and where to find more information on obscure cross-platform errors. Data virtualization is a key target for Microsoft with SQL Server 2019. This book will help you keep your skills current, remain relevant, and build new business and career opportunities around Microsoft’s product direction. What You Will Learn Install and configure PolyBase as a stand-alone service, or unlock its capabilities with a scale-out cluster Understand how PolyBase interacts with outside data sources while presenting their data as regular SQL Server tables Write queries combining data from SQL Server, Apache Hadoop, Oracle, Cosmos DB, Apache Spark, and more Troubleshoot PolyBase queries using SQL Server Dynamic Management Views Tune PolyBase queries using statistics and execution plans Solve common business problems, including \"cold storage\" of infrequently accessed data and simplifying ETL jobs Who This Book Is For SQL Server developers working in multi-platform environments who want one easy way of communicating with, and collecting data from, all of these sources","language":"en","currency":"USD","id":"1484254619","title":"PolyBase Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BHGDwAAQBAJ&source=gbs_api","authors":["Kevin Feasel"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ve-NDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.73,"subtitle":"Sistem Canggih di Balik Google, Yahoo!, Facebook, IBM","description":"Kini, adopsi teknologi Big Data bukan lagi hanya menjadi ranah perusahaan-perusahaan raksasa internet layaknya Google, Facebook, maupun Amazon. Sejumlah instansi pemerintah maupun perusahaan dalam negeri sudah mulai memberdayakannya. Bahkan, diantaranya sudah merealisasikan sukses besar. Buku ini didedikasikan untuk memberikan pengetahuan dasar namun komprehensif tentang konsep Big Data beserta teknologi terapannya. Disajikan sedemikian rupa mulai dari teori yang sifatnya konseptual, tutorial, hingga contoh implementasi sederhana yang berbasis real world data. Pembahasan dimulai dengan definisi Big Data, latar belakang munculnya istilah tersebut, serta berbagai contoh kasus aplikasinya. Kemudian, dilanjutkan dengan konsep teknologi Big Data yang telah dikembangkan oleh Google, diantaranya: Google File System, MapReduce, dan Big Table. Pada bab berikutnya, diuraikan konsep dan spesifikasi Hadoop, HBase, dan Spark yang dikembangkan oleh Apache Software Foundation. Selain itu, dibahas juga tentang teknologi web crawling dan database NoSQL MongoDB. Pada bab terakhir, guna merealisasikan pemahaman yang lebih komprehensif, disajikan sejumlah contoh sederhana implementasi teknologi Big Data yang mencakup tahap pengumpulan data, penyimpanan, analisa, hingga presentasi atau visualisasi. Contoh-contoh implementasi tersebut dikerjakan dengan memberdayakan real world data ( bukan data simulasi ). Sebagai pelengkap, pada bagian lampiran disertakan tutorial tentang cara setup serta penggunaan Hadoop, MapReduce, HBase dan Spark, baik pada platform Windows maupun Linux yang disertai dengan contoh program aplikasi. Dengan konten yang mencakup teori dan implementasi praktis, buku ini dapat menjadi referensi bagi berbagai kalangan: pelajar, akademisi, pelaku bisnis, maupun pemerintah, atau dapat menjadi semacam sumber inspirasi guna memicu lahirnya inovasi-inovasi kreatif terkait pemberdayaan data dan informasi, khususnya dalam konteks Big Data.","language":"id","currency":"USD","id":"6025375879","title":"Teknologi Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ve-NDwAAQBAJ&source=gbs_api","authors":["Wayan M. Wijaya"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7rOuDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.99,"subtitle":"The Coming Age of Artificial Intelligence","description":"The future is now. Acclaimed technologist and inventor Amir Husain explains how we can live amidst the coming age of sentient machines and artificial intelligence—and not only survive, but thrive. Artificial “machine” intelligence is playing an ever-greater role in our society. We are already using cruise control in our cars, automatic checkout at the drugstore, and are unable to live without our smartphones. The discussion around AI is polarized; people think either machines will solve all problems for everyone, or they will lead us down a dark, dystopian path into total human irrelevance. Regardless of what you believe, the idea that we might bring forth intelligent creation can be intrinsically frightening. But what if our greatest role as humans so far is that of creators? Amir Husain, a brilliant inventor and computer scientist, argues that we are on the cusp of writing our next, and greatest, creation myth. It is the dawn of a new form of intellectual diversity, one that we need to embrace in order to advance the state of the art in many critical fields, including security, resource management, finance, and energy. “In The Sentient Machine, Husain prepares us for a brighter future; not with hyperbole about right and wrong, but with serious arguments about risk and potential” (Dr. Greg Hyslop, Chief Technology Officer, The Boeing Company). He addresses broad existential questions surrounding the coming of AI: Why are we valuable? What can we create in this world? How are we intelligent? What constitutes progress for us? And how might we fail to progress? Husain boils down complex computer science and AI concepts into clear, plainspoken language and draws from a wide variety of cultural and historical references to illustrate his points. Ultimately, Husain challenges many of our societal norms and upends assumptions we hold about “the good life.”","language":"en","currency":"USD","id":"1501144693","title":"The Sentient Machine","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7rOuDgAAQBAJ&source=gbs_api","authors":["Amir Husain"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZhqoKt3BF8sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Realistic, simple code examples to solve problems at scale with Hadoop and related technologies.","language":"en","currency":"USD","id":"1849519137","title":"Hadoop Real-World Solutions Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZhqoKt3BF8sC&source=gbs_api","authors":["Jonathan R. Owens","Brian Femiano","Jon Lentz"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hloWonPJyC4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book gathers chapters from some of the top international empirical software engineering researchers focusing on the practical knowledge necessary for conducting, reporting and using empirical methods in software engineering. Topics and features include guidance on how to design, conduct and report empirical studies. The volume also provides information across a range of techniques, methods and qualitative and quantitative issues to help build a toolkit applicable to the diverse software development contexts","language":"en","currency":"USD","id":"1848000448","title":"Guide to Advanced Empirical Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hloWonPJyC4C&source=gbs_api","authors":["Forrest Shull","Janice Singer","Dag I. K. Sjøberg"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E71mV_OQgX0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"A J2EE developer's guide to using Oracle JDeveloper's integrated database features to build data-driven applications with this book and eBook","language":"en","currency":"USD","id":"1847194311","title":"JDBC 4.0 and Oracle JDeveloper for J2EE Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E71mV_OQgX0C&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yEzSCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Learn the Essentials of Big Data Computing in the Apache Hadoop 2 Ecosystem","description":"Get Started Fast with Apache Hadoop® 2, YARN, and Today’s Hadoop Ecosystem With Hadoop 2.x and YARN, Hadoop moves beyond MapReduce to become practical for virtually any type of data processing. Hadoop 2.x and the Data Lake concept represent a radical shift away from conventional approaches to data usage and storage. Hadoop 2.x installations offer unmatched scalability and breakthrough extensibility that supports new and existing Big Data analytics processing methods and models. Hadoop® 2 Quick-Start Guide is the first easy, accessible guide to Apache Hadoop 2.x, YARN, and the modern Hadoop ecosystem. Building on his unsurpassed experience teaching Hadoop and Big Data, author Douglas Eadline covers all the basics you need to know to install and use Hadoop 2 on personal computers or servers, and to navigate the powerful technologies that complement it. Eadline concisely introduces and explains every key Hadoop 2 concept, tool, and service, illustrating each with a simple “beginning-to-end” example and identifying trustworthy, up-to-date resources for learning more. This guide is ideal if you want to learn about Hadoop 2 without getting mired in technical details. Douglas Eadline will bring you up to speed quickly, whether you’re a user, admin, devops specialist, programmer, architect, analyst, or data scientist. Coverage Includes Understanding what Hadoop 2 and YARN do, and how they improve on Hadoop 1 with MapReduce Understanding Hadoop-based Data Lakes versus RDBMS Data Warehouses Installing Hadoop 2 and core services on Linux machines, virtualized sandboxes, or clusters Exploring the Hadoop Distributed File System (HDFS) Understanding the essentials of MapReduce and YARN application programming Simplifying programming and data movement with Apache Pig, Hive, Sqoop, Flume, Oozie, and HBase Observing application progress, controlling jobs, and managing workflows Managing Hadoop efficiently with Apache Ambari–including recipes for HDFS to NFSv3 gateway, HDFS snapshots, and YARN configuration Learning basic Hadoop 2 troubleshooting, and installing Apache Hue and Apache Spark","language":"en","currency":"USD","id":"0134049993","title":"Hadoop 2 Quick-Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yEzSCgAAQBAJ&source=gbs_api","authors":["Douglas Eadline"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=395XD3tVHjgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This is a short, practical guide, with lots of examples to help you learn Google Guava.There is no minimum level of experience required. There is something for everyone who works with Java, from the beginner to the expert programmer.","language":"en","currency":"USD","id":"1783280166","title":"Getting Started with Google Guava","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=395XD3tVHjgC&source=gbs_api","authors":["Bill Bejeck"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o0IlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Best Practices for Scaling and Optimizing Apache Spark","description":"Apache Spark is amazing when everything clicks. But if you haven’t seen the performance improvements you expected, or still don’t feel confident enough to use Spark in production, this practical book is for you. Authors Holden Karau and Rachel Warren demonstrate performance optimizations to help your Spark queries run faster and handle larger data sizes, while using fewer resources. Ideal for software engineers, data engineers, developers, and system administrators working with large-scale data applications, this book describes techniques that can reduce data infrastructure costs and developer hours. Not only will you gain a more comprehensive understanding of Spark, you’ll also learn how to make it sing. With this book, you’ll explore: How Spark SQL’s new interfaces improve performance over SQL’s RDD data structure The choice between data joins in Core Spark and Spark SQL Techniques for getting the most out of standard RDD transformations How to work around performance issues in Spark’s key\/value pair paradigm Writing high-performance Spark code without Scala or the JVM How to test for functionality and performance when applying suggested improvements Using Spark MLlib and Spark ML machine learning libraries Spark’s Streaming components and external community packages","language":"en","currency":"USD","id":"1491943157","title":"High Performance Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o0IlDwAAQBAJ&source=gbs_api","authors":["Holden Karau","Rachel Warren"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BMPHj_ud8lMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Solve specific problems using individual self-contained code recipes, or work through the book to develop your capabilities. This book is packed with easy-to-follow code and commands used for illustration, which makes your learning curve easy and quick.If you are a Hadoop cluster system administrator with Unix\/Linux system management experience and you are looking to get a good grounding in how to set up and manage a Hadoop cluster, then this book is for you. It's assumed that you will have some experience in Unix\/Linux command line already, as well as being familiar with network communication basics.","language":"en","currency":"USD","id":"1782165177","title":"Hadoop Operations and Cluster Management Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BMPHj_ud8lMC&source=gbs_api","authors":["Shumin Guo"]},{"pageCount":48,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fN0WnuzATCwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. A simple and easy-to-follow starter approach will help guide the readers through how to develop a real-time web application using Node.js with the help of a sample project.Instant NodeJS Starter is great for web developers who know JavaScript and are curious about Node.js and want to understand and be able to quickly start creating their first applications on it. This book is also recommended for people with experience in network programming and event-driven programming to be able to get started using this exciting technology.","language":"en","currency":"USD","id":"1782165576","title":"Instant Node.js Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fN0WnuzATCwC&source=gbs_api","authors":["Pedro Teixeira"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GjlUXVLruCQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A complete guide to building EJB 3.0 database persistent applications with Oracle Fusion Middleware 11g tools with this book and eBook.","language":"en","currency":"USD","id":"1849681570","title":"EJB 3.0 Database Persistence with Oracle Fusion Middleware 11g","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GjlUXVLruCQC&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OnCLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Big data processing at scale to unlock unique business insights","description":"A comprehensive guide to mastering the most advanced Hadoop 3 concepts Key Features Get to grips with the newly introduced features and capabilities of Hadoop 3 Crunch and process data using MapReduce, YARN, and a host of tools within the Hadoop ecosystem Sharpen your Hadoop skills with real-world case studies and code Book Description Apache Hadoop is one of the most popular big data solutions for distributed storage and for processing large chunks of data. With Hadoop 3, Apache promises to provide a high-performance, more fault-tolerant, and highly efficient big data processing platform, with a focus on improved scalability and increased efficiency. With this guide, you’ll understand advanced concepts of the Hadoop ecosystem tool. You’ll learn how Hadoop works internally, study advanced concepts of different ecosystem tools, discover solutions to real-world use cases, and understand how to secure your cluster. It will then walk you through HDFS, YARN, MapReduce, and Hadoop 3 concepts. You’ll be able to address common challenges like using Kafka efficiently, designing low latency, reliable message delivery Kafka systems, and handling high data volumes. As you advance, you’ll discover how to address major challenges when building an enterprise-grade messaging system, and how to use different stream processing systems along with Kafka to fulfil your enterprise goals. By the end of this book, you’ll have a complete understanding of how components in the Hadoop ecosystem are effectively integrated to implement a fast and reliable data pipeline, and you’ll be equipped to tackle a range of real-world problems in data pipelines. What you will learn Gain an in-depth understanding of distributed computing using Hadoop 3 Develop enterprise-grade applications using Apache Spark, Flink, and more Build scalable and high-performance Hadoop data pipelines with security, monitoring, and data governance Explore batch data processing patterns and how to model data in Hadoop Master best practices for enterprises using, or planning to use, Hadoop 3 as a data platform Understand security aspects of Hadoop, including authorization and authentication Who this book is for If you want to become a big data professional by mastering the advanced concepts of Hadoop, this book is for you. You’ll also find this book useful if you’re a Hadoop professional looking to strengthen your knowledge of the Hadoop ecosystem. Fundamental knowledge of the Java programming language and basics of Hadoop is necessary to get started with this book.","language":"en","currency":"USD","id":"1788628322","title":"Mastering Hadoop 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OnCLDwAAQBAJ&source=gbs_api","authors":["Chanchal Singh","Manish Kumar"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9SKJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Delivering the Promise of Big Data and Data Science","description":"The data lake is a daring new approach for harnessing the power of big data technology and providing convenient self-service capabilities. But is it right for your company? This book is based on discussions with practitioners and executives from more than a hundred organizations, ranging from data-driven companies such as Google, LinkedIn, and Facebook, to governments and traditional corporate enterprises. You’ll learn what a data lake is, why enterprises need one, and how to build one successfully with the best practices in this book. Alex Gorelik, CTO and founder of Waterline Data, explains why old systems and processes can no longer support data needs in the enterprise. Then, in a collection of essays about data lake implementation, you’ll examine data lake initiatives, analytic projects, experiences, and best practices from data experts working in various industries. Get a succinct introduction to data warehousing, big data, and data science Learn various paths enterprises take to build a data lake Explore how to build a self-service model and best practices for providing analysts access to the data Use different methods for architecting your data lake Discover ways to implement a data lake from experts in different industries","language":"en","currency":"USD","id":"1491931507","title":"The Enterprise Big Data Lake","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9SKJDwAAQBAJ&source=gbs_api","authors":["Alex Gorelik"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pitLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Big Data Processing Made Simple","description":"Learn how to use, deploy, and maintain Apache Spark with this comprehensive guide, written by the creators of the open-source cluster-computing framework. With an emphasis on improvements and new features in Spark 2.0, authors Bill Chambers and Matei Zaharia break down Spark topics into distinct sections, each with unique goals. You’ll explore the basic operations and common functions of Spark’s structured APIs, as well as Structured Streaming, a new high-level API for building end-to-end streaming applications. Developers and system administrators will learn the fundamentals of monitoring, tuning, and debugging Spark, and explore machine learning techniques and scenarios for employing MLlib, Spark’s scalable machine-learning library. Get a gentle overview of big data and Spark Learn about DataFrames, SQL, and Datasets—Spark’s core APIs—through worked examples Dive into Spark’s low-level APIs, RDDs, and execution of SQL and DataFrames Understand how Spark runs on a cluster Debug, monitor, and tune Spark clusters and applications Learn the power of Structured Streaming, Spark’s stream-processing engine Learn how you can apply MLlib to a variety of problems, including classification or recommendation","language":"en","currency":"USD","id":"1491912294","title":"Spark: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pitLDwAAQBAJ&source=gbs_api","authors":["Bill Chambers","Matei Zaharia"]},{"pageCount":60,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jNVlpPUOGjkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. This is a Packt Instant How-to guide, which provides concise and clear recipes for getting started with Hadoop.This book is for big data enthusiasts and would-be Hadoop programmers. It is also meant for Java programmers who either have not worked with Hadoop at all, or who know Hadoop and MapReduce but are not sure how to deepen their understanding.","language":"en","currency":"USD","id":"1782167714","title":"Instant Mapreduce Patterns - Hadoop Essentials How-To","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jNVlpPUOGjkC&source=gbs_api","authors":["Srinath Perera"]},{"pageCount":186,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XkAwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Become a Node.js craftsman. About This Book This book will help readers to dive deeper into software development with Node.js and JavaScript Takes a craftsman approach to Node.js and object-orientation and test-driven development Crafts many of the small details of Node.js and through to fully-fledged web applications with REST Who This Book Is For This book is written to help you if you're working with Node.js already, but you want to move your craft to the next level with Node.js, so some working knowledge of Node.js is of course already assumed, so that we can look at the work of crafting applications with Node. What You Will Learn How to connect to databases like MongoDB and MySQL from your Node.js application How to unit tests and end-to-end tests for your code When and how to leverage migrations for setting up a continuous deployment workflow Detailed insight into how the Node Package Manager, NPM works How object-orientation actually works in JavaScript Ways to keep your code fast and efficient using asynchronous and non-blocking operations How to use and create event emitters How to use REST frameworks to write full-fledged web applications How to integrate Node.js with Angular In Detail The Node Craftsman Book helps JavaScript programmers with basic Node.js knowledge to now thoroughly master Node.js and JavaScript. This book dives you deeper into the craft of software development with Node.js and JavaScript, incuding object-orientation, test-driven development, database handling, web frameworks, and much more. The Node Craftsman Book shows you how to work with Node.js and how to think deeply about how you build your Node projects. You'll master how to build a complete Node.js application across six crafting milestones, and you'll learn many specific skills to achieve that mastery. These skills include how to work with the Node Package Manager in depth, how to connect your Node applications to databases, and how to write unit tests and end-to-end tests for your code. You'll experience the full Node.js development picture, and learn how to craft and control your Node.js applications - right through to fully-fledged web applications using REST, and integration with Angular applications. Style and approach This book builds on your early knowledge and experience of Node.js and takes a craftsman approach to understanding the whole picture more deeply and shaping your Node applications to perform the way a craftsman would want. So, we take a thoughtful and broad thinking and coding approach to work with Node.js in this book.","language":"en","currency":"USD","id":"1787289257","title":"The Node Craftsman Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XkAwDwAAQBAJ&source=gbs_api","authors":["Manuel Kiessling"]},{"pageCount":144,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uEgTfiURlcQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is a step-by-step tutorial that will enable you to leverage the flexible search functionality of Apache Solr together with the Big Data power of Apache Hadoop.Scaling Big Data with Hadoop and Solr provides guidance to developers who wish to build high-speed enterprise search platforms using Hadoop and Solr. This book is primarily aimed at Java programmers who wish to extend the Hadoop platform to make it run as an enterprise search without any prior knowledge of Apache Hadoop and Solr.","language":"en","currency":"USD","id":"1783281383","title":"Scaling Big Data with Hadoop and Solr","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uEgTfiURlcQC&source=gbs_api","authors":["Hrishikesh Karambelkar"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJ7NBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"If you are an application developer or software architect who wants to dive into the Cypher language and learn the concepts of graph theory and graph-based data models, this is the book for you. Prior experience with a graph-based or NoSQL-based database is expected. Some knowledge of Java will be beneficial, as this will give you more insights into Neo4j’s extensibility.","language":"en","currency":"USD","id":"1783555181","title":"Neo4j Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJ7NBgAAQBAJ&source=gbs_api","authors":["Sumit Gupta"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJ7NBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"If you are an application developer or software architect who wants to dive into the Cypher language and learn the concepts of graph theory and graph-based data models, this is the book for you. Prior experience with a graph-based or NoSQL-based database is expected. Some knowledge of Java will be beneficial, as this will give you more insights into Neo4j’s extensibility.","language":"en","currency":"USD","id":"1783555181","title":"Neo4j Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJ7NBgAAQBAJ&source=gbs_api","authors":["Sumit Gupta"]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WWgMsgBl3B4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Pro Spring Integration is an authoritative book from the experts that guides you through the vast world of enterprise application integration (EAI) and application of the Spring Integration framework towards solving integration problems. The book is: An introduction to the concepts of enterprise application integration A reference on building event-driven applications using Spring Integration A guide to solving common integration problems using Spring Integration What makes this book unique is its coverage of contemporary technologies and real-world information, with a focus on common problems that users are likely to confront. This book zeroes in on extending the Spring Integration framework to meet your custom integration demands. As Spring Integration is an extension of the Spring programming model, it builds on the Spring Framework's existing support for enterprise integration. This book will take you through all aspects of this relationship and show you how to get the most out of your Spring applications, where integration is a consideration. It discusses simple messaging within Spring-based applications and integration with external systems via simple adapters. Those adapters provide a higher-level of abstraction over Spring's support for remoting, messaging, and scheduling, all of which receives coverage in this book.","language":"en","currency":"USD","id":"143023346X","title":"Pro Spring Integration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WWgMsgBl3B4C&source=gbs_api","authors":["Josh Long","Dr Mark Lui","Mario Gray","Andy Chan"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=u1bTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.94,"subtitle":null,"description":"If you are a Hadoop programmer who wants to learn about Flume to be able to move datasets into Hadoop in a timely and replicable manner, then this book is ideal for you. No prior knowledge about Apache Flume is necessary, but a basic knowledge of Hadoop and the Hadoop File System (HDFS) is assumed.","language":"en","currency":"USD","id":"1784399140","title":"Apache Flume: Distributed Log Collection for Hadoop - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=u1bTBgAAQBAJ&source=gbs_api","authors":["Steve Hoffman"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=adN9BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"5th International Provenance and Annotation Workshop, IPAW 2014, Cologne, Germany, June 9-13, 2014. Revised Selected Papers","description":"This book constitutes the revised selected papers of the 5th International Provenance and Annotation Workshop, IPAW 2014, held in Cologne, Germany in June 2014. The 14 long papers, 20 short papers and 4 extended abstracts presented were carefully reviewed and selected from 53 submissions. The papers include tools that enable provenance capture from software compilers, from web publications and from scripts, using existing audit logs and employing both static and dynamic instrumentation.","language":"en","currency":"USD","id":"3319164627","title":"Provenance and Annotation of Data and Processes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=adN9BwAAQBAJ&source=gbs_api","authors":["Bertram Ludäscher","Beth Plale"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practical guide to designing, indexing, and querying advanced distributed search engines","description":"Master the intricacies of Elasticsearch 7.0 and use it to create flexible and scalable search solutions Key Features Master the latest distributed search and analytics capabilities of Elasticsearch 7.0 Perform searching, indexing, and aggregation of your data at scale Discover tips and techniques for speeding up your search query performance Book Description Building enterprise-grade distributed applications and executing systematic search operations call for a strong understanding of Elasticsearch and expertise in using its core APIs and latest features. This book will help you master the advanced functionalities of Elasticsearch and understand how you can develop a sophisticated, real-time search engine confidently. In addition to this, you'll also learn to run machine learning jobs in Elasticsearch to speed up routine tasks. You'll get started by learning to use Elasticsearch features on Hadoop and Spark and make search results faster, thereby improving the speed of query results and enhancing the customer experience. You'll then get up to speed with performing analytics by building a metrics pipeline, defining queries, and using Kibana for intuitive visualizations that help provide decision-makers with better insights. The book will later guide you through using Logstash with examples to collect, parse, and enrich logs before indexing them in Elasticsearch. By the end of this book, you will have comprehensive knowledge of advanced topics such as Apache Spark support, machine learning using Elasticsearch and scikit-learn, and real-time analytics, along with the expertise you need to increase business productivity, perform analytics, and get the very best out of Elasticsearch. What you will learn Pre-process documents before indexing in ingest pipelines Learn how to model your data in the real world Get to grips with using Elasticsearch for exploratory data analysis Understand how to build analytics and RESTful services Use Kibana, Logstash, and Beats for dashboard applications Get up to speed with Spark and Elasticsearch for real-time analytics Explore the basics of Spring Data Elasticsearch, and understand how to index, search, and query in a Spring application Who this book is for This book is for Elasticsearch developers and data engineers who want to take their basic knowledge of Elasticsearch to the next level and use it to build enterprise-grade distributed search applications. Prior experience of working with Elasticsearch will be useful to get the most out of this book.","language":"en","currency":"USD","id":"1789956560","title":"Advanced Elasticsearch 7.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fyisDwAAQBAJ&source=gbs_api","authors":["Wai Tak Wong"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U5VCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Demystifying the Black Art","description":"Often referred to as the “black art” because of its complexity and uncertainty, software estimation is not as difficult or puzzling as people think. In fact, generating accurate estimates is straightforward—once you understand the art of creating them. In his highly anticipated book, acclaimed author Steve McConnell unravels the mystery to successful software estimation—distilling academic information and real-world experience into a practical guide for working software professionals. Instead of arcane treatises and rigid modeling techniques, this guide highlights a proven set of procedures, understandable formulas, and heuristics that individuals and development teams can apply to their projects to help achieve estimation proficiency. Discover how to: Estimate schedule and cost—or estimate the functionality that can be delivered within a given time frame Avoid common software estimation mistakes Learn estimation techniques for you, your team, and your organization * Estimate specific project activities—including development, management, and defect correction Apply estimation approaches to any type of project—small or large, agile or traditional Navigate the shark-infested political waters that surround project estimates When many corporate software projects are failing, McConnell shows you what works for successful software estimation.","language":"en","currency":"USD","id":"0735637032","title":"Software Estimation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U5VCAwAAQBAJ&source=gbs_api","authors":["Steve McConnell"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wpCKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.77,"subtitle":"A Tutorial-Based Approach","description":"Big Data: A Tutorial-Based Approach explores the tools and techniques used to bring about the marriage of structured and unstructured data. It focuses on Hadoop Distributed Storage and MapReduce Processing by implementing (i) Tools and Techniques of Hadoop Eco System, (ii) Hadoop Distributed File System Infrastructure, and (iii) efficient MapReduce processing. The book includes Use Cases and Tutorials to provide an integrated approach that answers the ‘What’, ‘How’, and ‘Why’ of Big Data. Features Identifies the primary drivers of Big Data Walks readers through the theory, methods and technology of Big Data Explains how to handle the 4 V’s of Big Data in order to extract value for better business decision making Shows how and why data connectors are critical and necessary for Agile text analytics Includes in-depth tutorials to perform necessary set-ups, installation, configuration and execution of important tasks Explains the command line as well as GUI interface to a powerful data exchange tool between Hadoop and legacy r-dbms databases","language":"en","currency":"USD","id":"0429592450","title":"Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wpCKDwAAQBAJ&source=gbs_api","authors":["Nasir Raheem"]},{"pageCount":127,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2tEYDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"IFIP WG 11.4 International Workshop, iNetSec 2015, Zurich, Switzerland, October 29, 2015, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the IFIP WG 11.4 International Workshop on Open Problems in Network Security, iNetSec 2015, held in Zurich, Switzerland, in October 2015. iNetSec is the main workshop of the IFIP working group WG 11.4; its objective is to present and discuss open problems and new research directions on all aspects related to network security. The 9 revised full papers presented in this volume were carefully reviewed and selected from 13 submissions. They were organized in topical sections named: network security; intrusion detection; anonymous communication; and cryptography.","language":"en","currency":"USD","id":"3319390287","title":"Open Problems in Network Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2tEYDAAAQBAJ&source=gbs_api","authors":["Jan Camenisch","Doğan Kesdoğan"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K1JtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Shipping Reliable Containers in Production","description":"Docker is rapidly changing the way organizations deploy software at scale. However, understanding how Linux containers fit into your workflow—and getting the integration details right—is not a trivial task. With the updated edition of this practical guide, you’ll learn how to use Docker to package your applications with all of their dependencies and then test, ship, scale, and support your containers in production. This edition includes significant updates to the examples and explanations that reflect the substantial changes that have occurred over the past couple of years. Sean Kane and Karl Matthias have added a complete chapter on Docker Compose, deeper coverage of Docker Swarm mode, introductions to both Kubernetes and AWS Fargate, examples on how to optimize your Docker images, and much more. Learn how Docker simplifies dependency management and deployment workflow for your applications Start working with Docker images, containers, and command line tools Use practical techniques to deploy and test Docker containers in production Debug containers by understanding their composition and internal processes Deploy production containers at scale inside your data center or cloud environment Explore advanced Docker topics, including deployment tools, networking, orchestration, security, and configuration","language":"en","currency":"USD","id":"1492036749","title":"Docker: Up & Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K1JtDwAAQBAJ&source=gbs_api","authors":["Sean P. Kane","Karl Matthias"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t2dBlNfKk6gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Practical Use Cases with the Leading NoSQL Database","description":"Whether you’re building a social media site or an internal-use enterprise application, this hands-on guide shows you the connection between MongoDB and the business problems it’s designed to solve. You’ll learn how to apply MongoDB design patterns to several challenging domains, such as ecommerce, content management, and online gaming. Using Python and JavaScript code examples, you’ll discover how MongoDB lets you scale your data model while simplifying the development process. Many businesses launch NoSQL databases without understanding the techniques for using their features most effectively. This book demonstrates the benefits of document embedding, polymorphic schemas, and other MongoDB patterns for tackling specific big data use cases, including: Operational intelligence: Perform real-time analytics of business data Ecommerce: Use MongoDB as a product catalog master or inventory management system Content management: Learn methods for storing content nodes, binary assets, and discussions Online advertising networks: Apply techniques for frequency capping ad impressions, and keyword targeting and bidding Social networking: Learn how to store a complex social graph, modeled after Google+ Online gaming: Provide concurrent access to character and world data for a multiplayer role-playing game","language":"en","currency":"USD","id":"1449340075","title":"MongoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t2dBlNfKk6gC&source=gbs_api","authors":["Rick Copeland"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ufjJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Easy, hands-on recipes to help you understand Hive and its integration with frameworks that are used widely in today's big data world About This Book Grasp a complete reference of different Hive topics. Get to know the latest recipes in development in Hive including CRUD operations Understand Hive internals and integration of Hive with different frameworks used in today's world. Who This Book Is For The book is intended for those who want to start in Hive or who have basic understanding of Hive framework. Prior knowledge of basic SQL command is also required What You Will Learn Learn different features and offering on the latest Hive Understand the working and structure of the Hive internals Get an insight on the latest development in Hive framework Grasp the concepts of Hive Data Model Master the key concepts like Partition, Buckets and Statistics Know how to integrate Hive with other frameworks such as Spark, Accumulo, etc In Detail Hive was developed by Facebook and later open sourced in Apache community. Hive provides SQL like interface to run queries on Big Data frameworks. Hive provides SQL like syntax also called as HiveQL that includes all SQL capabilities like analytical functions which are the need of the hour in today's Big Data world. This book provides you easy installation steps with different types of metastores supported by Hive. This book has simple and easy to learn recipes for configuring Hive clients and services. You would also learn different Hive optimizations including Partitions and Bucketing. The book also covers the source code explanation of latest Hive version. Hive Query Language is being used by other frameworks including spark. Towards the end you will cover integration of Hive with these frameworks. Style and approach Starting with the basics and covering the core concepts with the practical usage, this book is a complete guide to learn and explore Hive offerings.","language":"en","currency":"USD","id":"1782161090","title":"Apache Hive Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ufjJDAAAQBAJ&source=gbs_api","authors":["Hanish Bansal","Saurabh Chauhan","Shrey Mehrotra"]},{"pageCount":8,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ZSbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.33,"subtitle":null,"description":"Academic Paper from the year 2019 in the subject Computer Science - Software, grade: 8.6, Patna Women's College (Patna Women's College), course: MCA, language: English, abstract: MongoDB is a document-oriented database which helps us group data more logically. This paper demonstrates the conversion of data from a native tabular form to unstructured documents. The document and collections within it needs not to be well defined prior to the creation of unstructured data in MongoDB. The MongoDB has lots of extensive built-in-features and is highly compatible with other software systems, with extensive and flexible ways of accessing data beyond JSON query, its highly compatible Business Intelligence Connector is highly compatible which makes it compatible with existing databases. High scalability is making it remarkable and popular in the World and hence made me think about writing a paper demonstrating the data conversion. This conversion has helped me in making the most of modern data to be compatible with MongoDB. Data is stored on the cloud as cloud-based storage is an excellent and most cost-effective solution. My solution is highly scalable as the built-in shading solution for data handling makes it one of the best big data handling tool. The data that i have used, is location based in MongoDB that can directly yeild document ACID transactions to maintain data integrity.","language":"en","currency":"USD","id":"3668949859","title":"Data Migration from Relational Database to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ZSbDwAAQBAJ&source=gbs_api","authors":["Ajit Singh"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8c3LDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Cloud Native Applications with Go and Java for Docker and Kubernetes","description":"Get a comprehensive understanding of gRPC fundamentals through real-world examples. With this practical guide, you’ll learn how this high-performance interprocess communication protocol is capable of connecting polyglot services in microservices architecture, while providing a rich framework for defining service contracts and data types. Complete with hands-on examples written in Go, Java, Node, and Python, this book also covers the essential techniques and best practices to use gRPC in production systems. Authors Kasun Indrasiri and Danesh Kuruppu discuss the importance of gRPC in the context of microservices development.","language":"en","currency":"USD","id":"1492058289","title":"gRPC: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8c3LDwAAQBAJ&source=gbs_api","authors":["Kasun Indrasiri","Danesh Kuruppu"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4PWoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design documents and implement real world e-commerce applications with Couchbase About This Book Get acquainted with Couchbase architecture and design your document-based data schema Implement full text search using industry standard elastic search plugins Develop critical and high performance applications using this hands-on tutorial guide Who This Book Is For If you are new to the NoSQL document system or have little or no experience in NoSQL development and administration and are planning to deploy Couchbase for your next project, then this book is for you. It would be helpful to have a bit of familiarity with Java. What You Will Learn Get acquainted with the concept of NoSQL databases and configure your Couchbase database cluster Maintain Couchbase effectively using the web-based administrative console with ease Enable partition capabilities by making use of Buckets Analyze important design considerations for maintaining relationship between various documents Use Couchbase SDK Java API to store and retrieve document Write views using map\/reduce to retrieve documents efficiently Get familiar with N1QL and how to use it in Java applications Integrate Couchbase with Elasticsearch to implement full text search Configure XDCR for disaster recovery and develop ecommerce application using Couchbase In Detail NoSQL database systems have changed application development in terms of adaptability to dynamics schema and scalability. Compared with the currently available NoSQL database systems, Couchbase is the fastest. Its ease of configuration and powerful features for storing different schema structures, retrieval using map reduce and inbuilt disaster recovery by replicating document across the geographical region, make it one of the most powerful, scalable and comprehensive NoSQL in the market. Couchbase also introduces smart client API for various programming language to integrate the database with the application easily, yet providing very complex features like cluster health awareness. This book achieves its goal by taking up an end-to-end development structure, right from understanding NOSQL document design to implementing full fledged eCommerce application design using Couchbase as a backend. Starting with the architecture of Couchbase to get you up and running, this book quickly takes you through designing a NoSQL document and implementing highly scalable applications using Java API. You will then be introduced to document design and get to know the various ways to administer Couchbase. Followed by this, learn to store documents using bucket. Moving on, you will then learn to store, retrieve and delete documents using smart client base on Java API. You will then retrieve documents using SQL like syntax call N1QL. Next, you will learn how to write map reduce base views. Finally, you will configure XDCR for disaster recovery and implement an eCommerce application using Couchbase. Style and approach The book starts from absolute basics and slowly moves to more advanced topics ensuring at every step that all concepts and terms are understood by the reader to have complete understanding at every stage. Technical and complex terms are explained in clear and simple language, thus making this book a perfect companion for those who have started their journey to NoSQL using Couchbase","language":"en","currency":"USD","id":"1785284282","title":"Learning Couchbase","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4PWoCwAAQBAJ&source=gbs_api","authors":["Henry Potsangbam"]},{"pageCount":154,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L-g6Qxb_43sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Continuous delivery and Devops explained.","language":"en","currency":"USD","id":"1849693692","title":"Continuous Delivery and DevOps: a QuickStart Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L-g6Qxb_43sC&source=gbs_api","authors":["Paul Swartout"]},{"pageCount":343,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MJzvDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"FC 2016 International Workshops, BITCOIN, VOTING, and WAHC, Christ Church, Barbados, February 26, 2016, Revised Selected Papers","description":"This book constitutes the refereed proceedings of three workshops heldat the 20th International Conference on Financial Cryptography and DataSecurity, FC 2016, in Christ Church, Barbados, in February 2016. The 22 full papers presented were carefully reviewed and selected from 49 submissions. They feature the outcome of the Second Workshop on Bitcoin and Blockchain Research, BITCOIN 2016, the First Workshop on Secure Voting Systems, VOTING 2016, and the 4th Workshop on Encrypted Computing and Applied Homomorphic Cryptography, WAHC 2016.","language":"en","currency":"USD","id":"366253357X","title":"Financial Cryptography and Data Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MJzvDAAAQBAJ&source=gbs_api","authors":["Jeremy Clark","Sarah Meiklejohn","Peter Y.A. Ryan","Dan Wallach","Michael Brenner","Kurt Rohloff"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vetaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is for developers who want an alternative way to store and process data within their applications. No previous graph database experience is required; however, some basic database knowledge will help you understand the concepts more easily.","language":"en","currency":"USD","id":"1849517177","title":"Learning Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vetaBAAAQBAJ&source=gbs_api","authors":["Rik Van Bruggen"]},{"pageCount":344,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XSb7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"网络大数据是指“人、机、物”三元世界在网络空间（cyberspace）中彼此交互与融合所产生并在互联网上可获得的大数据，简称网络数据。本书提出了开放知识网络的概念，以概率论、图论、矩阵分析、组合优化等为模型基础，给出了一套从开放知识的感知与获取、开放知识的融合与更新、开放知识的推断与预测，到开放知识计算引擎的构建及系统应用的开放知识处理流程。深入探讨了开放知识网络的建模与计算方法，并通过开放网络知识库和应用系统，介绍了典型应用案例，全面、系统地展示了本领域最新的研究成果和进展。 本书可作为计算机、通信、信息等相关专业的教师、研究生和大学高年级学生的教材或教学参考书，也可供行业大数据分析、商业情报挖掘、语义检索、知识问答等方面的研究人员和工程技术人员参考。","language":"zh-CN","currency":"USD","id":"7302491437","title":"开放网络知识计算：模型、方法与应用","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XSb7DwAAQBAJ&source=gbs_api","authors":["王元卓等著"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ESf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.68,"subtitle":null,"description":"Apache HAWQ是一个SQL-on-Hadoop产品，它非常适合用于Hadoop平台上快速构建数据仓库系统。HAWQ具有大规模并行处理、完善的SQL兼容性、支持存储过程和事务、出色的性能表现等特性，还可与开源数据挖掘库MADlib轻松整合，从而使用SQL就能进行数据挖掘与机器学习。 本书内容分技术解析、实战演练与数据挖掘三个部分共27章。技术解析部分说明HAWQ的基础架构与功能特性，包括安装、连接、对象与资源管理、查询优化、备份恢复、高可用性等。实战演练部分用一个完整的示例，说明如何使用HAWQ取代传统数据仓库，包括ETL处理、自动调度系统、维度表与事实表技术、OLAP与数据的图形化表示等。数据挖掘部分用实例说明HAWQ与MADlib整合，实现降维、协同过滤、关联规则、回归、聚类、分类等常见数据挖掘与机器学习方法。 本书适合数据库管理员、大数据技术人员、Hadoop技术人员、数据仓库技术人员，也适合高等院校和培训机构相关专业的师生教学参考。","language":"zh-CN","currency":"USD","id":"7302498024","title":"HAWQ数据仓库与数据挖掘实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ESf7DwAAQBAJ&source=gbs_api","authors":["王雪迎著"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iMD1j6GHgWsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"The Definitive Guide","description":"Jakarta Tomcat is not only the most commonly used open source servlet engine today, it's become the de facto standard by which other servlet engines are measured. Powerful and flexible, it can be used as a stand-alone web server or in conjunction with another server, like Apache or IIS, to run servlets or JSPs. But mastery of Tomcat is not easy: because it's as complex as it is complete. Tomcat: The Definitive Guide answers vexing questions that users, administrators, and developers alike have been asking. This concise guide provides much needed information to help harness Tomcat's power and wealth of features.Tomcat: The Definitive Guide offers something for everyone who uses Tomcat. System and network administrators will find detailed instructions on installation, configuration, and maintenance. For users, it supplies insightful information on how to deploy Tomcat. And seasoned enterprise Java developers will have a complete reference to setting up, running, and using this powerful softwareThe book begins with an introduction to the Tomcat server and includes an overview of the three types of server configurations: stand-alone, in-process, and out-of-process. The authors show how directories are laid out, cover the initial setup, and describe how to set the environment variables and modify the configuration files, concluding with common errors, problems, and solutions. In subsequent chapters, they cover: The server.xml configuration file Java Security manager Authentication schemes and Tomcat users The Secure Socket Layer (SSL) Tomcat JDBC Realms Installing servlets and Java Server Pages Integrating Tomcat with Apache Advanced Tomcat configuration and much more.Tomcat: The Definitive Guide covers all major platforms, including Windows, Solaris, Linux, and Mac OS X, contains details on Tomcat configuration files, and has a quick-start guide to get developers up and running with Java servlets and JavaServer Pages. If you've struggled with this powerful yet demanding technology in the past, this book will provide the answers you need.","language":"en","currency":"USD","id":"9780596552053","title":"Tomcat: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iMD1j6GHgWsC&source=gbs_api","authors":["Jason Brittain","Ian F. Darwin"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-s2xL0pVsLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"It’s easy to write correct Ruby code, but to gain the fluency needed to write great Ruby code, you must go beyond syntax and absorb the “Ruby way” of thinking and problem solving. In Eloquent Ruby, Russ Olsen helps you write Ruby like true Rubyists do–so you can leverage its immense, surprising power. Olsen draws on years of experience internalizing the Ruby culture and teaching Ruby to other programmers. He guides you to the “Ah Ha!” moments when it suddenly becomes clear why Ruby works the way it does, and how you can take advantage of this language’s elegance and expressiveness. Eloquent Ruby starts small, answering tactical questions focused on a single statement, method, test, or bug. You’ll learn how to write code that actually looks like Ruby (not Java or C#); why Ruby has so many control structures; how to use strings, expressions, and symbols; and what dynamic typing is really good for. Next, the book addresses bigger questions related to building methods and classes. You’ll discover why Ruby classes contain so many tiny methods, when to use operator overloading, and when to avoid it. Olsen explains how to write Ruby code that writes its own code–and why you’ll want to. He concludes with powerful project-level features and techniques ranging from gems to Domain Specific Languages. A part of the renowned Addison-Wesley Professional Ruby Series, Eloquent Ruby will help you “put on your Ruby-colored glasses” and get results that make you a true believer.","language":"en","currency":"USD","id":"0321700279","title":"Eloquent Ruby","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-s2xL0pVsLUC&source=gbs_api","authors":["Russ Olsen"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wmrEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Build Real Time Data Analytics on Google Cloud Platform","description":"Step-by-step guide to different data movement and processing techniques, using Google Cloud Platform Services DESCRIPTION Modern businesses are awash with data, making data-driven decision-making tasks increasingly complex. As a result, relevant technical expertise and analytical skills are required to do such tasks. This book aims to equip you with enough knowledge of Cloud Computing in conjunction with Google Cloud Data platform to succeed in the role of a Cloud data expert. The current market is trending towards the latest cloud technologies, which is the need of the hour. Google being the pioneer, is dominating this space with the right set of cloud services being offered as part of GCP (Google Cloud Platform). At this juncture, this book will be very vital and will cover all the services that are being offered by GCP, putting emphasis on Data services. This book starts with sophisticated knowledge on Cloud Computing. It also explains different types of data services\/technology and machine learning algorithm\/Pre-Trained API through real-business problems, which are built on the Google Cloud Platform (GCP). With some of the latest business examples and hands-on guide, this book will enable the developers entering the data analytics fields to implement an end-to-end data pipeline, using GCP Data services. Through the course of the book, you will come across multiple industry-wise use cases, like Building Datawarehouse using Big Query, a sample real-time data analytics solution on machine learning and Artificial Intelligence that helped with the business decision, by employing a variety of data science approaches on Google Cloud environment. Whether your business is at the early stage of cloud implementation in its journey or well on its way to digital transformation, Google Cloud's solutions and technologies will always help chart a path to success. This book can be used to develop the GCP concepts in an easy way. It contains many examples showcasing the implementation of a GCP service. It enables the learning of the basic and advance concepts of Google Cloud Data Platform. This book is divided into 7 chapters and provides a detailed description of the core concepts of each of the Data services offered by Google Cloud. KEY FEATURES Learn the basic concept of Cloud Computing along with different Cloud service provides with their supported Models (IaaS\/PaaS\/SaaS) Learn the basics of Compute Engine, App Engine, Container Engine, Project and Billing setup in the Google Cloud Platform Learn how and when to use Cloud DataFlow, Cloud DataProc and Cloud DataPrep Build real-time data pipeline to support real-time analytics using Pub\/Sub messaging service Setting up a fully managed GCP Big Data Cluster using Cloud DataProc for running Apache Spark and Apache Hadoop clusters in a simpler, more cost-efficient manner Learn how to use Cloud Data Studio for visualizing the data on top of Big Query Implement and understand real-world business scenarios for Machine Learning, Data Pipeline Engineering WHAT WILL YOU LEARN By the end of the book, you will have come across different data services and platforms offered by Google Cloud, and how those services\/features can be enabled to serve business needs. You will also see a few case studies to put your knowledge to practice and solve business problems such as building a real-time streaming pipeline engine, Scalable Data Warehouse on Cloud, fully managed Hadoop cluster on Cloud and enabling TensorFlow\/Machine Learning API’s to support real-life business problems. Remember to practice additional examples to master these techniques. WHO IS THIS BOOK FOR This book is for professionals as well as graduates who want to build a career in Google Cloud data analytics technologies. While no prior knowledge of Cloud Computing or related technologies is assumed, it will be helpful to have some data background and experience. One stop shop for those who wish to get an initial to advance understanding of the GCP data platform. The target audience will be data engineers\/professionals who are new, as well as those who are acquainted with the tools and techniques related to cloud and data space. ● Individuals who have basic data understanding (i.e. Data and cloud) and have done some work in the field of data analytics, can refer\/use this book to master their knowledge\/understanding. ● The highlight of this book is that it will start with the basic cloud computing fundamentals and will move on to cover the advance concepts on GCP cloud data analytics and hence can be referred across multiple different levels of audiences. Table of Contents 1. GCP Overview and Architecture 2. Data Storage in GCP 3. Data Processing in GCP with Pub\/Sub and Dataflow 4. Data Processing in GCP with DataPrep and Dataflow 5. Big Query and Data Studio 6. Machine Learning with GCP 7. Sample Use cases and Examples","language":"en","currency":"USD","id":"9389423635","title":"Data Analytics with Google Cloud Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wmrEDwAAQBAJ&source=gbs_api","authors":["Murari Ramuka"]},{"pageCount":363,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jnEoBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"This textbook explains the concepts and techniques required to write programs that can handle large amounts of data efficiently. Project-oriented and classroom-tested, the book presents a number of important algorithms supported by examples that bring meaning to the problems faced by computer programmers. The idea of computational complexity is also introduced, demonstrating what can and cannot be computed efficiently so that the programmer can make informed judgements about the algorithms they use. Features: includes both introductory and advanced data structures and algorithms topics, with suggested chapter sequences for those respective courses provided in the preface; provides learning goals, review questions and programming exercises in each chapter, as well as numerous illustrative examples; offers downloadable programs and supplementary files at an associated website, with instructor materials available from the author; presents a primer on Python for those from a different language background.","language":"en","currency":"USD","id":"3319130722","title":"Data Structures and Algorithms with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jnEoBgAAQBAJ&source=gbs_api","authors":["Kent D. Lee","Steve Hubbard"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=syPHBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Scala, Java, or Python developer with an interest in machine learning and data analysis and are eager to learn how to apply common machine learning techniques at scale using the Spark framework, this is the book for you. While it may be useful to have a basic understanding of Spark, no previous experience is required.","language":"en","currency":"USD","id":"1783288523","title":"Machine Learning with Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=syPHBgAAQBAJ&source=gbs_api","authors":["Nick Pentreath"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UT2qCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a data scientist of any level, beginners included, and interested in cleaning up your data, this is the book for you! Experience with Python or PHP is assumed, but no previous knowledge of data cleaning is needed.","language":"en","currency":"USD","id":"1785289039","title":"Clean Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UT2qCQAAQBAJ&source=gbs_api","authors":["Megan Squire"]},{"pageCount":265,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XpDqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Guide to Hadoop's Data Warehouse System","description":"Dive into the world of SQL on Hadoop and get the most out of your Hive data warehouses. This book is your go-to resource for using Hive: authors Scott Shaw, Ankur Gupta, David Kjerrumgaard, and Andreas Francois Vermeulen take you through learning HiveQL, the SQL-like language specific to Hive, to analyze, export, and massage the data stored across your Hadoop environment. From deploying Hive on your hardware or virtual machine and setting up its initial configuration to learning how Hive interacts with Hadoop, MapReduce, Tez and other big data technologies, Practical Hive gives you a detailed treatment of the software. In addition, this book discusses the value of open source software, Hive performance tuning, and how to leverage semi-structured and unstructured data. What You Will Learn Install and configure Hive for new and existing datasets Perform DDL operations Execute efficient DML operations Use tables, partitions, buckets, and user-defined functions Discover performance tuning tips and Hive best practices Who This Book Is For Developers, companies, and professionals who deal with large amounts of data and could use software that can efficiently manage large volumes of input. It is assumed that readers have the ability to work with SQL.","language":"en","currency":"USD","id":"1484202716","title":"Practical Hive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XpDqDAAAQBAJ&source=gbs_api","authors":["Scott Shaw","Andreas François Vermeulen","Ankur Gupta","David Kjerrumgaard"]},{"pageCount":210,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Essential techniques to help you process, and get unique insights from, big data, 2nd Edition","description":"This book takes you on a fantastic journey to discover the attributes of big data using Apache Hive. Key Features Grasp the skills needed to write efficient Hive queries to analyze the Big Data Discover how Hive can coexist and work with other tools within the Hadoop ecosystem Uses practical, example-oriented scenarios to cover all the newly released features of Apache Hive 2.3.3 Book Description In this book, we prepare you for your journey into big data by frstly introducing you to backgrounds in the big data domain, alongwith the process of setting up and getting familiar with your Hive working environment. Next, the book guides you through discovering and transforming the values of big data with the help of examples. It also hones your skills in using the Hive language in an effcient manner. Toward the end, the book focuses on advanced topics, such as performance, security, and extensions in Hive, which will guide you on exciting adventures on this worthwhile big data journey. By the end of the book, you will be familiar with Hive and able to work effeciently to find solutions to big data problems What you will learn Create and set up the Hive environment Discover how to use Hive's definition language to describe data Discover interesting data by joining and filtering datasets in Hive Transform data by using Hive sorting, ordering, and functions Aggregate and sample data in different ways Boost Hive query performance and enhance data security in Hive Customize Hive to your needs by using user-defined functions and integrate it with other tools Who this book is for If you are a data analyst, developer, or simply someone who wants to quickly get started with Hive to explore and analyze Big Data in Hadoop, this is the book for you. Since Hive is an SQL-like language, some previous experience with SQL will be useful to get the most out of this book.","language":"en","currency":"USD","id":"1789136512","title":"Apache Hive Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IMNiDwAAQBAJ&source=gbs_api","authors":["Dayong Du"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":251,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rmXXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"The Simplified Beginner's Guide to Managing, Analyzing, and Manipulating Data With SQL","description":"\"THE BEST SQL BOOK FOR BEGINNERS IN 2020 - HANDS DOWN!\" *INCLUDES FREE ACCESS TO A SAMPLE DATABASE, SQL BROWSER APP, COMPREHENSION QUIZES & SEVERAL OTHER DIGITAL RESOURCES!* *| #1 NEW RELEASE & #1 BEST SELLER |* Not sure how to prepare for the data-driven future?This book shows you EXACTLY what you need to know to successfully use the SQL programming language to enhance your career! Are you a developer who wants to expand your mastery to database management?Then you NEED this book. Buy now and start reading today! Are you a project manager who needs to better understand your development team’s needs? A decision maker who needs to make deeper data-driven analysis?Everything you need to know is included in these pages! The ubiquity of big data means that now more than ever there is a burning need to warehouse, access, and understand the contents of massive databases quickly and efficiently. That’s where SQL comes in. SQL is the workhorse programming language that forms the backbone of modern data management and interpretation. Any database management professional will tell you that despite trendy data management languages that come and go, SQL remains the most widely used and most reliable to date, with no signs of stopping. In this comprehensive guide, experienced mentor and SQL expert Walter Shields draws on his considerable knowledge to make the topic of relational database management accessible, easy to understand, and highly actionable. SQL QuickStart Guide is ideal for those seeking to increase their job prospects and enhance their careers, for developers looking to expand their programming capabilities, or for anyone who wants to take advantage of our inevitably data-driven future—even with no prior coding experience! SQL QuickStart Guide Is For: - Professionals looking to augment their job skills in preparation for a data-driven future - Job seekers who want to pad their skills and resume for a durable employability edge - Beginners with zero prior experienceManagers, decision makers, and business owners looking to manage data-driven business insights - Developers looking to expand their mastery beyond the full stackAnyone who wants to be better prepared for our data-driven future! In SQL QuickStart Guide You'll Discover: - The basic structure of databases—what they are, how they work, and how to successfully navigate them - How to use SQL to retrieve and understand data no matter the scale of a database (aided by numerous images and examples) - The most important SQL queries, along with how and when to use them for best effect - Professional applications of SQL and how to “sell” your new SQL skills to your employer, along with other career-enhancing considerations *LIFETIME ACCESS TO FREE RESOURCES & BUSINESS SUPPORT* Each book comes with free lifetime access to tons of exclusive online resources to help you become a better business owner such as workbooks, cheat sheets and reference guides. You also receive lifetime access to our online coaching community to help you achieve all of your financial goals! *GIVING BACK* ClydeBank Media proudly supports the non-profit AdoptAClassroom whose mission is to advance equity in K-12 education by supplementing dwindling school funding for vital classroom materials and resources.*","language":"en","currency":"USD","id":"1945051833","title":"SQL QuickStart Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rmXXDwAAQBAJ&source=gbs_api","authors":["Walter Shields"]},{"pageCount":406,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cCnhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":135.96,"subtitle":"A Classroom Approach","description":"The authors provide an understanding of big data and MapReduce by clearly presenting the basic terminologies and concepts. They have employed over 100 illustrations and many worked-out examples to convey the concepts and methods used in big data, the inner workings of MapReduce, and single node\/multi-node installation on physical\/virtual machines. This book covers almost all the necessary information on Hadoop MapReduce for most online certification exams. Upon completing this book, readers will find it easy to understand other big data processing tools such as Spark, Storm, etc. Ultimately, readers will be able to: • understand what big data is and the factors that are involved • understand the inner workings of MapReduce, which is essential for certification exams • learn the features and weaknesses of MapReduce • set up Hadoop clusters with 100s of physical\/virtual machines • create a virtual machine in AWS • write MapReduce with Eclipse in a simple way • understand other big data processing tools and their applications","language":"en","currency":"USD","id":"1000439089","title":"Big Data with Hadoop MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cCnhDwAAQBAJ&source=gbs_api","authors":["Rathinaraja Jeyaraj","Ganeshkumar Pugalendhi","Anand Paul"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3igKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This effective self-study system delivers complete coverage of every topic on the AWS Certified Developer Associate Exam Take the challenging AWS Certified Developer Associate Exam with confidence using the comprehensive information contained in this effective test preparation guide. Written by an Amazon Web Services certified expert and experienced trainer, AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01) covers every subject on the exam and clearly explains how to create, deploy, migrate, monitor, and debug cloud-native applications. Designed to help you pass the exam with ease, this guide also serves as an ideal on-the-job reference. Covers all topics on the exam, including: Getting started with AWS Journey AWS high availability and fault tolerance Working with cloud storage Authentication and authorization Creating SQL and NoSQL databases in AWS Cloud AWS application integration and management Developing cloud-native applications in AWS Building, deploying, and debugging cloud applications Electronic content includes: 130 practice questions Test engine containing full-length practice exams and customizable quizzes","language":"en","currency":"USD","id":"1260460185","title":"AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3igKEAAAQBAJ&source=gbs_api","authors":["Kamesh Ganesan"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HaHz3-fqGM0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Developing Apps in the New World of Cloud Computing","description":"Moving to the Cloud provides an in-depth introduction to cloud computing models, cloud platforms, application development paradigms, concepts and technologies. The authors particularly examine cloud platforms that are in use today. They also describe programming APIs and compare the technologies that underlie them. The basic foundations needed for developing both client-side and cloud-side applications covering compute\/storage scaling, data parallelism, virtualization, MapReduce, RIA, SaaS and Mashups are covered. Approaches to address key challenges of a cloud infrastructure, such as scalability, availability, multi-tenancy, security and management are addressed. The book also lays out the key open issues and emerging cloud standards that will drive the continuing evolution of cloud computing. Includes complex case studies of cloud solutions by cloud experts from Yahoo! , Amazon, Microsoft, IBM, Adobe and HP Labs Presents insights and techniques for creating compelling rich client applications that interact with cloud services Demonstrates and distinguishes features of different cloud platforms using simple to complex API programming examples","language":"en","currency":"USD","id":"1597497266","title":"Moving To The Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HaHz3-fqGM0C&source=gbs_api","authors":["Dinkar Sitaram","Geetha Manjunath"]},{"pageCount":88,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qS9eAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"The book will follow a step-by-step tutorial approach which will show the readers how to use Apache Kafka for messaging from scratch.Apache Kafka is for readers with software development experience, but no prior exposure to Apache Kafka or similar technologies is assumed. This book is also for enterprise application developers and big data enthusiasts who have worked with other publisher-subscriber based systems and now want to explore Apache Kafka as a futuristic scalable solution.","language":"en","currency":"USD","id":"1782167943","title":"Apache Kafka","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qS9eAQAAQBAJ&source=gbs_api","authors":["Nishant Garg"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VED3Sre6X_MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Already know Python but want to learn more? A lot more? Dive into a variety of topics used in practice for real-world applications. Covers regular expressions, Internet\/network programming, GUIs, SQL\/databases\/ORMs, threading, and Web development. Learn about contemporary development trends such as Google+, Twitter, MongoDB, OAuth, Python 3 migration, and Java\/Jython. Presents brand new material on Django, Google App Engine, CSV\/JSON\/XML, and Microsoft Office. Includes Python 2 and 3 code samples to get you started right away! Provides code snippets, interactive examples, and practical exercises to help build your Python skills. The Complete Developer’s Guide to Python Python is an agile, robust, and expressive programming language that continues to build momentum. It combines the power of compiled languages with the simplicity and rapid development of scripting languages. In Core Python Applications Programming, Third Edition , leading Python developer and corporate trainer Wesley Chun helps you take your Python knowledge to the next level. This book has everything you need to become a versatile Python developer. You will be introduced to multiple areas of application development and gain knowledge that can be immediately applied to projects, and you will find code samples in both Python 2 and 3, including migration tips if that’s on your roadmap too. Some snippets will even run unmodified on 2.x or 3.x. Learn professional Python style, best practices, and good programming habits Build clients and servers using TCP, UDP, XML-RPC, and be exposed to higher-level libraries like SocketServer and Twisted Develop GUI applications using Tkinter and other available toolkits Improve application performance by writing extensions in C\/C++, or enhance I\/O-bound code with multithreading Discover SQL and relational databases, ORMs, and even non-relational (NonSQL) databases like MongoDB Learn the basics of Web programming, including Web clients and servers, plus CGI and WSGI Expose yourself to regular expressions and powerful text processing tools for creating and parsing CSV, JSON, and XML data Interface with popular Microsoft Office applications such as Excel, PowerPoint, and Outlook using COM client programming Dive deeper into Web development with the Django framework and cloud computing with Google App Engine Explore Java programming with Jython, the way to run Python code on the JVM Connect to Web services Yahoo! Finance to get stock quotes, or Yahoo! Mail, Gmail, and others to download or send e-mail Jump into the social media craze by learning how to connect to the Twitter and Google+ networks Core Python Applications Programming, Third Edition, delivers Broad coverage of a variety of areas of development used in real-world applications today Powerful insights into current and best practices for the intermediate Python programmer Dozens of code examples, from quick snippets to full-fledged applications A variety of exercises at the end of every chapter to help hammer the concepts home","language":"en","currency":"USD","id":"0132850001","title":"Core Python Applications Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VED3Sre6X_MC&source=gbs_api","authors":["Wesley J Chun"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnnlCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This invaluable roadmap for startup engineers reveals how to successfully handle web application scalability challenges to meet increasing product and traffic demands. Web Scalability for Startup Engineers shows engineers working at startups and small companies how to plan and implement a comprehensive scalability strategy. It presents broad and holistic view of infrastructure and architecture of a scalable web application. Successful startups often face the challenge of scalability, and the core concepts driving a scalable architecture are language and platform agnostic. The book covers scalability of HTTP-based systems (websites, REST APIs, SaaS, and mobile application backends), starting with a high-level perspective before taking a deep dive into common challenges and issues. This approach builds a holistic view of the problem, helping you see the big picture, and then introduces different technologies and best practices for solving the problem at hand. The book is enriched with the author's real-world experience and expert advice, saving you precious time and effort by learning from others' mistakes and successes. Language-agnostic approach addresses universally challenging concepts in Web development\/scalability—does not require knowledge of a particular language Fills the gap for engineers in startups and smaller companies who have limited means for getting to the next level in terms of accomplishing scalability Strategies presented help to decrease time to market and increase the efficiency of web applications","language":"en","currency":"USD","id":"0071843663","title":"Web Scalability for Startup Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnnlCQAAQBAJ&source=gbs_api","authors":["Artur Ejsmont"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Sk0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Implement a High-Performance Enterprise Java Application Modernization Strategy Learn cutting-edge techniques and processes to systematically and strategically modernize legacy Java applications with predictability, consistency, and confidence. This Oracle Press guide offers an innovative blueprint that empowers corporate management teams to better understand necessary technical requirements and enables Java architects and developers to better align with agile business needs. Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio contains modernization approaches that offer end-to-end Java application portfolio visibility so that application modernization projects can stay on-schedule and within budget.","language":"en","currency":"USD","id":"0071842047","title":"Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Sk0DwAAQBAJ&source=gbs_api","authors":["G. Venkat"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kQi6DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Master the Powerful Multitenant Features of Oracle Database 12c Govern a scalable, extensible, and highly available enterprise database environment using the practical information contained in this Oracle Press guide. Written by a team of Oracle Masters, Oracle Database 12c Release 2 Multitenant shows, step-by-step, how to deploy and manage multitenant configurations across IT frameworks of all types and sizes. Find out how to create databases, work with PDBs and CDBs, administer Oracle Net Services, and automate administrative tasks. Backup and recovery, security, and advanced multitenant options are covered in complete detail. Learn how to: • Build high-performance multitenant Oracle databases • Create single-tenant, multitenant, and application containers • Establish network connections and manage services • Handle security using authentication, authorization, and encryption • Back up and restore your mission-critical data • Work with point-in-time recovery and Oracle Flashback • Move data and replicate and clone databases • Work with Oracle’s Resource Manager and Data Guard","language":"en","currency":"USD","id":"125983610X","title":"Oracle Database 12c Release 2 Multitenant","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kQi6DQAAQBAJ&source=gbs_api","authors":["Anton Els","Vit Špinka","Franck Pachot"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d2tLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn the art of regression analysis with Python About This Book Become competent at implementing regression analysis in Python Solve some of the complex data science problems related to predicting outcomes Get to grips with various types of regression for effective data analysis Who This Book Is For The book targets Python developers, with a basic understanding of data science, statistics, and math, who want to learn how to do regression analysis on a dataset. It is beneficial if you have some knowledge of statistics and data science. What You Will Learn Format a dataset for regression and evaluate its performance Apply multiple linear regression to real-world problems Learn to classify training points Create an observation matrix, using different techniques of data analysis and cleaning Apply several techniques to decrease (and eventually fix) any overfitting problem Learn to scale linear models to a big dataset and deal with incremental data In Detail Regression is the process of learning relationships between inputs and continuous outputs from example data, which enables predictions for novel inputs. There are many kinds of regression algorithms, and the aim of this book is to explain which is the right one to use for each set of problems and how to prepare real-world data for it. With this book you will learn to define a simple regression problem and evaluate its performance. The book will help you understand how to properly parse a dataset, clean it, and create an output matrix optimally built for regression. You will begin with a simple regression algorithm to solve some data science problems and then progress to more complex algorithms. The book will enable you to use regression models to predict outcomes and take critical business decisions. Through the book, you will gain knowledge to use Python for building fast better linear models and to apply the results in Python or in any computer language you prefer. Style and approach This is a practical tutorial-based book. You will be given an example problem and then supplied with the relevant code and how to walk through it. The details are provided in a step by step manner, followed by a thorough explanation of the math underlying the solution. This approach will help you leverage your own data using the same techniques.","language":"en","currency":"USD","id":"1783980745","title":"Regression Analysis with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d2tLDAAAQBAJ&source=gbs_api","authors":["Luca Massaron","Alberto Boschetti"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RHeuDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Designing and Building Effective Analytics at Scale","description":"The Complete Guide to Data Science with Hadoop—For Technical Professionals, Businesspeople, and Students Demand is soaring for professionals who can solve real data science problems with Hadoop and Spark. Practical Data Science with Hadoop® and Spark is your complete guide to doing just that. Drawing on immense experience with Hadoop and big data, three leading experts bring together everything you need: high-level concepts, deep-dive techniques, real-world use cases, practical applications, and hands-on tutorials. The authors introduce the essentials of data science and the modern Hadoop ecosystem, explaining how Hadoop and Spark have evolved into an effective platform for solving data science problems at scale. In addition to comprehensive application coverage, the authors also provide useful guidance on the important steps of data ingestion, data munging, and visualization. Once the groundwork is in place, the authors focus on specific applications, including machine learning, predictive modeling for sentiment analysis, clustering for document analysis, anomaly detection, and natural language processing (NLP). This guide provides a strong technical foundation for those who want to do practical data science, and also presents business-driven guidance on how to apply Hadoop and Spark to optimize ROI of data science initiatives. Learn What data science is, how it has evolved, and how to plan a data science career How data volume, variety, and velocity shape data science use cases Hadoop and its ecosystem, including HDFS, MapReduce, YARN, and Spark Data importation with Hive and Spark Data quality, preprocessing, preparation, and modeling Visualization: surfacing insights from huge data sets Machine learning: classification, regression, clustering, and anomaly detection Algorithms and Hadoop tools for predictive modeling Cluster analysis and similarity functions Large-scale anomaly detection NLP: applying data science to human language","language":"en","currency":"USD","id":"0134029720","title":"Practical Data Science with Hadoop and Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RHeuDQAAQBAJ&source=gbs_api","authors":["Ofer Mendelevitch","Casey Stella","Douglas Eadline"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"Languages That Are Shaping the Future","description":"Great programmers aren't born--they're made. The industry is moving from object-oriented languages to functional languages, and you need to commit to radical improvement. New programming languages arm you with the tools and idioms you need to refine your craft. While other language primers take you through basic installation and \"Hello, World,\" we aim higher. Each language in Seven More Languages in Seven Weeks will take you on a step-by-step journey through the most important paradigms of our time. You'll learn seven exciting languages: Lua, Factor, Elixir, Elm, Julia, MiniKanren, and Idris. Learn from the award-winning programming series that inspired the Elixir language. Hear how other programmers across broadly different communities solve problems important enough to compel language development. Expand your perspective, and learn to solve multicore and distribution problems. In each language, you'll solve a non-trivial problem, using the techniques that make that language special. Write a fully functional game in Elm, without a single callback, that compiles to JavaScript so you can deploy it in any browser. Write a logic program in Clojure using a programming model, MiniKanren, that is as powerful as Prolog but much better at interacting with the outside world. Build a distributed program in Elixir with Lisp-style macros, rich Ruby-like syntax, and the richness of the Erlang virtual machine. Build your own object layer in Lua, a statistical program in Julia, a proof in code with Idris, and a quiz game in Factor. When you're done, you'll have written programs in five different programming paradigms that were written on three different continents. You'll have explored four languages on the leading edge, invented in the past five years, and three more radically different languages, each with something significant to teach you.","language":"en","currency":"USD","id":"1680504746","title":"Seven More Languages in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZA9QDwAAQBAJ&source=gbs_api","authors":["Bruce Tate","Ian Dees","Frederic Daoud","Jack Moffitt"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZJJgAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A comprehensive practical guide that walks you through the multiple stages of data management in enterprise and gives you numerous design patterns with appropriate code examples to solve frequent problems in each of these stages. The chapters are organized to mimick the sequential data flow evidenced in Analytics platforms, but they can also be read independently to solve a particular group of problems in the Big Data life cycle. If you are an experienced developer who is already familiar with Pig and is looking for a use case standpoint where they can relate to the problems of data ingestion, profiling, cleansing, transforming, and egressing data encountered in the enterprises. Knowledge of Hadoop and Pig is necessary for readers to grasp the intricacies of Pig design patterns better.","language":"en","currency":"USD","id":"1783285567","title":"Pig Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZJJgAwAAQBAJ&source=gbs_api","authors":["Pradeep Pasupuleti"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=161KDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Leverage the power of Python design patterns to solve real-world problems in software architecture and design About This Book Understand the structural, creational, and behavioral Python design patterns Get to know the context and application of design patterns to solve real-world problems in software architecture, design, and application development Get practical exposure through sample implementations in Python v3.5 for the design patterns featured Who This Book Is For This book is for Software architects and Python application developers who are passionate about software design. It will be very useful to engineers with beginner level proficiency in Python and who love to work with Python 3.5 What You Will Learn Enhance your skills to create better software architecture Understand proven solutions to commonly occurring design issues Explore the design principles that form the basis of software design, such as loose coupling, the Hollywood principle and the Open Close principle among others Delve into the object-oriented programming concepts and find out how they are used in software applications Develop an understanding of Creational Design Patterns and the different object creation methods that help you solve issues in software development Use Structural Design Patterns and find out how objects and classes interact to build larger applications Focus on the interaction between objects with the command and observer patterns Improve the productivity and code base of your application using Python design patterns In Detail With the increasing focus on optimized software architecture and design it is important that software architects think about optimizations in object creation, code structure, and interaction between objects at the architecture or design level. This makes sure that the cost of software maintenance is low and code can be easily reused or is adaptable to change. The key to this is reusability and low maintenance in design patterns. Building on the success of the previous edition, Learning Python Design Patterns, Second Edition will help you implement real-world scenarios with Python's latest release, Python v3.5. We start by introducing design patterns from the Python perspective. As you progress through the book, you will learn about Singleton patterns, Factory patterns, and Facade patterns in detail. After this, we'll look at how to control object access with proxy patterns. It also covers observer patterns, command patterns, and compound patterns. By the end of the book, you will have enhanced your professional abilities in software architecture, design, and development. Style and approach This is an easy-to-follow guide to design patterns with hands-on examples of real-world scenarios and their implementation in Python v3.5. Each topic is explained and placed in context, and for the more inquisitive, there are more details on the concepts used.","language":"en","currency":"USD","id":"1785887378","title":"Learning Python Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=161KDAAAQBAJ&source=gbs_api","authors":["Chetan Giridhar"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zAcmiPOJssQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Python for the Java Platform","description":"Jython is an open source implementation of the high-level, dynamic, object-oriented scripting language Python seamlessly integrated with the Java platform. The predecessor to Jython, JPython, is certified as 100% Pure Java. Jython is freely available for both commercial and noncommercial use and is distributed with source code. Jython is complementary to Java. The Definitive Guide to Jython, written by the official Jython team leads, covers Jython 2.5 (or 2.5.x)—from the basics to more advanced features. This book begins with a brief introduction to the language and then journeys through Jython’s different features and uses. The Definitive Guide to Jython is organized for beginners as well as advanced users of the language. The book provides a general overview of the Jython language itself, but it also includes intermediate and advanced topics regarding database, web, and graphical user interface (GUI) applications; Web services\/SOA; and integration, concurrency, and parallelism, to name a few.","language":"en","currency":"USD","id":"1430225289","title":"The Definitive Guide to Jython","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zAcmiPOJssQC&source=gbs_api","authors":["Josh Juneau","Jim Baker","Frank Wierzbicki","Leo Soto Muoz","Victor Ng","Alex Ng","Donna L. Baker"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7n5vAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This step-by-step guide is full of easy-to-follow code taken from real-world examples explaining the migration and integration of Scala in a Java project. If you are a Java developer or a Java architect, working in Java EE-based solutions and want to start using Scala in your daily programming, this book is ideal for you. This book will get you up and running quickly by adopting a pragmatic approach with real-world code samples. No prior knowledge of Scala is required.","language":"en","currency":"USD","id":"1783283645","title":"Scala for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7n5vAwAAQBAJ&source=gbs_api","authors":["Thomas Alexandre"]},{"pageCount":305,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i1fSDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"How to Integrate Your RDBMS with the Hadoop Ecosystem and Re-Architect Relational Applications to NoSQL","description":"Re-architect relational applications to NoSQL, integrate relational database management systems with the Hadoop ecosystem, and transform and migrate relational data to and from Hadoop components. This book covers the best-practice design approaches to re-architecting your relational applications and transforming your relational data to optimize concurrency, security, denormalization, and performance. Winner of IBM’s 2012 Gerstner Award for his implementation of big data and data warehouse initiatives and author of Practical Hadoop Security, author Bhushan Lakhe walks you through the entire transition process. First, he lays out the criteria for deciding what blend of re-architecting, migration, and integration between RDBMS and HDFS best meets your transition objectives. Then he demonstrates how to design your transition model. Lakhe proceeds to cover the selection criteria for ETL tools, the implementation steps for migration with SQOOP- and Flume-based data transfers, and transition optimization techniques for tuning partitions, scheduling aggregations, and redesigning ETL. Finally, he assesses the pros and cons of data lakes and Lambda architecture as integrative solutions and illustrates their implementation with real-world case studies. Hadoop\/NoSQL solutions do not offer by default certain relational technology features such as role-based access control, locking for concurrent updates, and various tools for measuring and enhancing performance. Practical Hadoop Migration shows how to use open-source tools to emulate such relational functionalities in Hadoop ecosystem components. What You'll Learn Decide whether you should migrate your relational applications to big data technologies or integrate them Transition your relational applications to Hadoop\/NoSQL platforms in terms of logical design and physical implementation Discover RDBMS-to-HDFS integration, data transformation, and optimization techniques Consider when to use Lambda architecture and data lake solutions Select and implement Hadoop-based components and applications to speed transition, optimize integrated performance, and emulate relational functionalities Who This Book Is For Database developers, database administrators, enterprise architects, Hadoop\/NoSQL developers, and IT leaders. Its secondary readership is project and program managers and advanced students of database and management information systems.","language":"en","currency":"USD","id":"1484212878","title":"Practical Hadoop Migration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i1fSDAAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":255,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oKY5QeSWb4cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":"Detailed Hands-on Recipes for Creating the Most Useful Types of Graphs in R-- Starting from the Simplest Versions to More Advanced Applications","description":"With more than two million users worldwide, R is one of the most popular open source projects. It is a free and robust statistical programming environment with very powerful graphical capabilities. Analyzing and visualizing data with R is a necessary skill for anyone doing any kind of statistical analysis, and this book will help you do just that in the easiest and most efficient way possible. Unlike other books on R, this book takes a practical, hands-on approach and you dive straight into creating graphs in R right from the very first page. You want to harness the power of this open source programming language to visually present and analyze your data in the best way possible – and this book will show you how. The R Graph Cookbook takes a practical approach to teaching how to create effective and useful graphs using R. This practical guide begins by teaching you how to make basic graphs in R and progresses through subsequent dedicated chapters about each graph type in depth. It will demystify a lot of difficult and confusing R functions and parameters and enable you to construct and modify data graphics to suit your analysis, presentation, and publication needs. You will learn all about making graphics such as scatter plots, line graphs, bar charts, pie charts, dot plots, heat maps, histograms and box plots. In addition, there are detailed recipes on making various combinations and advanced versions of these graphs. Dedicated chapters on polishing and finalizing graphs will enable you to produce professional-quality graphs for presentation and publication. With R Graph Cookbook in hand, making graphs in R has never been easier.","language":"en","currency":"USD","id":"1849513074","title":"R Graphs Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oKY5QeSWb4cC&source=gbs_api","authors":["Hrishi V. Mittal"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":170,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kewPAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Streamlined Enterprise Data Management and Analysis","description":"There is an easier way to build Hadoop applications. With this hands-on book, you’ll learn how to use Cascading, the open source abstraction framework for Hadoop that lets you easily create and manage powerful enterprise-grade data processing applications—without having to learn the intricacies of MapReduce. Working with sample apps based on Java and other JVM languages, you’ll quickly learn Cascading’s streamlined approach to data processing, data filtering, and workflow optimization. This book demonstrates how this framework can help your business extract meaningful information from large amounts of distributed data. Start working on Cascading example projects right away Model and analyze unstructured data in any format, from any source Build and test applications with familiar constructs and reusable components Work with the Scalding and Cascalog Domain-Specific Languages Easily deploy applications to Hadoop, regardless of cluster location or data size Build workflows that integrate several big data frameworks and processes Explore common use cases for Cascading, including features and tools that support them Examine a case study that uses a dataset from the Open Data Initiative","language":"en","currency":"USD","id":"1449359604","title":"Enterprise Data Workflows with Cascading","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kewPAAAAQBAJ&source=gbs_api","authors":["Paco Nathan"]},{"pageCount":277,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yqhPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Practitioner's Guide to Using Spark for Large Scale Data Analysis","description":"Big Data Analytics with Spark is a step-by-step guide for learning Spark, which is an open-source fast and general-purpose cluster computing framework for large-scale data analysis. You will learn how to use Spark for different types of big data analytics projects, including batch, interactive, graph, and stream data analysis as well as machine learning. In addition, this book will help you become a much sought-after Spark expert. Spark is one of the hottest Big Data technologies. The amount of data generated today by devices, applications and users is exploding. Therefore, there is a critical need for tools that can analyze large-scale data and unlock value from it. Spark is a powerful technology that meets that need. You can, for example, use Spark to perform low latency computations through the use of efficient caching and iterative algorithms; leverage the features of its shell for easy and interactive Data analysis; employ its fast batch processing and low latency features to process your real time data streams and so on. As a result, adoption of Spark is rapidly growing and is replacing Hadoop MapReduce as the technology of choice for big data analytics. This book provides an introduction to Spark and related big-data technologies. It covers Spark core and its add-on libraries, including Spark SQL, Spark Streaming, GraphX, and MLlib. Big Data Analytics with Spark is therefore written for busy professionals who prefer learning a new technology from a consolidated source instead of spending countless hours on the Internet trying to pick bits and pieces from different sources. The book also provides a chapter on Scala, the hottest functional programming language, and the program that underlies Spark. You’ll learn the basics of functional programming in Scala, so that you can write Spark applications in it. What's more, Big Data Analytics with Spark provides an introduction to other big data technologies that are commonly used along with Spark, like Hive, Avro, Kafka and so on. So the book is self-sufficient; all the technologies that you need to know to use Spark are covered. The only thing that you are expected to know is programming in any language. There is a critical shortage of people with big data expertise, so companies are willing to pay top dollar for people with skills in areas like Spark and Scala. So reading this book and absorbing its principles will provide a boost—possibly a big boost—to your career.","language":"en","currency":"USD","id":"1484209648","title":"Big Data Analytics with Spark","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yqhPCwAAQBAJ&source=gbs_api","authors":["Mohammed Guller"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lrZrCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Perform forensic investigations on Hadoop clusters with cutting-edge tools and techniques About This Book Identify, collect, and analyze Hadoop evidence forensically Learn about Hadoop's internals and Big Data file storage concepts A step-by-step guide to help you perform forensic analysis using freely available tools Who This Book Is For This book is meant for statisticians and forensic analysts with basic knowledge of digital forensics. They do not need to know Big Data Forensics. If you are an IT professional, law enforcement professional, legal professional, or a student interested in Big Data and forensics, this book is the perfect hands-on guide for learning how to conduct Hadoop forensic investigations. Each topic and step in the forensic process is described in accessible language. What You Will Learn Understand Hadoop internals and file storage Collect and analyze Hadoop forensic evidence Perform complex forensic analysis for fraud and other investigations Use state-of-the-art forensic tools Conduct interviews to identify Hadoop evidence Create compelling presentations of your forensic findings Understand how Big Data clusters operate Apply advanced forensic techniques in an investigation, including file carving, statistical analysis, and more In Detail Big Data forensics is an important type of digital investigation that involves the identification, collection, and analysis of large-scale Big Data systems. Hadoop is one of the most popular Big Data solutions, and forensically investigating a Hadoop cluster requires specialized tools and techniques. With the explosion of Big Data, forensic investigators need to be prepared to analyze the petabytes of data stored in Hadoop clusters. Understanding Hadoop's operational structure and performing forensic analysis with court-accepted tools and best practices will help you conduct a successful investigation. Discover how to perform a complete forensic investigation of large-scale Hadoop clusters using the same tools and techniques employed by forensic experts. This book begins by taking you through the process of forensic investigation and the pitfalls to avoid. It will walk you through Hadoop's internals and architecture, and you will discover what types of information Hadoop stores and how to access that data. You will learn to identify Big Data evidence using techniques to survey a live system and interview witnesses. After setting up your own Hadoop system, you will collect evidence using techniques such as forensic imaging and application-based extractions. You will analyze Hadoop evidence using advanced tools and techniques to uncover events and statistical information. Finally, data visualization and evidence presentation techniques are covered to help you properly communicate your findings to any audience. Style and approach This book is a complete guide that follows every step of the forensic analysis process in detail. You will be guided through each key topic and step necessary to perform an investigation. Hands-on exercises are presented throughout the book, and technical reference guides and sample documents are included for real-world use.","language":"en","currency":"USD","id":"1785281216","title":"Big Data Forensics – Learning Hadoop Investigations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lrZrCgAAQBAJ&source=gbs_api","authors":["Joe Sremack"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yuh1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Learn about big data processing and analytics","description":"A fast paced guide that will help you learn about Apache Hadoop 3 and its ecosystem Key Features Set up, configure and get started with Hadoop to get useful insights from large data sets Work with the different components of Hadoop such as MapReduce, HDFS and YARN Learn about the new features introduced in Hadoop 3 Book Description Apache Hadoop is a widely used distributed data platform. It enables large datasets to be efficiently processed instead of using one large computer to store and process the data. This book will get you started with the Hadoop ecosystem, and introduce you to the main technical topics, including MapReduce, YARN, and HDFS. The book begins with an overview of big data and Apache Hadoop. Then, you will set up a pseudo Hadoop development environment and a multi-node enterprise Hadoop cluster. You will see how the parallel programming paradigm, such as MapReduce, can solve many complex data processing problems. The book also covers the important aspects of the big data software development lifecycle, including quality assurance and control, performance, administration, and monitoring. You will then learn about the Hadoop ecosystem, and tools such as Kafka, Sqoop, Flume, Pig, Hive, and HBase. Finally, you will look at advanced topics, including real time streaming using Apache Storm, and data analytics using Apache Spark. By the end of the book, you will be well versed with different configurations of the Hadoop 3 cluster. What you will learn Store and analyze data at scale using HDFS, MapReduce and YARN Install and configure Hadoop 3 in different modes Use Yarn effectively to run different applications on Hadoop based platform Understand and monitor how Hadoop cluster is managed Consume streaming data using Storm, and then analyze it using Spark Explore Apache Hadoop ecosystem components, such as Flume, Sqoop, HBase, Hive, and Kafka Who this book is for Aspiring Big Data professionals who want to learn the essentials of Hadoop 3 will find this book to be useful. Existing Hadoop users who want to get up to speed with the new features introduced in Hadoop 3 will also benefit from this book. Having knowledge of Java programming will be an added advantage.","language":"en","currency":"USD","id":"1788994345","title":"Apache Hadoop 3 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yuh1DwAAQBAJ&source=gbs_api","authors":["Hrishikesh Vijay Karambelkar"]},{"pageCount":778,"thumbnail":"http:\/\/books.google.com\/books\/content?id=10AoCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Recipes for Scaling Up with Hadoop and Spark","description":"If you are ready to dive into the MapReduce framework for processing large datasets, this practical book takes you step by step through the algorithms and tools you need to build distributed MapReduce applications with Apache Hadoop or Apache Spark. Each chapter provides a recipe for solving a massive computational problem, such as building a recommendation system. You’ll learn how to implement the appropriate MapReduce solution with code that you can use in your projects. Dr. Mahmoud Parsian covers basic design patterns, optimization techniques, and data mining and machine learning solutions for problems in bioinformatics, genomics, statistics, and social network analysis. This book also includes an overview of MapReduce, Hadoop, and Spark. Topics include: Market basket analysis for a large set of transactions Data mining algorithms (K-means, KNN, and Naive Bayes) Using huge genomic data to sequence DNA and RNA Naive Bayes theorem and Markov chains for data and market prediction Recommendation algorithms and pairwise document similarity Linear regression, Cox regression, and Pearson correlation Allelic frequency and mining DNA Social network analysis (recommendation systems, counting triangles, sentiment analysis)","language":"en","currency":"USD","id":"1491906138","title":"Data Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=10AoCgAAQBAJ&source=gbs_api","authors":["Mahmoud Parsian"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iPirBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.39,"subtitle":null,"description":"The R language is a powerful open source functional programming language. At its core, R is a statistical programming language that provides impressive tools to analyze data and create high-level graphics. This book covers the basics of R by setting up a user-friendly programming environment and performing data ETL in R. Data exploration examples are provided that demonstrate how powerful data visualization and machine learning is in discovering hidden relationships. You will then dive into important machine learning topics, including data classification, regression, clustering, association rule mining, and dimension reduction.","language":"en","currency":"USD","id":"1783982055","title":"Machine Learning with R Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iPirBwAAQBAJ&source=gbs_api","authors":["Yu-Wei, Chiu (David Chiu)"]},{"pageCount":534,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4YsdCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":104,"subtitle":null,"description":"Machine learning allows computers to learn and discern patterns without actually being programmed. When Statistical techniques and machine learning are combined together they are a powerful tool for analysing various kinds of data in many computer science\/engineering areas including, image processing, speech processing, natural language processing, robot control, as well as in fundamental sciences such as biology, medicine, astronomy, physics, and materials. Introduction to Statistical Machine Learning provides a general introduction to machine learning that covers a wide range of topics concisely and will help you bridge the gap between theory and practice. Part I discusses the fundamental concepts of statistics and probability that are used in describing machine learning algorithms. Part II and Part III explain the two major approaches of machine learning techniques; generative methods and discriminative methods. While Part III provides an in-depth look at advanced topics that play essential roles in making machine learning algorithms more useful in practice. The accompanying MATLAB\/Octave programs provide you with the necessary practical skills needed to accomplish a wide range of data analysis tasks. Provides the necessary background material to understand machine learning such as statistics, probability, linear algebra, and calculus. Complete coverage of the generative approach to statistical pattern recognition and the discriminative approach to statistical machine learning. Includes MATLAB\/Octave programs so that readers can test the algorithms numerically and acquire both mathematical and practical skills in a wide range of data analysis tasks Discusses a wide range of applications in machine learning and statistics and provides examples drawn from image processing, speech processing, natural language processing, robot control, as well as biology, medicine, astronomy, physics, and materials.","language":"en","currency":"USD","id":"0128023503","title":"Introduction to Statistical Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4YsdCAAAQBAJ&source=gbs_api","authors":["Masashi Sugiyama"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HP5_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Integrate Elasticsearch into Hadoop to effectively visualize and analyze your data About This Book Build production-ready analytics applications by integrating the Hadoop ecosystem with Elasticsearch Learn complex Elasticsearch queries and develop real-time monitoring Kibana dashboards to visualize your data Use Elasticsearch and Kibana to search data in Hadoop easily with this comprehensive, step-by-step guide Who This Book Is For This book is targeted at Java developers with basic knowledge on Hadoop. No prior Elasticsearch experience is expected. What You Will Learn Set up the Elasticsearch-Hadoop environment Import HDFS data into Elasticsearch with MapReduce jobs Perform full-text search and aggregations efficiently using Elasticsearch Visualize data and create interactive dashboards using Kibana Check and detect anomalies in streaming data using Storm and Elasticsearch Inject and classify real-time streaming data into Elasticsearch Get production-ready for Elasticsearch-Hadoop based projects Integrate with Hadoop eco-system such as Pig, Storm, Hive, and Spark In Detail The Hadoop ecosystem is a de-facto standard for processing terra-bytes and peta-bytes of data. Lucene-enabled Elasticsearch is becoming an industry standard for its full-text search and aggregation capabilities. Elasticsearch-Hadoop serves as a perfect tool to bridge the worlds of Elasticsearch and Hadoop ecosystem to get best out of both the worlds. Powered with Kibana, this stack makes it a cakewalk to get surprising insights out of your massive amount of Hadoop ecosystem in a flash. In this book, you'll learn to use Elasticsearch, Kibana and Elasticsearch-Hadoop effectively to analyze and understand your HDFS and streaming data. You begin with an in-depth understanding of the Hadoop, Elasticsearch, Marvel, and Kibana setup. Right after this, you will learn to successfully import Hadoop data into Elasticsearch by writing MapReduce job in a real-world example. This is then followed by a comprehensive look at Elasticsearch essentials, such as full-text search analysis, queries, filters and aggregations; after which you gain an understanding of creating various visualizations and interactive dashboard using Kibana. Classifying your real-world streaming data and identifying trends in it using Storm and Elasticsearch are some of the other topics that we'll cover. You will also gain an insight about key concepts of Elasticsearch and Elasticsearch-hadoop in distributed mode, advanced configurations along with some common configuration presets you may need for your production deployments. You will have “Go production checklist” and high-level view for cluster administration for post-production. Towards the end, you will learn to integrate Elasticsearch with other Hadoop eco-system tools, such as Pig, Hive and Spark. Style and approach A concise yet comprehensive approach has been adopted with real-time examples to help you grasp the concepts easily.","language":"en","currency":"USD","id":"1785282247","title":"Elasticsearch for Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HP5_CwAAQBAJ&source=gbs_api","authors":["Vishal Shukla"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hnc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Over 100 practical recipes to help you become an expert Hadoop administrator About This Book Become an expert Hadoop administrator and perform tasks to optimize your Hadoop Cluster Import and export data into Hive and use Oozie to manage workflow. Practical recipes will help you plan and secure your Hadoop cluster, and make it highly available Who This Book Is For If you are a system administrator with a basic understanding of Hadoop and you want to get into Hadoop administration, this book is for you. It's also ideal if you are a Hadoop administrator who wants a quick reference guide to all the Hadoop administration-related tasks and solutions to commonly occurring problems What You Will Learn Set up the Hadoop architecture to run a Hadoop cluster smoothly Maintain a Hadoop cluster on HDFS, YARN, and MapReduce Understand high availability with Zookeeper and Journal Node Configure Flume for data ingestion and Oozie to run various workflows Tune the Hadoop cluster for optimal performance Schedule jobs on a Hadoop cluster using the Fair and Capacity scheduler Secure your cluster and troubleshoot it for various common pain points In Detail Hadoop enables the distributed storage and processing of large datasets across clusters of computers. Learning how to administer Hadoop is crucial to exploit its unique features. With this book, you will be able to overcome common problems encountered in Hadoop administration. The book begins with laying the foundation by showing you the steps needed to set up a Hadoop cluster and its various nodes. You will get a better understanding of how to maintain Hadoop cluster, especially on the HDFS layer and using YARN and MapReduce. Further on, you will explore durability and high availability of a Hadoop cluster. You'll get a better understanding of the schedulers in Hadoop and how to configure and use them for your tasks. You will also get hands-on experience with the backup and recovery options and the performance tuning aspects of Hadoop. Finally, you will get a better understanding of troubleshooting, diagnostics, and best practices in Hadoop administration. By the end of this book, you will have a proper understanding of working with Hadoop clusters and will also be able to secure, encrypt it, and configure auditing for your Hadoop clusters. Style and approach This book contains short recipes that will help you run a Hadoop cluster efficiently. The recipes are solutions to real-life problems that administrators encounter while working with a Hadoop cluster","language":"en","currency":"USD","id":"1787126870","title":"Hadoop 2.x Administration Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hnc5DwAAQBAJ&source=gbs_api","authors":["Gurmukh Singh"]},{"pageCount":25,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mAeuCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"With the almost unfathomable increase in web traffic over recent years, driven by millions of connected users, businesses are gaining access to massive amounts of complex, unstructured data from which to gain insight. When Hadoop was introduced by Yahoo in 2007, it brought with it a paradigm shift in how this data was stored and analysed. Hadoop allowed small and medium sized companies to store huge amounts of data on cheap commodity servers in racks. The introduction of Big Data has allowed businesses to make decisions based on quantifiable analysis. Hadoop is now implemented in major organizations such as Amazon, IBM, Cloudera, and Dell to name a few. This book introduces you to Hadoop and to concepts such as ‘MapReduce’, ‘Rack Awareness’, ‘Yarn’ and ‘HDFS Federation’, which will help you get acquainted with the technology.","language":"en","currency":"USD","id":"1783552646","title":"Hadoop Explained","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mAeuCAAAQBAJ&source=gbs_api","authors":["Aravind Shenoy"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-twkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at developers and system administrators who want to learn about Big Data analysis using Amazon Elastic MapReduce. Basic Java programming knowledge is required. You should be comfortable with using command-line tools. Prior knowledge of AWS, API, and CLI tools is not assumed. Also, no exposure to Hadoop and MapReduce is expected.","language":"en","currency":"USD","id":"1782173447","title":"Learning Big Data with Amazon Elastic MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-twkBQAAQBAJ&source=gbs_api","authors":["Amarkant Singh","Vijay Rayapati"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8eotAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Big Data Analytics with R and Hadoop is a tutorial style book that focuses on all the powerful big data tasks that can be achieved by integrating R and Hadoop.This book is ideal for R developers who are looking for a way to perform big data analytics with Hadoop. This book is also aimed at those who know Hadoop and want to build some intelligent applications over Big data with R packages. It would be helpful if readers have basic knowledge of R.","language":"en","currency":"USD","id":"1782163298","title":"Big Data Analytics with R and Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8eotAgAAQBAJ&source=gbs_api","authors":["Vignesh Prajapati"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Build, implement and scale distributed deep learning models for large-scale datasets About This Book Get to grips with the deep learning concepts and set up Hadoop to put them to use Implement and parallelize deep learning models on Hadoop's YARN framework A comprehensive tutorial to distributed deep learning with Hadoop Who This Book Is For If you are a data scientist who wants to learn how to perform deep learning on Hadoop, this is the book for you. Knowledge of the basic machine learning concepts and some understanding of Hadoop is required to make the best use of this book. What You Will Learn Explore Deep Learning and various models associated with it Understand the challenges of implementing distributed deep learning with Hadoop and how to overcome it Implement Convolutional Neural Network (CNN) with deeplearning4j Delve into the implementation of Restricted Boltzmann Machines (RBM) Understand the mathematical explanation for implementing Recurrent Neural Networks (RNN) Get hands on practice of deep learning and their implementation with Hadoop. In Detail This book will teach you how to deploy large-scale dataset in deep neural networks with Hadoop for optimal performance. Starting with understanding what deep learning is, and what the various models associated with deep neural networks are, this book will then show you how to set up the Hadoop environment for deep learning. In this book, you will also learn how to overcome the challenges that you face while implementing distributed deep learning with large-scale unstructured datasets. The book will also show you how you can implement and parallelize the widely used deep learning models such as Deep Belief Networks, Convolutional Neural Networks, Recurrent Neural Networks, Restricted Boltzmann Machines and autoencoder using the popular deep learning library deeplearning4j. Get in-depth mathematical explanations and visual representations to help you understand the design and implementations of Recurrent Neural network and Denoising AutoEncoders with deeplearning4j. To give you a more practical perspective, the book will also teach you the implementation of large-scale video processing, image processing and natural language processing on Hadoop. By the end of this book, you will know how to deploy various deep neural networks in distributed systems using Hadoop. Style and approach This book takes a comprehensive, step-by-step approach to implement efficient deep learning models on Hadoop. It starts from the basics and builds the readers' knowledge as they strengthen their understanding of the concepts. Practical examples are included in every step of the way to supplement the theory.","language":"en","currency":"USD","id":"1787121232","title":"Deep Learning with Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K1QoDwAAQBAJ&source=gbs_api","authors":["Dipayan Dev"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=s-nUDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Utilize R to uncover hidden patterns in your Big Data About This Book Perform computational analyses on Big Data to generate meaningful results Get a practical knowledge of R programming language while working on Big Data platforms like Hadoop, Spark, H2O and SQL\/NoSQL databases, Explore fast, streaming, and scalable data analysis with the most cutting-edge technologies in the market Who This Book Is For This book is intended for Data Analysts, Scientists, Data Engineers, Statisticians, Researchers, who want to integrate R with their current or future Big Data workflows. It is assumed that readers have some experience in data analysis and understanding of data management and algorithmic processing of large quantities of data, however they may lack specific skills related to R. What You Will Learn Learn about current state of Big Data processing using R programming language and its powerful statistical capabilities Deploy Big Data analytics platforms with selected Big Data tools supported by R in a cost-effective and time-saving manner Apply the R language to real-world Big Data problems on a multi-node Hadoop cluster, e.g. electricity consumption across various socio-demographic indicators and bike share scheme usage Explore the compatibility of R with Hadoop, Spark, SQL and NoSQL databases, and H2O platform In Detail Big Data analytics is the process of examining large and complex data sets that often exceed the computational capabilities. R is a leading programming language of data science, consisting of powerful functions to tackle all problems related to Big Data processing. The book will begin with a brief introduction to the Big Data world and its current industry standards. With introduction to the R language and presenting its development, structure, applications in real world, and its shortcomings. Book will progress towards revision of major R functions for data management and transformations. Readers will be introduce to Cloud based Big Data solutions (e.g. Amazon EC2 instances and Amazon RDS, Microsoft Azure and its HDInsight clusters) and also provide guidance on R connectivity with relational and non-relational databases such as MongoDB and HBase etc. It will further expand to include Big Data tools such as Apache Hadoop ecosystem, HDFS and MapReduce frameworks. Also other R compatible tools such as Apache Spark, its machine learning library Spark MLlib, as well as H2O. Style and approach This book will serve as a practical guide to tackling Big Data problems using R programming language and its statistical environment. Each section of the book will present you with concise and easy-to-follow steps on how to process, transform and analyse large data sets.","language":"en","currency":"USD","id":"1786463725","title":"Big Data Analytics with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=s-nUDQAAQBAJ&source=gbs_api","authors":["Simon Walkowiak"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdEGBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Do you want to broaden your Hadoop skill set and take your knowledge to the next level? Do you wish to enhance your knowledge of Hadoop to solve challenging data processing problems? Are your Hadoop jobs, Pig scripts, or Hive queries not working as fast as you intend? Are you looking to understand the benefits of upgrading Hadoop? If the answer is yes to any of these, this book is for you. It assumes novice-level familiarity with Hadoop.","language":"en","currency":"USD","id":"1783983655","title":"Mastering Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdEGBgAAQBAJ&source=gbs_api","authors":["Sandeep Karanth"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kU_lAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"This book is an easy-to-understand, practical guide to designing, testing, and implementing complex MapReduce applications in Scala using the Scalding framework. It is packed with examples featuring log-processing, ad-targeting, and machine learning. This book is for developers who are willing to discover how to effectively develop MapReduce applications. Prior knowledge of Hadoop or Scala is not required; however, investing some time on those topics would certainly be beneficial.","language":"en","currency":"USD","id":"1783287020","title":"Programming MapReduce with Scalding","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kU_lAwAAQBAJ&source=gbs_api","authors":["Antonios Chalkiopoulos"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d5EIBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Are you curious about AI? All you need is a good understanding of the Scala programming language, a basic knowledge of statistics, a keen interest in Big Data processing, and this book!","language":"en","currency":"USD","id":"178355875X","title":"Scala for Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d5EIBgAAQBAJ&source=gbs_api","authors":["Patrick R. Nicolas"]},{"pageCount":194,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WF_CCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a system or application developer interested in learning how to solve practical problems using the Hadoop framework, then this book is ideal for you. This book is also meant for Hadoop professionals who want to find solutions to the different challenges they come across in their Hadoop projects.","language":"en","currency":"USD","id":"1784390461","title":"Hadoop Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WF_CCAAAQBAJ&source=gbs_api","authors":["Shiva Achari"]},{"pageCount":327,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kVdiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Handle Data-Driven Challenges in an Enterprise Big Data Lake","description":"Use this practical guide to successfully handle the challenges encountered when designing an enterprise data lake and learn industry best practices to resolve issues. When designing an enterprise data lake you often hit a roadblock when you must leave the comfort of the relational world and learn the nuances of handling non-relational data. Starting from sourcing data into the Hadoop ecosystem, you will go through stages that can bring up tough questions such as data processing, data querying, and security. Concepts such as change data capture and data streaming are covered. The book takes an end-to-end solution approach in a data lake environment that includes data security, high availability, data processing, data streaming, and more. Each chapter includes application of a concept, code snippets, and use case demonstrations to provide you with a practical approach. You will learn the concept, scope, application, and starting point. What You'll Learn Get to know data lake architecture and design principles Implement data capture and streaming strategies Implement data processing strategies in Hadoop Understand the data lake security framework and availability model Who This Book Is For Big data architects and solution architects","language":"en","currency":"USD","id":"1484235223","title":"Practical Enterprise Data Lake Insights","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kVdiDwAAQBAJ&source=gbs_api","authors":["Saurabh Gupta","Venkata Giri"]},{"pageCount":120,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EU8kDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"New Designs Using Apache Kafka and MapR Streams","description":"More and more data-driven companies are looking to adopt stream processing and streaming analytics. With this concise ebook, you’ll learn best practices for designing a reliable architecture that supports this emerging big-data paradigm. Authors Ted Dunning and Ellen Friedman (Real World Hadoop) help you explore some of the best technologies to handle stream processing and analytics, with a focus on the upstream queuing or message-passing layer. To illustrate the effectiveness of these technologies, this book also includes specific use cases. Ideal for developers and non-technical people alike, this book describes: Key elements in good design for streaming analytics, focusing on the essential characteristics of the messaging layer New messaging technologies, including Apache Kafka and MapR Streams, with links to sample code Technology choices for streaming analytics: Apache Spark Streaming, Apache Flink, Apache Storm, and Apache Apex How stream-based architectures are helpful to support microservices Specific use cases such as fraud detection and geo-distributed data streams Ted Dunning is Chief Applications Architect at MapR Technologies, and active in the open source community. He currently serves as VP for Incubator at the Apache Foundation, as a champion and mentor for a large number of projects, and as committer and PMC member of the Apache ZooKeeper and Drill projects. Ted is on Twitter as @ted_dunning. Ellen Friedman, a committer for the Apache Drill and Apache Mahout projects, is a solutions consultant and well-known speaker and author, currently writing mainly about big data topics. With a PhD in Biochemistry, she has years of experience as a research scientist and has written about a variety of technical topics. Ellen is on Twitter as @Ellen_Friedman.","language":"en","currency":"USD","id":"1491953888","title":"Streaming Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EU8kDAAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zD-gCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"A Guide to Massive-Scale Data Processing in Practice","description":"Finding patterns in massive event streams can be difficult, but learning how to find them doesn’t have to be. This unique hands-on guide shows you how to solve this and many other problems in large-scale data processing with simple, fun, and elegant tools that leverage Apache Hadoop. You’ll gain a practical, actionable view of big data by working with real data and real problems. Perfect for beginners, this book’s approach will also appeal to experienced practitioners who want to brush up on their skills. Part I explains how Hadoop and MapReduce work, while Part II covers many analytic patterns you can use to process any data. As you work through several exercises, you’ll also learn how to use Apache Pig to process data. Learn the necessary mechanics of working with Hadoop, including how data and computation move around the cluster Dive into map\/reduce mechanics and build your first map\/reduce job in Python Understand how to run chains of map\/reduce jobs in the form of Pig scripts Use a real-world dataset—baseball performance statistics—throughout the book Work with examples of several analytic patterns, and learn when and where you might use them","language":"en","currency":"USD","id":"1491923903","title":"Big Data for Chimps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zD-gCgAAQBAJ&source=gbs_api","authors":["Philip (flip) Kromer","Russell Jurney"]},{"pageCount":141,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TNUlDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.96,"subtitle":null,"description":"The past few years have seen a major change in computing systems, as growing data volumes and stalling processor speeds require more and more applications to scale out to clusters. Today, a myriad data sources, from the Internet to business operations to scientific instruments, produce large and valuable data streams. However, the processing capabilities of single machines have not kept up with the size of data. As a result, organizations increasingly need to scale out their computations over clusters. At the same time, the speed and sophistication required of data processing have grown. In addition to simple queries, complex algorithms like machine learning and graph analysis are becoming common. And in addition to batch processing, streaming analysis of real-time data is required to let organizations take timely action. Future computing platforms will need to not only scale out traditional workloads, but support these new applications too. This book, a revised version of the 2014 ACM Dissertation Award winning dissertation, proposes an architecture for cluster computing systems that can tackle emerging data processing workloads at scale. Whereas early cluster computing systems, like MapReduce, handled batch processing, our architecture also enables streaming and interactive queries, while keeping MapReduce's scalability and fault tolerance. And whereas most deployed systems only support simple one-pass computations (e.g., SQL queries), ours also extends to the multi-pass algorithms required for complex analytics like machine learning. Finally, unlike the specialized systems proposed for some of these workloads, our architecture allows these computations to be combined, enabling rich new applications that intermix, for example, streaming and batch processing. We achieve these results through a simple extension to MapReduce that adds primitives for data sharing, called Resilient Distributed Datasets (RDDs). We show that this is enough to capture a wide range of workloads. We implement RDDs in the open source Spark system, which we evaluate using synthetic and real workloads. Spark matches or exceeds the performance of specialized systems in many domains, while offering stronger fault tolerance properties and allowing these workloads to be combined. Finally, we examine the generality of RDDs from both a theoretical modeling perspective and a systems perspective. This version of the dissertation makes corrections throughout the text and adds a new section on the evolution of Apache Spark in industry since 2014. In addition, editing, formatting, and links for the references have been added.","language":"en","currency":"USD","id":"1970001577","title":"An Architecture for Fast and General Data Processing on Large Clusters","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TNUlDAAAQBAJ&source=gbs_api","authors":["Matei Zaharia"]},{"pageCount":106,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w8bjqM4LUJkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Tools for Data Analysts","description":"If you want to use CouchDB to support real-world applications, you'll need to create MapReduce views that let you query this document-oriented database for meaningful data. With this short and concise ebook, you'll learn how to create a variety of MapReduce views to help you query and aggregate data in CouchDB’s large, distributed datasets. You'll get step-by-step instructions and lots of sample code to create and explore several MapReduce views through the course of the book, using an example database you construct. To work with these different views, you’ll learn how to use the Futon web administration console and the cURL command line tool that come with CouchDB. Learn how the Map and Reduce steps work independently and together to index your data Use the example database to create several temporary views based on different criteria Discover the uses of Map and Reduce JavaScript functions Convert your temporary views to permanent views within a design document Learn several options for querying the data within your views Limit the number of results returned, skip some results, or reverse the order of the output Group your results by exact keys or by parts of keys Bradley Holt, co-founder of the creative services firm Found Line, is a web developer and entrepreneur ten years of PHP and MySQL experience. He began using CouchDB before the release of version 1.0. Bradley is an active member of the PHP community, and can be reached at bradley-holt.com.","language":"en","currency":"USD","id":"1449303897","title":"Writing and Querying MapReduce Views in CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w8bjqM4LUJkC&source=gbs_api","authors":["Bradley Holt"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]},{"pageCount":393,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wzppDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"With Resilient Distributed Datasets, Spark SQL, Structured Streaming and Spark Machine Learning library","description":"Develop applications for the big data landscape with Spark and Hadoop. This book also explains the role of Spark in developing scalable machine learning and analytics applications with Cloud technologies. Beginning Apache Spark 2 gives you an introduction to Apache Spark and shows you how to work with it. Along the way, you’ll discover resilient distributed datasets (RDDs); use Spark SQL for structured data; and learn stream processing and build real-time applications with Spark Structured Streaming. Furthermore, you’ll learn the fundamentals of Spark ML for machine learning and much more. After you read this book, you will have the fundamentals to become proficient in using Apache Spark and know when and how to apply it to your big data applications. What You Will Learn Understand Spark unified data processing platform How to run Spark in Spark Shell or Databricks Use and manipulate RDDs Deal with structured data using Spark SQL through its operations and advanced functions Build real-time applications using Spark Structured Streaming Develop intelligent applications with the Spark Machine Learning library Who This Book Is For Programmers and developers active in big data, Hadoop, and Java but who are new to the Apache Spark platform.","language":"en","currency":"USD","id":"1484235797","title":"Beginning Apache Spark 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wzppDwAAQBAJ&source=gbs_api","authors":["Hien Luu"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wzFgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"The book describes the emergence of big data technologies and the role of Spark in the entire big data stack. It compares Spark and Hadoop and identifies the shortcomings of Hadoop that have been overcome by Spark. The book mainly focuses on the in-depth architecture of Spark and our understanding of Spark RDDs and how RDD complements big data’s immutable nature, and solves it with lazy evaluation, cacheable and type inference. It also addresses advanced topics in Spark, starting with the basics of Scala and the core Spark framework, and exploring Spark data frames, machine learning using Mllib, graph analytics using Graph X and real-time processing with Apache Kafka, AWS Kenisis, and Azure Event Hub. It then goes on to investigate Spark using PySpark and R. Focusing on the current big data stack, the book examines the interaction with current big data tools, with Spark being the core processing layer for all types of data. The book is intended for data engineers and scientists working on massive datasets and big data technologies in the cloud. In addition to industry professionals, it is helpful for aspiring data processing professionals and students working in big data processing and cloud computing environments.","language":"en","currency":"USD","id":"9811305501","title":"Big Data Processing Using Spark in Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wzFgDwAAQBAJ&source=gbs_api","authors":["Mamta Mittal","Valentina E. Balas","Lalit Mohan Goyal","Raghvendra Kumar"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=faPPDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Designing and Building Big Data Systems using the Hadoop Ecosystem","description":"Learn advanced analytical techniques and leverage existing tool kits to make your analytic applications more powerful, precise, and efficient. This book provides the right combination of architecture, design, and implementation information to create analytical systems that go beyond the basics of classification, clustering, and recommendation. Pro Hadoop Data Analytics emphasizes best practices to ensure coherent, efficient development. A complete example system will be developed using standard third-party components that consist of the tool kits, libraries, visualization and reporting code, as well as support glue to provide a working and extensible end-to-end system. The book also highlights the importance of end-to-end, flexible, configurable, high-performance data pipeline systems with analytical components as well as appropriate visualization results. You'll discover the importance of mix-and-match or hybrid systems, using different analytical components in one application. This hybrid approach will be prominent in the examples. What You'll Learn Build big data analytic systems with the Hadoop ecosystem Use libraries, tool kits, and algorithms to make development easier and more effective Apply metrics to measure performance and efficiency of components and systems Connect to standard relational databases, noSQL data sources, and more Follow case studies with example components to create your own systems Who This Book Is For Software engineers, architects, and data scientists with an interest in the design and implementation of big data analytical systems using Hadoop, the Hadoop ecosystem, and other associated technologies.","language":"en","currency":"USD","id":"1484219104","title":"Pro Hadoop Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=faPPDQAAQBAJ&source=gbs_api","authors":["Kerry Koitzsch"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2mC4CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is useful for Hadoop administrators who need to learn how to monitor and diagnose their clusters. Also, the book will prove useful for new users of the technology, as the language used is simple and easy to grasp.","language":"en","currency":"USD","id":"1783281561","title":"Monitoring Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2mC4CAAAQBAJ&source=gbs_api","authors":["Gurmukh Singh"]},{"pageCount":116,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gzUmAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is a step-by-step tutorial filled with practical examples which will focus mainly on the key security tools and implementation techniques of Hadoop security.This book is great for Hadoop practitioners (solution architects, Hadoop administrators, developers, and Hadoop project managers) who are looking to get a good grounding in what Kerberos is all about and who wish to learn how to implement end-to-end Hadoop security within an enterprise setup. It’s assumed that you will have some basic understanding of Hadoop as well as be familiar with some basic security concepts.","language":"en","currency":"USD","id":"1783285265","title":"Securing Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gzUmAgAAQBAJ&source=gbs_api","authors":["Sudheesh Narayanan"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LDaiAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"How to effectively use BigQuery, avoid common mistakes, and execute sophisticated queries against large datasets Google BigQuery Analytics is the perfect guide for business and data analysts who want the latest tips on running complex queries and writing code to communicate with the BigQuery API. The book uses real-world examples to demonstrate current best practices and techniques, and also explains and demonstrates streaming ingestion, transformation via Hadoop in Google Compute engine, AppEngine datastore integration, and using GViz with Tableau to generate charts of query results. In addition to the mechanics of BigQuery, the book also covers the architecture of the underlying Dremel query engine, providing a thorough understanding that leads to better query results. Features a companion website that includes all code and data sets from the book Uses real-world examples to explain everything analysts need to know to effectively use BigQuery Includes web application examples coded in Python","language":"en","currency":"USD","id":"1118824792","title":"Google BigQuery Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LDaiAwAAQBAJ&source=gbs_api","authors":["Jordan Tigani","Siddartha Naidu"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y-wtAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book is a step-by-step tutorial filled with practical examples which will show you how to build and manage a Hadoop cluster along with its intricacies.This book is ideal for database administrators, data engineers, and system administrators, and it will act as an invaluable reference if you are planning to use the Hadoop platform in your organization. It is expected that you have basic Linux skills since all the examples in this book use this operating system. It is also useful if you have access to test hardware or virtual machines to be able to follow the examples in the book.","language":"en","currency":"USD","id":"1783281723","title":"Hadoop Cluster Deployment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y-wtAgAAQBAJ&source=gbs_api","authors":["Danil Zburivsky"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kJ8ygww4E14C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":52,"subtitle":null,"description":"Transform Big Data into Insight \"In this book, some of Oracle's best engineers and architects explain how you can make use of big data. They'll tell you how you can integrate your existing Oracle solutions with big data systems, using each where appropriate and moving data between them as needed.\" -- Doug Cutting, co-creator of Apache Hadoop Cowritten by members of Oracle's big data team, Oracle Big Data Handbook provides complete coverage of Oracle's comprehensive, integrated set of products for acquiring, organizing, analyzing, and leveraging unstructured data. The book discusses the strategies and technologies essential for a successful big data implementation, including Apache Hadoop, Oracle Big Data Appliance, Oracle Big Data Connectors, Oracle NoSQL Database, Oracle Endeca, Oracle Advanced Analytics, and Oracle's open source R offerings. Best practices for migrating from legacy systems and integrating existing data warehousing and analytics solutions into an enterprise big data infrastructure are also included in this Oracle Press guide. Understand the value of a comprehensive big data strategy Maximize the distributed processing power of the Apache Hadoop platform Discover the advantages of using Oracle Big Data Appliance as an engineered system for Hadoop and Oracle NoSQL Database Configure, deploy, and monitor Hadoop and Oracle NoSQL Database using Oracle Big Data Appliance Integrate your existing data warehousing and analytics infrastructure into a big data architecture Share data among Hadoop and relational databases using Oracle Big Data Connectors Understand how Oracle NoSQL Database integrates into the Oracle Big Data architecture Deliver faster time to value using in-database analytics Analyze data with Oracle Advanced Analytics (Oracle R Enterprise and Oracle Data Mining), Oracle R Distribution, ROracle, and Oracle R Connector for Hadoop Analyze disparate data with Oracle Endeca Information Discovery Plan and implement a big data governance strategy and develop an architecture and roadmap","language":"en","currency":"USD","id":"0071827277","title":"Oracle Big Data Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kJ8ygww4E14C&source=gbs_api","authors":["Tom Plunkett","Brian Macdonald","Bruce Nelson","Mark Hornick","Helen Sun","Khader Mohiuddin","Debra Harding","Gokula Mishra","Robert Stackowiak","Keith Laker","David Segleau"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wWCYBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Case Studies with Hadoop, Scalding and Spark","description":"This timely text\/reference describes the development and implementation of large-scale distributed processing systems using open source tools and technologies. Comprehensive in scope, the book presents state-of-the-art material on building high performance distributed computing systems, providing practical guidance and best practices as well as describing theoretical software frameworks. Features: describes the fundamentals of building scalable software systems for large-scale data processing in the new paradigm of high performance distributed computing; presents an overview of the Hadoop ecosystem, followed by step-by-step instruction on its installation, programming and execution; Reviews the basics of Spark, including resilient distributed datasets, and examines Hadoop streaming and working with Scalding; Provides detailed case studies on approaches to clustering, data classification and regression analysis; Explains the process of creating a working recommender system using Scalding and Spark.","language":"en","currency":"USD","id":"3319134973","title":"Guide to High Performance Distributed Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wWCYBgAAQBAJ&source=gbs_api","authors":["K.G. Srinivasa","Anil Kumar Muppalla"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mn9cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Use Hadoop to solve business problems by learning from a rich set of real-life case studies About This Book Solve real-world business problems using Hadoop and other Big Data technologies Build efficient data lakes in Hadoop, and develop systems for various business cases like improving marketing campaigns, fraud detection, and more Power packed with six case studies to get you going with Hadoop for Business Intelligence Who This Book Is For If you are interested in building efficient business solutions using Hadoop, this is the book for you This book assumes that you have basic knowledge of Hadoop, Java, and any scripting language. What You Will Learn Learn about the evolution of Hadoop as the big data platform Understand the basics of Hadoop architecture Build a 360 degree view of your customer using Sqoop and Hive Build and run classification models on Hadoop using BigML Use Spark and Hadoop to build a fraud detection system Develop a churn detection system using Java and MapReduce Build an IoT-based data collection and visualization system Get to grips with building a Hadoop-based Data Lake for large enterprises Learn about the coexistence of NoSQL and In-Memory databases in the Hadoop ecosystem In Detail If you have a basic understanding of Hadoop and want to put your knowledge to use to build fantastic Big Data solutions for business, then this book is for you. Build six real-life, end-to-end solutions using the tools in the Hadoop ecosystem, and take your knowledge of Hadoop to the next level. Start off by understanding various business problems which can be solved using Hadoop. You will also get acquainted with the common architectural patterns which are used to build Hadoop-based solutions. Build a 360-degree view of the customer by working with different types of data, and build an efficient fraud detection system for a financial institution. You will also develop a system in Hadoop to improve the effectiveness of marketing campaigns. Build a churn detection system for a telecom company, develop an Internet of Things (IoT) system to monitor the environment in a factory, and build a data lake – all making use of the concepts and techniques mentioned in this book. The book covers other technologies and frameworks like Apache Spark, Hive, Sqoop, and more, and how they can be used in conjunction with Hadoop. You will be able to try out the solutions explained in the book and use the knowledge gained to extend them further in your own problem space. Style and approach This is an example-driven book where each chapter covers a single business problem and describes its solution by explaining the structure of a dataset and tools required to process it. Every project is demonstrated with a step-by-step approach, and explained in a very easy-to-understand manner.","language":"en","currency":"USD","id":"1783980311","title":"Hadoop Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mn9cDgAAQBAJ&source=gbs_api","authors":["Anurag Shrivastava","Tanmay Deshpande"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O5MtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Harnessing Cloud Features and Flexibility for Hadoop Clusters","description":"Until recently, Hadoop deployments existed on hardware owned and run by organizations. Now, of course, you can acquire the computing resources and network connectivity to run Hadoop clusters in the cloud. But there’s a lot more to deploying Hadoop to the public cloud than simply renting machines. This hands-on guide shows developers and systems administrators familiar with Hadoop how to install, use, and manage cloud-born clusters efficiently. You’ll learn how to architect clusters that work with cloud-provider features—not just to avoid pitfalls, but also to take full advantage of these services. You’ll also compare the Amazon, Google, and Microsoft clouds, and learn how to set up clusters in each of them. Learn how Hadoop clusters run in the cloud, the problems they can help you solve, and their potential drawbacks Examine the common concepts of cloud providers, including compute capabilities, networking and security, and storage Build a functional Hadoop cluster on cloud infrastructure, and learn what the major providers require Explore use cases for high availability, relational data with Hive, and complex analytics with Spark Get patterns and practices for running cloud clusters, from designing for price and security to dealing with maintenance","language":"en","currency":"USD","id":"1491959584","title":"Moving Hadoop to the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O5MtDwAAQBAJ&source=gbs_api","authors":["Bill Havanki"]},{"pageCount":979,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LWzWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unlock the power of your data with Hadoop 2.X ecosystem and its data warehousing techniques across large data sets About This Book Conquer the mountain of data using Hadoop 2.X tools The authors succeed in creating a context for Hadoop and its ecosystem Hands-on examples and recipes giving the bigger picture and helping you to master Hadoop 2.X data processing platforms Overcome the challenging data processing problems using this exhaustive course with Hadoop 2.X Who This Book Is For This course is for Java developers, who know scripting, wanting a career shift to Hadoop - Big Data segment of the IT industry. So if you are a novice in Hadoop or an expert, this book will make you reach the most advanced level in Hadoop 2.X. What You Will Learn Best practices for setup and configuration of Hadoop clusters, tailoring the system to the problem at hand Integration with relational databases, using Hive for SQL queries and Sqoop for data transfer Installing and maintaining Hadoop 2.X cluster and its ecosystem Advanced Data Analysis using the Hive, Pig, and Map Reduce programs Machine learning principles with libraries such as Mahout and Batch and Stream data processing using Apache Spark Understand the changes involved in the process in the move from Hadoop 1.0 to Hadoop 2.0 Dive into YARN and Storm and use YARN to integrate Storm with Hadoop Deploy Hadoop on Amazon Elastic MapReduce and Discover HDFS replacements and learn about HDFS Federation In Detail As Marc Andreessen has said “Data is eating the world,” which can be witnessed today being the age of Big Data, businesses are producing data in huge volumes every day and this rise in tide of data need to be organized and analyzed in a more secured way. With proper and effective use of Hadoop, you can build new-improved models, and based on that you will be able to make the right decisions. The first module, Hadoop beginners Guide will walk you through on understanding Hadoop with very detailed instructions and how to go about using it. Commands are explained using sections called “What just happened” for more clarity and understanding. The second module, Hadoop Real World Solutions Cookbook, 2nd edition, is an essential tutorial to effectively implement a big data warehouse in your business, where you get detailed practices on the latest technologies such as YARN and Spark. Big data has become a key basis of competition and the new waves of productivity growth. Hence, once you get familiar with the basics and implement the end-to-end big data use cases, you will start exploring the third module, Mastering Hadoop. So, now the question is if you need to broaden your Hadoop skill set to the next level after you nail the basics and the advance concepts, then this course is indispensable. When you finish this course, you will be able to tackle the real-world scenarios and become a big data expert using the tools and the knowledge based on the various step-by-step tutorials and recipes. Style and approach This course has covered everything right from the basic concepts of Hadoop till you master the advance mechanisms to become a big data expert. The goal here is to help you learn the basic essentials using the step-by-step tutorials and from there moving toward the recipes with various real-world solutions for you. It covers all the important aspects of Hadoop from system designing and configuring Hadoop, machine learning principles with various libraries with chapters illustrated with code fragments and schematic diagrams. This is a compendious course to explore Hadoop from the basics to the most advanced techniques available in Hadoop 2.X.","language":"en","currency":"USD","id":"1787120457","title":"Hadoop: Data Processing and Modelling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LWzWDQAAQBAJ&source=gbs_api","authors":["Garry Turkington","Tanmay Deshpande","Sandeep Karanth"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MABwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Advance your skills in efficient data analysis and data processing using the powerful tools of Scala, Spark, and Hadoop About This Book This is a primer on functional-programming-style techniques to help you efficiently process and analyze all of your data Get acquainted with the best and newest tools available such as Scala, Spark, Parquet and MLlib for machine learning Learn the best practices to incorporate new Big Data machine learning in your data-driven enterprise to gain future scalability and maintainability Who This Book Is For Mastering Scala Machine Learning is intended for enthusiasts who want to plunge into the new pool of emerging techniques for machine learning. Some familiarity with standard statistical techniques is required. What You Will Learn Sharpen your functional programming skills in Scala using REPL Apply standard and advanced machine learning techniques using Scala Get acquainted with Big Data technologies and grasp why we need a functional approach to Big Data Discover new data structures, algorithms, approaches, and habits that will allow you to work effectively with large amounts of data Understand the principles of supervised and unsupervised learning in machine learning Work with unstructured data and serialize it using Kryo, Protobuf, Avro, and AvroParquet Construct reliable and robust data pipelines and manage data in a data-driven enterprise Implement scalable model monitoring and alerts with Scala In Detail Since the advent of object-oriented programming, new technologies related to Big Data are constantly popping up on the market. One such technology is Scala, which is considered to be a successor to Java in the area of Big Data by many, like Java was to C\/C++ in the area of distributed programing. This book aims to take your knowledge to next level and help you impart that knowledge to build advanced applications such as social media mining, intelligent news portals, and more. After a quick refresher on functional programming concepts using REPL, you will see some practical examples of setting up the development environment and tinkering with data. We will then explore working with Spark and MLlib using k-means and decision trees. Most of the data that we produce today is unstructured and raw, and you will learn to tackle this type of data with advanced topics such as regression, classification, integration, and working with graph algorithms. Finally, you will discover at how to use Scala to perform complex concept analysis, to monitor model performance, and to build a model repository. By the end of this book, you will have gained expertise in performing Scala machine learning and will be able to build complex machine learning projects using Scala. Style and approach This hands-on guide dives straight into implementing Scala for machine learning without delving much into mathematical proofs or validations. There are ample code examples and tricks that will help you sail through using the standard techniques and libraries. This book provides practical examples from the field on how to correctly tackle data analysis problems, particularly for modern Big Data datasets.","language":"en","currency":"USD","id":"178588526X","title":"Mastering Scala Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MABwDQAAQBAJ&source=gbs_api","authors":["Alex Kozlov"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Effective data processing with MySQL 8, Hadoop, NoSQL APIs, and other Big Data tools","description":"Uncover the power of MySQL 8 for Big Data About This Book Combine the powers of MySQL and Hadoop to build a solid Big Data solution for your organization Integrate MySQL with different NoSQL APIs and Big Data tools such as Apache Sqoop A comprehensive guide with practical examples on building a high performance Big Data pipeline with MySQL Who This Book Is For This book is intended for MySQL database administrators and Big Data professionals looking to integrate MySQL 8 and Hadoop to implement a high performance Big Data solution. Some previous experience with MySQL will be helpful, although the book will highlight the newer features introduced in MySQL 8. What You Will Learn Explore the features of MySQL 8 and how they can be leveraged to handle Big Data Unlock the new features of MySQL 8 for managing structured and unstructured Big Data Integrate MySQL 8 and Hadoop for efficient data processing Perform aggregation using MySQL 8 for optimum data utilization Explore different kinds of join and union in MySQL 8 to process Big Data efficiently Accelerate Big Data processing with Memcached Integrate MySQL with the NoSQL API Implement replication to build highly available solutions for Big Data In Detail With organizations handling large amounts of data on a regular basis, MySQL has become a popular solution to handle this structured Big Data. In this book, you will see how DBAs can use MySQL 8 to handle billions of records, and load and retrieve data with performance comparable or superior to commercial DB solutions with higher costs. Many organizations today depend on MySQL for their websites and a Big Data solution for their data archiving, storage, and analysis needs. However, integrating them can be challenging. This book will show you how to implement a successful Big Data strategy with Apache Hadoop and MySQL 8. It will cover real-time use case scenario to explain integration and achieve Big Data solutions using technologies such as Apache Hadoop, Apache Sqoop, and MySQL Applier. Also, the book includes case studies on Apache Sqoop and real-time event processing. By the end of this book, you will know how to efficiently use MySQL 8 to manage data for your Big Data applications. Style and approach Step by Step guide filled with real-world practical examples.","language":"en","currency":"USD","id":"1788390423","title":"MySQL 8 for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xhKDwAAQBAJ&source=gbs_api","authors":["Shabbir Challawala","Jaydip Lakhatariya","Chintan Mehta","Kandarp Patel"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vNNJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Hands-on techniques to implement enterprise analytics and machine learning using Hadoop, Spark, NoSQL and R","description":"Get command of your organizational Big Data using the power of data science and analytics Key Features A perfect companion to boost your Big Data storing, processing, analyzing skills to help you take informed business decisions Work with the best tools such as Apache Hadoop, R, Python, and Spark for NoSQL platforms to perform massive online analyses Get expert tips on statistical inference, machine learning, mathematical modeling, and data visualization for Big Data Book Description Big Data analytics relates to the strategies used by organizations to collect, organize and analyze large amounts of data to uncover valuable business insights that otherwise cannot be analyzed through traditional systems. Crafting an enterprise-scale cost-efficient Big Data and machine learning solution to uncover insights and value from your organization's data is a challenge. Today, with hundreds of new Big Data systems, machine learning packages and BI Tools, selecting the right combination of technologies is an even greater challenge. This book will help you do that. With the help of this guide, you will be able to bridge the gap between the theoretical world of technology with the practical ground reality of building corporate Big Data and data science platforms. You will get hands-on exposure to Hadoop and Spark, build machine learning dashboards using R and R Shiny, create web-based apps using NoSQL databases such as MongoDB and even learn how to write R code for neural networks. By the end of the book, you will have a very clear and concrete understanding of what Big Data analytics means, how it drives revenues for organizations, and how you can develop your own Big Data analytics solution using different tools and methods articulated in this book. What you will learn - Get a 360-degree view into the world of Big Data, data science and machine learning - Broad range of technical and business Big Data analytics topics that caters to the interests of the technical experts as well as corporate IT executives - Get hands-on experience with industry-standard Big Data and machine learning tools such as Hadoop, Spark, MongoDB, KDB+ and R - Create production-grade machine learning BI Dashboards using R and R Shiny with step-by-step instructions - Learn how to combine open-source Big Data, machine learning and BI Tools to create low-cost business analytics applications - Understand corporate strategies for successful Big Data and data science projects - Go beyond general-purpose analytics to develop cutting-edge Big Data applications using emerging technologies Who this book is for The book is intended for existing and aspiring Big Data professionals who wish to become the go-to person in their organization when it comes to Big Data architecture, analytics, and governance. While no prior knowledge of Big Data or related technologies is assumed, it will be helpful to have some programming experience.","language":"en","currency":"USD","id":"1783554401","title":"Practical Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vNNJDwAAQBAJ&source=gbs_api","authors":["Nataraj Dasgupta"]},{"pageCount":253,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZQLjDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":null,"description":"Master the Big Data Capabilities of Oracle R Enterprise Effectively manage your enterprise’s big data and keep complex processes running smoothly using the hands-on information contained in this Oracle Press guide. Oracle R Enterprise: Harnessing the Power of R in Oracle Database shows, step-by-step, how to create and execute large-scale predictive analytics and maintain superior performance. Discover how to explore and prepare your data, accurately model business processes, generate sophisticated graphics, and write and deploy powerful scripts. You will also find out how to effectively incorporate Oracle R Enterprise features in APEX applications, OBIEE dashboards, and Apache Hadoop systems. Learn to: • Install, configure, and administer Oracle R Enterprise • Establish connections and move data to the database • Create Oracle R Enterprise packages and functions • Use the R language to work with data in Oracle Database • Build models using ODM, ORE, and other algorithms • Develop and deploy R scripts and use the R script repository • Execute embedded R scripts and employ ORE SQL API functions • Map and manipulate data using Oracle R Advanced Analytics for Hadoop • Use ORE in Oracle Data Miner, OBIEE, and other applications","language":"en","currency":"USD","id":"1259585646","title":"Oracle R Enterprise: Harnessing the Power of R in Oracle Database","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZQLjDAAAQBAJ&source=gbs_api","authors":["Brendan Tierney"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=38YcDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The professional's one-stop guide to this open-source, Java-based big data framework Professional Hadoop is the complete reference and resource for experienced developers looking to employ Apache Hadoop in real-world settings. Written by an expert team of certified Hadoop developers, committers, and Summit speakers, this book details every key aspect of Hadoop technology to enable optimal processing of large data sets. Designed expressly for the professional developer, this book skips over the basics of database development to get you acquainted with the framework's processes and capabilities right away. The discussion covers each key Hadoop component individually, culminating in a sample application that brings all of the pieces together to illustrate the cooperation and interplay that make Hadoop a major big data solution. Coverage includes everything from storage and security to computing and user experience, with expert guidance on integrating other software and more. Hadoop is quickly reaching significant market usage, and more and more developers are being called upon to develop big data solutions using the Hadoop framework. This book covers the process from beginning to end, providing a crash course for professionals needing to learn and apply Hadoop quickly. Configure storage, UE, and in-memory computing Integrate Hadoop with other programs including Kafka and Storm Master the fundamentals of Apache Big Top and Ignite Build robust data security with expert tips and advice Hadoop's popularity is largely due to its accessibility. Open-source and written in Java, the framework offers almost no barrier to entry for experienced database developers already familiar with the skills and requirements real-world programming entails. Professional Hadoop gives you the practical information and framework-specific skills you need quickly.","language":"en","currency":"USD","id":"111926720X","title":"Professional Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=38YcDAAAQBAJ&source=gbs_api","authors":["Benoy Antony","Konstantin Boudnik","Cheryl Adams","Branky Shao","Cazen Lee","Kai Sasaki"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYL-9HfJSGsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.75,"subtitle":null,"description":"The Oracle Press Guide to Big Data Analytics using R Cowritten by members of the Big Data team at Oracle, this Oracle Press book focuses on analyzing data with R while making it scalable using Oracle’s R technologies. Using R to Unlock the Value of Big Data provides an introduction to open source R and describes issues with traditional R and database interaction. The book then offers in-depth coverage of Oracle’s strategic R offerings: Oracle R Enterprise, Oracle R Distribution, ROracle, and Oracle R Connector for Hadoop. You can practice your new skills using the end-of-chapter exercises.","language":"en","currency":"USD","id":"0071826270","title":"Using R to Unlock the Value of Big Data: Big Data Analytics with Oracle R Enterprise and Oracle R Connector for Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYL-9HfJSGsC&source=gbs_api","authors":["Mark Hornick","Tom Plunkett"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WmsdDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.39,"subtitle":null,"description":"Tackle the real-world complexities of modern machine learning with innovative, cutting-edge, techniques About This Book Fully-coded working examples using a wide range of machine learning libraries and tools, including Python, R, Julia, and Spark Comprehensive practical solutions taking you into the future of machine learning Go a step further and integrate your machine learning projects with Hadoop Who This Book Is For This book has been created for data scientists who want to see machine learning in action and explore its real-world application. With guidance on everything from the fundamentals of machine learning and predictive analytics to the latest innovations set to lead the big data revolution into the future, this is an unmissable resource for anyone dedicated to tackling current big data challenges. Knowledge of programming (Python and R) and mathematics is advisable if you want to get started immediately. What You Will Learn Implement a wide range of algorithms and techniques for tackling complex data Get to grips with some of the most powerful languages in data science, including R, Python, and Julia Harness the capabilities of Spark and Hadoop to manage and process data successfully Apply the appropriate machine learning technique to address real-world problems Get acquainted with Deep learning and find out how neural networks are being used at the cutting-edge of machine learning Explore the future of machine learning and dive deeper into polyglot persistence, semantic data, and more In Detail Finding meaning in increasingly larger and more complex datasets is a growing demand of the modern world. Machine learning and predictive analytics have become the most important approaches to uncover data gold mines. Machine learning uses complex algorithms to make improved predictions of outcomes based on historical patterns and the behaviour of data sets. Machine learning can deliver dynamic insights into trends, patterns, and relationships within data, immensely valuable to business growth and development. This book explores an extensive range of machine learning techniques uncovering hidden tricks and tips for several types of data using practical and real-world examples. While machine learning can be highly theoretical, this book offers a refreshing hands-on approach without losing sight of the underlying principles. Inside, a full exploration of the various algorithms gives you high-quality guidance so you can begin to see just how effective machine learning is at tackling contemporary challenges of big data. This is the only book you need to implement a whole suite of open source tools, frameworks, and languages in machine learning. We will cover the leading data science languages, Python and R, and the underrated but powerful Julia, as well as a range of other big data platforms including Spark, Hadoop, and Mahout. Practical Machine Learning is an essential resource for the modern data scientists who want to get to grips with its real-world application. With this book, you will not only learn the fundamentals of machine learning but dive deep into the complexities of real world data before moving on to using Hadoop and its wider ecosystem of tools to process and manage your structured and unstructured data. You will explore different machine learning techniques for both supervised and unsupervised learning; from decision trees to Naive Bayes classifiers and linear and clustering methods, you will learn strategies for a truly advanced approach to the statistical analysis of data. The book also explores the cutting-edge advancements in machine learning, with worked examples and guidance on deep learning and reinforcement learning, providing you with practical demonstrations and samples that help take the theory–and mystery–out of even the most advanced machine learning methodologies. Style and approach A practical data science tutorial designed to give you an insight into the practical application of machine learning, this book takes you through complex concepts and tasks in an accessible way. Featuring information on a wide range of data science techniques, Practical Machine Learning is a comprehensive data science resource.","language":"en","currency":"USD","id":"1784394017","title":"Practical Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WmsdDAAAQBAJ&source=gbs_api","authors":["Sunila Gollapudi"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_PApCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"How to Install, Deploy, and Optimize Hadoop in a Virtualized Architecture","description":"Plan and Implement Hadoop Virtualization for Maximum Performance, Scalability, and Business Agility Enterprises running Hadoop must absorb rapid changes in big data ecosystems, frameworks, products, and workloads. Virtualized approaches can offer important advantages in speed, flexibility, and elasticity. Now, a world-class team of enterprise virtualization and big data experts guide you through the choices, considerations, and tradeoffs surrounding Hadoop virtualization. The authors help you decide whether to virtualize Hadoop, deploy Hadoop in the cloud, or integrate conventional and virtualized approaches in a blended solution. First, Virtualizing Hadoop reviews big data and Hadoop from the standpoint of the virtualization specialist. The authors demystify MapReduce, YARN, and HDFS and guide you through each stage of Hadoop data management. Next, they turn the tables, introducing big data experts to modern virtualization concepts and best practices. Finally, they bring Hadoop and virtualization together, guiding you through the decisions you’ll face in planning, deploying, provisioning, and managing virtualized Hadoop. From security to multitenancy to day-to-day management, you’ll find reliable answers for choosing your best Hadoop strategy and executing it. Coverage includes the following: • Reviewing the frameworks, products, distributions, use cases, and roles associated with Hadoop • Understanding YARN resource management, HDFS storage, and I\/O • Designing data ingestion, movement, and organization for modern enterprise data platforms • Defining SQL engine strategies to meet strict SLAs • Considering security, data isolation, and scheduling for multitenant environments • Deploying Hadoop as a service in the cloud • Reviewing the essential concepts, capabilities, and terminology of virtualization • Applying current best practices, guidelines, and key metrics for Hadoop virtualization • Managing multiple Hadoop frameworks and products as one unified system • Virtualizing master and worker nodes to maximize availability and performance • Installing and configuring Linux for a Hadoop environment","language":"en","currency":"USD","id":"0133811131","title":"Virtualizing Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_PApCgAAQBAJ&source=gbs_api","authors":["George Trujillo","Charles Kim","Steve Jones","Rommel Garcia","Justin Murray"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wJcfAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book follows a step-by-step, tutorial-based approach which will teach you how to develop your own super cluster using Raspberry Pi computers quickly and efficiently. Raspberry Pi Super Cluster is an introductory guide for those interested in experimenting with parallel computing at home. Aimed at Raspberry Pi enthusiasts, this book is a primer for getting your first cluster up and running. Basic knowledge of C or Java would be helpful but no prior knowledge of parallel computing is necessary.","language":"en","currency":"USD","id":"1783286202","title":"Raspberry Pi Super Cluster","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wJcfAgAAQBAJ&source=gbs_api","authors":["Andrew K. Dennis"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=swKWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Master the Concepts, Architecture and Applications with Real-world examples and Case studies","description":"Unleash the power of cloud computing using Azure, AWS and Apache Hadoop Description With the advent of internet, there is a complete paradigm shift in the manner we comprehend computing. Need to enable ubiquity, convenient and on-demand access to resources in highly scalable and resilient environments that can be remotely accessed, gave birth to the concept of Cloud computing. The acceptance is so rapid that the notion influences sophisticated innovations in academia, industry and research world-wide and hereby change the landscape of information technology as we thought of. Through this book, the authors tried to incorporate core principles and basic notion of cloud computing in a step-by-step manner and tried to emphasize on key concepts for clear and thorough insight into the subject. Audience This book is intended for students of B.E., B.Tech., B.Sc., M.Sc., M.E., and M.Tech. as a text book. The content is designed keeping in mind the bench marked curriculum of various universities (both National and International). The book covers not only the technical details of how cloud works but also exhibits the strategy, technical design, and in-depth knowledge required to migrate existing applications to the cloud. Therefore, it makes it relevant for the beginners who wants to learn cloud computing right from the foundation. Aspiring Cloud Computing Researchers Instructors, Academicians and Professionals, if they are familiar with cloud, can use this book to learn various open source cloud computing tools, applications, technologies. They will also get a flavor of various international certification exams available. What will you learn • Learn about the Importance of Cloud Computing in Current Digital Era • Understand the Core concepts and Principles of Cloud Computing with practical benefits • Learn about the Cloud Deployment models and Services • Discover how Cloud Computing Architecture works • Learn about the Load balancing approach and Mobile Cloud Computing (MCC) • Learn about the Virtualization and Service-Oriented Architecture (SOA) concepts • Learn about the various Cloud Computing applications, Platforms and Security concepts • Understand the adoption Cloud Computing technology and strategies for migration to the cloud • Case Studies for Cloud computing adoption - Sub-Saharan Africa and India Key Features • Provides a sound understanding of the Cloud computing concepts, architecture and its applications • Explores the practical benefits of Cloud computing services and deployment models in details • Cloud Computing Architecture, Cloud Computing Life Cycle (CCLC), Load balancing approach, Mobile Cloud Computing (MCC), Google App Engine (GAE) • Virtualization and Service-Oriented Architecture (SOA) • Cloud Computing applications - Google Apps, Dropbox Cloud and Apple iCloud and its uses in various sectors - Education, Healthcare, Politics, Business, and Agriculture • Cloud Computing platforms - Microsoft Azure, Amazon Web Services (AWS), Open Nebulla, Eucalyptus, Open Stack, Nimbus and The Apache Hadoop Architecture • Adoption of Cloud Computing technology and strategies for migration to the cloud • Cloud computing adoption case studies - Sub-Saharan Africa and India • Chapter-wise Questions with Summary and Examination Model Question papers Table of Contents 1. Foundation of Cloud Computing 2. Cloud Services and Deployment Models 3. Cloud Computing Architecture 4. Virtualization & Service Oriented Architecture 5. Cloud Security and Privacy 6. Cloud Computing Applications 7. Cloud Computing Technologies, Platform and Services 8. Adoption of Cloud Computing 9. Model Paper 1 10. Model Paper 2 11. Model Paper 3 12. Model Paper 4","language":"en","currency":"USD","id":"9388511409","title":"Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=swKWDwAAQBAJ&source=gbs_api","authors":["Kamal Kant Hiran","Ruchi Doshi","Temitayo Fagbola","Mehul Mahrishi"]}]