[{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H8qPDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.99,"subtitle":null,"description":"Have you always wanted to learn the foundations of computer programming? Are you tired of being bogged down by confusing jargon and complex descriptions? This book is an easy-to-understand, beginner's introduction to JavaScript. With this book, your website will be up-and-running in no time! This book includes chapters on the following: Functions – Finally your website can do things! It's not just a pretty face. Learn how to enable your site to perform tasks. Variables – Integers, doubles, floats, characters, strings: these are all different types of variables. Variables are crucial to programming because they contain data. Learn about the different types and when you should use each one. If Statements - If you read this book, you will reach the section on conditionals. If statements run code IF a certain condition is met. These are extremely useful for testing values and preventing code from crashing, among other things.","language":"en","currency":"USD","id":"1365839885","title":"Learn Javascript In 1 Hour","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H8qPDgAAQBAJ&source=gbs_api","authors":["John Bura"]},{"pageCount":357,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K_aEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"An Introduction to Understanding and Implementing Core Data Structure and Algorithm Fundamentals","description":"Explore data structures and algorithm concepts and their relation to everyday JavaScript development. A basic understanding of these ideas is essential to any JavaScript developer wishing to analyze and build great software solutions. You'll discover how to implement data structures such as hash tables, linked lists, stacks, queues, trees, and graphs. You'll also learn how a URL shortener, such as bit.ly, is developed and what is happening to the data as a PDF is uploaded to a webpage. This book covers the practical applications of data structures and algorithms to encryption, searching, sorting, and pattern matching. It is crucial for JavaScript developers to understand how data structures work and how to design algorithms. This book and the accompanying code provide that essential foundation for doing so. With JavaScript Data Structures and Algorithms you can start developing your knowledge and applying it to your JavaScript projects today. What You'll Learn Review core data structure fundamentals: arrays, linked-lists, trees, heaps, graphs, and hash-table Review core algorithm fundamentals: search, sort, recursion, breadth\/depth first search, dynamic programming, bitwise operators Examine how the core data structure and algorithms knowledge fits into context of JavaScript explained using prototypical inheritance and native JavaScript objects\/data types Take a high-level look at commonly used design patterns in JavaScript Who This Book Is For Existing web developers and software engineers seeking to develop or revisit their fundamental data structures knowledge; beginners and students studying JavaScript independently or via a course or coding bootcamp.","language":"en","currency":"USD","id":"1484239881","title":"JavaScript Data Structures and Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K_aEDwAAQBAJ&source=gbs_api","authors":["Sammie Bae"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wFCrRfnse8gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Designer's Guide","description":"JavaScript is the brains of your Web page—it enables you to modify a document’s structure, styling, and content in response to user actions without requesting new pages from the server. Scriptin' with JavaScript and Ajax teaches you how to master this powerful and elegant language so you can develop intuitive user interactions that take the user experience to new levels of sophistication and responsiveness. Today’s application-like Web experiences (such as Salesforce.com and Google Maps) and Web 2.0 sites (such as Flickr.com and Twitter) are powered by JavaScript and Ajax. Using the techniques shown in this book, you will be able to start creating similar experiences in the sites you design. Scriptin' with JavaScript and Ajax will teach you how to: Start developing with JavaScript fast! Write lightweight but powerful object-oriented code Modify the Document Object Model “Progressively enhance” your pages with JavaScript to provide the highest levels of accessibility to all users Learn sophisticated techniques for making your pages respond to user actions Use the downloadable Scriptin’ library of helper functions to speed development and ensure cross-browser compatibility Use Ajax scripting techniques to update specific areas of the page with data from the server Create powerful interface interactions, such as sliding panels and tree menus Evaluate frameworks such as jQuery and Prototype to find the best one for your needs Build an online application that looks and responds like a regular desktop application Easily adapt the Scriptin’ code examples for use in your own projects—download them at www.scriptinwithajax.com","language":"en","currency":"USD","id":"9780132104760","title":"Scriptin' with JavaScript and Ajax","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wFCrRfnse8gC&source=gbs_api","authors":["Charles Wyke-Smith"]},{"pageCount":132,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bODhAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"A step-by-step, practical tutorial to help you transform into a Grunt power-user. This book is for JavaScript developers who want to get to grips with GruntJS and use it to build and test their JavaScript applications. The only requirement for this book is a basic understanding of objects and functions in JavaScript.","language":"en","currency":"USD","id":"178398063X","title":"Getting Started with Grunt: The JavaScript Task Runner","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bODhAgAAQBAJ&source=gbs_api","authors":["Jaime Pillora"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A6VWBxzcKXEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.A simple Starter approach to show the readers how to develop a real-time web application using Meteor, with the help of a sample project.This book is ideal for people with knowledge of standard JavaScript, basic HTML, and some CSS. This book starts at the very beginning, from installing the framework on your computer all the way up to deploying your finished app on the Web. If you want to get into this exciting new framework, and you would like to learn how to take a project from being a concept to a real-world app, then this is definitely the book for you.","language":"en","currency":"USD","id":"1782163433","title":"Instant Meteor JavaScript Framework Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A6VWBxzcKXEC&source=gbs_api","authors":["Gabriel Manricks"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rwiJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.95,"subtitle":null,"description":"Douglas Crockford starts by looking at the fundamentals: names, numbers, booleans, characters, and bottom values. JavaScript’s number type is shown to be faulty and limiting, but then Crockford shows how to repair those problems. He then moves on to data structures and functions, exploring the underlying mechanisms and then uses higher order functions to achieve class-free object oriented programming. The book also looks at eventual programming, testing, and purity, all the while looking at the requirements of The Next Language. Most of our languages are deeply rooted in the paradigm that produced FORTRAN. Crockford attacks those roots, liberating us to consider the next paradigm.He also presents a strawman language and develops a complete transpiler to implement it. The book is deep, dense, full of code, and has moments when it is intentionally funny.","language":"en","currency":"USD","id":"1949815021","title":"How JavaScript Works","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rwiJDwAAQBAJ&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cKZhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":132,"subtitle":null,"description":"This book will teach you how to take advantage of the JavaScript language to process data provided on the Internet. Much attention is given to the main JavaScript backbone: prototype based objects, and functional capabilities, while common features (loops, etc.) are summarized in a few cheat-sheets. Only operational features are detailed through the coding of several applications -the second and largest part of the book-, on free-access datasets (e.g. World Bank). It includes: cartography (SVG or API's based), data-sheets access (via Ajax or Jsonp), video data and post-synchronization, and animation examples.","language":"en","currency":"USD","id":"1119527309","title":"JavaScript and Open Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cKZhDwAAQBAJ&source=gbs_api","authors":["Robert Jeansoulin"]},{"pageCount":716,"thumbnail":"http:\/\/books.google.com\/books\/content?id=REo63fRiLFkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Build interactive Web pages with JavaScript using this unique sourcebook of ready-to-run scripts. Filled with over 90 scripts inside the book and on the accompanying CD, you’ll be able to create a wide range of applications—from displaying banners and other Web graphics to using forms and building frames—and much more. In addition, you’ll get detailed hands-on information for customizing and extending scripts for use in different environments. This guide also includes coverage of DHTML, plugins, security issues and creation of e-commerce applications—plus, easy to identify icons throughout the text highlight what’s on the CD, for quick reference.","language":"en","currency":"USD","id":"0072253371","title":"Instant JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=REo63fRiLFkC&source=gbs_api","authors":["Martin Webb","Michel Plungjan","Keith Drakard"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ogYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":"The Definitive Guide for JavaScript Developers","description":"ECMAScript 6 represents the biggest update to the core of JavaScript in the history of the language. In Understanding ECMAScript 6, expert developer Nicholas C. Zakas provides a complete guide to the object types, syntax, and other exciting changes that ECMAScript 6 brings to JavaScript. Every chapter is packed with example code that works in any JavaScript environment so you’ll be able to see new features in action. You’ll learn: –How ECMAScript 6 class syntax relates to more familiar JavaScript concepts –What makes iterators and generators useful –How arrow functions differ from regular functions –Ways to store data with sets, maps, and more –The power of inheritance –How to improve asynchronous programming with promises –How modules change the way you organize code Whether you’re a web developer or a Node.js developer, you’ll find Understanding ECMAScript 6 indispensable on your journey from ECMAScript 5 to ECMAScript 6.","language":"en","currency":"USD","id":"1593277989","title":"Understanding ECMAScript 6","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ogYvDwAAQBAJ&source=gbs_api","authors":["Nicholas C. Zakas"]},{"pageCount":478,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M9hpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"The book is aimed at all levels of readers. Beginners can learn the basic configurations and step-by-step approaches in creating charts or Highcharts cloud. For intermediate and advanced readers, the book explores the APIs, events, server-side operations and plugins.","language":"en","currency":"USD","id":"1783287462","title":"Learning Highcharts 4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M9hpBgAAQBAJ&source=gbs_api","authors":["Joe Kuan"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-6xPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Learn Backbone.js, Node.js and MongoDB","description":"This is a hands-on book which introduces you to agile JavaScript web and mobile software development using the latest cutting-edge front-end and back-end technologies including: Node.js, MongoDB, Backbone.js, Parse.com, Heroku and Windows Azure. Practical examples include building multiple versions of the Chat app:•jQuery + Parse.com JS REST API•Backbone and Parse.com JS SDK•Backbone and Node.js•Backbone and Node.js + MongoDB The Chat application has all the foundation of a typical web\/mobile application: fetching data, displaying it, submitting new data. Other examples in the book are as follows:•jQuery + Twitter RESP API “Tweet Analyzer”•Parse.com “Save John”•MongoDB “Print Collections”•Backbone.js “Apple Database”•Monk + Express.js “REST API Server” This book will save you many hours by providing a hand-picked and tested collection of quick start guides. RPJS has practical examples that allow to spend less time learning and more time building your own applications. Prototype fast and ship code that matters! What You will Learn: You should expect a basic understanding from a collection of quick start guides, tutorials and suggestions for the devel0pment apps discussed in this book. In addition to coding examples, the book covers virtually all setup and deployment step-by-step. You’ll learn from the examples of Chat web\/mobile applications starting with front-end components and by the end we’ll put front-end and back-end together and deploy to the production environment. Who This Book is For: The typical programmer who wants to learn more about effective JavaScript coding.","language":"en","currency":"USD","id":"1484217519","title":"Full Stack JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-6xPCwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":802,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d1jBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn to develop interactive web applications with clean and maintainable JavaScript code","description":"The JavaScript Workshop is a definitive guide to learning JavaScript in a practical way. Starting with JavaScript's core syntax and structure, the book gradually builds up to more advanced concepts like server-side development and functional programming. With this book, you'll gain the confidence to tackle any real-world JavaScript challenge.","language":"en","currency":"USD","id":"1838645888","title":"The The JavaScript Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d1jBDwAAQBAJ&source=gbs_api","authors":["Joseph Labrecque","Jahred Love","Daniel Rosenbaum","Nick Turner","Gaurav Mehla","Alonzo L. Hosford","Florian Sloot","Philip Kirkbride"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":275,"thumbnail":"http:\/\/books.google.com\/books\/content?id=295iDEn7YCYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"Foundation Website Creation with CSS, XHTML, and JavaScript covers the entire process of building a website. This process involves much more than just technical knowledge, and this book provides you with all the information you'll need to understand the concepts behind designing and developing for the Web, as well as the best means to deliver professional, best-practice-based results. There is far more to building a successful website than knowing a little Hypertext Markup Language (HTML). The process starts long before any coding takes place, and this book introduces you to the agile development process, explaining why this method makes so much sense for web projects and how best to implement it. Planning is vital, so you'll also learn how to use techniques such as brainstorming, wireframes, mockups, and prototypes to get your project off to the best possible start and help ensure smooth progress as it develops. An understanding of correct, semantic markup is essential to any web professional, so this book explains how XHTML should be used to structure content so that the markup adheres to current web standards. You'll learn about the wide range of HTML elements available to you, and you'll learn how and when to use them through building example web pages. Without creative use of Cascading Style Sheets (CSS), websites would all look largely the same. CSS gives you the ability to set your website apart from the rest while maintaining the integrity of your markup. You'll learn how CSS works and how to apply styles to your pages, enabling you to realize your design ideas in the browser. JavaScript can be used to make your website easier and more interesting to use. This book provides information on appropriate uses of this technology and introduces the concepts of programming using it. You'll also see how JavaScript works as part of the much-hyped technique Ajax and in turn where Ajax fits into the wider Web 2.0 picture. While a website is being built, it needs to be tested across multiple browsers and platforms to ensure that the site works for all users, regardless of ability or disability, and the book explains how best to do these tasks. Then, it discusses the process of launching and maintaining the site so that it will continue to work for all its users throughout its life-cycle. The book concludes by covering server-side technologies, acting as a guide to the different options available and explaining differences between available products. With insights from renowned experts such as Jason Fried of 37signals, Daniel Burka of Digg and Pownce, and Chris Messina of Citizen Agency, this book provides invaluable information applicable to every web project, regardless of size, scope, or budget.","language":"en","currency":"USD","id":"1430209925","title":"Foundation Website Creation with CSS, XHTML, and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=295iDEn7YCYC&source=gbs_api","authors":["Steve Smith","Jonathan Lane"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ifhGYfylJngC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Annotation Since its initial launch, Sencha Touch has quickly become the gold standard for developing rich mobile web applications with HTML5. Sencha Touch is the first HTML5 mobile JavaScript framework that allows you to develop mobile web apps that look and feel like native apps on both iPhone and Android touchscreen devices. Sencha Touch is the world's first application framework built specifically to leverage HTML5, CSS3 and JavaScript for the highest level of power, flexibility and optimization. It makes specific use of HTML5 to deliver components like audio and video, as well as a localStorage proxy for saving data offline. Sencha Touch also makes extensive use of CSS3 in its components and themes to provide an incredibly robust styling layer, giving you total control over the look of your application.Sencha Touch enables you to design both Apple iOS and Google Android apps without the need for learning multiple arcane programing languages. Instead you can leverage your existing knowledge of HTML and CSS to quickly create rich web applications for mobile devices in JavaScript. This book will show you how you can use Sencha Touch to efficiently produce attractive, exciting, easy-to-use web applications that keep your visitors coming back for more.Sencha Touch Mobile JavaScript Framework teaches you all you need to get started with Sencha Touch and build awesome mobile web applications. Beginning with an overview of Sencha Touch, this book will guide you through creating a complete simple application followed by styling the user interface and the list of Sencha Touch components explained through comprehensive examples. Next, you will learn about the essential touch and component events, which will help you create rich dynamic animations. The book follows this up with information about core data packages and dealing with data and wraps it up with building another simple but powerful Sencha Touch application.In short, this book has the step by step approach and extensive content to make a beginner to Sencha Touch into an ace quickly and easily.Exploit Sencha Touch a cross-platform library aimed at next generation, touch-enabled devices.","language":"en","currency":"USD","id":"1849515115","title":"Sencha Touch Mobile JavaScript Framework","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ifhGYfylJngC&source=gbs_api","authors":["John E. Clark"]},{"pageCount":344,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EE_VDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Building Cross-Platform Applications with GraphQL, React, React Native, and Electron","description":"JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications. In this practical book, new and experienced JavaScript developers will learn how to use this language to create APIs as well as web, mobile, and desktop applications. Author and engineering leader Adam D. Scott covers technologies such as Node.js, GraphQL, React, React Native, and Electron. Ideal for developers who want to build full stack applications and ambitious web development beginners looking to bootstrap a startup, this book shows you how to create a single CRUD-style application that will work across several platforms. Explore GraphQL’s simple process for querying data Learn about shared authentication for APIs, web apps, and native applications Build performant web applications with React and Styled Components Use React Native to write cross-platform applications for iOS and Android that compile to native code Learn how to write desktop applications with Electron","language":"en","currency":"USD","id":"1492046930","title":"JavaScript Everywhere","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EE_VDwAAQBAJ&source=gbs_api","authors":["Adam D. Scott"]},{"pageCount":106,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0A5QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":"Build More Responsive Apps with Less Code","description":"With the advent of HTML5, front-end MVC, and Node.js, JavaScript is ubiquitous--and still messy. This book will give you a solid foundation for managing async tasks without losing your sanity in a tangle of callbacks. It's a fast-paced guide to the most essential techniques for dealing with async behavior, including PubSub, evented models, and Promises. With these tricks up your sleeve, you'll be better prepared to manage the complexity of large web apps and deliver responsive code. With Async JavaScript, you'll develop a deeper understanding of the JavaScript language. You'll start with a ground-up primer on the JavaScript event model--key to avoiding many of the most common mistakes JavaScripters make. From there you'll see tools and design patterns for turning that conceptual understanding into practical code. The concepts in the book are illustrated with runnable examples drawn from both the browser and the Node.js server framework, incorporating complementary libraries including jQuery, Backbone.js, and Async.js. You'll learn how to create dynamic web pages and highly concurrent servers by mastering the art of distributing events to where they need to be handled, rather than nesting callbacks within callbacks within callbacks. Async JavaScript will get you up and running with real web development quickly. By the time you've finished the Promises chapter, you'll be parallelizing Ajax requests or running animations in sequence. By the end of the book, you'll even know how to leverage Web Workers and AMD for JavaScript applications with cutting-edge performance. Most importantly, you'll have the knowledge you need to write async code with confidence. What You Need: Basic knowledge of JavaScript is recommended. If you feel that you're not up to speed, see the \"Resources for Learning JavaScript\" section in the preface.","language":"en","currency":"USD","id":"168050312X","title":"Async JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0A5QDwAAQBAJ&source=gbs_api","authors":["Trevor Burnham"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uExICgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Have big dreams? Kick start them with JavaScript! If we've learned one thing from the Millennial generation, it's that no one is too young to make history online. JavaScript For Kids For Dummies introduces pre-teens and early teens alike to the world of JavaScript, which is an integral programming language that drives the functionality of websites and apps. This informative, yet engaging text guides you through the basics of coding with JavaScript, and is an essential resource if you want to expand your technology skills while following easy, step-by-step instructions. Through small, goal-oriented projects, you learn key coding concepts, while actually creating apps, games, and more. This hands-on experience, coupled with the presentation of ideas in a simple style, allows you to both learn and retain JavaScript fundamentals. JavaScript has been heralded as 'the programming language of the web,' and many kids are interested in learning how to use it; however, most schools don't offer coding classes at this level, and most families can't afford the high cost of coding classes through a summer camp. But this can't stop you from developing your JavaScript coding skills! This fun text is all you need to get started on your JavaScript journey. Explore the basics of JavaScript through the creation of a calculator app Deepen your understanding of HTML, arrays, and variables by building a grocery shopping app Learn conditional logic through the development of a choose your own adventure game Discover loops and strings by creating a lemonade stand app and MadLibs-style game JavaScript For Kids For Dummies brings pre-teens and early teens into the world of coding by teaching them one of the key Web design languages.","language":"en","currency":"USD","id":"1119119898","title":"JavaScript For Kids For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uExICgAAQBAJ&source=gbs_api","authors":["Chris Minnick","Eva Holland"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=08O3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Get up and running on the latest JavaScript standard using this fully updated beginner’s guide This hands-on, fast-paced guide shows, from start to finish, how to create dynamic Web pages complete with special effects using JavaScript. This edition contains updates for all major new features and the latest Web development techniques and practices. You will discover how to extend JavaScript’s capabilities to the server side using Node.js. JavaScript: A Beginner's Guide, Fifth Edition begins by clearly explaining the fundamentals, including variables, functions, operators, event handlers, objects, arrays, strings, and forms. From there, the book moves on to more advanced techniques, such as debugging, accessibility, and security. Throughout, “Ask the Expert,” “Try This,” notes, tips, and self tests highlight salient points and aid in learning. •Teaches, step by step, how to get started developing Web applications•Features detailed examples and downloadable project files•Written by an experienced Web developer and JavaScript expert","language":"en","currency":"USD","id":"1260457699","title":"JavaScript A Beginner's Guide Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=08O3DwAAQBAJ&source=gbs_api","authors":["John Pollock"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0eL7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is a fast-paced guide full of step-by-step instructions that teach you how to visualize social data using HTML5 and JavaScript.This book is for developers who are excited about data and who want to share that excitement with others. Developers who are interested in the data which can be extracted from social networks will also find this book hugely beneficial.Readers should have a working knowledge of both JavaScript and HTML.","language":"en","currency":"USD","id":"1782166556","title":"Social Data Visualization with HTML5 and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0eL7AAAAQBAJ&source=gbs_api","authors":["Simon Timms"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DLNi9TpZlhwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Building Windows 8 Apps with JavaScript is the definitive guide for every experienced developer who wants to create, ship, and profit from Windows 8 apps built with HTML5 and JavaScript. Written by Chris Sells, former Visual Studio Principal Program Manager who led the team that built Microsoft’s official Windows 8 JavaScript app templates, and Brandon Satrom, expert web\/mobile developer, this book covers every facet of development with Microsoft’s new JavaScript framework and WinRT. The authors guide you through building full-featured Windows Store apps that merge the best aspects of desktop, web, and mobile apps into a single user and developer experience. You’ll learn how to leverage the full power of the Windows 8 platform and integrate services ranging from client-side state to offline storage. Leveraging these techniques, you can deliver information to users faster, more clearly, and more concisely, on whatever devices they prefer. Through complete example projects, Building Windows 8 Apps with JavaScript covers Understanding powerful new improvements in Windows 8 developer experience Using Windows 8’s more flexible binding to update the UI as underlying data changes Creating layouts and typography that fit Windows 8 style and leverage its advantages Working with audio, video, captured media, animation, and HTML5 graphics Making your app “connectable” with PlayTo Integrating WinJS navigation services to improve UI control Maintaining app states built up over time, and sharing them across devices Writing highly responsive async apps Supporting true-touch metaphors and interactions, location data, and sensors Designing apps for the Windows 8 design language Extending JavaScript code to integrate existing C\/C++ code or to access Windows capabilities that WinRT doesn’t expose Discovering best practices for monetizing Windows Store apps All of the downloadable examples can be created and run with Microsoft’s free Visual Studio 2012 Express for Windows 8, which includes all you need to build, package, and deploy your Windows Store apps.","language":"en","currency":"USD","id":"0133090582","title":"Building Windows 8 Apps with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DLNi9TpZlhwC&source=gbs_api","authors":["Chris Sells","Brandon Satrom","Don Box"]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Fast-track your web development career using the powerful features of advanced JavaScript","description":"Develop your JavaScript programming skills by learning strategies and techniques commonly used in modern full-stack application development Key Features Write and deploy full-stack applications efficiently with JavaScript Delve into JavaScript’s multiple programming paradigms Get up to speed with core concepts such as modularity and functional programming to write efficient code Book Description In depth knowledge of JavaScript makes it easier to learn a variety of other frameworks, including React, Angular, and related tools and libraries. This book is designed to help you cover the core JavaScript concepts you need to build modern applications. You'll start by learning how to represent an HTML document in the Document Object Model (DOM). Then, you'll combine your knowledge of the DOM and Node.js to create a web scraper for practical situations. As you read through further lessons, you'll create a Node.js-based RESTful API using the Express library for Node.js. You'll also understand how modular designs can be used for better reusability and collaboration with multiple developers on a single project. Later lessons will guide you through building unit tests, which ensure that the core functionality of your program is not affected over time. The book will also demonstrate how constructors, async\/await, and events can load your applications quickly and efficiently. Finally, you'll gain useful insights into functional programming concepts such as immutability, pure functions, and higher-order functions. By the end of this book, you'll have the skills you need to tackle any real-world JavaScript development problem using a modern JavaScript approach, both for the client and server sides. What you will learn Apply the core concepts of functional programming Build a Node.js project that uses the Express.js library to host an API Create unit tests for a Node.js project to validate it Use the Cheerio library with Node.js to create a basic web scraper Develop a React interface to build processing flows Use callbacks as a basic way to bring control back Who this book is for If you want to advance from being a frontend developer to a full-stack developer and learn how Node.js can be used for hosting full-stack applications, this is an ideal book for you. After reading this book, you'll be able to write better JavaScript code and learn about the latest trends in the language. To easily grasp the concepts explained here, you should know the basic syntax of JavaScript and should've worked with popular frontend libraries such as jQuery. You should have also used JavaScript with HTML and CSS but not necessarily Node.js.","language":"en","currency":"USD","id":"1838822755","title":"Professional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSOzDwAAQBAJ&source=gbs_api","authors":["Hugo Di Francesco","Siyuan Gao","Vinicius Isola","Philip Kirkbride"]},{"pageCount":257,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bWwFBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Master JavaScript in 20 lessons--online video tutorials included! Based on the author's successful online courses, this complete, integrated learning tool provides easy-to-follow lessons that feature clear explanations, sample code and exercises, and video tutorials. Each lesson is designed to take you less than an hour to complete. JavaScript: 20 Lessons to Successful Web Development covers the basics, including variables, operators, arrays, objects, and values. Next, you'll learn how to use conditional statements, work with multidimensional arrays, manipulate objects, handle errors, manage cookies, use Ajax, and much more. Together, the book and almost five hours of video training make learning JavaScript easier than ever! Ready-to-use code at www.mhprofessional.com","language":"en","currency":"USD","id":"0071841571","title":"JavaScript: 20 Lessons to Successful Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bWwFBgAAQBAJ&source=gbs_api","authors":["Robin Nixon"]},{"pageCount":271,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GkBEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"Volume 1: Constraint Validation, Enumerations, Special Datatypes","description":"Today, web applications are the most important type of software applications. This textbook shows how to design and implement them, using a model-based engineering approach that covers general information management concepts and techniques and the two most relevant technology platforms: JavaScript and Java. The book provides an in-depth tutorial for theory-underpinned and example-based learning by doing it yourself, supported by quiz questions and practice projects. Volume 1 provides an introduction to web technologies and model-based web application engineering, discussing the information management concepts of constraint-based data validation, enumerations and special datatypes. Volume 2 discusses the advanced information management concepts of associations and inheritance in class hierarchies. Web apps are designed using UML class diagrams and implemented with two technologies: JavaScript for front-end (and distributed NodeJS) apps, and Java (with JPA and JSF) for back-end apps. The six example apps discussed in the book can be run, and their source code downloaded, from the book’s website. Gerd Wagner is Professor of Internet Technology at Brandenburg University of Technology, Germany, and Adjunct Associate Professor at Old Dominion University, Norfolk, VA, USA. He works in the areas of web engineering and modeling and simulation. Mircea Diaconescu is a Software Architect and Technical Team Leader at Entri GmbH, Berlin. He enjoys to work with the newest web technologies and to build Web of Things projects. Java, JavaScript\/NodeJS and C# are his favorite programming languages.","language":"en","currency":"USD","id":"3110497247","title":"Web Applications with Javascript or Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GkBEDwAAQBAJ&source=gbs_api","authors":["Gerd Wagner","Mircea Diaconescu"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E6E5CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"The Javascript Adventure teaches people how to write code by building a simple text-based adventure game. The first few chapters are designed for the absolute beginner that has little to no knowledge of programming. From the first line written, each bit of code can be used to build a part of the game. This book teaches by example and purposefully focuses on helping the reader accomplish bite-sized tasks to build confidence. The reader will be able to write some code literally within minutes of reading the first chapter!","language":"en","currency":"USD","id":"1329219937","title":"The Javascript Adventure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E6E5CgAAQBAJ&source=gbs_api","authors":["Ron Sims II"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TU0nCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"How do you make a video game? Advanced Game Design with HTML5 and JavaScript is a down to earth education in how to make video games from scratch, using the powerful HTML5 and JavaScript technologies. This book is a point-by-point round up of all the essential techniques that every game designer needs to know. You'll discover how to create and render game graphics, add interactivity, sound, and animation. You’ll learn how to build your own custom game engine with reusable components so that you can quickly develop games with maximum impact and minimum code. You’ll also learn the secrets of vector math and advanced collision detection techniques, all of which are covered in a friendly and non-technical manner. You'll find detailed working examples, with hundreds of illustrations and thousands of lines of source code that you can freely adapt for your own projects. All the math and programming techniques are elaborately explained and examples are open-ended to encourage you to think of original ways to use these techniques in your own games. You can use what you learn in this book to make games for desktops, mobile phones, tablets or the Web. Advanced Game Design with HTML5 and JavaScript is a great next step for experienced programmers or ambitious beginners who already have some JavaScript experience, and want to jump head first into the world of video game development. It’s also great follow-up book for readers of Foundation Game Design with HTML5 and JavaScript (by the same author) who want to add depth and precision to their skills. The game examples in this book use pure JavaScript, so you can code as close to the metal as possible without having to be dependent on any limiting frameworks or game engines. No libraries, no dependencies, no third-party plugins: just you, your computer, and the code. If you’re looking for a book to take your game design skills into the stratosphere and beyond, this is it!","language":"en","currency":"USD","id":"1430258012","title":"Advanced Game Design with HTML5 and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TU0nCgAAQBAJ&source=gbs_api","authors":["Rex van der Spuy"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=N2wdDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Explore and master modern JavaScript techniques in order to build large-scale web applications About This Book Write powerful code with the high-level functions that JavaScript offers Test and debug issues with JavaScript code using various modern mechanisms Offers an expert's eye on the latest ES6 features and how these advanced tasks fit together in JavaScript as a whole Who This Book Is For This book is ideal for web developers who are looking to master modern JavaScript concepts and design principles. You should already have an intermediate level of JavaScript knowledge before starting this book. What You Will Learn Get a run through of the basic JavaScript language constructs Get familiar with the Functions and Closures of JavaScript Explore Regular Expressions in JavaScript Code using the powerful object-oriented feature in JavaScript Test and debug your code using JavaScript strategies Master DOM manipulation, cross-browser strategies, and ES6 Understand the basic concurrency constructs in Javascript and best performance strategies Learn to build scalable server application in JavaScript using Node.js In Detail JavaScript is a high-level, dynamic, untyped, lightweight, and interpreted programming language. Along with HTML and CSS, it is one of the three essential technologies of World Wide Web content production, and is an open source and cross-platform technology. The majority of websites employ JavaScript, and it is well supported by all modern web browsers without plugins. However, the JavaScript landscape has changed dramatically in recent years, and you need to adapt to the new world of JavaScript that people now expect. Mastering modern JavaScript techniques and the toolchain are essential to develop web-scale applications. Mastering JavaScript will be your companion as you master JavaScript and build innovative web applications. To begin with, you will get familiarized with the language constructs and how to make code easy to organize. You will gain a concrete understanding of variable scoping, loops, and best practices on using types and data structures, as well as the coding style and recommended code organization patterns in JavaScript. The book will also teach you how to use arrays and objects as data structures. You will graduate from intermediate-level skills to advanced techniques as you come to understand crucial language concepts and design principles. You will learn about modern libraries and tools so you can write better code. By the end of the book, you will understand how reactive JavaScript is going to be the new paradigm. Style and approach This is a comprehensive guide with a clear focus on practical use cases and patterns. Each chapter consists of best practices, useful advice, and a bunch of easy-to-follow examples that will build up your skills as you advance through the book.","language":"en","currency":"USD","id":"1785286285","title":"Mastering JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=N2wdDAAAQBAJ&source=gbs_api","authors":["Ved Antani"]},{"pageCount":976,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6RZqowc5WwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":null,"description":"The essential JavaScript resource—fully updated Design, debug, and publish high-performance web pages and applications using tested techniques and best practices from expert developers. The all-new edition of this comprehensive guide has been thoroughly revised and expanded to cover the latest JavaScript features, tools, and programming methods. JavaScript: The Complete Reference, Third Edition provides illustrative examples, line-by-line code samples, and practical development advice—from the core of the language to the various standard and emerging APIs supported by modern web browsers. This in-depth resource covers everything you need to know, whether you’re trying to understand the fundamentals of weak typing in JavaScript, reduce your confusion over closures, or perform common tasks like form validation or Ajax calls. Explore core JavaScript syntax and data types Investigate often confusing concepts such as weak typing and closures Use object-oriented programming the JavaScript way See what changes come from ECMAScript 5 Perform dynamic content updates using DOM methods Handle user-generated events with modern event models Modernize form handling with HTML5 and JavaScript Use the XMLHttpRequest object to create Ajax applications Control animation and multimedia content with JavaScript Generate bitmap graphics with the Canvas API Learn methods to handle the challenges of cross-browser coding Discover defensive development and error handling","language":"en","currency":"USD","id":"0071741216","title":"JavaScript The Complete Reference 3rd Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6RZqowc5WwC&source=gbs_api","authors":["Thomas Powell","Fritz Schneider"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5CReDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.95,"subtitle":null,"description":"There's no doubt that the JavaScript ecosystem changes fast. Not only are new tools and frameworks introduced and developed at a rapid rate, the language itself has undergone big changes with the introduction of ES2015 (aka ES6). Understandably, many articles have been written complaining about how difficult it is to learn modern JavaScript development these days. We're aiming to minimize that confusion with this set of books on modern JavaScript. This book presents six complete JavaScript projects; each taking advantage of modern JavaScript and its ecosystem. You'll learn to build several different apps, and along the way you'll pick up a ton of useful advice, tips, and techniques. It contains: Build a Full-Sphere 3D Image Gallery with React VR by Michaela Lehr Build a WebRTC Video Chat Application with SimpleWebRTC by Michael Wanyoike Build a JavaScript Single Page App Without a Framework by Michael Wanyoike Build a To-do List with Hyperapp, the 1KB JS Micro-framework by Darren Jones Use Parcel to Bundle a Hyperapp App & Deploy to GitHub Pages by Darren Jones Interactive Data Visualization with Modern JavaScript and D3 by Adam Janes This book is for all front-end developers who wish to improve their JavaScript skills. You'll need to be familiar with HTML and CSS and have a reasonable level of understanding of JavaScript in order to follow the discussion.","language":"en","currency":"USD","id":"1492068101","title":"6 JavaScript Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5CReDwAAQBAJ&source=gbs_api","authors":["Michaela Lehr","Michael Wanyoike","Darren Jones","Adam Janes"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nb1wRgrJ8boC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44,"subtitle":null,"description":"Create real-time, highly interactive apps quickly with the powerful XMPP protocol XMPP is a robust protocol used for a wide range of applications, including instant messaging, multi-user chat, voice and video conferencing, collaborative spaces, real-time gaming, data synchronization, and search. This book teaches you how to harness the power of XMPP in your own apps and presents you with all the tools you need to build the next generation of apps using XMPP or add new features to your current apps. Featuring the JavaScript language throughout and making use of the jQuery library, the book contains several XMPP apps of increasing complexity that serve as ideal learning tools. Coverage Includes: Getting to Know XMPP Designing XMPP Applications Saying Hello: The First Application Exploring the XMPP Protocol: A Debugging Console Microblogging in Real Time: An Identica Client Talking with Friends: One-on-One Chat Exploring Services: Service Discovery and Browsing Group Chatting: A Multi-User Chat Client Publishing and Subscribing: A Shared Sketch Pad Introduction Writing with Friends: A Collaborative Text Editor Playing Games: Head to Head Tic-Tac-Toe Getting Attached: Bootstrapping BOSH Deploying XMPP Applications Writing Strophe Plug-ins Note: CD-ROM\/DVD and other supplementary materials are not included as part of eBook file.","language":"en","currency":"USD","id":"0470633905","title":"Professional XMPP Programming with JavaScript and jQuery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nb1wRgrJ8boC&source=gbs_api","authors":["Jack Moffitt"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BFda3Z71Y5YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Write Windows 8 Metro apps capable of running on one billion devices -- and do it with familiar HTML5 and JavaScript technologies! Sams Teach Yourself Windows 8 Metro Apps with JavaScript and HTML5 in 24 Hours is the fastest way for web and Windows developers to profit from the massive new Windows 8\/Metro opportunity. Microsoft MVP Chad Carter teaches every facet of HTML5\/JavaScript Metro development simply and clearly, through 24 concise, hands-on lessons focused on knowledge you can apply immediately. Each lesson builds on what's come before, helping you get practical results fast! You'll learn how HTML5, JavaScript, and CSS3 fit into Metro development… how to quickly master Metro design and start using Microsoft's powerful Metro templates… what you need to know about WinRT and WinJS… how to build high-performance Metro apps… how to handle tablet and smartphone form factors, touch, and sensors… how to bind data to apps, and store it locally or remotely… how to manage app lifecycle events… how to make the most of Metro's innovative UI features… and much more. Carter walks you through constructing apps and games from start to finish, and even shows how to get them certified for sale at the Windows Store. Step-by-step instructions walk readers through key tasks... Q-and-As, Quizzes, and Exercises test their knowledge... \"Did You Know?\" tips offer insider advice... \"Watch Out!\" alerts help them avoid problems. By the time they're finished, readers will be comfortable with every phase of Windows 8 Metro development -- from planning apps through earning revenue!","language":"en","currency":"USD","id":"0133255875","title":"Sams Teach Yourself Windows 8 Apps with JavaScript and HTML5 in 24 Hours","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BFda3Z71Y5YC&source=gbs_api","authors":["Chad Carter"]},{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lUAnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"From Novice to Professional","description":"The Google Maps API is a showcase example of the Web 2.0 development paradigm, designed to be invitingly simple for developers to incorporate dynamic mapping services into Web applications. Beginning Google Maps Applications with Rails and Ajax takes a developer’s perspective, showing how to integrate mapping features into their Rails-driven Web applications. The book shows how to draw on data sources such as the U.S. Census Bureau’s TIGER\/Line data and Google's own geocoding feature to build comprehensive geocoding services. The book includes guided examples demonstrating how to encourage user interaction such as pinpointing map locations, adding comments, and building community-driven maps.","language":"en","currency":"USD","id":"1430203803","title":"Beginning Google Maps Applications with Rails and Ajax","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lUAnCgAAQBAJ&source=gbs_api","authors":["Andre Lewis","Cameron Turner","Jeffrey Sambells","Michael Purvis"]},{"pageCount":548,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DprLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Develop reliable, maintainable, and robust JavaScript","description":"Get the most out of JavaScript for building web applications through a series of patterns, techniques, and case studies for clean coding Key Features Write maintainable JS code using internal abstraction, well-written tests, and well-documented code Understand the agents of clean coding like SOLID principles, OOP, and functional programming Explore solutions to tackle common JavaScript challenges in building UIs, managing APIs, and writing states Book Description Building robust apps starts with creating clean code. In this book, you’ll explore techniques for doing this by learning everything from the basics of JavaScript through to the practices of clean code. You’ll write functional, intuitive, and maintainable code while also understanding how your code affects the end user and the wider community. The book starts with popular clean-coding principles such as SOLID, and the Law of Demeter (LoD), along with highlighting the enemies of writing clean code such as cargo culting and over-management. You’ll then delve into JavaScript, understanding the more complex aspects of the language. Next, you’ll create meaningful abstractions using design patterns, such as the Class Pattern and the Revealing Module Pattern. You’ll explore real-world challenges such as DOM reconciliation, state management, dependency management, and security, both within browser and server environments. Later, you’ll cover tooling and testing methodologies and the importance of documenting code. Finally, the book will focus on advocacy and good communication for improving code cleanliness within teams or workplaces, along with covering a case study for clean coding. By the end of this book, you’ll be well-versed with JavaScript and have learned how to create clean abstractions, test them, and communicate about them via documentation. What you will learn Understand the true purpose of code and the problems it solves for your end-users and colleagues Discover the tenets and enemies of clean code considering the effects of cultural and syntactic conventions Use modern JavaScript syntax and design patterns to craft intuitive abstractions Maintain code quality within your team via wise adoption of tooling and advocating best practices Learn the modern ecosystem of JavaScript and its challenges like DOM reconciliation and state management Express the behavior of your code both within tests and via various forms of documentation Who this book is for This book is for anyone who writes JavaScript, professionally or otherwise. As this book does not relate specifically to any particular framework or environment, no prior experience of any JavaScript web framework is required. Some knowledge of programming is assumed to understand the concepts covered in the book more effectively.","language":"en","currency":"USD","id":"178995729X","title":"Clean Code in JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DprLDwAAQBAJ&source=gbs_api","authors":["James Padolsey"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=05GZf14jYIkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"for HTML5, CSS3, and JavaScript Development","description":"Foundation Adobe Edge Animate is a project-oriented book that will walk you through the features of Edge Animate - Adobe's exciting new motion and interaction tool for web standards development. Edge Animate is an application that allows web designers and developers to make full use of many of the features of CSS3, JavaScript, and HTML5. Edge Animate enables you to animate graphics without the need to hand code everything using canvas or SVG. It exports well-formed, standards-compliant code that you can either use to create new web products, or add directly into existing projects. It also features full JavaScript and DOM manipulation, enabling you to get under the hood and create fantastic interactive experiences. Using a unique project-oriented focus you will be creating carefully developed projects designed to give you the skills and confidence necessary to undertake interactive and web design experiences aimed at devices ranging from smart phones to the TV set in your living room. Along the way you will discover how many of the tools in the Adobe Web Design CS6 collection can be fully utilized to create expressive and engaging web applications. This includes: Building interactive projects using the Edge Animate timeline and coding tools. Learning how Fireworks, Photoshop, and Illustrator are used for Edge Animate content creation. Discovering how pages created in Dreamweaver and Muse can become fully interactive and contain motion graphics in Edge Animate.","language":"en","currency":"USD","id":"1430243511","title":"Foundation Adobe Edge Animate","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=05GZf14jYIkC&source=gbs_api","authors":["Tom Green","Michael Clawson"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AEOWCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"JavaScript Essentials for Modern Application Development","description":"This is an exciting time to learn JavaScript. Now that the latest JavaScript specification—ECMAScript 6.0 (ES6)—has been finalized, learning how to develop high-quality applications with this language is easier and more satisfying than ever. This practical book takes programmers (amateurs and pros alike) on a no-nonsense tour of ES6, along with some related tools and techniques. Author Ethan Brown (Web Development with Node and Express) not only guides you through simple and straightforward topics (variables, control flow, arrays), but also covers complex concepts such as functional and asynchronous programming. You’ll learn how to create powerful and responsive web applications on the client, or with Node.js on the server. Use ES6 today and transcompile code to portable ES5 Translate data into a format that JavaScript can use Understand the basic usage and mechanics of JavaScript functions Explore objects and object-oriented programming Tackle new concepts such as iterators, generators, and proxies Grasp the complexities of asynchronous programming Work with the Document Object Model for browser-based apps Learn Node.js fundamentals for developing server-side applications","language":"en","currency":"USD","id":"1491914920","title":"Learning JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AEOWCwAAQBAJ&source=gbs_api","authors":["Ethan Brown"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kURBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Playful Programming Activities to Make You Smarter","description":"Impractical Python Projects is a collection of fun and educational projects designed to entertain programmers while enhancing their Python skills. It picks up where the complete beginner books leave off, expanding on existing concepts and introducing new tools that you'll use every day. And to keep things interesting, each project includes a zany twist featuring historical incidents, pop culture references, and literary allusions. You'll flex your problem-solving skills and employ Python's many useful libraries to do things like: - Help James Bond crack a high-tech safe with a hill-climbing algorithm - Write haiku poems using Markov Chain Analysis - Use genetic algorithms to breed a race of gigantic rats - Crack the world's most successful military cipher using cryptanalysis - Derive the anagram, \"I am Lord Voldemort\" using linguistical sieves - Plan your parents' secure retirement with Monte Carlo simulation - Save the sorceress Zatanna from a stabby death using palingrams - Model the Milky Way and calculate our odds of detecting alien civilizations - Help the world's smartest woman win the Monty Hall problem argument - Reveal Jupiter's Great Red Spot using optical stacking - Save the head of Mary, Queen of Scots with steganography - Foil corporate security with invisible electronic ink Simulate volcanoes, map Mars, and more, all while gaining valuable experience using free modules like Tkinter, matplotlib, Cprofile, Pylint, Pygame, Pillow, and Python-Docx. Whether you're looking to pick up some new Python skills or just need a pick-me-up, you'll find endless educational, geeky fun with Impractical Python Projects.","language":"en","currency":"USD","id":"1593278918","title":"Impractical Python Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kURBDwAAQBAJ&source=gbs_api","authors":["Lee Vaughan"]},{"pageCount":296,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-m08A3lsSUgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"Foundation Website Creation with HTML5, CSS3, and JavaScript shows the entire process of building a website. This process involves much more than just technical knowledge, and this book provides all the information you'll need to understand the concepts behind designing and developing for the Web, as well as the best means to deliver professional results based on best practices. Of course, there is far more to building a successful website than knowing a little Hypertext Markup Language (HTML). The process starts long before any coding takes place, and this book introduces you to the agile development process, explaining why this method makes so much sense for web projects and how best to implement it. We also make sure you're up to date by using the latest HTML5 features. Planning is vital, so you'll also learn to use techniques such as brainstorming, wireframes, mockups, and prototypes to get your project off to the best possible start and help ensure smooth progress as it develops. An understanding of correct, semantic markup is essential for any web professional; this book explains how HTML5 should be used to structure content so that the markup adheres to current web standards. You'll learn about the wide range of HTML5 elements available to you, and you'll learn how and when to use them through building example web pages. Without creative use of Cascading Style Sheets (CSS), websites would all look largely the same. CSS enables you to set your website apart from the rest, while maintaining the integrity of your markup. We'll showcase the new features of CSS3 and how you can use them. You'll learn how CSS3 works and how to apply styles to your pages, allowing you to realize your design ideas in the browser. JavaScript can be used to make your website easier and more interesting to use. This book provides information on appropriate uses of this technology and introduces the concepts of JavaScript programming. You'll also see how JavaScript works as part of the much-hyped technique Ajax, and in turn, where Ajax fits into the wider Web 2.0 picture. While a website is being built, it needs to be tested across multiple browsers and platforms to ensure that the site works for all users, regardless of ability or disability, and this book explains how best to accomplish these tasks. Then, it discusses the process of launching and maintaining the site so that it will continue to work for all its users throughout its life cycle. Foundation Website Creation with HTML5, CSS3, and JavaScript concludes by covering server-side technologies, acting as a guide to the different options available. With insights from renowned experts such as Jason Fried of 37signals, Daniel Burka of Digg and Pownce, and Chris Messina of Citizen Agency, Foundation Website Creation with CSS, XHTML, and JavaScript provides invaluable information applicable to every web project—regardless of size, scope, or budget.","language":"en","currency":"USD","id":"1430237902","title":"Foundation Website Creation with HTML5, CSS3, and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-m08A3lsSUgC&source=gbs_api","authors":["Joe Lewis","Jonathan Lane","Meitar Moscovitz","Tom Barker"]},{"pageCount":120,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":null,"description":"If you've used a more traditional object-oriented language, such as C++ or Java, JavaScript probably doesn't seem object-oriented at all. It has no concept of classes, and you don't even need to define any objects in order to write code. But don't be fooled—JavaScript is an incredibly powerful and expressive object-oriented language that puts many design decisions right into your hands. In The Principles of Object-Oriented JavaScript, Nicholas C. Zakas thoroughly explores JavaScript's object-oriented nature, revealing the language's unique implementation of inheritance and other key characteristics. You'll learn: –The difference between primitive and reference values –What makes JavaScript functions so unique –The various ways to create objects –How to define your own constructors –How to work with and understand prototypes –Inheritance patterns for types and objects The Principles of Object-Oriented JavaScript will leave even experienced developers with a deeper understanding of JavaScript. Unlock the secrets behind how objects work in JavaScript so you can write clearer, more flexible, and more efficient code.","language":"en","currency":"USD","id":"1593275765","title":"The Principles of Object-Oriented JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dAYvDwAAQBAJ&source=gbs_api","authors":["Nicholas C. Zakas"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n6arJlPuiA0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Develop for Android using HTML5, CSS3 & JavaScript","description":"Developing applications for Android and other mobile devices using web technologies is now well within reach. When the capabilities of HTML5 are combined with CSS3 and JavaScript, web application developers have an opportunity to develop compelling mobile applications using familiar tools. Not only is it possible to build mobile web apps that feel as good as native apps, but to also write an application once and have it run a variety of different devices. While the HTML5 specification is still evolving, there is a lot that can be used right now to build mobile web apps. Mobile web apps are now starting to provide many of the features that were once only available to native-language-based apps in Java, Objective-C, etc. Pro Android Web Apps teaches developers already familiar with web application development, how to code and structure a web app for use on the Android mobile platform. Understand both the why and how of mobile web app development, focusing on the Android platform. Learn how to structure mobile web apps through a number of practical, real-world application examples. Discover what cloud platforms such as Google AppEngine have to offer Android web apps, for both hosting web apps and providing device to cloud data synchronization solutions. Get a real picture of the status of HTML5 on Android and other mobile devices, including some things to watch out for when building your own applications. Understand the capabilities of the web application stack, and how to complement those with native bridging frameworks such as PhoneGap to access native features of the device. Gain an understanding of the different UI frameworks that are available for building mobile web apps. Learn how to include mapping and leverage location-based services in mobile web apps to create engaging mobile experiences. Enable social integration with your Android web app and gain access to millions of potential users. After reading this book, you will not only have a greater understanding of the world of web apps on Android, but also how to leverage additional tools and frameworks to increase the reach of your mobile web apps. Additionally, through the practical samples in the book you will have been given solid exposure of where both the opportunities and challenges lie when building mobile apps the web way.","language":"en","currency":"USD","id":"1430232773","title":"Pro Android Web Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n6arJlPuiA0C&source=gbs_api","authors":["Damon Oehlman","Sbastien Blanc"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":706,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NPbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"Master the World's Most-Used Programming Language","description":"For web developers and other programmers interested in using JavaScript, this bestselling book provides the most comprehensive JavaScript material on the market. The seventh edition represents a significant update, with new information for ECMAScript 2020, and new chapters on language-specific features. JavaScript: The Definitive Guide is ideal for experienced programmers who want to learn the programming language of the web, and for current JavaScript programmers who want to master it.","language":"en","currency":"USD","id":"1491951982","title":"JavaScript: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NPbkDwAAQBAJ&source=gbs_api","authors":["David Flanagan"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sHT6PeMp1k8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"The Insider's Guide to Developing Applications in JavaScript using the Palm Mojo Framework","description":"A Note from the Author and from O'Reilly Media about what this bookdoes--and doesn't--do: Palm webOS is a brand new platform and represents a very different type ofoperating system where the web runtime is used as the basis for the UI andApplication model. Palm and O'Reilly felt that it was important to have abook available to help developers get a basic understanding of the new Palmplatform at the time that the SDK was released; this timing played a majorrole in the content and structure of the book. Ideally this book would have been a complete reference of the new platformbut that wasn't possible since the content was written at the same time asthe software SDK was being developed by the Palm engineering team. The bookdoes provide a complete overview of Palm webOS, a thorough description ofthe application model and gives details on many key design concepts. Thereare descriptions and examples of UI widgets, services, storage,notifications, dashboards and background applications, serving as a greatintroduction but not as a definitive source. The book uses a simple News reader application to illustrate the technicaldescriptions but the examples are not intended to serve as a cookbooktutorial. Experienced developers should be able to use the examples to buildup a working application chapter by chapter but others may not find theloose descriptions adequate for recreating the application unaided. Overtime, these different needs will be filled by other books, but in themeantime we hope that this book will serve a valuable role introducingdevelopers to webOS and giving them a way of getting started with webOSapplication development. A second printing of the book will update any original coverage obsoleted bysubsequent Mojo SDK builds. For owners of the original printing of the book,all of these updates are posted on the \"View\/Submit Errata\" link (please seeleft-hand column of this web page). Thanks for understanding that book publishing and coverage of rapidly movingtechnologies can sometimes be an inexact science; we knew there'd be a needfor a book such as Palm webOS: The Insider's Guide to DevelopingApplications in JavaScript using the Palm MojoT Framework, and there'scertainly no better person to write that book that Mitch Allen; that said,we understand that because it is such a new operating system and SDK, therewould (and will continue to be) changes that at best can't be documented andexplored until new printings of the books are released. In the meantime wewill be diligent in posting updates to this book's O'Reilly Media catalogpage. DescriptionThis is the official guide to building native JavaScript applications for Palm's new mobile operating system, Palm webOS. Written by Palm's software chief technology officer along with the Palm webOS development team, Palm webOS provides a complete tutorial on the design principles, architecture, UI, tools, and services necessary to develop webOS applications-including the Mojo JavaScript framework and Palm's SDK. Palm webOS is designed to support a fast and superb user experience using established web standards, so if you're familiar with HTML, CSS, and JavaScript, you're ready to build applications for any webOS-based device, including the Palm Pre. You'll gain expertise, chapter by chapter, as you build a working mobile application through the course of the book. You'll also learn how to extend existing web apps to work with the new generation of mobile phones. Get a thorough overview of the webOS platform and architecture Understand the critical concepts for application design: what separates webOS from other web and mobile platforms Learn the details of Mojo's development tools and SDK for building and testing mobile applications Examine best practices, important considerations, and guiding principles for developing with webOS and the Mojo framework","language":"en","currency":"USD","id":"9781449379230","title":"Palm webOS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sHT6PeMp1k8C&source=gbs_api","authors":["Mitch Allen"]},{"pageCount":425,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NHhqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Build on your Basic Knowledge of HTML5 and JavaScript to Create Substantial HTML5 Applications","description":"Build on your basic knowledge of HTML5 and JavaScript to create substantial HTML5 applications. Through the many interesting projects you can create in this book, you'll develop HTML5 skills for future projects, and extend the core skills you may have learned with its companion book, The Essential Guide to HTML5. HTML5 and JavaScript Projects is fully updated as a second edition and covers important programming techniques and HTML, CSS, and JavaScript features to help you build projects with images, animation, video, audio and line drawings. You'll learn how to build games, quizzes and other interactive projects; incorporate the use of the Google Maps API and localStorage; and address the challenges of Responsive Design and Accessibility. Each project starts out with a description of the example's operation, often with full-color illustrations. You'll then review the HTML5 and JavaScript concepts that relate to the project followed by a step-by-step explanation of the programming used. Tables are used to show the relationship of functions and provide comments for each line of code so that you can easily apply the techniques to your own HTML5 projects.​ What You'll Learn Enhance your HTML5 and JavaScript programming skills. Poduce applications combining Canvas drawings, photos, and videos Incorporate Google Maps and geolocation into your projects Build applications requiring persistent data, storing the information locally or on a database on the server Who This Book Is For Developers who have some knowledge of programming and want to build more substantial applications by combining basic features and combining JavaScript with other technologies.","language":"en","currency":"USD","id":"1484238648","title":"HTML5 and JavaScript Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NHhqDwAAQBAJ&source=gbs_api","authors":["Jeanine Meyer"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=naYFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.33,"subtitle":null,"description":"ES6JavaScript *Visual Studio Code *JavaScriptTensorFlow *JavaScriptJavaScript *HTMLDOM *CSSJavaScriptCSS *Google ChromeJavaScript *jQueryjQueryDOM\/\/ *ES6JavaScriptJavaScriptJSONFetch APIAJAX *TensorFlow.js *JavaScript+TensorFlow.jsKeras API *Python+KerasTensorFlow.js *TensorFlow.jsWebWebCam # GOTOP","language":"zh-TW","currency":"USD","id":"9865026104","title":"JavaScriptTensorFlow.js()","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=naYFEAAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hG_djAUkyzcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"covers both C# and JavaScript","description":"The Model-View-View-Model (MVVM) pattern is held in high regard by many developers as an excellent way of creating sophisticated modern applications. It's clear seperation of presentation and business logic produces a clean implementation that promotes speed, scalability and code reuse in applications with a complex UI. These strengths have found it favor with WPF and Silverlight developers. It is now increasingly being employed for Windows 8 apps, a purpose to which it is ideally suited as this book will show. In this brief, information-rich, guide we will show you how MVVM works with both XAML (C#) and HTML5 (JavaScript) flavors of Windows 8. Beginning with a brief recap of MVVM concepts under .NET - to provide a common frame of reference - we will then delve into the details of how MVVM can best be implemented in Metro-style apps for Windows 8 and show a working application framework in each case.","language":"en","currency":"USD","id":"1430249099","title":"Windows 8 MVVM Patterns Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hG_djAUkyzcC&source=gbs_api","authors":["Ashish Ghoda"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EYOH3EKoRBIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Develop cross-platform multimedia applications with HTML5 Now you can create rich, interactive content in the browser and deploy it across all platforms. HTML5 Multimedia Developer's Guide shows you how. You'll learn to use the revolutionary new features of HTML5, including the native audio, video, and drawing elements that eliminate the need for third-party plug-ins. New tags, the simplified doctype, local data storage, drag-and-drop, and geolocation are also covered. Detailed code examples illustrate the techniques discussed. By the end of the book, you'll be able to develop amazing multimedia applications and websites with HTML5. Use canvas for drawing, animation, effects, and events Create and view videos with the native video element Add and play audio files with the native audio element Take advantage of local data storage functions Apply drag-and-drop functionality Build location-aware web pages with the geolocation property Develop well-structured pages using the new semantic layout tags Add functionality to web forms with the new form objects Learn about new CSS3 properties and enhancements Use the editable content and offline files features Work with JavaScript and other technologies","language":"en","currency":"USD","id":"0071752838","title":"HTML5 Multimedia Developer's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EYOH3EKoRBIC&source=gbs_api","authors":["Ken Bluttman","Lee Cottrell"]},{"pageCount":1065,"thumbnail":"http:\/\/books.google.com\/books\/content?id=srkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":57.59,"subtitle":null,"description":"Master the art of predictive modeling About This Book Load, wrangle, and analyze your data using the world's most powerful statistical programming language Familiarize yourself with the most common data mining tools of R, such as k-means, hierarchical regression, linear regression, Naive Bayes, decision trees, text mining and so on. We emphasize important concepts, such as the bias-variance trade-off and over-fitting, which are pervasive in predictive modeling Who This Book Is For If you work with data and want to become an expert in predictive analysis and modeling, then this Learning Path will serve you well. It is intended for budding and seasoned practitioners of predictive modeling alike. You should have basic knowledge of the use of R, although it's not necessary to put this Learning Path to great use. What You Will Learn Get to know the basics of R's syntax and major data structures Write functions, load data, and install packages Use different data sources in R and know how to interface with databases, and request and load JSON and XML Identify the challenges and apply your knowledge about data analysis in R to imperfect real-world data Predict the future with reasonably simple algorithms Understand key data visualization and predictive analytic skills using R Understand the language of models and the predictive modeling process In Detail Predictive analytics is a field that uses data to build models that predict a future outcome of interest. It can be applied to a range of business strategies and has been a key player in search advertising and recommendation engines. The power and domain-specificity of R allows the user to express complex analytics easily, quickly, and succinctly. R offers a free and open source environment that is perfect for both learning and deploying predictive modeling solutions in the real world. This Learning Path will provide you with all the steps you need to master the art of predictive modeling with R. We start with an introduction to data analysis with R, and then gradually you'll get your feet wet with predictive modeling. You will get to grips with the fundamentals of applied statistics and build on this knowledge to perform sophisticated and powerful analytics. You will be able to solve the difficulties relating to performing data analysis in practice and find solutions to working with “messy data”, large data, communicating results, and facilitating reproducibility. You will then perform key predictive analytics tasks using R, such as train and test predictive models for classification and regression tasks, score new data sets and so on. By the end of this Learning Path, you will have explored and tested the most popular modeling techniques in use on real-world data sets and mastered a diverse range of techniques in predictive analytics. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Data Analysis with R, Tony Fischetti Learning Predictive Analytics with R, Eric Mayor Mastering Predictive Analytics with R, Rui Miguel Forte Style and approach Learn data analysis using engaging examples and fun exercises, and with a gentle and friendly but comprehensive \"learn-by-doing\" approach. This is a practical course, which analyzes compelling data about life, health, and death with the help of tutorials. It offers you a useful way of interpreting the data that's specific to this course, but that can also be applied to any other data. This course is designed to be both a guide and a reference for moving beyond the basics of predictive modeling.","language":"en","currency":"USD","id":"1788290852","title":"R: Predictive Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=srkrDwAAQBAJ&source=gbs_api","authors":["Tony Fischetti","Eric Mayor","Rui Miguel Forte"]},{"pageCount":161,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGyCCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":"Criando aplicaes web real-time com JavaScript","description":"O JavaScript j  uma opo real de desenvolvimento server-side. Trabalhar com a mesma linguagem que utilizamos no front-end  tambm uma grande vantagem. Diversos frameworks surgiram e, sem dvida, o Meteor  que mais se destaca. Neste livro, venha desenvolver sua prpria rede social do zero implementando funcionalidades que interagem em tempo real, alm de tambm aprender a trabalhar com diversos componentes nativos do framework que visam agilizar a prototipagem da aplicao, utilizando o Meteor 1.1.x. Tambm veremos como lidar tarefas do dia a dia como criao de templates com Handlebars; integrao com a API do Facebook para autenticao e cadastro de usurios; utilizao do banco de dados no-relacional MongoDB; e programao orientada a eventos, utilizando PubSub nativo do Meteor.","language":"pt","currency":"USD","id":"8555191351","title":"Meteor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGyCCwAAQBAJ&source=gbs_api","authors":["Caio Ribeiro Pereira"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ndpqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":null,"description":"If you have a working knowledge of JavaScript and ECMAScript 6 (ES6), this practical guide will help you tackle modular programming to produce code that’s readable, maintainable, and scalable. You’ll learn the fundamentals of modular architecture with JavaScript and the benefits of writing self-contained code at every system level, including the client and server. Nicols Bevacqua, author of Practical Modern JavaScript, demonstrates how to scale out JavaScript applications by breaking codebases into smaller modules. By following the design practices in this book, senior developers, technical leaders, and software architects will learn how to create modules that are simple and flexible while keeping internal complexity in check. Learn modular design essentials, including how your application will be consumed and what belongs on the interface Design module internals to keep your code readable and its intent clear Reduce complexity by refactoring code and containing and eliminating state Take advantage of modern JavaScript features to write clear programs and reduce complexity Apply Twelve-Factor App principles to frontend and backend JavaScript application development","language":"en","currency":"USD","id":"1491955635","title":"Mastering Modular JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ndpqDwAAQBAJ&source=gbs_api","authors":["Nicolas Bevacqua"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HdOW3luqHZwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"The practicing programmer’s Deitel guide to XHTML, CSS, JavaScript, XML and Ajax RIA development. This book applies the Deitel signature live-code approach to teaching the client side of Rich Internet Applications (RIA) development. The book presents concepts in the context of 100+ fully tested programs (6,000+ lines of code), complete with syntax shading, detailed descriptions and sample outputs. The book features over 150 tips that will help you build robust client-side web applications. Start with an introduction to Extensible HyperText Markup Language (XHTML) and Cascading Style Sheets (CSS), then rapidly move on to the details of JavaScript programming. Finish with more advanced client-side development technologies including XHTML’s Document Object Model (DOM), Extensible Markup Language (XML), XML’s DOM, JavaScript Object Notation (JSON) and Asynchronous JavaScript and XML (Ajax). When you’re finished, you’ll have everything you need to build the client side of Web 2.0 Rich Internet Applications (RIAs). The book culminates with several substantial Ajax-enabled RIAs, including a book cover viewer (JavaScript\/DOM), an address book (Ajax\/consuming web services) and a calendar application (Ajax\/Dojo\/consuming web services). TheDeitel Developer Seriesis designed for professional programmers. The series presents focused treatments of emerging technologies, including .NET, Java, web services, Internet and web development and more.","language":"en","currency":"USD","id":"9780137013111","title":"JavaScript for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HdOW3luqHZwC&source=gbs_api","authors":["Paul Deitel","Harvey M. Deitel"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ex0qfJVhRgIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Exploring JavaScript and the Modern DOM","description":"With DOM Enlightenment, you’ll learn how to manipulate HTML more efficiently by scripting the Document Object Model (DOM) without a DOM library. Using code examples in cookbook style, author Cody Lindley (jQuery Cookbook) walks you through modern DOM concepts to demonstrate how various node objects work. Over the past decade, developers have buried the DOM under frameworks that simplify its use. This book brings these tools back into focus, using concepts and code native to modern browsers. If you have JavaScript experience, you’ll understand the role jQuery plays in DOM scripting, and learn how to use the DOM directly in applications for mobile devices and specific browsers that require low overhead. Understand JavaScript node objects and their relationship to the DOM Learn the properties and methods of document, element, text, and DocumentFragment objects Delve into element node selecting, geometry, and inline styles Add CSS style sheets to an HTML document and use CSSStyleRule objects Set up DOM events by using different code patterns Learn the author’s vision for dom.js, a jQuery-inspired DOM Library for modern browsers","language":"en","currency":"USD","id":"1449344518","title":"DOM Enlightenment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ex0qfJVhRgIC&source=gbs_api","authors":["Cody Lindley"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F_BuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.6,"subtitle":null,"description":"JavaScriptJavaScriptJavaScriptJavaScriptJavaScript","language":"zh-TW","currency":"USD","id":"9576814588","title":"JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F_BuDwAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":840,"thumbnail":"http:\/\/books.google.com\/books\/content?id=v2KIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.81,"subtitle":null,"description":"HTML+CSS+JavaScriptHTML+CSS+JavaScriptWebWeb 24HTMLHTML 5CSSCSSCSSJavaScriptJavaScriptJavaScriptJavaScriptCSSAjaxjQuery4Web 1368 2 34 4380301770 5 ","language":"zh-CN","currency":"USD","id":"7302423903","title":"HTML+CSS+JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=v2KIDwAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kvxvDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Hone your skills by learning classic data structures and algorithms in JavaScript About This Book Understand common data structures and the associated algorithms, as well as the context in which they are used. Master existing JavaScript data structures such as array, set and map and learn how to implement new ones such as stacks, linked lists, trees and graphs. All concepts are explained in an easy way, followed by examples. Who This Book Is For If you are a student of Computer Science or are at the start of your technology career and want to explore JavaScript's optimum ability, this book is for you. You need a basic knowledge of JavaScript and programming logic to start having fun with algorithms. What You Will Learn Declare, initialize, add, and remove items from arrays, stacks, and queues Get the knack of using algorithms such as DFS (Depth-first Search) and BFS (Breadth-First Search) for the most complex data structures Harness the power of creating linked lists, doubly linked lists, and circular linked lists Store unique elements with hash tables, dictionaries, and sets Use binary trees and binary search trees Sort data structures using a range of algorithms such as bubble sort, insertion sort, and quick sort In Detail This book begins by covering basics of the JavaScript language and introducing ECMAScript 7, before gradually moving on to the current implementations of ECMAScript 6. You will gain an in-depth knowledge of how hash tables and set data structure functions, as well as how trees and hash maps can be used to search files in a HD or represent a database. This book is an accessible route deeper into JavaScript. Graphs being one of the most complex data structures you'll encounter, we'll also give you a better understanding of why and how graphs are largely used in GPS navigation systems in social networks. Toward the end of the book, you'll discover how all the theories presented by this book can be applied in real-world solutions while working on your own computer networks and Facebook searches. Style and approach This book gets straight to the point, providing you with examples of how a data structure or algorithm can be used and giving you real-world applications of the algorithm in JavaScript. With real-world use cases associated with each data structure, the book explains which data structure should be used to achieve the desired results in the real world.","language":"en","currency":"USD","id":"178355388X","title":"Learning JavaScript Data Structures and Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kvxvDQAAQBAJ&source=gbs_api","authors":["Loiane Groner"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oU_bPMt0Se4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.08,"subtitle":null,"description":"100 CSS power solutions in one handy guide This practical resource contains 100 ready-to-run CSS plug-ins you can use to create dynamic Web content. All of the plug-ins include HTML examples and screen shots showing specific end results you can achieve right away. Methods for using CSS with JavaScript and HTML5 to make Web pages even more interactive and dynamic are also included. Using these plug-ins, you'll be able to build CSS projects more quickly and easily than ever, as many complex tasks are reduced to a single class. Get ready-made CSS plug-ins for: Manipulating objects Text and typography Menus and navigation Page layout Visual effects Dynamic objects Dynamic text and typography Dynamic interaction Incorporating JavaScript Clickable and RSS buttons Borders Rollover effects Horizontal and vertical animated tabs And much more Download all of the plug-ins at the book's companion website.","language":"en","currency":"USD","id":"0071748776","title":"Plug-In CSS 100 Power Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oU_bPMt0Se4C&source=gbs_api","authors":["Robin Nixon"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tjjrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Modern Patterns for Developing React Apps","description":"If you want to learn how to build efficient React applications, this is your book. Ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, this updated edition provides best practices and patterns for writing modern React code. No prior knowledge of React or functional JavaScript is necessary. With their learning road map, authors Alex Banks and Eve Porcello show you how to create UIs that can deftly display changes without page reloads on large-scale, data-driven websites. You’ll also discover how to work with functional programming and the latest ECMAScript features. Once you learn how to build React components with this hands-on guide, you’ll understand just how useful React can be in your organization. Understand key functional programming concepts with JavaScriptLook under the hood to learn how React runs in the browserCreate application presentation layers with React componentsManage data and reduce the time you spend debugging applicationsIncorporate React Hooks to manage state and fetch dataUse a routing solution for single-page application featuresLearn how to structure React applications with servers in mind","language":"en","currency":"USD","id":"1492051675","title":"Learning React","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tjjrDwAAQBAJ&source=gbs_api","authors":["Alex Banks","Eve Porcello"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AImMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.66,"subtitle":null,"description":"Bring in more customers with your own web site! Take your business online and start generating additional revenue with help from this highly visual, easy-to-follow guide. Small Business Web Sites Made Easy shows you how to use HTML, CSS, JavaScript, PHP, and other tools to create a compelling site that's functional, flexible, secure, and ready for commercial transactions. The book also covers the fundamentals of web-based marketing, including search engine optimization and pay-per-click advertising. Now you can establish a solid online presence without the expense of hiring a designer! Learn essential HTML skills Plan your site architecture Add style to your web site using Cascading Style Sheets (CSS) Make your pages come alive with JavaScript elements Increase leads, conversions, and sales using search engine optimization (SEO) Set up pay-per-click advertising, including Google AdWords Track metrics with hit meters Market your site on Facebook Create a shopping cart and enable credit card transactions","language":"en","currency":"USD","id":"0071815821","title":"Small Business Web Sites Made Easy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AImMBAAAQBAJ&source=gbs_api","authors":["Steven Holzner"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8J_3BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.33,"subtitle":null,"description":"*HTMLDOM *CSSJavaScriptCSS *jQuery *FireBugJavaScript *jQuery *jQueryAjaxjQueryjQuery UI *jQuery MobileMobile Web *Node.js JavaScriptjQuery jQuery MobileJavaScriptMobile Web Node.jsJavaScriptWebMVCWeb # GOTOP Information Inc.","language":"zh-TW","currency":"USD","id":"9863474215","title":"JavaScript+jQuery Mobile+Node.js()","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8J_3BQAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6JEDEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":null,"description":"Ce livre s’adresse  tous les dveloppeurs web, qu’ils soient dbutants ou avancs. Le JavaScript sert avant tout  rendre les pages web interactives et dynamiques du ct de l’utilisateur, mais il est galement de plus en plus souvent utilis ct serveur. La premire partie de ce livre explique les bases et les bonnes pratiques de la programmation en JavaScript en se fondant sur la version ECMAScript 6. La deuxime partie porte sur l’interactivit avec les utilisateurs (interfaces, formulaires, gestion des erreurs, golocalisation...). La troisime partie permet de s’initier aux aspects les plus avancs de JavaScript tels que Node.js, React ou les Web Workers. Les renvois de type tjs.ovh\/nomScript qui sont prsents au fil des pages sont des complments interactifs  ce livre. Ils affichent : Le rendu de l’excution du script. Un mulateur de la console du navigateur. Le code source complet de l’exemple avec une coloration syntaxique, des commentaires et des liens vers les fiches de la rfrence JS du site toutjavascript.com. Cette deuxime dition a t actualise en profondeur. Elle est toffe par deux nouveaux chapitres sur Vue.js, sur Google Sheet et sur Docker.","language":"fr","currency":"USD","id":"2100818961","title":"Tout JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6JEDEAAAQBAJ&source=gbs_api","authors":["Olivier Hondermarck"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xlSIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.25,"subtitle":null,"description":"JavaScriptWebJavaScriptECMAScriptDOMBOM WebJavaScript","language":"zh-CN","currency":"USD","id":"7302467943","title":"JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xlSIDwAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=r9RLtcp_1rsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Designing, Theming, Scripting","description":"“For Drupal to succeed, we need books like this.” –Dries Buytaert, Drupal founder and project lead “Drupal faces a common problem on the Web–the relative lack of new, high quality themes. Front End Drupal tackles this problem directly and is designed to help both experienced designers and rank novices get an understanding of how Drupal theming works. In fact, I’ll be the first to admit I learned a lot from this book.” – Dries Buytaert, Drupal founder and project lead The Practical, Complete Guide to Customizing Drupal Sites with Behaviors, Themes, and Templates Drupal is now the world’s #1 open source content management system: Thousands of individuals and organizations are using it to build and update Web sites of virtually every kind. As Web designers and developers adopt Drupal, they need ways to quickly customize the visuals and interactivity of their sites. Drupal offers powerful tools for doing so, but little guidance on using them effectively. Front End Drupal is the solution. In this book, two expert Drupal developers cover everything you need to know to create great visual designs and state-of-the-art interactivity with Drupal’s behaviors, themes, and templates. Front End Drupal is 100% focused on issues of site design, behavior, usability, and management. The authors show how to style Drupal sites, make the most of Drupal’s powerful templating system, build sophisticated community sites, streamline site management, and build more portable, flexible themes. You’ll also gain hands-on experience through several case studies that walk you through the customization of everything from page templates to Web site forums. Prepare and organize content so it’s easier to integrate into Drupal Web sites Structure Drupal page templates that are easy to work with Configure Drupal with the modules and browser tools you need to customize your site Utilize Drupal’s Starter Themes and themes converted from WordPress, Joomla!, and Drupal 5.x Maximize the power and usability of Drupal’s content editing forms Build usable community sites with user profiles, comments, and user-generated content Use JavaScript to make your themes interactive and to enhance usability Create powerful animations and AJAX callbacks with jQuery, Drupal’s JavaScript library About the Web Site The accompanying site, frontenddrupal.com, contains all sample code and themes presented in this book.","language":"en","currency":"USD","id":"0132703033","title":"Front End Drupal","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=r9RLtcp_1rsC&source=gbs_api","authors":["Konstantin Kfer","Emma Jane Hogbin"]},{"pageCount":620,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gJrmszNHQV4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Leading Programmers Explain How They Think","description":"How do the experts solve difficult problems in software development? In this unique and insightful book, leading computer scientists offer case studies that reveal how they found unusual, carefully designed solutions to high-profile projects. You will be able to look over the shoulder of major coding and design experts to see problems through their eyes. This is not simply another design patterns book, or another software engineering treatise on the right and wrong way to do things. The authors think aloud as they work through their project's architecture, the tradeoffs made in its construction, and when it was important to break rules. This book contains 33 chapters contributed by Brian Kernighan, KarlFogel, Jon Bentley, Tim Bray, Elliotte Rusty Harold, Michael Feathers,Alberto Savoia, Charles Petzold, Douglas Crockford, Henry S. Warren,Jr., Ashish Gulhati, Lincoln Stein, Jim Kent, Jack Dongarra and PiotrLuszczek, Adam Kolawa, Greg Kroah-Hartman, Diomidis Spinellis, AndrewKuchling, Travis E. Oliphant, Ronald Mak, Rogerio Atem de Carvalho andRafael Monnerat, Bryan Cantrill, Jeff Dean and Sanjay Ghemawat, SimonPeyton Jones, Kent Dybvig, William Otte and Douglas C. Schmidt, AndrewPatzer, Andreas Zeller, Yukihiro Matsumoto, Arun Mehta, TV Raman,Laura Wingerd and Christopher Seiwald, and Brian Hayes. Beautiful Code is an opportunity for master coders to tell their story. All author royalties will be donated to Amnesty International.","language":"en","currency":"USD","id":"9780596554675","title":"Beautiful Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gJrmszNHQV4C&source=gbs_api","authors":["Greg Wilson","Andy Oram"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jGN4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Professionell programmieren im Browser und auf dem Server","description":"Immer mehr Programmierer von Enterprise-Anwendungen interessieren sich fr JavaScript. Sie wollen sich schnell darin einarbeiten, sind aber oft nicht mit den gngigen JavaScript-Bchern fr Webentwickler zufrieden. Nach einem schnellen berblick ber die JavaScript-Kernkonzepte geht es in diesem Buch daher ohne Umschweife an die spannenden Themen, u.a.: funktionales, prototypisches und objektorientiertes Programmieren, Testen, Packaging, Entwurfsmuster, jQuery und node.js. Kenntnisse in der Webentwicklung sind erforderlich, Jave-EE-oder .NET-Erfahrung ist hilfreich.","language":"de","currency":"USD","id":"3864911273","title":"JavaScript fr Enterprise-Entwickler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jGN4DwAAQBAJ&source=gbs_api","authors":["Oliver Ochs"]},{"pageCount":174,"thumbnail":"http:\/\/books.google.com\/books\/content?id=appNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Building Accessible and Performant Web Apps","description":"Get a brisk introduction to building fast, interactive single-page web applications with Vue.js, the popular JavaScript framework that organizes and simplifies web development. With this practical guide, you’ll quickly move from basics to custom components and advanced features—including JSX, the JavaScript syntax extension. Author Callum Macrae shows you how to use the most useful libraries in the Vue ecosystem, such as vue-router for routing, vuex for state management, and vue-test-utils for testing. If you’re a frontend developer familiar with JavaScript, HTML, and CSS, this book will show you how to develop a fully featured web application using Vue. Learn Vue.js basics, including its use of templates to display data on a page Set up Vue projects from scratch, or use vue-cli to set up from a template Create a maintainable codebase by splitting code into self-contained components Discover how Vue.js works with CSS to style your websites and applications Use render functions and JSX, rather than templates, to determine what Vue displays Control how code is executed and displayed with vue-router Manage state in one centralized place with the Vuex library Write unit tests to ensure your Vue components don’t break in the future","language":"en","currency":"USD","id":"1491997192","title":"Vue.js: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=appNDwAAQBAJ&source=gbs_api","authors":["Callum Macrae"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ti14DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":null,"description":"Das populre Framework AngularJS macht die Komplexitt moderner JavaScript- und Single-Page-Anwendungen (SPA) fr Entwickler beherrschbar. Es untersttzt bei immer wiederkehrenden Aufgaben wie Datenbindung, Validierung oder Routing\/Deep-Linking. Die Tatsache, dass sowohl Google als auch eine riesige Community hinter AngularJS stehen, schafft darber hinaus Vertrauen. Dieses Buch zeigt, wie Sie von AngularJS in Ihren Projekten profitieren. Dabei beschrnkt es sich nicht nur auf die Grundlagen, sondern geht auch auf die zahlreichen Mglichkeiten zur Erweiterung mit Blick auf die eigenen Bedrfnissen ein. Die Autoren gehen auch auf das Zusammenspiel mit anderen Technologien und Standards wie RequireJS, Yoeman, Bower, Grunt, TypeScript oder OAuth 2.0. ein. Aus dem Inhalt: - Moderne JavaScript-basierte Single-Page-Applications (SPA) mit AngularJS erstellen - RESTful Services via AJAX anbinden - Formulare bereitstellen und Eingaben validieren - Logische Seiten innerhalb einer SPA mit Routing und Deep-Linking realisieren - Internationalisierung von Ein- und Ausgaben - Umgang mit mobilen und touch-basierten Anwendungen sowie Animationen - Testautomatisierung mit Jasmine - AngularJS an eigene Bedrfnisse anpassen - Wiederverwendbare Komponenten mit Direktiven bereitstellen - Moderne Security-Szenarien umsetzen - AngularJS mit anderen Technologien und Standards wie RequireJS, Yoeman, Bower, Grunt, TypeScript oder OAuth 2.0 kombinieren","language":"de","currency":"USD","id":"3955619524","title":"Angular JS: Moderne Webanwendungen und Single Page Applications mit JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ti14DwAAQBAJ&source=gbs_api","authors":["Manfred Steyer","Vildan Softic"]},{"pageCount":407,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TpxQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Learn to Expedite and Improve your Web Development","description":"Learn to create speedy cross-platform applications with ease using Webix. You will begin with an introduction to Webix and basic usage, exploring the interface components and utilities it offers, as well as the tools available (skin builder, form builder, and code snippet testing facility). You’ll understand how Webix can integrate with other popular libraries and frameworks including Angular, Vue, React and more (as well as third-party components like dHTMLx and rich text editors). You will learn tangential topics including communication with back-end systems (Node.js and common related tooling), packaging as a Cordova app and, of course, you will learn how to use Webix following the Progressive Web App delivery mechanism. Offering a complete solution in a single bundle, this JavaScript UI framework provides a rich set of interface components, application architecture direction and commonly-needed utility and ancillary capabilities.Every topic will be taught a practical way, explored within the context of building real-world working apps, not through unrelated snippets. Bringing 25 years of professional development experience to the table, author Frank Zammetti uses his unique levity to teach you how to get up and running with this new and upcoming framework. What You’ll Learn Explore the capabilities and UI widgets it provides and the features that make it stand out from its competitors Build one web technology-based app that works on both desktops and mobile devices (Android and iOS) Create and hook a Webix app up to a Node.js\/Express-based RESTful server API for data storage Mobilize a Webix app using both PhoneGap and Progressive Web App techniques Enhance your Webix and general development skills in the most fun way possible: by building a game Who This Book Is For Moderately experienced front-end developers who want to learn about Webix and the power it brings to client-side development. Developers looking to use their web development skills to build cross-platform apps that work on both desktop and mobile devices with Webix as the foundation. A working knowledge of CSS, HTML and JavsScript is assumed, though you don’t need to be an expert.","language":"en","currency":"USD","id":"1484233840","title":"Practical Webix","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TpxQDwAAQBAJ&source=gbs_api","authors":["Frank Zammetti"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EERbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.46,"subtitle":null,"description":"__,JavaScript_____ ______20 _,JavaScript_ __,_JavaScript___ ___———_———_ JavaScript Web_____, _____ ___, HTML _,_____ _______","language":"zh-CN","currency":"USD","id":"7550421722","title":"JavaScript__\/","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EERbDwAAQBAJ&source=gbs_api","authors":["__,___",""]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript  un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e pu aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di pi... Anche se JavaScript  il linguaggio di programmazione client side al giorno d'oggi pi diffuso, pu essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo pu darvi un risultato doppio, perch questo linguaggio continua ad espandersi in sempre pi aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo  ci che vi dar questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si pu usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perch sono cos comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T8DUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.12,"subtitle":null,"description":"WebHTMLHTMLCSSJavaScript","language":"zh-CN","currency":"USD","id":"7111480481","title":"HTML+CSS+JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T8DUDwAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=itd2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.99,"subtitle":"Das Praxisbuch fr Web-Entwickler","description":"Fast alle Webseiten haben eines gemeinsam: Sie bestehen aus JavaScript-, HTML- und CSS-Code. Whrend HTML und CSS stagnieren, hat sich Java- Script mit Ajax zur dominierenden Web-2.0-Technik weiterentwickelt. Dieses Buch vermittelt anhand konkreter Programmierbeispiele die Grundlagen und einige fortgeschrittene Techniken von JavaScript und Ajax.","language":"de","currency":"USD","id":"3645220364","title":"JavaScript und Ajax","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=itd2DwAAQBAJ&source=gbs_api","authors":["Jan Winkler"]},{"pageCount":45,"thumbnail":"http:\/\/books.google.com\/books\/content?id=25a4DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3,"subtitle":null,"description":"Fatigu d'essayer d'apprendre  programmer? Prt  vraiment apprendre comment programmer? Si vous avez essay d'apprendre  programmer par le pass, mais n'avez pas eu beaucoup de succs, tentez le coup avec le livre  Programmer en JavaScript . Il vous apprendra exactement ce que vous devez savoir sur le langage de script le plus largement utilis dans le monde aujourd'hui. Vous commencerez par le dbut et le livre vous permettra de progresser en vous basant sur ce que vous aurez acquis au fur et  mesure. Apprenez le JavaScript une fois, utilisez-le encore et encore... Mme si le JavaScript est de loin le langage de programmation ct client le plus populaire en usage aujourd'hui, il peut aussi tre utilis ct serveur. Node.js, Meteor, Wakanda, CouchDB et MongoDB ne sont que quelques exemples de frameworks avec lesquels vous serez en mesure d'utiliser JavaScript ct serveur. Le temps que vous  apprendre le JavaScript peut tre doublement payant du fait que le JavaScript continue d’voluer dans de plus en plus de domaines de l'informatique. Si vous cherchez  amliorer votre CV pour votre carrire, la matrise du JavaScript est une comptence inestimable. Les comptences JavaScript sont trs fortement demandes et le besoin de personnes sachant programmer en JavaScript est en constante augmentation. Si vous cherchez  percer dans un domaine technique, quoi de mieux  ajouter sur votre CV que quelque chose qui peut tre utilis pratiquement partout? Vous voulez travailler sur le front-end (l’interface) de sites Web? Apprenez le JavaScript. Prt  attaquer la programmation back-end pour les applications Web et rseau? Apprenez le JavaScript. Vous souhaitez travailler sur les technologies de bases de donnes les plus rcentes? Apprenez le JavaScript. Apprenez le JavaScript de la bonne manire - une fois pour toutes... Peu importe si","language":"fr","currency":"USD","id":"1507139721","title":"Programmer en JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=25a4DQAAQBAJ&source=gbs_api","authors":["Preston Prescott"]},{"pageCount":936,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zyMUnspbsekC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The World’s Easiest Java Script Tutorial—Fully Updated! JavaScript by Example, Second Edition, is the easiest, most hands-on way to learn JavaScript. Legendary programming instructor Ellie Quigley has thoroughly updated her classic book to deliver the skills and information today’s JavaScript users need most—including up-to-the-minute coverage of JavaScript programming constructs, CSS, Ajax, JSON, and the latest JavaScript libraries and best practices. Quigley illuminates every technique with focused, classroom-tested code examples, detailed line-by-line explanations, and real program output. This exceptionally clear, easy-to-understand book takes you from your first script to advanced techniques. It’s the only JavaScript book you’ll ever need! New in This Edition End-of-chapter study tools, including classroom-tested labs Programming the DOM More Cascading Style Sheets Introduction to Ajax and JSON Explanation of how to develop interactive Web applications with dynamic, desktop-style interfaces Programmers’ preparation for HTML 5’s breakthrough capabilities This edition has been completely updated and includes many new and completely rewritten code examples; contains fully revised and updated coverage of Cascading Style Sheets (CSS) and the Document Object Model (DOM); and fully covers modern JavaScript concepts, principles, and programming techniques. Thousands of Web developers, administrators, and power users have relied on JavaScript by Example to become expert JavaScript programmers. With this new edition, you can, too—even if you’re completely new to JavaScript. After you’ve become an expert, you’ll turn to this book constantly as the best source for trustworthy answers, solutions, and code.","language":"en","currency":"USD","id":"9780137084760","title":"JavaScript by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zyMUnspbsekC&source=gbs_api","authors":["Ellie Quigley"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HuXuBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a JavaScript developer interested in learning functional programming, looking for the quantum leap towards mastering the JavaScript language, or just want to become a better programmer in general, then this book is ideal for you. It is aimed at programmers involved in developing reactive frontend apps, server-side apps that wrangle with reliability and concurrency, and everything in between.","language":"en","currency":"USD","id":"1784392405","title":"Functional Programming in JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HuXuBwAAQBAJ&source=gbs_api","authors":["Dan Mantyla"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RInpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.62,"subtitle":"","description":"HTML 5JavaScript *HTML 5HTML 4.01HTML 5articlesectionnavheaderfootervideoaudiocanvas *JavaScriptJavaScriptJavaScriptHTMLwindowJavaScriptdocumentelement *CSSXHTMLAjax *HTML 5 APIJavaScriptHTML 5 APICanvas APIVideo\/Audio APIDrag and Drop APIGeolocation API # GOTOP Information Inc.","language":"zh-TW","currency":"USD","id":"9863474665","title":"HTML5JavaScriptCSSXHTMLAjax ()()","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RInpBgAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":688,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CoubS6nNPboC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Master HTML and Web design using this resource filled with precise, proven techniques from today’s leading industry experts. Inside you’ll find quick and concise solutions that can be put to immediate use easily and effectively. Organized by topic and packed with critical information this is a must-have guide for every Web designer.","language":"en","currency":"USD","id":"0072228253","title":"HTML & Web Design Tips & Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CoubS6nNPboC&source=gbs_api","authors":["Kris Jamsa","Konrad King","Andy Anderson"]},{"pageCount":476,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BRZ4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":35.99,"subtitle":"Einfhrung, Programmierung und Referenz","description":"Verstndlich und praxisnah beschreibt Erfolgsautor Stefan Koch den JavaScript-Standard ECMAScript. Er erklrt u.a. browser- und plattformunabhngige Programmierung, Stylesheets und das Document Object Model, Anwenderfeedback durch Formulareingaben und Cookies. Ein Referenzteil ber die wichtigsten Objekte, die in den verschiedenen Browsern zur Verfgung stehen, ist auch fr den erfahrenen JavaScript-Programmierer von groem Wert. Die 6. Auflage wurde komplett durchgesehen, aktualisiert und um neue Themen wie HTML 5 erweitert.","language":"de","currency":"USD","id":"3864910552","title":"JavaScript (iX Edition)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BRZ4DwAAQBAJ&source=gbs_api","authors":["Stefan Koch"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RbT2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"68 Dinge, die ein guter JavaScript-Entwickler wissen sollte","description":"Wollen Sie JavaScript wirklich beherrschen? Dann sollten Sie die vielen ausdrucksstarken Besonderheiten der Sprache effektiv nutzen und ihre Fallstricke vermeiden knnen. Ganz gleich, wie lange Sie schon JavaScript-Code schreiben - dieses Buch wird Ihnen helfen, Ihr Verstndnis dieser leistungsfhigen Programmiersprache zu vertiefen und zuverlssigen, wartbaren Code zu schreiben. Anhand zahlreicher praktischer Beispiele vermittelt Ihnen dieses Buch 68 Anstze fr besseren JavaScript-Code. Sie lernen, fr jedes Projekt den passenden Programmierstil zu whlen, mit unvorhergesehenen Problemen umzugehen und das Potenzial von JavaScript gezielt einzusetzen. Dabei geht es u.a. um: • Verbesserte Vorgehensweisen fr die prototypbasierte objektorientierte Programmierung • Feinheiten beim Umgang mit Arrays und Dictionary-Objekten • Praktische Erluterungen der JavaScript-Funktionen und der Semantik von Gltigkeitsbereichen • Ntzliche JavaScript-Muster und -Idiome, wie Optionsobjekte und Method Chaining • Tief gehende Beschreibung des \"Run-to- Completion\"-Ansatzes fr Nebenlufigkeit Der Autor David Herman ist seit Jahren Mitglied im JavaScript-Standardisierungskomitee TC 39 der Ecma. In diesem Buch beleuchtet er die inneren Funktionen der Sprache anschaulich und praxisorientiert. Er zeigt Ihnen, wie Sie die Vorzge von JavaScript in ihrer ganzen Breite nutzen knnen, und bietet bewhrte Techniken und Anstze, auf die Sie sich in den kommenden Jahren verlassen knnen.","language":"de","currency":"USD","id":"3864914248","title":"JavaScript effektiv","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RbT2DwAAQBAJ&source=gbs_api","authors":["David Herman"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tf--AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"What every web developer should know about networking and web performance","description":"How prepared are you to build fast and efficient web applications? This eloquent book provides what every web developer should know about the network, from fundamental limitations that affect performance to major innovations for building even more powerful browser applications—including HTTP 2.0 and XHR improvements, Server-Sent Events (SSE), WebSocket, and WebRTC. Author Ilya Grigorik, a web performance engineer at Google, demonstrates performance optimization best practices for TCP, UDP, and TLS protocols, and explains unique wireless and mobile network optimization requirements. You’ll then dive into performance characteristics of technologies such as HTTP 2.0, client-side network scripting with XHR, real-time streaming with SSE and WebSocket, and P2P communication with WebRTC. Deliver superlative TCP, UDP, and TLS performance Speed up network performance over 3G\/4G mobile networks Develop fast and energy-efficient mobile applications Address bottlenecks in HTTP 1.x and other browser protocols Plan for and deliver the best HTTP 2.0 performance Enable efficient real-time streaming in the browser Create efficient peer-to-peer videoconferencing and low-latency applications with real-time WebRTC transports","language":"en","currency":"USD","id":"1449344720","title":"High Performance Browser Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tf--AAAAQBAJ&source=gbs_api","authors":["Ilya Grigorik"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5yl-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.33,"subtitle":null,"description":" PC (mobile first)   HTML5  CSS3Box Model2D\/3DPC  JavaScriptDOMJavaScript  jQuery  Bootstrap 4PCOne Web One URL ()   jQuery MobilejQuery Mobile # GOTOP Information Inc.","language":"zh-TW","currency":"USD","id":"9864769502","title":"()- HTML5CSS3JavaScriptjQueryBootstrap()","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5yl-DwAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qdJsTgTL0boC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Using JavaScript to Create Rich Internet Applications","description":"AJAX: fast mastery for experienced Web developers! Already an experienced Web developer? Apply your skills in today’s fastest-growing area of Web development: AJAX! Building on what you already know, this fast-paced guide will show you exactly how to create rich, usable Internet applications. Joshua Eichorn teaches through sophisticated code examples, including extensive server-side PHP code. You won’t just learn how to code AJAX applications: Eichorn covers the entire development lifecycle, from use cases and design through debugging. He also presents detailed application case studies, including a start-to-finish update of a non-AJAX application that addresses everything from feature improvements to changing usage patterns. Coverage includes:  How AJAX changes the conventional Web development cycle  Problems created by the AJAX paradigm -- and how to avoid them  Adding AJAX to existing Web applications: key considerations  Using core AJAX technologies, including the XMLHttpRequest object  Consuming data returned to an AJAX application using both XSLT and JSON  Building more usable AJAX applications: guidelines and downloadable resources  Use cases: solving real-world problems in the AJAX environment  Libraries and toolkits for simplifying AJAX development, including Sarissa, scriptaculous, and HTML_AJAX  A complete guide to AJAX debugging  Supporting browsers without XMLHttpRequest by using IFrames or cookies  JSON data encoding debugging guide, which covers tools for Firefox and Internet Explorer  A list of libraries, which includes PHP, .NET, Java, and other libraries that can be used with any server language","language":"en","currency":"USD","id":"0132715856","title":"Understanding AJAX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qdJsTgTL0boC&source=gbs_api","authors":["Joshua Eichorn"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XaUfBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31,"subtitle":null,"description":"Essential Skills—Made Easy! PHP and MySQL Web Development: A Beginner's Guide takes you from building static web pages to creating comprehensive database-driven web applications. The book reviews HTML, CSS, and JavaScript and then explores PHP--its structure, control statements, arrays, functions, use with forms, and file handling capabilities. Next, the book examines MySQL, including SQL, the MySQL command set, and how to use it with PHP to create a relational database and build secure, databasedriven web applications. This practical resource features complete, step-by-step examples with code that you can use as templates for your own projects. Designed for Easy Learning Key Skills & Concepts--Chapter-opening lists of specific skills covered in the chapter Try This--Hands-on exercises that show you how to apply your skills Notes--Extra information related to the topic being covered Tips--Helpful reminders or alternate ways of doing things Cautions--Errors and pitfalls to avoid Self Tests--End-of-chapter quizzes to reinforce your skills Annotated Syntax--Example code with commentary that describes the programming techniques being illustrated Ready-to-use code at www.mhprofessional.com","language":"en","currency":"USD","id":"0071837310","title":"PHP and MySQL Web Development: A Beginner’s Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XaUfBQAAQBAJ&source=gbs_api","authors":["Marty Matthews"]},{"pageCount":234,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ep54DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"Das Handbuch fr den professionellen Programmierer","description":"Entwickeln oder warten Sie JavaScript-Webapplikationen und haben immer ein ungutes Gefhl, wenn Sie Ihre Software in Betrieb nehmen? Dann wird es hchste Zeit, dass Sie sich mit testgetriebener Entwicklung vertraut machen. Dieses Buch zeigt JavaScript-Entwicklern, wie Test-Driven Development (TDD) in der Praxis funktionieren kann. Anschaulich macht Sie Sebastian Springer zunchst mit den allgemeinen TDD-Grundlagen vertraut. Er zeigt, wie Sie diese auf das JavaScript-Umfeld bertragen knnen und stellt verschiedene Testframeworks vor (Jasmine, QUnit, Karma und JsTestDriver). In einer ausfhrlichen Beispielanwendung knnen Sie das Gelernte dann im Red-Green-Refactor- Zyklus praktisch nachvollziehen und ben. Darauf aufbauend lernen Sie weitere Facetten der testgetriebenen Entwicklung mit JavaScript kennen, die fr Ihre tgliche Arbeit hilfreich oder notwendig sind, u.a.: • Testinfrastruktur fr mehrere Browser • Spys, Stubs und Mocks • Abhngigkeiten vom DOM • Asynchrone Operationen • Testen von Bestandscode • Node.js-Anwendungen testgetrieben entwickeln • Werkzeuge, die das Testen leichter machen TDD-Einsteiger haben nach der Lektre einen berblick ber TDD im JavaScript-Umfeld und knnen eigene Projekte testgetrieben durchfhren. JavaScript-Entwickler, die bereits testgetrieben entwickeln, knnen die fortgeschrittenen Kapitel zum Nachschlagen und Vertiefen verwenden. Vorausgesetzt werden Erfahrungen in der JavaScript-Entwicklung.","language":"de","currency":"USD","id":"3864916488","title":"Testgetriebene Entwicklung mit JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ep54DwAAQBAJ&source=gbs_api","authors":["Sebastian Springer"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G3MLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.33,"subtitle":null,"description":"   *HTML5 *CSS3Box ModelPC *JavaScriptDOMwindowdocumentelementJavaScript *jQuery *jQuery UI *AjaxJSON * (RWDResponsive Web Design) PC # GOTOP","language":"zh-TW","currency":"USD","id":"9865026295","title":"HTML5CSS3JavaScriptjQueryjQuery UIAjaxRWD()()","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G3MLEAAAQBAJ&source=gbs_api","authors":[""]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oK32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Einfach programmieren lernen mit der Sprache des Web","description":"JavaScript ist die Programmiersprache des Internet, die geheime Zutat, die deine Lieblingssites so fantastisch macht und Online-Spiele zum Laufen bringt! \"JavaScript kinderleicht\" zeigt dir (und deinen Eltern) die Welt der Programmierung im Web. Nick Morgan fhrt dich Schritt fr Schritt durch die Grundlagen von JavaScript. Du experimentierst mit einzigartigen (und oft urkomischen) Beispielprogrammen, die du sofort in deinem Webbrowser ausprobieren kannst. Neue Begriffe werden erklrt; der Programmcode ist farbig dargestellt, strukturiert und mit Erklrungen versehen; witzige Abbildungen erhhen den Lernspa. Du beginnst mit den Grundlagen, etwa mit Strings, Arrays und Schleifen, und gehst dann zu fortgeschrittenen Aufgaben ber: Du entwickelst mit jQuery interaktive Elemente, lernst objektorientiert zu programmieren oder wie man auf Browser-Klicks reagiert. Schlielich programmierst du Spiele wie \"Schatzsuche\", \"Hangman\" und \"Snake\". Du lernst auch, wie du • Funktionen einsetzt und wie sie helfen, bersichtliche Programme zu schreiben, • HTML schreibst und vernderst, um dynamische Webseiten zu entwickeln, • deine Webseiten mithilfe des DOM und von jQuery auf Benutzereingaben reagieren lsst, • mit dem Canvas-Element Grafiken zeichnest und animierst • benutzergesteuerte Spiele mit Kollisionserkennung und Spielstnden programmierst Alle Kapitel bauen aufeinander auf. Die Programmieraufgaben am Ende jedes Kapitels fordern dich heraus und animieren dich, deine eigenen, tollen Programme zu schreiben.","language":"de","currency":"USD","id":"3864917301","title":"JavaScript kinderleicht!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oK32DwAAQBAJ&source=gbs_api","authors":["Nick Morgan"]},{"pageCount":136,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DSF4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Verstndlicher, flexibler und effizienter programmieren","description":"Wenn Sie mit Programmiersprachen wie C++ oder Java vertraut sind, erscheint Ihnen JavaScript kaum objektorientiert. JavaScript kennt kein Klassenkonzept und Sie mssen nicht einmal Objekte definieren, um Programme zu erstellen. Lassen Sie sich aber nicht tuschen: JavaScript ist eine auerordentlich mchtige und ausdrucksstarke objektorientierte Sprache, die Ihnen selbst zahlreiche Designentscheidungen berlsst. In diesem kompakten Buch erforscht Nicholas Zakas mit Ihnen die objektorientierte Natur der Sprache und legt die einzigartige Implementierung der Vererbung und anderer Schlsselkonzepte offen. Er erklrt Ihnen, wie Sie Kapselung, Aggregation, Vererbung und Polymorphismus umsetzen knnen, wenn sie JavaScript-Code schreiben. Im Einzelnen erfahren Sie, • welche Unterschiede es zwischen primitiven und Referenztypen gibt, • was JavaScript-Funktionen so einzigartig macht, • auf welche verschiedenen Arten Sie Objekte definieren, • wie Sie Ihren eigenen Konstruktor erzeugen und mit Prototypen arbeiten, • welche Vererbungsmuster fr Typen und Objekte mglich sind. Das Buch fhrt auch erfahrene Programmierer zu einem tieferen Verstndnis von JavaScript. Es ermglicht Ihnen damit, besser strukturierten, flexibleren und effizienteren JavaScript-Code zu schreiben. Autor Nikolas Zakas arbeitet als Entwickler im JavaScript-Umfeld und ist durch zahlreiche Verffentlichungen und Vortrge bekannt. Er ist bereits Autor mehrerer erfolgreicher Bcher zu JavaScript.","language":"de","currency":"USD","id":"3864915546","title":"JavaScript objektorientiert","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DSF4DwAAQBAJ&source=gbs_api","authors":["Nicholas C. Zakas"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q-I2M80f7KwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Brazilian designer Fbio Sasso, who has wildly popular design blog Abduzeedo, has created the definitive guide to design. This book features interviews with designers and offers tutorials on various design styles, an extension of what he does with his site abduzeedo.com. Each chapter addresses a particular style, e.g., Vintage, Neo-surrealism, Retro 80s, Light Effects, Collage, Vector, and starts off with an explanation about the style and techniques that go into that style. Next, the Abduzeedo Design Guide shows images from different visual artists illustrating each style. Fbio interviews a master of each style, such as, in the case of Retro Art, James White. Then he wraps up the chapter with a tutorial showing the elements and techniques for creating that style in Photoshop. Meant for beginning to intermediate designers as well as more experienced designers looking for inspiration, the book focuses on styles that can be applied both to web or print.","language":"en","currency":"USD","id":"9780132684729","title":"Abduzeedo Inspiration Guide for Designers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q-I2M80f7KwC&source=gbs_api","authors":["Fbio Sasso"]},{"pageCount":514,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lbX2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Roboter, Maker-Projekte und IoT-Gerte programmieren und steuern","description":"JavaScript ist die beliebteste Programmiersprache der Welt und der Standard fr Webcoder. Elektronikbastler steuern jedoch ihre Gerte im Internet der Dinge meist mit anderen Sprachen. Warum also nicht diese beiden kreativen Welten zusammenfhren? Dieses ansprechend illustrierte und praxisorientierte Buch bringt Ihnen bei, wie Sie mit JavaScript auf Plattformen wie Arduino, Tessel 2 und Raspberry Pi Wetterstationen, motorisierte Gelndefahrzeuge, Bluetooth-Trklingeln und vieles mehr konstruieren knnen. Schlieen Sie einfach alles an, von Motoren ber Touchscreens bis hin zu Bodenfeuchtesensoren, und schon geht's los! Mit dem node.js-Framework Johnny-Five sind Sie in der Lage, Arbeitsablufe fr die Entwicklung zu nutzen, die Ihnen als WebentwicklerIn vertraut sind. So macht Hardware-Prototyping Spa und funktioniert intuitiv und schnell. Die Kapselung des Verhaltens in Komponentenklassen, die Johnny-Five bietet, ist leicht zugnglich und der resultierende Code ist meist viel sauberer und leichter handzuhaben als viele Arduino-Bibliotheken. Auerdem knnen Sie ber den Package-Manager npm das nahezu unerschpfliche Angebot der weltweiten Node.js-Community nutzen und Module importieren. Sie erhalten einen intensiven Crash-Kurs in Grundlagen-Elektronik – Vorkenntnisse werden nicht erwartet. Schritt fr Schritt erweitert das Buch Ihr Wissen. Bald erschaffen Sie Ihre eigenen Konstruktionen, die aufleuchten, Gerusche erzeugen, Daten austauschen, sich bewegen oder ihre Umgebung wahrnehmen knnen. Verwenden Sie JavaScript, um das Internet der Dinge zum Leben zu erwecken!","language":"de","currency":"USD","id":"3960884222","title":"JavaScript fr Raspi, Arduino & Co.","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lbX2DwAAQBAJ&source=gbs_api","authors":["Lyza Danger Gardner"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wRZ4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.99,"subtitle":"Die Alternative zu JavaScript - eine kompakte Einfhrung","description":"CoffeeScript ist eine kleine Programmiersprache, die nach JavaScript bersetzt wird und versucht, ungeliebte Eigenschaften von JavaScript durch eine deutlich einfachere Syntax zu umgehen. Sie richtet sich an alle Webentwickler, denen JavaScript zu unhandlich ist oder die bei der Arbeit mit Ruby on Rails die CoffeeScript-Integration nutzen. Dieses Buch gibt Ihnen eine umfassende Einfhrung in die Sprache CoffeeScript. Anhand zahlreicher Beispiele lernen Sie die elegante Syntax sowie die Verwendung der Sprache praktisch kennen. Behandelt werden u.a. folgende Themen: • Syntax und Grundlagen • Objektorientierte Programmierung mit CoffeeScript • Testen mit Mocha und Chai • CoffeeScript in Ruby on Rails • Einsatz mit AngularJS und node.js Nach der Lektre des Buches sind Sie in der Lage, CoffeeScript zur Entwicklung dynamischer Webapplikationen, fr Kommandozeilen-Tools oder serverseitige Komponenten einzusetzen. Die Quellcodes zu diesem Buch findet man unter github.com\/aschubert\/coffeescript-buch","language":"de","currency":"USD","id":"3864916003","title":"CoffeeScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wRZ4DwAAQBAJ&source=gbs_api","authors":["Andreas Schubert"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iCn1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.99,"subtitle":"D3.js fr die Darstellung groer Datenmengen einsetzen","description":"Willkommen im Datenzeitalter. Ob Smartphone, DSL-Router oder auch beim Einkauf um die Ecke: Daten fallen berall in groer Menge an und werden gespeichert. Um diese groen Datenmengen effizient und nutzbringend einsetzen zu knnen, ist eine geeignete Darstellungsform notwendig. Mit D3.js steht eine JavaScript-Bibliothek bereit, um groe Datenmengen in unterschiedlichsten Diagrammtypen darstellen zu knnen. Werden Sie damit Herr der Daten. Bevor Sie eigene Diagramme mit D3.js erstellen knnen, mssen Sie sich mit der entsprechenden Syntax auseinandersetzen. Gull erklrt Ihnen die wichtigsten Regeln im ersten Kapitel. Danach geht es direkt ans Eingemachte: Balkendiagramme, Kreisdiagramme und animierte Diagramme. Erleben Sie die groen Mglichkeiten von D3 anhand von eigenen Diagrammen. Nach einem theoretischen und praktischen Einstieg in den ersten beiden Kapiteln widmet sich das Kapitel 3 einer groen Anwendung, dem Mtro Information Tracker. Hierbei nutzen Sie ffentlich zugngliche Daten (Open Data), um mit unterschiedlichen Diagrammen Informationen zur Mtro in Paris darzustellen. Hierbei setzen Sie sich mit allen Themen auseinander, die die moderne Webentwicklung zu bieten hat: HTML, CSS, JSON und SVG. In einem Force-Directed-Graph stellen Sie die Daten dar und reichern diesen mit SVG-Grafiken an. Nachdem Sie dieses Projekt selbst umgesetzt haben, sind Sie gewappnet fr eigene groe D3-Anwendungen. Der Quellcode steht auch online zur Verfgung. So lernen Ihre Modelle das Laufen! Erfahren Sie, wie Sie eine Armatur - eine Art Skelett - fr Ihre Charaktere erstellen und sie mit der 3-D-Grafik verknpfen. Anschlieend knnen Sie die Animationsphasen selbst erstellen und aufnehmen. Darber hinaus sehen Sie, wie Sie Licht und Schatten fr die Kameraaufnahme gekonnt einsetzen. Aus dem Inhalt: • Datendarstellung im Web mit D3 • Eigenheiten und Syntaxregeln • Plug-ins von D3.js • Document Object Model • Visualisierung von Daten","language":"de","currency":"USD","id":"3645203478","title":"BigData mit JavaScript visualisieren","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iCn1DwAAQBAJ&source=gbs_api","authors":["Clemens Gull"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=avqrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Learn everything from the basics of JavaScript to the new ES2020 features. Practice with more than 50 quizzes and dive into the basics of TypeScript.","description":"Whether you are a complete beginner or you have some knowledge in JavaScript, this book will guide you from the basics of the language to all the new features introduced until 2020. At the end of each chapter test your knowledge with quizzes. After reading this book, Let Const, generators, promises, and async won't be a problem anymore. If you want to experience something new, this book also includes an introduction to the basics of TypeScript, a must-know for any JavaScript develop in 2020.","language":"en","currency":"USD","id":"1080031294","title":"Complete Guide to Modern JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=avqrDwAAQBAJ&source=gbs_api","authors":["Alberto Montalesi"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_NG1hb_gezcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":52,"subtitle":"A Guide to Fusion Web Development","description":"Written by the most knowledgeable Oracle JDeveloper author team in the world This Oracle Press guide shows how to build Web applications using the Fusion Middleware development tool, Oracle JDeveloper. The book discusses the latest technologies and explains how to develop code using multiple techniques. Oracle JDeveloper 11g Handbook: A Guide to Fusion Web Development covers the Oracle Application Development Framework and JavaServer Faces. Hands-on practice examples walk you through the creation of a complete sample application that employs highly-interactive user interface components and declarative development methods. You will learn the techniques required to implement Fusion-oriented software solutions in JDeveloper.","language":"en","currency":"USD","id":"0071602399","title":"Oracle JDeveloper 11g Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_NG1hb_gezcC&source=gbs_api","authors":["Duncan Mills","Peter Koletzke","Avrom Roy-Faderman"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YemUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Making Your JavaScript Applications Scale","description":"Any programmer working with a dynamically typed language will tell you how hard it is to scale to more lines of code and more engineers. That’s why Facebook, Google, and Microsoft invented gradual static type layers for their dynamically typed JavaScript and Python code. This practical book shows you how one such type layer, TypeScript, is unique among them: it makes programming fun with its powerful static type system. If you’re a programmer with intermediate JavaScript experience, author Boris Cherny will teach you how to master the TypeScript language. You’ll understand how TypeScript can help you eliminate bugs in your code and enable you to scale your code across more engineers than you could before. In this book, you’ll: Start with the basics: Learn about TypeScript’s different types and type operators, including what they’re for and how they’re used Explore advanced topics: Understand TypeScript’s sophisticated type system, including how to safely handle errors and build asynchronous programs Dive in hands-on: Use TypeScript with your favorite frontend and backend frameworks, migrate your existing JavaScript project to TypeScript, and run your TypeScript application in production","language":"en","currency":"USD","id":"1492037605","title":"Programming TypeScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YemUDwAAQBAJ&source=gbs_api","authors":["Boris Cherny"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j0aYafxE2B4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Use CoffeeScript to Write Better JavaScript Code Than Ever Before! If you can do it in JavaScript, you can do it better in CoffeeScript. And, since CoffeeScript “compiles down” to JavaScript, your code will fit neatly into virtually any web environment. In Programming in CoffeeScript, Mark Bates shows web developers why CoffeeScript is so useful and how it avoids the problems that often make JavaScript code buggy and unmanageable. He guides you through every feature and technique you need to write quality CoffeeScript code and shows how to take advantage of CoffeeScript’s increasingly robust toolset. Bates begins with the absolute basics of running and compiling CoffeeScript and then introduces syntax, control structures, functions, collections, and classes. Through same page code comparisons, you’ll discover exactly how CoffeeScript improves on JavaScript. Next, you’ll put it to work in building applications that are powerful, flexible, maintainable, concise, reliable, and secure. Bates shares valuable tips for better development, illuminating CoffeeScript’s hidden gems and warning you about its remaining “rough edges.” The book concludes with a start-to-finish application case study showing how to code back-ends and front-ends and integrate powerful frameworks and libraries. Coverage includes Understanding the right ways to compile and execute CoffeeScript Using CoffeeScript’s clean syntax to focus on your code, not JavaScript’s distractions Working with CoffeeScript’s control structures, functions, and arguments Taking full advantage of CoffeeScript’s implementation of collections and iterators Leveraging CoffeeScript’s full class support to create complex data models Automating common application development tasks with Cake and Cakefiles Configuring Jasmine with CoffeeScript support, and using it to systematically test your code Writing Node.js server-side applications in CoffeeScript Using CoffeeScript to write jQuery and Backbone.js applications Integrating framework code to avoid “reinventing the wheel” Want a better way to create the JavaScript code your web applications need? CoffeeScript is the solution–and this book will help you master it!","language":"en","currency":"USD","id":"0132946149","title":"Programming in CoffeeScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j0aYafxE2B4C&source=gbs_api","authors":["Mark Bates"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NnR4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":35.99,"subtitle":"ASP.NET MVC im Zusammenspiel mit Web APIs und JavaScript-Frameworks","description":"Wer sich die Erstellung moderner Webanwendungen auf die Fahnen geheftet hat, muss eine Vielzahl an client- und serverseitigen Technologien kombinieren. Dieses Buch hilft Ihnen dabei, indem es auf die Technologien ASP.NET MVC, ASP.NET Web API, ASP.NET SignalR, Entity Framework sowie auf JavaScript-Frameworks, wie AngularJS, eingeht und deren Zusammenspiel erlutert. Daneben bespricht es ausgewhlte, fr die Entwicklung von Anwendungen interessante HTML-5-APIs, darunter die Browser-Datenbank IndexedDb und den Application Cache zur Bereitstellung offlinefhiger Web-Anwendungen. Auch die Themen Authentifizierung und Autorisierung kommen nicht zu kurz: Neben klassischen Mglichkeiten zum Umgang mit Benutzern werden zeitgeme, auf OAuth 2.0 und OpenId Connect basierende Security-Szenarien ausfhrlich behandelt. In diesem Zusammenhang beschreiben die Autoren auch die Umsetzung von Single-Sign-On-Szenarien mit firmeninternen sowie ffentlichen Login-in-Providern wie Google, Facebook oder Twitter.","language":"de","currency":"USD","id":"3955617424","title":"Moderne Web-Anwendungen mit ASP.NET MVC und JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NnR4DwAAQBAJ&source=gbs_api","authors":["Manfred Steyer","Holger Schwichtenberg"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Nq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Eine moderne Einfhrung in die Sprache des Web","description":"Das Buch ist eine Einfhrung in JavaScript, die sich auf gute Programmiertechniken konzentriert. Der Autor lehrt den Leser, wie man die Eleganz und Przision von JavaScript nutzt, um browserbasierte Anwendungen zu schreiben. Das Buch beginnt mit den Grundlagen der Programmierung - Variablen, Kontrollstrukturen, Funktionen und Datenstrukturen -, dann geht es auf komplexere Themen ein, wie die funktionale und objektorientierte Programmierung, regulre Ausdrcke und Browser-Events. Untersttzt von verstndlichen Beispielen wird der Leser rasch die Sprache des Web flieend 'sprechen' knnen.","language":"de","currency":"USD","id":"3864911907","title":"Die Kunst der JavaScript-Programmierung","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Nq32DwAAQBAJ&source=gbs_api","authors":["Marijn Haverbeke"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PgK1GbyiiDUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"The Definitive Guide","description":"Of all the Ajax-specific frameworks that have popped up in recent years, one clearly stands out as the industrial strength solution. Dojo is not just another JavaScript toolkit—it's the JavaScript toolkit—and Dojo: The Definitive Guide demonstrates how to tame Dojo's extensive library of utilities so that you can build rich and responsive web applications like never before. Dojo founder Alex Russell gives a foreword that explains the \"why\" of Dojo and of this book. Dojo provides an end-to-end solution for development in the browser, including everything from the core JavaScript library and turnkey widgets to build tools and a testing framework. Its vibrant open source community keeps adding to Dojo's arsenal, and this book provides an ideal companion to Dojo's official documentation. Dojo: the Definitive Guide gives you the most thorough overview of this toolkit available, showing you everything from how to create complex layouts and form controls closely resembling those found in the most advanced desktop applications with stock widgets, to advanced JavaScript idioms to AJAX and advanced communication transports. With this definitive reference you get: Get a concise introduction to Dojo that's good for all 1.x versions Well-explained examples, with scores of tested code samples, that let you see Dojo in action A comprehensive reference to Dojo's standard JavaScript library (including fundamental utilities in Base, Dojo's tiny but powerful kernel) that you'll wonder how you ever lived without An extensive look at additional Core features, such as animations, drag-and-drop, back-button handling, animations like wipe and slide, and more Exhaustive coverage of out-of-the-box Dijits (Dojo widgets) as well as definitive coverage on how to create your own, either from scratch or building on existing ones An itemized inventory of DojoX subprojects, the build tools, and the DOH, Dojo's unit-testing framework that you can use with Dojo—or anywhere else If you're a DHTML-toting web developer, you need to read this book—whether you're a one-person operation or part of an organization employing scores of developers. Dojo packs the standard JavaScript library you've always wanted, and Dojo: The Definitive Guide helps you transform your ideas into working applications quickly by leveraging design concepts you already know.","language":"en","currency":"USD","id":"059655172X","title":"Dojo: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PgK1GbyiiDUC&source=gbs_api","authors":["Matthew A. Russell"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4D63DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"62 Specific Ways to Improve Your TypeScript","description":"TypeScript is a typed superset of JavaScript with the potential to solve many of the headaches for which JavaScript is famous. But TypeScript has a learning curve of its own, and understanding how to use it effectively can take time. This book guides you through 62 specific ways to improve your use of TypeScript. Author Dan Vanderkam, a principal software engineer at Sidewalk Labs, shows you how to apply these ideas, following the format popularized by Effective C++ and Effective Java (both from Addison-Wesley). You’ll advance from a beginning or intermediate user familiar with the basics to an advanced user who knows how to use the language well. Effective TypeScript is divided into eight chapters: Getting to Know TypeScript TypeScript’s Type System Type Inference Type Design Working with any Types Declarations and @types Writing and Running Your Code Migrating to TypeScript","language":"en","currency":null,"id":"1492053694","title":"Effective TypeScript","infoLink":"http:\/\/books.google.com\/books?id=4D63DwAAQBAJ&dq=javascript&hl=&as_brr=5&source=gbs_api","authors":["Dan Vanderkam"]},{"pageCount":75,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VnbTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"A Journey from 0 to 1","description":"Inspiring, personal and full of all-too-relatable stories from life in modern America, Real Tough Software is an unforgettable memoir from a woman who didn’t take no for an answer. In a life filled with dead-end jobs and a quest for meaning, RealToughCandy has emerged as a survivor taking full advantage of everything the developer lifestyle has to offer - but not without sacrifice. As an educator, creator and business owner she created a multimedia empire dedicated to up-and-coming developers while establishing herself as tireless advocate for newcomers to the field. RTC invites you into her world, chronicling events from sleepless nights learning RESTful APIs and JavaScript type conversion to her time spent in a senior position at a dysfunctional enterprise software company. She details her wins and losses, telling her story in a way that takes you right to the scene. Real Tough Software is a brutally honest look back at one person’s incredible journey to a career in software, sharing the fight, the heart, and the relentless hustle that resulted in not only a new career, but a new chance at freedom.","language":"en","currency":"USD","id":"1672340268","title":"Real Tough Software","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VnbTDwAAQBAJ&source=gbs_api","authors":[]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JUNYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"An Introduction to Data Visualization in JavaScript","description":"Master D3, Today’s Most Powerful Tool for Visualizing Data on the Web Data-driven graphics are everywhere these days, from websites and mobile apps to interactive journalism and high-end presentations. Using D3, you can create graphics that are visually stunning and powerfully effective. Visual Storytelling with D3 is a hands-on, full-color tutorial that teaches you to design charts and data visualizations to tell your story quickly and intuitively, and that shows you how to wield the powerful D3 JavaScript library. Drawing on his extensive experience as a professional graphic artist, writer, and programmer, Ritchie S. King walks you through a complete sample project—from conception through data selection and design. Step by step, you’ll build your skills, mastering increasingly sophisticated graphical forms and techniques. If you know a little HTML and CSS, you have all the technical background you’ll need to master D3. This tutorial is for web designers creating graphics-driven sites, services, tools, or dashboards; online journalists who want to visualize their content; researchers seeking to communicate their results more intuitively; marketers aiming to deepen their connections with customers; and for any data visualization enthusiast. Coverage includes Identifying a data-driven story and telling it visually Creating and manipulating beautiful graphical elements with SVG Shaping web pages with D3 Structuring data so D3 can easily visualize it Using D3’s data joins to connect your data to the graphical elements on a web page Sizing and scaling charts, and adding axes to them Loading and filtering data from external standalone datasets Animating your charts with D3’s transitions Adding interactivity to visualizations, including a play button that cycles through different views of your data Finding D3 resources and getting involved in the thriving online D3 community About the Website All of this book’s examples are available at ritchiesking.com\/book, along with video tutorials, updates, supporting material, and even more examples, as they become available.","language":"en","currency":"USD","id":"0133439658","title":"Visual Storytelling with D3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JUNYBAAAQBAJ&source=gbs_api","authors":["Ritchie S. King"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ein1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"JavaScript im Einsatz: Webseiten erstellen mit AngularJS, Meteor und jQuery Mobile","description":"Single-Page-Web-Apps sind eine neue Art, Webanwendungen zu bauen. Im Gegensatz zu klassischen Webseiten fhren Single-Page-Web-Apps keinen Seitenwechsel mehr durch die Oberflche wird ber dynamischen Austausch der HTML-Elemente auf einer einzigen Seite mit JavaScript verndert. Die Implementierung erfolgt mit den Technologien HTML5, CSS3 und JavaScript. Die HTML-Seiten werden zum grten Teil dynamisch im Browser erzeugt. Die Daten werden meist ber JSON oder XML mit einem Backend ausgetauscht. Eine Single-Page-Web-App ist ber eine URL im Browser universell erreichbar. Eine Installation ist nicht notwendig. Im Unternehmensumfeld reduziert diese Eigenschaft enorm die Kosten fr Installation und Verteilung. Viele Benutzer wollen Dienste auf unterschiedlichen Gerten nutzen. Der Zugriff muss vom heimischen PC genauso gut funktionieren wie vom Tablet oder Smartphone aus. Eine separate Entwicklung fr jede Zielplattform ist teuer. Das Web wird die bergreifende Plattform fr alle Betriebssysteme und Gertearten. Dank HTML und JavaScript laufen Single-Page-Web-Apps auf allen wichtigen mobilen Betriebssystemen wie Android, Windows Phone und iOS. Offline-Fhigkeiten Mit den neuen Fhigkeiten von HTML5, wie dem LocalStorage, gibt es zum ersten Mal eine Mglichkeit, effiziente Cache-Strategien und Offline-Fhigkeiten zu etablieren. Es ist sehr leicht, mit den verwendeten Technologien zu starten als Entwicklungsumgebung reicht ein guter Texteditor aus. Zum Ausfhren reicht ein Browser, der mit den entsprechenden Plug-ins sogar Debugging bereitstellt. Alle diese Komponenten sind fr den Einsteiger kostenlos verfgbar.","language":"de","currency":"USD","id":"3645203109","title":"Single-Page-Web-Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ein1DwAAQBAJ&source=gbs_api","authors":["Heiko Spindler"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h_6ZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":"Usando JavaScript no servidor","description":"Rena o conhecimento de programao que voc j usa no navegador e empregue no servidor com o Node! Aprenda a criar aplicaes em rede de alto desempenho e plenamente escalonveis nesta plataforma baseada em JavaScript. O contedo deste livro  bastante prtico, \"mo na massa\", e far com que o programador de JavaScript, acostumado a lidar apenas com processamento no navegador, domine com maestria os fundamentos do Node no servidor. Sero abordados inmeros mdulos nativos e tambm de terceiros. Esta edio foi atualizada para abranger tanto a mais recente verso tradicional (Long Term Support – LTS) do Node quanto a verso estvel mais atual. Aprenda rapidamente sobre o modelo de I\/O assncrono e baseado em eventos do Node e, com ele, desenvolva aplicaes que usam dados intensivamente, que so acessados com frequncia e, ainda assim, so computacionalmente muito simples. Se voc j domina o JavaScript, este livro oferece muitos exemplos de programas e implementaes que se beneficiam do desenvolvimento centralizado no servidor proporcionado pelo Node. Explore a funcionalidade do Node e de seus frameworks para desenvolver solues em full-stack. Mergulhe no sistema de mdulos e pacotes do Node. Teste imediatamente o cdigo de sua aplicao ou mdulo com o console REPL do Node. Use os mdulos nativos do Node para criar aplicaes web que tenham seu prprio servidor HTTP. Aprenda todos os recursos do Node para networks, segurana e sockets. Acesse funcionalidades do sistema operacional com processos-filho. Aprenda as melhores ferramentas e tcnicas para desenvolver e colocar em produo seus sistemas em Node. Use o Node em microcontroladores, microcomputadores e na Internet das Coisas (IoT – Internet of Things)","language":"pt","currency":"USD","id":"8575227696","title":"Aprendendo Node","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h_6ZDwAAQBAJ&source=gbs_api","authors":["Shelley Powers"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qNesBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":"A Beginner's Guide (ebook)","description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Move beyond basic Web design by learning to create dynamic Web content To create a dynamic page on which content changes in response to events requires programming and the potential use of databases. Dynamic Web Programming: A Beginner's Guide starts by covering HTML, XHTML, and CSS. You will then learn to use JavaScript to implement elements such as rollover events, popups, and calculations. The book explains how to use PHP to create guest books, blogs, and page transitions, as well as how to implement a database-driven Web site with MySQL.","language":"en","currency":"USD","id":"0071633456","title":"Dynamic Web Programming: A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qNesBAAAQBAJ&source=gbs_api","authors":["Marty Matthews","John Cronan"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1e32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"Der Crashkurs fr Softwareentwickler","description":"Ihr Crashkurs in moderner Webprogrammierung Sie haben Programmiergrundwissen und suchen einen Quereinstieg in HTML5, JavaScript und jQuery? Mit dieser konzentrierten Einfhrung lernen Sie zgig und praxisnah, was Sie zur Entwicklung moderner Webanwendungen wissen mssen. Geschrieben von einem Entwickler fr Entwickler, vermittelt dieses Buch die relevanten Konzepte und ihre Anwendung direkt anhand eines Beispielprojekts, ganz ohne theoretischen Ballast. Autor Dane Cameron macht Sie zunchst mit den Elementen und Konzepten von HTML5, JavaScript und jQuery vertraut. Kapitel fr Kapitel bauen Sie die Beispielanwendung als Single Page Webanwendung (SPA) auf und implementieren dabei alle bentigten Features. Sie lernen unter anderem, mit jQuery das DOM zu bearbeiten, eigene Plugins zu schreiben, client-seitig Daten zu speichern oder Ihre Webanwendung auch offline nutzbar und mit Web Worker \"multithread-fhig\" zu machen.","language":"de","currency":"USD","id":"3864916674","title":"HTML5, JavaScript und jQuery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1e32DwAAQBAJ&source=gbs_api","authors":["Dane Cameron"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iP3GCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Making Interactive Graphics in JavaScript and Processing","description":"With p5.js, you can think of your entire Web browser as your canvas for sketching with code! Learn programming the fun way--by sketching with interactive computer graphics! Getting Started with p5.js contains techniques that can be applied to creating games, animations, and interfaces. p5.js is a new interpretation of Processing written in JavaScript that makes it easy to interact with HTML5 objects, including text, input, video, webcam, and sound. Like its older sibling Processing, p5.js makes coding accessible for artists, designers, educators, and beginners. Written by the lead p5.js developer and the founders of Processing, this book provides an introduction to the creative possibilities of today's Web, using JavaScript and HTML. With Getting Started with p5.js, you'll: Quickly learn programming basics, from variables to objects Understand the fundamentals of computer graphics Create interactive graphics with easy-to-follow projects Learn to apply data visualization techniques Capture and manipulate webcam audio and video feeds in the browser","language":"en","currency":"USD","id":"145718673X","title":"Getting Started with p5.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iP3GCgAAQBAJ&source=gbs_api","authors":["Lauren McCarthy","Casey Reas","Ben Fry"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kStHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Learner's Guide to Coding and Computational Thinking","description":"What will you learn from this book? It’s no secret the world around you is becoming more connected, more configurable, more programmable, more computational. You can remain a passive participant, or you can learn to code. With Head First Learn to Code you’ll learn how to think computationally and how to write code to make your computer, mobile device, or anything with a CPU do things for you. Using the Python programming language, you’ll learn step by step the core concepts of programming as well as many fundamental topics from computer science, such as data structures, storage, abstraction, recursion, and modularity. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Learn to Code uses a visually rich format to engage your mind, rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multi-sensory learning experience is designed for the way your brain really works.","language":"en","currency":"USD","id":"1491958812","title":"Head First Learn to Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kStHDwAAQBAJ&source=gbs_api","authors":["Eric Freeman"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Bessere Webanwendungen mit einfachen JavaScript-Techniken entwickeln","description":"Dieses Buch gibt eine behutsame Einfhrung in die Prinzipien von jQuery, damit Sie Ihren Seiten Interaktion und Animationen hinzufgen knnen -auch wenn frhere Versuche, JavaScript zu schreiben, Sie nur in Verwirrung gestrzt haben. Dieses Buch hilft Ihnen, die Klippen zu umschiffen, die bei Ajax, Ereignissen, Effekten und anspruchsvolleren Merkmalen der Sprache JavaScript lauern. Auerdem fungiert es als kurzes Nachschlagewerk zur Bibliothek jQuery, die sie immer wieder benutzen knnen. Die Neuauflage dieses erfolgreichen Buches wurde komplett berarbeitet und auf die Version 1.6 von jQuery aktualisiert.","language":"de","currency":"USD","id":"3864911508","title":"jQuery lernen und einsetzen","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qq32DwAAQBAJ&source=gbs_api","authors":["Jonathan Chaffer","Karl Swedberg"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9O13CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Learn all the new ES6 features and be amongst the most prominent JavaScript developers who can write efficient JS programs as per the latest standards! About This Book Learn a powerful approach to writing object-oriented JavaScript code using ES6 Create and use ES6 modules to learn to write smart, modularized JavaScript code The book will take you step-by-step through a wide array of examples, giving you tips on how to make the best use of the latest ES6 features Who This Book Is For If you are a JavaScript developer with basic development, and now want to learn about the latest features in order to develop better client-side programs with JavaScript, then this book is for you. What You Will Learn Explore the usage of new syntaxes introduced by ES6 Use the new prototype-based features introduced by ES6 Execute ES6 in an old non-supported ES6 environment Write asynchronous code using promise to facilitate the writing of better asynchronous code that is easier to read and maintain Create and understand the usage of iterators, iterables, and generators Get to know object-oriented programming and create objects using classes Build proxies using the ES6 proxy API and understand its uses Create JavaScript libraries using ES6 modules In Detail ECMAScript 6 is the new edition to the ECMAScript language, whose specifications are inherited by JavaScript. ES6 gives a vast makeover to JavaScript by adding new syntaxes and APIs to write complex applications and libraries that are easier to debug and maintain. ES6 aims to keep JavaScript accessible for casual developers, even after adding so many new features. This book will provide step-by-step instructions on how to apply ES6 features instead of old JavaScript hacks and methods. The book will start by introducing all the built-in objects of ES6 and how to create ES6 custom Iterators. Next, it will teach you how to write asynchronous code in a synchronous style using ES6. Moving on, the book will teach how to use Reflect API to inspect and manipulate object properties. Next, it teaches how to create proxies, and use it to intercept and customize operations performed on objects. Finally, it explains old modular programming techniques such as IIFE, CommonJS, AMD, and UMD and also compares it with ES6 modules and how ES6 modules can increase the performance of websites when used. Style and approach This book is a pragmatic guide that takes you through the ES6 APIs and other features in a conversational and easy-to-follow style. Each topic is explained with examples and use cases.","language":"en","currency":"USD","id":"1785886533","title":"Learning ECMAScript 6","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9O13CgAAQBAJ&source=gbs_api","authors":["Narayan Prusty"]},{"pageCount":864,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7qqgT3dKqtgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":null,"description":"Ideal for the 3+ million Java developers, this fast-paced tutorial offers in-depth coverage of JavaServer Faces (JSF) -- Sun Microsystem's Web application architecture for the future. Co-written by the #1 JSF expert in the Java community, this book offers the most complete resource on JSF available. * Extensive coverage on JSF custom component development * Serves as a thorough introduction to AJAX technology and techniques * Numerous custom JSF component examples including AJAX enabled components provided","language":"en","currency":"USD","id":"0071710485","title":"JavaServer Faces: The Complete Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7qqgT3dKqtgC&source=gbs_api","authors":["Chris Schalk","Ed Burns","James Holmes"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y33uAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Game programming offers a wealth of creative and business opportunities, and it’s never been more accessible. In Core HTML5 2D Game Programming, best-selling author David Geary shows you how to use freely available browser tools and open source resources to create video games that run in desktop browsers and on mobile devices. Geary walks you step by step through every aspect of implementing a sophisticated arcade-style game entirely from scratch, without using proprietary game frameworks. Packed with code, this full-color tutorial gives you the in-depth understanding you need to design and build any kind of HTML5 2D game on your own, whether you use a framework or not. A clearly written, accessible, and exhaustive guide to implementing games, this book leaves no stone unturned, showing you how to Create smooth, flicker-free animations Implement motion that’s unaffected by your game’s underlying animation frame rate Animate sprites (graphical objects) to make them sparkle, explode, etc. Layer multi-channel sound effects on top of a soundtrack Warp time to create nonlinear effects, such as jumping or bouncing Control the flow of time through your game with a time system Implement particle systems that simulate natural phenomena Efficiently detect collisions between sprites Create a developer backdoor containing special features Use Node.js and socket.io to transfer real-time metrics to a server Employ a heads-up display to show high scores stored on a server Understand the nuances of implementing HTML5 games for mobile devices Through expertly written code that’s easy to understand, and prose that cuts to the chase, Geary illuminates every corner of game development. Everyone from novice game programmers to professional game developers will find this book invaluable as both a tutorial and a reference. All of the book’s source code, including chapter-specific versions of the game discussed in the book, are available at corehtml5games.com.","language":"en","currency":"USD","id":"0133564266","title":"Core HTML5 2D Game Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y33uAwAAQBAJ&source=gbs_api","authors":["David Geary"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SJ1eDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.95,"subtitle":null,"description":"There's no doubt that the JavaScript ecosystem changes fast. Not only are new tools and frameworks introduced and developed at a rapid rate, the language itself has undergone big changes with the introduction of ES2015 (aka ES6) and further revisions. Understandably, many articles have been written complaining about how difficult it is to learn modern JavaScript development these days. We're aiming to minimize that confusion with this set of books on modern JavaScript. This collection contains: Practical ES6 is a collection of articles introducing many of the powerful new JavaScript language features that were introduced in ECMAScript 2015, as well as features introduced in ECMAScript 2016 and 2017. It also takes a look at the features planned for ECMAScript 2018 in this rapidly evolving language. JavaScript: Best Practice presents articles discussing modern JavaScript best practice, enabling you to write more powerful code that is clean, performant, maintainable, and reusable. 6 JavaScript Projects presents six complete JavaScript projects; each taking advantage of modern JavaScript and its ecosystem. You'll learn to build several different apps, and along the way you'll pick up a ton of useful advice, tips, and techniques. Modern JavaScript Tools & Skills contains a collection of articles outlining essential tools and skills that every modern JavaScript developer should know. This book is for all front-end developers who wish to improve their JavaScript skills. You'll need to be familiar with HTML and CSS and have a reasonable level of understanding of JavaScript in order to follow the discussion.","language":"en","currency":"USD","id":"1492068179","title":"The Modern JavaScript Collection","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SJ1eDwAAQBAJ&source=gbs_api","authors":["Aurelio De Rosa","Craig Buckler","Nilson Jacques","Byron Houwens","Jeff Mott","Graham Cox","Ludovico Fischer","James Wright","James Kolce","Moritz Kroger","Ivan Curic","Samier Saeed","M. David Green","Michaela Lehr","Michael Wanyoike","Darren Jones","Mark Brown"]},{"pageCount":808,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UMFeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Beginner's Guide to HTML, CSS, JavaScript, and Web Graphics","description":"Do you want to build web pages but have no prior experience? This friendly guide is the perfect place to start. You’ll begin at square one, learning how the web and web pages work, and then steadily build from there. By the end of the book, you’ll have the skills to create a simple site with multicolumn pages that adapt for mobile devices. Each chapter provides exercises to help you learn various techniques and short quizzes to make sure you understand key concepts. This thoroughly revised edition is ideal for students and professionals of all backgrounds and skill levels. It is simple and clear enough for beginners, yet thorough enough to be a useful reference for experienced developers keeping their skills up to date. Build HTML pages with text, links, images, tables, and forms Use style sheets (CSS) for colors, backgrounds, formatting text, page layout, and even simple animation effects Learn how JavaScript works and why the language is so important in web design Create and optimize web images so they’ll download as quickly as possible NEW! Use CSS Flexbox and Grid for sophisticated and flexible page layout NEW! Learn the ins and outs of Responsive Web Design to make web pages look great on all devices NEW! Become familiar with the command line, Git, and other tools in the modern web developer’s toolkit NEW! Get to know the super-powers of SVG graphics","language":"en","currency":"USD","id":"1491960159","title":"Learning Web Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UMFeDwAAQBAJ&source=gbs_api","authors":["Jennifer Robbins"]},{"pageCount":764,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5vxwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Learn to build and deploy robust JavaScript applications using Cucumber, Mocha, Jenkins, Docker, and Kubernetes","description":"Strengthen your applications by adopting Test-Driven Development (TDD), the OpenAPI Specification, Continuous Integration (CI), and container orchestration. Key Features Create production-grade JavaScript applications from scratch Build microservices and deploy them to a Docker container for scaling applications Test and deploy your code with confidence using Travis CI Book Description With the over-abundance of tools in the JavaScript ecosystem, it's easy to feel lost. Build tools, package managers, loaders, bundlers, linters, compilers, transpilers, typecheckers - how do you make sense of it all? In this book, we will build a simple API and React application from scratch. We begin by setting up our development environment using Git, yarn, Babel, and ESLint. Then, we will use Express, Elasticsearch and JSON Web Tokens (JWTs) to build a stateless API service. For the front-end, we will use React, Redux, and Webpack. A central theme in the book is maintaining code quality. As such, we will enforce a Test-Driven Development (TDD) process using Selenium, Cucumber, Mocha, Sinon, and Istanbul. As we progress through the book, the focus will shift towards automation and infrastructure. You will learn to work with Continuous Integration (CI) servers like Jenkins, deploying services inside Docker containers, and run them on Kubernetes. By following this book, you would gain the skills needed to build robust, production-ready applications. What you will learn Practice Test-Driven Development (TDD) throughout the entire book Use Cucumber, Mocha and Selenium to write E2E, integration, unit and UI tests Build stateless APIs using Express and Elasticsearch Document your API using OpenAPI and Swagger Build and bundle front-end applications using React, Redux and Webpack Containerize services using Docker Deploying scalable microservices using Kubernetes Who this book is for If you're a JavaScript developer looking to expand your skillset and become a senior JavaScript developer by building production-ready web applications, then this book is for you.","language":"en","currency":"USD","id":"1788472918","title":"Building Enterprise JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5vxwDwAAQBAJ&source=gbs_api","authors":["Daniel Li"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mDzlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Skalierbare JavaScript-Applikationen entwickeln","description":"Herausragendes Fachbuch zu TypeScript und seinem kosystem TypeScripts ausgeklgeltes Typsystem verstehen Tiefgehende Einsichten in die Sprache gewinnen (Minko Gechev, Angular-Team bei Google) Von den Grundlagen bis zu Applikationen im Produktionsbetrieb Programmierer, die mit dynamisch typisierten Sprachen arbeiten, wissen nur zu genau, wie schlecht ihre Projekte skalieren: wie schwierig es ist, mit einer umfangreichen Codebasis zu arbeiten und viele Entwickler einzubinden. Facebook, Google und Microsoft haben deshalb statisch typisierte Schichten fr ihren JavaScript-und Python-Code entwickelt. TypeScript ist hier besonders interessant: Die Sprache bietet ein mchtiges statisches Typsystem, sodass Projekte besser skalieren und das Programmieren wieder Spa macht. Boris Cherny zeigt Programmierern mit JavaScript-Grundkenntnissen, wie die Konzepte hinter TypeScript gedacht sind und wie man die Sprache sicher beherrscht. Sie erfahren, wie TypeScript Sie dabei untersttzt, Bugs zu vermeiden und Ihren Code fr deutlich mehr Entwickler zu skalieren. Was Sie in diesem Buch erwartet: Mit den Grundlagen beginnen: Sie lernen verschiedene Typen und Typ-Operatoren von TypeScript kennen und erfahren, wofr und wie sie benutzt werden. Fortgeschrittene Themen erarbeiten: Sie verstehen TypeScripts ausgeklgeltes Typsystem, wie Sie Fehler sicher behandeln und asynchrone Programme entwickeln. In die Praxis eintauchen: Sie verwenden TypeScript mit den Frontend- und Backend-Frameworks Ihrer Wahl, migrieren JavaScript-Projekte zu TypeScript und fhren TypeScript-Anwendungen im Produktivbetrieb aus.","language":"de","currency":"USD","id":"396010362X","title":"Programmieren in TypeScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mDzlDwAAQBAJ&source=gbs_api","authors":["Boris Cherny"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2bX2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Interaktive JavaScript-Grafiken im Browser","description":"Der Standard fr JavaScript-Grafiken Bringen Sie Ihre Daten ins Web! Erweitern Sie Ihren Werkzeugkasten um ein mchtiges Grafik-Tool. Schneller Praxiseinstieg in D3.js D3.js ist die fhrende JavaScript-Bibliothek fr webbasierte Grafiken und Visualisierungen. Wenn Sie es eilig haben, D3.js zu lernen, ist dieses Buch genau das Richtige fr Sie. Es ist kompakt gehalten und konzentriert sich auf Konzepte und Muster. Auerdem werden untersttzende Technologien wie SVG, HTML5, CSS und das DOM erklrt. Der Autor Philipp K. Janert zeigt Ihnen, wie Sie D3 auf Ihre eigenen Probleme anwenden knnen. Verstehen Sie die D3-Selections, das grundlegende Organisationsprinzip der Bibliothek. Erfahren Sie, wie Sie datengesteuerte Dokumente mit Datenbindung erstellen knnen. Erstellen Sie animierte Grafiken und interaktive Benutzeroberflchen. Zeichnen Sie Figuren mit Kurven, Formen und Farben. Verwenden Sie die integrierten Funktionen fr Heatmaps, Baumdiagramme und Netzwerke. Vereinfachen Sie Ihre Arbeit, indem Sie Ihre eigenen wiederverwendbaren Komponenten schreiben.","language":"de","currency":"USD","id":"3960888821","title":"D3-Praxisbuch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2bX2DwAAQBAJ&source=gbs_api","authors":["Philipp K. Janert"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g4ZmAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Linux-Powered Electronic Projects With Python and JavaScript","description":"Many people think of Linux as a computer operating system, running on users' desktops and powering servers. But Linux can also be found inside many consumer electronics devices. Whether they're the brains of a cell phone, cable box, or exercise bike, embedded Linux systems blur the distinction between computer and device. Many makers love microcontroller platforms such as Arduino, but as the complexity increases in their projects, they need more power for applications, such as computer vision. The BeagleBone is an embedded Linux board for makers. It's got built-in networking, many inputs and outputs, and a fast processor to handle demanding tasks. This book introduces you to both the original BeagleBone and the new BeagleBone Black and gets you started with projects that take advantage of the board's processing power and its ability to interface with the outside world.","language":"en","currency":"USD","id":"1449345336","title":"Getting Started with BeagleBone","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g4ZmAgAAQBAJ&source=gbs_api","authors":["Matt Richardson"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7PmoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Over 100 recipes to help you develop cross-platform, native applications in JavaScript About This Book Leverage your JavaScript skills to write mobile applications using Titanium Studio tools with the native advantage Deploy your application on the App Store and Google Play Add your own IOS native modules in objective-C, in an easy-to-follow step-by-step format Who This Book Is For This book is an essential for any developer learning or using JavaScript who wants to write native UI applications for iOS and Android. No knowledge of Objective-C, Swift and Java is required and you'll quickly be developing native, cross-platform apps, in JavaScript! What You Will Learn Transfer data between applications with URL schemes, and make your application accessible to other mobile applications and services Connect with remote services using JSON Work with Google Maps and Apple Maps, GPS and annotate routes Create animations and special effects Integrate notifications and connect with social media services such as Facebook and Twitter Build applications with Alloy MVC – a rapid application development framework Design native APIs and use local databases In Detail The mobile web has paved the way but many users want to have “native” applications installed. Using Appcelerator as a platform it's now possible to write iOS, Android, and Windows phone applications in JavaScript! It allows developers to develop fully native UI applications using Appcelerator studio tools without any knowledge of Objective-C, Swift or Java. This book will take you through the process of building cross-platform, native UI applications for the mobile from scratch. You will learn how to develop apps, how to use GPS, cameras and photos and how to build socially connected apps. You will also learn how to package them for submission to the App Store and Google Play. This cookbook takes a pragmatic approach to creating applications in JavaScript from putting together basic UIs, to handling events and implementation of third party services such as Twitter, Facebook and Push notifications. The book shows you how to integrate datasources and server APIs, and how to use local databases. The topics covered will guide you to use Appcelerator Studio tools for all the mobile features such as Geolocation, Accelerometer, animation and more. You'll also learn about Alloy, the Appcelerator MVC framework for rapid app development, and how to transfer data between applications using URLSchemes, enabling other developers to access and launch specific parts of your app. Finally, you will learn how to register developer accounts and publish your very own applications on the App Store and Google Play. Style and approach This book offers a set of practical recipes with a step-by-step approach for building native applications for both the iOS and Android using JavaScript. This hands-on guide shows you exactly how to use the Appcelerator platform to rapidly develop cross-platform, native apps.","language":"en","currency":"USD","id":"184969771X","title":"Appcelerator Titanium Smartphone App Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7PmoCwAAQBAJ&source=gbs_api","authors":["Jason Kneen"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BHs2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Hands-On Guide to Angular 2 and Angular 4","description":"Learning Angular, Second Edition A Hands-On Guide to Angular 2 and Angular 4 Learning Angular teaches modern application development with Angular 2 and Angular 4. It begins with the basics of Angular and the technologies and techniques used throughout the book, such as key features of TypeScript, newer ES6 syntax and concepts, and details about the tools needed to write professional Angular applications. The reader will next build an Angular application from scratch while learning about the primary pieces of an Angular application and see how they work together. Using lots of examples, the core parts of Angular will be introduced, such as Components, the Router, and Services. The book also covers techniques like server-side rendering and how to incrementally add Angular 2+ features to existing AngularJS applications. Finally, the reader will gain insight into advanced skills that should be part of any professional Angular developer’s toolkit such as testing, tooling options, and performance tuning. Understand how Angular is organized and learn best practices for designing Angular applications Quickly build Angular templates with built-in directives that enhance the user experience Bind UI elements to your data model, so changes to your model and UI occur automatically in tandem Define custom Angular directives that extend HTML Implement zoomable images, expandable lists, and other rich UI components Implement client-side services that interact with web servers Build dynamic browser views to provide even richer user interaction Create custom services you can easily reuse Implement rich UI components as custom Angular directives Contents at a Glance Introduction What is Angular Why Use Angular Who this Book is For How to Use this Book Getting the Source Code Chapter 1: Jumping into JavaScript Setting Up a JavaScript Development Environment Defining Variables Understanding JavaScript Data Types Using Operators Implementing Looping Creating Functions Understanding Variable Scope Using JavaScript Objects Manipulating Strings Working with Arrays Adding Error Handling Chapter 2: Jumping into TypeScript Learning the Different Types Understanding Interfaces Implementing Classes Implementing Modules Understanding Functions Chapter 3: Getting Started with Angular Why Angular? Understanding Angular Separation of Responsibilities Adding Angular to Your Environment Using the Angular CLI Creating a Basic Angular Application Chapter 4: Angular Components Component Configuration Building the Template Using Constructors Using External Templates Implementing Directives Chapter 5: Expressions Using Expressions Using Pipes Building a Custom Pipe Chapter 6: Data Binding Understanding Data Binding Interpolation Property Binding Attribute Binding Class Binding Style Binding Event Binding Two-Way Binding Chapter 7: Built-in Directives Understanding Directives Using Built-in Directives Structural Directives Attribute Directives Chapter 8: Custom Directives Creating a Custom Attribute Directive Creating a Custom Directive with a Component Chapter 9: Events and Change Detection Using Browser Events Emitting Custom Events Using Observables Chapter 10: Implementing Angular Services in Web Applications Understanding Angular Services Using the Built in Services Sending HTTP GET and PUT Requests with the http Service Implementing a Simple Mock Server Using the http Service Changing Views with the router Service Implementing a Router with a Navigation Bar Implementing a Router with Parameters Chapter 11: Creating Your Own Custom Angular Service Integrating Custom Services into Angular Applications Implementing a Simple Application That Uses a Constant Data Service Implementing a Data Transform Service Implementing a Variable Data Service Implementing a Service that Returns a Promise Implementing a Shared Service Chapter 12: Having Fun with Angular Implementing an Angular Application That Uses the Animation Service Implementing an Angular Application That Zooms in on Images Implementing an Angular Application That Enables Drag and Drop Implementing a Star Rating Angular Component","language":"en","currency":"USD","id":"0134577027","title":"Learning Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BHs2DwAAQBAJ&source=gbs_api","authors":["Brad Dayley","Brendan Dayley","Caleb Dayley"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0yEvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"What if William Shakespeare were asked to generate the Fibonacci series or Jane Austen had to write a factorial program? In If Hemingway Wrote JavaScript, author Angus Croll imagines short JavaScript programs as written by famous wordsmiths. The result is a peculiar and charming combination of prose, poetry, and programming. The best authors are those who obsess about language—and the same goes for JavaScript developers. To master either craft, you must experiment with language to develop your own style, your own idioms, and your own expressions. To that end, If Hemingway Wrote JavaScript playfully bridges the worlds of programming and literature for the literary geek in all of us. Featuring original artwork by Miran Lipova?a.","language":"en","currency":"USD","id":"1593276354","title":"If Hemingway Wrote JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0yEvDwAAQBAJ&source=gbs_api","authors":["Angus Croll"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yaX3BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Arm yourself for the escalating war against malware and rootkits Thwart debilitating cyber-attacks and dramatically improve your organization’s security posture using the proven defense strategies in this thoroughly updated guide. Hacking ExposedTM Malware and Rootkits: Security Secrets & Solutions, Second Edition fully explains the hacker’s latest methods alongside ready-to-deploy countermeasures. Discover how to block pop-up and phishing exploits, terminate embedded code, and identify and eliminate rootkits. You will get up-to-date coverage of intrusion detection, firewall, honeynet, antivirus, and anti-rootkit technology. • Learn how malware infects, survives, and propagates across an enterprise • See how hackers develop malicious code and target vulnerable systems • Detect, neutralize, and remove user-mode and kernel-mode rootkits • Use hypervisors and honeypots to uncover and kill virtual rootkits • Defend against keylogging, redirect, click fraud, and identity theft • Block spear phishing, client-side, and embedded-code exploits • Effectively deploy the latest antivirus, pop-up blocker, and firewall software • Identify and stop malicious processes using IPS solutions","language":"en","currency":"USD","id":"0071825754","title":"Hacking Exposed Malware & Rootkits: Security Secrets and Solutions, Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yaX3BwAAQBAJ&source=gbs_api","authors":["Christopher C. Elisan","Michael A. Davis","Sean M. Bodmer","Aaron LeMasters"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8BWkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Master HTML and HTML5 in 20 lessons--online video tutorials included! Based on the author's successful online courses, this complete, integrated learning tool provides easy-to-follow lessons that feature clear explanations, sample code and exercises, and video tutorials. Each lesson is designed to take you less than an hour to complete. HTML5: 20 Lessons to Successful Web Development covers the basics of HTML, including laying out an HTML document, using fonts, colors, and images, creating lists and tables, and building forms. Next, you'll learn how to use the HTML5 canvas, support geolocation, build advanced forms, implement local storage, add audio and video to your pages, and much more. Together, the book and almost five hours of video training make learning HTML5 easier than ever! Ready-to-use code at www.mhprofessional.com","language":"en","currency":"USD","id":"007183768X","title":"HTML5: 20 Lessons to Successful Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8BWkBQAAQBAJ&source=gbs_api","authors":["Robin Nixon"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bM83bP5szgYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":60,"subtitle":null,"description":"Advanced PeopleSoft PeopleTools Development Strategies Maximize the efficiency and productivity of your PeopleSoft applications from Oracle using the proven methods and best practices in this Oracle Press guide. PeopleSoft PeopleTools Tips & Techniques lays out the benefits of each tactic along with implementation considerations, programming instructions, and reusable code samples. Construct powerful iScripts, build custom UIs, work with Java and Ajax, and integrate the latest Web 2.0 features. Test-driven development, application security, performance tuning, and debugging are also covered in this authoritative resource. Develop modular logic using PeopleSoft application classes Incorporate file attachment and approval workflow capabilities Add Web elements with PeopleCode iScripts and bookmarkets Enhance functionality using HTML, JavaScript, CSS, and Ajax Extend PeopleSoft Integration Broker through custom connctors Effectively merge Java with PeopleCode to create elegant solutions Use runtime loggers and tracers to test and tune applications Extend the PeopleSoft Web server with JSP, servlets, and filters Create Web-based mobile applications using Oracle JDeveloper","language":"en","currency":"USD","id":"0071664920","title":"PeopleSoft PeopleTools Tips & Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bM83bP5szgYC&source=gbs_api","authors":["Jim Marion"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=r91PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"JavaScript – PHP – Datenbank","description":"Dieser Band der „Bibliothek der Mediengestaltung“ gibt eine Einfhrung in die Webprogrammierung mit JavaScript und PHP mit dem Ziel der Erstellung dynamischer Webseiten mit Datenbankanbindung. Fr diese Bibliothek wurden die Themen des Kompendiums der Mediengestaltung neu strukturiert, vollstndig berarbeitet und in ein handliches Format gebracht. Leitlinien waren hierbei die Anpassung an die Entwicklungen in der Werbe- und Medienbranche sowie die Bercksichtigung der aktuellen Rahmenplne und Studienordnungen sowie Prfungsanforderungen der Ausbildungs- und Studiengnge. Die Bnde der „Bibliothek der Mediengestaltung“ enthalten zahlreiche praxisorientierte Aufgaben mit Musterlsungen und eignen sich als Lehr- und Arbeitsbcher an Schulen sowie Hochschulen und zum Selbststudium.","language":"de","currency":"USD","id":"3662547309","title":"Webtechnologien","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=r91PDwAAQBAJ&source=gbs_api","authors":["Peter Bhler","Patrick Schlaich","Dominik Sinner"]},{"pageCount":71,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nv2lDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"The ultimate guide to starting, growing & making money from your small YouTube channel","description":"Here's the awesome news: you don’t need to have a million subscribers or even 10,000 to be a successful, income-generating YouTuber. Tiny YouTube was written by active YouTuber RealToughCandy, whose small tech channel (less than 10,000 subscribers at the time of publication) has generated thousands of dollars since its debut in 2017. One part training manual and one part YouTuber tell-all, RealToughCandy's Tiny YouTube shows you how to get started with YouTube while developing a sustainable channel that will make you money for years to come. With Tiny YouTube, you’ll be well on your way to producing content that people care about. . .Content that gets results.In Tiny Youtube, we go over things like: -Choosing a niche -Growing your channel -Your technical workflow (planning, recording, editing, publishing) -Optimizing your video for maximum exposure & engagement -Helpful browser extensions that give you invaluable insights -Collaborations, going on camera and dealing with trolls -The seven avenues for making money -And so much more It doesn't matter what you're interested in or where you live. From techies, to fitness gurus, to business owners, to outdoor enthusiasts, to toad fanatics and beyond, Tiny YouTube provides real-world, actionable guidance so you can start your YouTube channel with a bang and keep subscribers coming back while gaining more and more. If you have an Internet connection, a YouTube account and a desire to succeed, this book is going to set you up for success the minute you start your channel. Other books give outdated advice or gloss over important details. Not with Tiny YouTube! The big AND small factors are discussed in a thorough yet approachable way. Tiny YouTube: the only book dedicated to the sustained success of small YouTube channels.","language":"en","currency":"USD","id":"1073611213","title":"Tiny YouTube","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nv2lDwAAQBAJ&source=gbs_api","authors":["RealToughCandy"]},{"pageCount":76,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eSPyRuL8b7UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Advanced Sound for Games and Interactive Apps","description":"Go beyond HTML5’s Audio tag and boost the audio capabilities of your web application with the Web Audio API. Packed with lots of code examples, crisp descriptions, and useful illustrations, this concise guide shows you how to use this JavaScript API to make the sounds and music of your games and interactive applications come alive. You need little or no digital audio expertise to get started. Author Boris Smus introduces you to digital audio concepts, then shows you how the Web Audio API solves specific application audio problems. If you're an experienced JavaScript programmer, you’ll not only learn how to synthesize and process digital audio, you’ll also explore audio analysis and visualization with this API. Learn Web Audio API, including audio graphs and the audio nodes Provide quick feedback to user actions by scheduling sounds with the API’s precise timing model Control gain, volume, and loudness, and dive into clipping and crossfading Understand pitch and frequency: use tools to manipulate soundforms directly with JavaScript Generate synthetic sound effects and learn how to spatialize sound in 3D space Use Web Audio API with the Audio tag, getUserMedia, and the Page Visibility API","language":"en","currency":"USD","id":"1449332641","title":"Web Audio API","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eSPyRuL8b7UC&source=gbs_api","authors":["Boris Smus"]},{"pageCount":752,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZCchAeprwvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Fundamentals, Data Structure, Sorting, Searching","description":"Robert Sedgewick has thoroughly rewritten and substantially expanded and updated his popular work to provide current and comprehensive coverage of important algorithms and data structures. Christopher Van Wyk and Sedgewick have developed new C++ implementations that both express the methods in a concise and direct manner, and also provide programmers with the practical means to test them on real applications. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 250,000 programmers! This particular book, Parts 1n4, represents the essential first half of Sedgewick's complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. Although the substance of the book applies to programming in any language, the implementations by Van Wyk and Sedgewick also exploit the natural match between C++ classes and ADT implementations. Highlights Expanded coverage of arrays, linked lists, strings, trees, and other basic data structures Greater emphasis on abstract data types (ADTs), modular programming, object-oriented programming, and C++ classes than in previous editions Over 100 algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT (searching) implementations New implementations of binomial queues, multiway radix sorting, randomized BSTs, splay trees, skip lists, multiway tries, B trees, extendible hashing, and much more Increased quantitative information about the algorithms, giving you a basis for comparing them Over 1000 new exercises to help you learn the properties of algorithms Whether you are learning the algorithms for the first time or wish to have up-to-date reference material that incorporates new programming styles with classic and new algorithms, you will find a wealth of useful information in this book.","language":"en","currency":"USD","id":"0768685036","title":"Algorithms in C++, Parts 1-4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZCchAeprwvYC&source=gbs_api","authors":["Robert Sedgewick"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"Rapid, Confident, Maintainable Code","description":"Debunk the myth that JavaScript is not easily testable. Whether you use Node.js, Express, MongoDB, jQuery, AngularJS, or directly manipulate the DOM, you can test-drive JavaScript. Learn the craft of writing meaningful, deterministic automated tests with Karma, Mocha, and Chai. Test asynchronous JavaScript, decouple and properly mock out dependencies, measure code coverage, and create lightweight modular designs of both server-side and client-side code. Your investment in writing tests will pay high dividends as you create code that's predictable and cost-effective to change. Design and code JavaScript applications with automated tests. Writing meaningful tests is a skill that takes learning, some unlearning, and a lot of practice, and with this book, you'll hone that skill. Fire up the editor and get hands-on through practical exercises for effective automated testing and designing maintainable, modular code. Start by learning when and why to do manual testing vs. automated verification. Focus tests on the important things, like the pre-conditions, the invariants, complex logic, and gnarly edge cases. Then begin to design asynchronous functions using automated tests. Carefully decouple and mock out intricate dependencies such as the DOM, geolocation API, file and database access, and Ajax calls to remote servers. Step by step, test code that uses Node.js, Express, MongoDB, jQuery, and AngularJS. Know when and how to use tools such as Chai, Istanbul, Karma, Mocha, Protractor, and Sinon. Create tests with minimum effort and run them fast without having to spin up web servers or manually edit HTML pages to run in browsers. Then explore end-to-end testing to ensure all parts are wired and working well together. Don't just imagine creating testable code, write it. What You Need: A computer with a text editor and your favorite browser. The book provides instructions to install the necessary automated testing-related tools.","language":"en","currency":"USD","id":"1680504908","title":"Test-Driving JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uT6eBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solutions and Techniques in Ruby Programming","description":"For more than a decade, Ruby developers have turned to The Ruby Way for reliable “how-to” guidance on effective Ruby programming. Now, Hal Fulton and Andr Arko have thoroughly updated this classic guide to cover new language enhancements and developers’ experiences through Ruby 2.1. The new edition illuminates Ruby 2.1 through 400+ examples, each answering the question: “How do I do this in Ruby?” For each example, they present both a task description and realistic technical constraints. Next, they walk step-by-step through presenting one good solution, offering detailed explanations to promote deeper understanding. Conveniently organized by topic, The Ruby Way, Third Edition makes it easier than ever to find the specific solution you want—and to write better code by reflecting Ruby’s unique philosophy and spirit. Coverage includes Ruby 2.1 overview: terminology, philosophy, and basic principles Best practices for strings and regular expressions Efficiently internationalizing your code Performing calculations (including trigonometry, calculus, statistics, and time\/date calculations) Working with “Rubyesque” objects such as symbols and ranges Using arrays, hashes, stacks, queues, trees, graphs, and other data structures Efficiently storing data with YAML, JSON, and SQLite3 Leveraging object-oriented and dynamic features, from multiple constructors to program inspection Building GUIs with Shoes 4, Ruby\/Tk, Ruby\/GTK3, QtRuby, and other toolkits Improving thread performance by understanding Ruby’s synchronization methods and avoiding its pitfalls Automating system administration with Ruby Data formats: JSON, XML, RSS, Atom, RMagick, PDF, and more Testing and debugging with RSpec, Minitest, Cucumber, byebug, and pry Measuring Ruby program performance Packaging and distributing code, and managing dependencies with Bundler Network programming: clients, time servers, POP, SMTP, IMAP, Open-URI Web applications: HTTP servers, Rails, Sinatra, HTML generation, and more Writing distributed Ruby software with drb Choosing modern development tools that maximize your productivity All source code for this book may be downloaded at www.rubyhacker.com. informit.com\/aw informit.com\/ruby rubyhacker.com\/therubyway therubyway.io","language":"en","currency":"USD","id":"0132480379","title":"The Ruby Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uT6eBgAAQBAJ&source=gbs_api","authors":["Hal Fulton","Andr Arko"]}]