[{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":686,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ptiYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"JavaScript lets you supercharge your HTML with animation, interactivity, and visual effects—but many web designers find the language hard to learn. This easy-to-read guide not only covers JavaScript basics, but also shows you how to save time and effort with the jQuery and jQuery UI libraries of prewritten JavaScript code. You’ll build web pages that feel and act like desktop programs—with little or no programming. The important stuff you need to know: Pull back the curtain on JavaScript. Learn how to build a basic program with this language. Get up to speed on jQuery. Quickly assemble JavaScript programs that work well on multiple web browsers. Transform your user interface. Learn jQuery UI, the JavaScript library for interface features like design themes and controls. Make your pages interactive. Create JavaScript events that react to visitor actions. Use animations and effects. Build drop-down navigation menus, pop-ups, automated slideshows, and more. Collect data with web forms. Create easy-to-use forms that ensure more accurate visitor responses. Practice with living examples. Get step-by-step tutorials for web projects you can build yourself.","language":"en","currency":"USD","id":"1491948612","title":"JavaScript & jQuery: The Missing Manual","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ptiYBAAAQBAJ&source=gbs_api","authors":["David Sawyer McFarland"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nBuA0hmspdMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"68 Specific Ways to Harness the Power of JavaScript","description":"“It’s uncommon to have a programming language wonk who can speak in such comfortable and friendly language as David does. His walk through the syntax and semantics of JavaScript is both charming and hugely insightful; reminders of gotchas complement realistic use cases, paced at a comfortable curve. You’ll find when you finish the book that you’ve gained a strong and comprehensive sense of mastery.” —Paul Irish, developer advocate, Google Chrome “This is not a book for those looking for shortcuts; rather it is hard-won experience distilled into a guided tour. It’s one of the few books on JS that I’ll recommend without hesitation.” —Alex Russell, TC39 member, software engineer, Google In order to truly master JavaScript, you need to learn how to work effectively with the language’s flexible, expressive features and how to avoid its pitfalls. No matter how long you’ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful language, so you can build more predictable, reliable, and maintainable programs. Author David Herman, with his years of experience on Ecma’s JavaScript standardization committee, illuminates the language’s inner workings as never before—helping you take full advantage of JavaScript’s expressiveness. Reflecting the latest versions of the JavaScript standard, the book offers well-proven techniques and best practices you’ll rely on for years to come. Effective JavaScript is organized around 68 proven approaches for writing better JavaScript, backed by concrete examples. You’ll learn how to choose the right programming style for each project, manage unanticipated problems, and work more successfully with every facet of JavaScript programming from data structures to concurrency. Key features include Better ways to use prototype-based object-oriented programming Subtleties and solutions for working with arrays and dictionary objects Precise and practical explanations of JavaScript’s functions and variable scoping semantics Useful JavaScript programming patterns and idioms, such as options objects and method chaining In-depth guidance on using JavaScript’s unique “run-to-completion” approach to concurrency","language":"en","currency":"USD","id":"0132902257","title":"Effective JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nBuA0hmspdMC&source=gbs_api","authors":["David Herman"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"A Modern Introduction to Programming","description":"JavaScript is at the heart of almost every modern Web application, whether it's Google Apps, Twitter, or the newest browser-based game. Though it's simple for beginners to pick up and play with, JavaScript is not a toy—it's a flexible and complex language that can be used to build full-scale applications. Eloquent JavaScript dives into this flourishing language and teaches you to write code that's beautiful and effective. By immersing you in example code and encouraging experimentation right from the start, the author quickly gives you the tools you need to build your own programs. As you follow along with examples like an artificial life simulation and a version of the classic game Sokoban, you'll learn to: –Understand the essential elements of programming: syntax, control, and data –Use object-oriented and functional programming techniques to organize and clarify your programs –Script the browser and make basic Web applications –Work with tools like regular expressions and XMLHttpRequest objects And since programming is an art that's best learned by doing, all example code is available online in an interactive sandbox for you to experiment with. With Eloquent JavaScript as your guide, you can tweak, expand, and modify the author's code, or throw it away and build your own creations from scratch. Before you know it, you'll be fluent in the language of the Web.","language":"en","currency":"USD","id":"1593272936","title":"Eloquent JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UAYvDwAAQBAJ&source=gbs_api","authors":["Marijn Haverbeke"]},{"pageCount":460,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qU3rAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"An In-Depth Guide for Programmers","description":"Like it or not, JavaScript is everywhere these days—from browser to server to mobile—and now you, too, need to learn the language or dive deeper than you have. This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position. Speaking JavaScript helps you approach the language with four standalone sections. First, a quick-start guide teaches you just enough of the language to help you be productive right away. More experienced JavaScript programmers will find a complete and easy-to-read reference that covers each language feature in depth. Complete contents include: JavaScript quick start: Familiar with object-oriented programming? This part helps you learn JavaScript quickly and properly. JavaScript in depth: Learn details of ECMAScript 5, from syntax, variables, functions, and object-oriented programming to regular expressions and JSON with lots of examples. Pick a topic and jump in. Background: Understand JavaScript’s history and its relationship with other programming languages. Tips, tools, and libraries: Survey existing style guides, best practices, advanced techniques, module systems, package managers, build tools, and learning resources.","language":"en","currency":"USD","id":"1449364993","title":"Speaking JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qU3rAgAAQBAJ&source=gbs_api","authors":["Axel Rauschmayer"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L46fX62D5qYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A JavaScript and jQuery Developer's Guide","description":"With Learning JavaScript Design Patterns, you’ll learn how to write beautiful, structured, and maintainable JavaScript by applying classical and modern design patterns to the language. If you want to keep your code efficient, more manageable, and up-to-date with the latest best practices, this book is for you. Explore many popular design patterns, including Modules, Observers, Facades, and Mediators. Learn how modern architectural patterns—such as MVC, MVP, and MVVM—are useful from the perspective of a modern web application developer. This book also walks experienced JavaScript developers through modern module formats, how to namespace code effectively, and other essential topics. Learn the structure of design patterns and how they are written Understand different pattern categories, including creational, structural, and behavioral Walk through more than 20 classical and modern design patterns in JavaScript Use several options for writing modular code—including the Module pattern, Asyncronous Module Definition (AMD), and CommonJS Discover design patterns implemented in the jQuery library Learn popular design patterns for writing maintainable jQuery plug-ins \"This book should be in every JavaScript developer’s hands. It’s the go-to book on JavaScript patterns that will be read and referenced many times in the future.\"—Andrée Hansson, Lead Front-End Developer, presis!","language":"en","currency":"USD","id":"1449334873","title":"Learning JavaScript Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L46fX62D5qYC&source=gbs_api","authors":["Addy Osmani"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OIhuxqUO2TcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Introducing Functional Programming with Underscore.js","description":"How can you overcome JavaScript language oddities and unsafe features? With this book, you’ll learn how to create code that’s beautiful, safe, and simple to understand and test by using JavaScript’s functional programming support. Author Michael Fogus shows you how to apply functional-style concepts with Underscore.js, a JavaScript library that facilitates functional programming techniques. Sample code is available on GitHub at https:\/\/github.com\/funjs\/book-source. Fogus helps you think in a functional way to help you minimize complexity in the programs you build. If you’re a JavaScript programmer hoping to learn functional programming techniques, or a functional programmer looking to learn JavaScript, this book is the ideal introduction. Use applicative programming techniques with first-class functions Understand how and why you might leverage variable scoping and closures Delve into higher-order functions—and learn how they take other functions as arguments for maximum advantage Explore ways to compose new functions from existing functions Get around JavaScript’s limitations for using recursive functions Reduce, hide, or eliminate the footprint of state change in your programs Practice flow-based programming with chains and functional pipelines Discover how to code without using classes","language":"en","currency":"USD","id":"1449360785","title":"Functional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OIhuxqUO2TcC&source=gbs_api","authors":["Michael Fogus"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ExJ9_sor87QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Develop and Design","description":"It’s time for a current, definitive JavaScript book, and in this comprehensive beginner’s guide, bestselling author Larry Ullman teaches the language as it is implemented today. Larry demonstrates how to build upon JavaScript’s ease of use, while demystifying its often-cryptic syntax, especially for those who have not programmed before. This book enforces modern JavaScript’s best practices and embraces key Web development approaches such as progressive enhancement and unobtrusive scripting. The author demonstrates loads of real-world code and makes it available for download. You’ll learn about JavaScript itself and the relationship between JavaScript and HTML. Next you’ll explore variables, common operators, and control structures. Then you’ll create functions, handle events, and do more with HTML forms. You’ll master Ajax, work with frameworks, and use JavaScript with PHP to create a complete example. The result is a book that helps you not just tinker with JavaScript but to thoroughly comprehend it. This book includes: Easy step-by-step instruction, ample illustrations, and clear examples Real-world techniques to build your skills Insight into best practices from a veteran Web expert Emphasis on strategies for creating reliable code that will work on all of today’s browsers and devices, even those without JavaScript","language":"en","currency":"USD","id":"0132905876","title":"Modern JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ExJ9_sor87QC&source=gbs_api","authors":["Larry Ullman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GgJN2CC_2s4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This book addresses today’s approach to JavaScript in detail: modern browser support, including information on Internet Explorer 7; Object-Oriented JavaScript; testing and debugging; unobtrusive JavaScript techniques using DOM Scripting; Ajax; creating and using blocks of reusable code, and the future of JavaScript. All the concepts expressed in this up-to-the-minute reference are thoroughly backed up with real world examples and full-scale case studies. The book offers reusable functions for readers to use in their own projects, a significant time-saver. Also included are several reference sections that allow developers to look up details quickly and easily.","language":"en","currency":"USD","id":"9781430202837","title":"Pro JavaScript Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GgJN2CC_2s4C&source=gbs_api","authors":["John Resig"]},{"pageCount":269,"thumbnail":"http:\/\/books.google.com\/books\/content?id=za3vlnlWxb0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"With Pro JavaScript Design Patterns, you’ll start with the basics of object-oriented programming in JavaScript applicable to design patterns, including making JavaScript more expressive, inheritance, encapsulation, information hiding, and more. The book then details how to implement and take advantage of several design patterns in JavaScript. Each chapter is packed with real-world examples of how the design patterns are best used and expert advice on writing better code, as well as what to watch out for. Along the way you’ll discover how to create your own libraries and APIs for even more efficient coding.","language":"en","currency":"USD","id":"9781430204961","title":"Pro JavaScript Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=za3vlnlWxb0C&source=gbs_api","authors":["Dustin Diaz","Ross Harmes"]},{"pageCount":591,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BCtt4oHdbyIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.96,"subtitle":null,"description":"Advanced JavaScript, Third Edition provides an in-depth examination of the most important features of JavaScript. Beginning with an overview of JavaScript, the book quickly moves into more advanced features needed for complex yet robust JavaScript scripts, such as objects, arrays, and date and time functions. Additionally, various features of JavaScript that are essential for modern web pages are discussed, including manipulating the status bar, creating dynamic calendars, and working with forms, images, and the Document Object Model. Numerous examples illustrate how to implement various techniques. Topics covered how to enhance your web pages with LED signs, banners, and images; implementing cookies to store and retrieve information; the structure of the Document Object Model and how it can be used to view, access, and change an HTML document; Security measures to protect private information while using the Internet.","language":"en","currency":"USD","id":"144963348X","title":"Advanced Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BCtt4oHdbyIC&source=gbs_api","authors":["Chuck Easttom"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTZqecc9olUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Build Better Applications with Coding and Design Patterns","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","language":"en","currency":"USD","id":"9781449396947","title":"JavaScript Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTZqecc9olUC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OgxlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Master ES6, ES7, and ES8","description":"JavaScript is no longer to be feared or loathed - the world's most popular and ubiquitous language has evolved into a respectable language. Whether you're writing frontend applications or server side code, the phenomenal features from ES6 and beyond - like the rest operator, generators, destructuring, object literals, arrow functions, modern classes, promises, async, and metaprogramming capabilities - will get you excited and eager to program with JavaScript. You've found the right book to get started quickly and dive deep into the essence of modern JavaScript. Learn practical tips to apply the elegant parts of the language and the gotchas to avoid. JavaScript is a black swan that no one, including the author of the language, thought would become a popular and ubiquitous language. Not long ago, it was the most hated and feared language you could use to program the web. JavaScript ES6 and beyond has gone through a significant makeover. Troublesome features have been replaced with better, elegant, more reliable alternatives. This book includes many practical examples and exercises to help you learn in depth. It will not bore you with idiosyncrasies and arcane details intended for bad interview questions. Instead, it takes you into key features that you can readily use in your day-to-day projects. Whether you program the frontend or the server side, you can now write concise, elegant, and expressive JavaScript with newer features like default parameters, template literals, rest and spread operators, destructuring, arrow functions, and generators. Take it up a notch with features like infinite series, promises, async, and metaprogramming to create flexible, powerful, and extensible libraries. While the evolved features of the language will draw you in, the hundreds of examples in this book will pin the concepts down, for you to use on your projects. Take command of modern JavaScript and unlock your potential to create powerful applications. What You Need: To try out the examples in the book you will need a computer with Node.js, a text editor, and a browser like Chrome installed in it.","language":"en","currency":"USD","id":"1680506188","title":"Rediscovering JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OgxlDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oo26Kw9c2W4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This \"learn by example\" book offers 10 complete JavaScript projects that will save web developers countless hours of development time. These projects can serve as samples to learn from and\/or be adapted for use in other projects. The 10 projects all address common needs in modern web applications, including a utility library, a validation framework, a GUI widget framework, a dynamic event calendar application, a drag and drop shopping cart, and more! Coverage details JavaScript best practices, Ajax techniques, and some of the most popular JavaScript libraries, such as Prototype, Script.aculo.us, and the Yahoo YUI library.","language":"en","currency":"USD","id":"1430201975","title":"Practical JavaScript, DOM Scripting and Ajax Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oo26Kw9c2W4C&source=gbs_api","authors":["Frank Zammetti"]},{"pageCount":186,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3NQhBTNKJB8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.39,"subtitle":"Making App Store Apps Without Objective-C or Cocoa","description":"What people are saying about Building iPhone Apps w\/ HTML, CSS, and JavaScript \"The future of mobile development is clearly web technologies like CSS, HTML and JavaScript. Jonathan Stark shows you how to leverage your existing web development skills to build native iPhone applications using these technologies.\" --John Allsopp, author and founder of Web Directions \"Jonathan's book is the most comprehensive documentation available for developing web applications for mobile Safari. Not just great tech coverage, this book is an easy read of purely fascinating mobile tidbits in a fun colloquial style. Must have for all PhoneGap developers.\" -- Brian LeRoux, Nitobi Software It's a fact: if you know HTML, CSS, and JavaScript, you already have the tools you need to develop your own iPhone apps. With this book, you'll learn how to use these open source web technologies to design and build apps for the iPhone and iPod Touch on the platform of your choice-without using Objective-C or Cocoa. Device-agnostic mobile apps are the wave of the future, and this book shows you how to create one product for several platforms. You'll find guidelines for converting your product into a native iPhone app using the free PhoneGap framework. And you'll learn why releasing your product as a web app first helps you find, fix, and test bugs much faster than if you went straight to the App Store with a product built with Apple's tools. Build iPhone apps with tools you already know how to use Learn how to make an existing website look and behave like an iPhone app Add native-looking animations to your web app using jQTouch Take advantage of client-side data storage with apps that run even when the iPhone is offline Hook into advanced iPhone features -- including the accelerometer, geolocation, and vibration -- with JavaScript Submit your applications to the App Store with Xcode This book received valuable community input through O'Reilly's Open Feedback Publishing System (OFPS).","language":"en","currency":"USD","id":"9781449382919","title":"Building iPhone Apps with HTML, CSS, and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3NQhBTNKJB8C&source=gbs_api","authors":["Jonathan Stark"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3On-moJDuO0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Add Sparkle and Life to Your Web Pages","description":"If you're new to JavaScript, or an experienced web developer looking to improve your skills, Learning JavaScript provides you with complete, no-nonsense coverage of this quirky yet essential language for web development. You'll learn everything from primitive data types to complex features, including JavaScript elements involved with Ajax and dynamic page effects. By the end of the book, you'll be able to work with even the most sophisticated libraries and web applications. Complete with best practices and examples of JavaScript use, this new edition shows you how to integrate the language with the browser environment, and how to practice proper coding techniques for standards-compliant websites. This book will help you: Learn the JavaScript application structure, including basic statements and control structures Identify JavaScript objects—String, Number, Boolean, Function, and more Use browser debugging tools and troubleshooting techniques Understand event handling, form events, and JavaScript applications with forms Develop with the Browser Object Model, the Document Object Model, and custom objects you create Learn about browser cookies and more modern client-side storage techniques Get details for using XML or JSON with Ajax applications Learning JavaScript follows proven learning principles to help you absorb the concepts at an easy pace, so you'll learn how to create powerful and responsive applications in any browser.","language":"en","currency":"USD","id":"0596554370","title":"Learning JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3On-moJDuO0C&source=gbs_api","authors":["Shelley Powers"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-2WsMNZ3g2sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Visual QuickStart Guide","description":"This task-based, visual reference guide has been fully revised. It uses step-by-step instructions and plenty of screenshots to give beginning and intermediate Web designers what they need to know to learn JavaScript. Readers can start from the beginning to get a tour of the programming language, or look up specific tasks to learn just what they need to know. In this updated seventh edition, readers will find new information on Ajax design and modern coding techniques.","language":"en","currency":"USD","id":"9780132104272","title":"JavaScript and Ajax for the Web","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-2WsMNZ3g2sC&source=gbs_api","authors":["Tom Negrino","Dori Smith"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7iMefp2PwO8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":null,"description":"The purpose of this ebook is to teach the essentials of the JavaScript scripting language so that anyone with a web site can learn to use this powerful language quickly and effectively. It builds detailed and in depth knowledge of all aspects of JavaScript from language basics through to advanced topics in 23 detailed chapters.This book is designed to provide a detailed and comprehensive, yet easy to follow, guide to developing powerful, dynamic web pages using JavaScript. Each subject area is accompanied by clear and concise examples putting theory into practice.It could be said that the object of JavaScript Essentials is to provide you with everything you need to use JavaScript, and nothing that you don't.","language":"en","currency":"USD","id":"055766716X","title":"JavaScript Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7iMefp2PwO8C&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M3Uqna8RIAkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"From Novice to Professional","description":"This is the most up-to-date book on JavaScript available, covering current standards, techniques, and practices. It provides all you need to know to hit the ground running, without making you trawl through hundreds of pages of syntax. The book contains multiple chapters on Ajax and DOM Scripting, which are two of the hottest web development and design tools available today. Using a pragmatic and thorough approach, the book ensures that even the most novice JavaScript programmers will become familiar and comfortable using the tools presented.","language":"en","currency":"USD","id":"9781430201847","title":"Beginning JavaScript with DOM Scripting and Ajax","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M3Uqna8RIAkC&source=gbs_api","authors":["Christian Heilmann"]},{"pageCount":1608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=unu2k2kNTDAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Pure JavaScript, Second Edition is a substantial and focused reference for experienced Web developers. This book begins with an accelerated introduction to the newest features of JavaScript so that experienced Web developers can quickly understand the concepts of JavaScript and begin developing their own JavaScript solutions immediately. Pure JavaScript, Second Edition contains concise descriptions of JavaScript forms, cookies, windows, and layers. Beyond the brief descriptions and short syntax snippets found in most references, this book also provides real-life, well-commented JavaScript examples for each documented object, property, method, and event handler. This not only helps the reader's understanding of the syntax, but also provides a contextual aid in determining how and why a specific object or method may be used. It also includes a special reference section dedicated to server-side JavaScript, coverage of JScript and Active Scripting, and a complete reference to browser-supported JavaScript.","language":"en","currency":"USD","id":"0768685524","title":"Pure JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=unu2k2kNTDAC&source=gbs_api","authors":["Jason D. Gilliam","R. Allen Wyke","Charlton Ting","Sean Michaels"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bKxhgNopylMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"JavaScript is one of the easiest, most straightforward ways to enhance a website with interactivity. Sams Teach Yourself JavaScript in 24 Hours, 4th Edition serves as an easy-to-understand tutorial on both scripting basics and JavaScript itself. The book is written in a clear and personable style with an extensive use of practical, complete examples. It also includes material on the latest developments in JavaScript and web scripting. You will learn how to use JavaScript to enhance web pages with interactive forms, objects, and cookies, as well as how to use JavaScript to work with games, animation, and multimedia.","language":"en","currency":"USD","id":"9780132715508","title":"Sams Teach Yourself JavaScript in 24 Hours","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bKxhgNopylMC&source=gbs_api","authors":["Michael Moncur"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GgJN2CC_2s4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This book addresses today’s approach to JavaScript in detail: modern browser support, including information on Internet Explorer 7; Object-Oriented JavaScript; testing and debugging; unobtrusive JavaScript techniques using DOM Scripting; Ajax; creating and using blocks of reusable code, and the future of JavaScript. All the concepts expressed in this up-to-the-minute reference are thoroughly backed up with real world examples and full-scale case studies. The book offers reusable functions for readers to use in their own projects, a significant time-saver. Also included are several reference sections that allow developers to look up details quickly and easily.","language":"en","currency":"USD","id":"9781430202837","title":"Pro JavaScript Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GgJN2CC_2s4C&source=gbs_api","authors":["John Resig"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eSIsAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"A Brain-Friendly Guide","description":"What will you learn from this book? This brain-friendly guide teaches you everything from JavaScript language fundamentals to advanced topics, including objects, functions, and the browser’s document object model. You won’t just be reading—you’ll be playing games, solving puzzles, pondering mysteries, and interacting with JavaScript in ways you never imagined. And you’ll write real code, lots of it, so you can start building your own web applications. Prepare to open your mind as you learn (and nail) key topics including: The inner details of JavaScript How JavaScript works with the browser The secrets of JavaScript types Using arrays The power of functions How to work with objects Making use of prototypes Understanding closures Writing and testing applications What’s so special about this book? We think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First JavaScript Programming uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. This book replaces Head First JavaScript, which is now out of print.","language":"en","currency":"USD","id":"1449343988","title":"Head First JavaScript Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eSIsAwAAQBAJ&source=gbs_api","authors":["Eric Freeman","Elisabeth Robson"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3eJdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Writing Modern JavaScript with ES5, ES6, and Beyond","description":"The best modern JavaScript is simple, readable, and predictable. Learn to write modern JavaScript not by memorizing a list of new syntax, but with practical examples of how syntax changes can make code more expressive. Starting from variable declarations that communicate intention clearly, see how modern principles can improve all parts of code. Incorporate ideas with curried functions, array methods, classes, and more to create code that does more with less while yielding fewer bugs. It's time to write JavaScript code that's clean and exprssive. Modern JavaScript is simpler and more predictable and readable than ever. Discover how to write better code with clear examples using principles that show how updated syntax can make code better with fewer bugs. Starting from the ground up, learn new syntax (or how to reuse older syntax) to transform code from clunky bug-susceptible scripts to clear and elegant programs that are easy to read and easy to extend. Create a foundation for readable code with simple variable declarations that reduce side effects and subtle bugs. Select collections with clear goals instead of defaulting to objects or arrays. See how to simplify iterations from complex loops to single line array methods. Master techniques for writing flexible and solid code ranging from high-order functions, to reusableclasses, to patterns for architecting large applications creating applications that will last while through rounds of refactoring and changing requirements. The best part is there's no need to read this book straight through. Jump around and incorporate new functionality at will. Most importantly, understand not just what the new syntax is, but when and how to use it. Start writing better code from the first page. What You Need: For the best experience, have the latest version of Node installed (at least version 7). You can test most examples in the console of Chrome or other modern web browser. If you'd like to run the tests, you'll also need to install the latest version of Node Package Manager (npm).","language":"en","currency":"USD","id":"1680506056","title":"Simplifying JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3eJdDwAAQBAJ&source=gbs_api","authors":["Joe Morgan"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fv1wRM_nIPIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Getting Started with Adobe AIR","description":"This book is the official guide to Adobe ® AIR[TM], written by members of the AIR team. With Adobe AIR, web developers can use technologies like HTML and JavaScript to build and deploy web applications to the desktop. Packed with examples, this book explains how AIR works and features recipes for performing common runtime tasks. Part of the Adobe Developer Library, this concise pocket guide explains: What Adobe AIR is, and the problems this runtime aims to solve How to set up your development environment The HTML and JavaScript environments within AIR How to create your first AIR application using HTML and JavaScript Ways to perform an array of common tasks with this runtime Also included is a guide to AIR packages, classes, and command line tools. Once you understand the basics of building HTML- and JavaScript-based AIR applications, this book makes an ideal reference for tackling specific problems. It offers a quick introduction to a significant new development technology, which lets you combine the reach and ease of the Web with the power of the desktop.","language":"en","currency":"USD","id":"9781449379391","title":"AIR for Javascript Developers Pocket Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fv1wRM_nIPIC&source=gbs_api","authors":["Mike Chambers","Daniel Dura","Kevin Hoyt","Dragos Georgita"]},{"pageCount":296,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_oeZs0woLv4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"JavaScript Programmer's Reference is an invaluable resource that won't stray far from your desktop (or your tablet!). It contains detailed information on every JavaScript object and command, and combines that reference with practical examples showcasing how you can use those commands in the real world. Whether you're just checking the syntax of a method or you're starting out on the road to JavaScript mastery, the JavaScript Programmer's Reference will be an essential aid. With a detailed and informative tutorial section giving you the ins and outs of programming with JavaScript and the DOM followed by a command-by-command reference, your next project will pop with interactivity and keep your audience coming back for more. JavaScript Programmer's Reference is your one-stop source for everything you'll need to know to become a cutting edge web developer using the latest tools and techniques available today. In depth explanations and activities to explain not just the command in question, but why it is used in that way Progressive learning curve to not overwhelm and confuse you Handy and extremely informative quick-reference of every command within the JavaScript & DOM specifications","language":"en","currency":"USD","id":"1430246308","title":"JavaScript Programmer's Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_oeZs0woLv4C&source=gbs_api","authors":["Thomas Valentine","Jonathan Reid"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a09NMFdA6m0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Create Native Apps with Objective-C and Xcode","description":"Is it possible for JavaScript programmers to learn Apple's iOS 4 SDK and live to tell the tale? Technology guru Danny Goodman did, and with this book he leaves a well-marked trail for you to follow. An authority on JavaScript since its inception, Goodman understands the challenges you might face in creating native iOS apps with this SDK, and introduces Xcode, Objective-C, and Cocoa Touch in a context you'll readily understand. Why bother with the SDK when you can simply build web apps for Apple's iOS devices? Web apps can't access an iPhone's music library, camera, or iOS system software for maps, audio, and more. Nor can you sell web apps in the App Store. If you want to take full advantage of the iPhone and iPad, iOS 4 SDK is your tool -- and this is your book. Includes full coverage of iOS SDK 4.2. Learn the distinction between web app and iOS native app programming Create a workbench app to test code snippets throughout the learning process Get a structural view of an iOS app, and compare the process of building objects in Objective-C versus JavaScipt Discover how your code launches iOS apps and makes them user-ready Learn about iOS memory management details that are different from JavaScript, including pointers and data types Use Objective-C and Cocoa Touch to implement common JavaScript tasks","language":"en","currency":"USD","id":"9781449302801","title":"Learning the iOS 4 SDK for JavaScript Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a09NMFdA6m0C&source=gbs_api","authors":["Danny Goodman"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0U6nBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Covering HTML5, CSS3, and jQuery","description":"In just a short time, you can learn how to use HTML5, Cascading Style Sheets (CSS3), and JavaScript together to design, create, and maintain world-class websites. Using a straightforward, step-by-step approach, each lesson in this book builds on the previous ones, enabling you to learn the essentials from the ground up. Clear instructions and practical, hands-on examples show you how to use HTML to create the framework of your website, design your site's layout and typography with CSS, and then add interactivity with JavaScript and jQuery. Step-by-step instructions carefully walk you through the most common web development tasks Practical, hands-on examples show you how to apply what you learn Quizzes and exercises help you test your knowledge and stretch your skills Learn how to... Build your own web page and get it online in an instant Format text for maximum clarity and readability Create links to other pages and to other sites Add graphics, color, and visual pizzazz to your web pages Work with transparent images and background graphics Design your site’s layout and typography using CSS Get user input with web-based forms Use JavaScript to build dynamic, interactive web pages Add AJAX effects to your web pages Leverage JavaScript libraries such as jQuery Make your site easy to maintain and update as it grows Contents at a Glance Part I Getting Started on the Web 1 Understanding How the Web Works 2 Structuring an HTML Document 3 Understanding Cascading Style Sheets 4 Understanding JavaScript 5 Validating and Debugging Your Code Part II Building Blocks of Practical Web Design 6 Working with Fonts, Text Blocks, Lists, and Tables 7 Using External and Internal Links 8 Working with Colors, Images, and Multimedia Part III Advanced Web Page Design with CSS 9 Working with Margins, Padding, Alignment, and Floating 10 Understanding the CSS Box Model and Positioning 11 Using CSS to Do More with Lists, Text, and Navigation 12 Creating Fixed or Liquid Layouts Part IV Getting Started with Dynamic Sites 13 Understanding Dynamic Websites and HTML5 Applications 14 Getting Started with JavaScript Programming 15 Working with the Document Object Model (DOM) 16 Using JavaScript Variables, Strings, and Arrays 17 Using JavaScript Functions and Objects 18 Controlling Flow with Conditions and Loops 19 Responding to Events 20 Using Windows Part V Advanced JavaScript Programming 21 JavaScript Best Practices 22 Using Third-Party JavaScript Libraries and Frameworks 23 A Closer Look at jQuery 24 First Steps Toward Creating Rich Interactions with jQuery UI 25 AJAX: Remote Scripting Part VI Advanced Website Functionality and Management 26 Working with Web-Based Forms 27 Organizing and Managing a Website","language":"en","currency":"USD","id":"0133795187","title":"HTML, CSS and JavaScript All in One, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0U6nBAAAQBAJ&source=gbs_api","authors":["Julie C. Meloni"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=thezCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"How to Code Safely in the World's Most Dangerous Language","description":"Create more robust applications with a test-first approach to JavaScript Reliable JavaScript, How to Code Safely in the World's Most Dangerous Language demonstrates how to create test-driven development for large-scale JavaScript applications that will stand the test of time and stay accurate through long-term use and maintenance. Taking a test-first approach to software architecture, this book walks you through several patterns and practices and explains what they are supposed to do by having you write unit tests. Write the code to pass the unit tests, so you not only develop your technique for structuring large-scale applications, but you also learn how to test your work. You'll come away with hands-on practice that results in code that is correct from the start, and has the test coverage to ensure that it stays correct during subsequent maintenance. All code is provided both in the text and on the web, so you can immediately get started designing more complete, robust applications. JavaScript has graduated from field-validation scripts to full-scale applications, but many developers still approach their work as if they were writing simple scripts. If you're one of those developers, this book is the solution you need to whip your code into shape and create JavaScript applications that work. Write more concise and elegant code by thinking in JavaScript Test the implementation and use of common design patterns Master the use of advanced JavaScript features Ensure your code's conformance to your organization's standards If you're ready to step up your code and develop more complete software solutions, Reliable JavaScript is your essential resource.","language":"en","currency":"USD","id":"1119028744","title":"Reliable JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=thezCQAAQBAJ&source=gbs_api","authors":["Lawrence D. Spencer","Seth H. Richards"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f2UHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Visual QuickStart Guide","description":"With the proliferation of new, standards-compliant browsers, virtually all users and Web sites can successfully use the latest JavaScript techniques. This task-based, visual-reference guide has been fully revised and uses step-by-step instructions and plenty of screenshots to give beginning and intermediate scripters what they need to know to keep their skills up-to-date. Readers can start from the beginning to get a tour of the programming language, or look up specific tasks to learn just what they need to know. In this updated ninth edition, readers will find new information on scripting for mobile devices and updated code to work with the latest versions of all major browsers. Readers will also find an expanded focus on getting their JavaScript done quickly by using the near-ubiquitous jQuery library.","language":"en","currency":"USD","id":"0133846059","title":"JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f2UHBAAAQBAJ&source=gbs_api","authors":["Dori Smith","Tom Negrino"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bHhlCrvbqSoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Writing Readable Code","description":"You may have definite ideas about writing code when working alone, but team development requires that everyone use the same approach. With the JavaScript practices in this book—including code style, programming tips, and automation—you will learn how to write maintainable code that other team members can easily understand, adapt, and extend. Author Nicholas Zakas assembled this collection of best practices as a front-end tech leader at Yahoo!, after completing his own journey from solo hacker to team player. He also includes rules recommended by other industry authorities. Use these tips and techniques to help your team set aside individual preferences and function at a higher level. Establish specific code conventions for your team Use tools such as JSLint and JSHint to keep your team on track Adopt style guidelines, such as basic formatting, to help your team produce uniform code Apply several programming practices to solve problems and improve code quality Create an automated JavaScript build system using a variety of utilities Integrate browser-based JavaScript testing with tools such as the YUI Test Selenium Driver","language":"en","currency":"USD","id":"1449328121","title":"Maintainable JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bHhlCrvbqSoC&source=gbs_api","authors":["Nicholas C. Zakas"]},{"pageCount":686,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ptiYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"JavaScript lets you supercharge your HTML with animation, interactivity, and visual effects—but many web designers find the language hard to learn. This easy-to-read guide not only covers JavaScript basics, but also shows you how to save time and effort with the jQuery and jQuery UI libraries of prewritten JavaScript code. You’ll build web pages that feel and act like desktop programs—with little or no programming. The important stuff you need to know: Pull back the curtain on JavaScript. Learn how to build a basic program with this language. Get up to speed on jQuery. Quickly assemble JavaScript programs that work well on multiple web browsers. Transform your user interface. Learn jQuery UI, the JavaScript library for interface features like design themes and controls. Make your pages interactive. Create JavaScript events that react to visitor actions. Use animations and effects. Build drop-down navigation menus, pop-ups, automated slideshows, and more. Collect data with web forms. Create easy-to-use forms that ensure more accurate visitor responses. Practice with living examples. Get step-by-step tutorials for web projects you can build yourself.","language":"en","currency":"USD","id":"1491948612","title":"JavaScript & jQuery: The Missing Manual","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ptiYBAAAQBAJ&source=gbs_api","authors":["David Sawyer McFarland"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HdCTBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This book is for JavaScript developers having basic web development knowledge and also for those who want to explore the security issues that arise from the use of JavaScript. Prior knowledge of how JavaScript is used, such as for DOM manipulation or to perform Ajax operations, is assumed.","language":"en","currency":"USD","id":"1783988010","title":"JavaScript Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HdCTBQAAQBAJ&source=gbs_api","authors":["Y.E Liang"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H5JlrWxn7tsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Visual QuickStart Guide","description":"This task-based, visual-reference guide has been fully revised and uses step-by-step instructions and plenty of screenshots to give beginning and intermediate scripters what they need to know to keep their skills up-to-date. Readers can start from the beginning to get a tour of the programming language, or look up specific tasks to learn just what they need to know. In this updated eighth edition, readers will find new information on using frameworks and libraries--such as jQuery--and modern coding techniques.","language":"en","currency":"USD","id":"0132735466","title":"JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H5JlrWxn7tsC&source=gbs_api","authors":["Tom Negrino","Dori Smith"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ss5zPx4SNGsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Activate Your Web Pages","description":"JavaScript is the ubiquitous programming language of the Web, and for more than 15 years, JavaScript: The Definitive Guide has been the bible of JavaScript programmers around the world. Ideal for JavaScript developers at any level, this book is an all-new excerpt of The Definitive Guide, collecting the essential parts of that hefty volume into this slim yet dense pocket reference. The first 9 chapters document the latest version (ECMAScript 5) of the core JavaScript language, covering: Types, values, and variables Operators, expressions, and statements Objects and arrays Functions and classes The next 5 chapters document the fundamental APIs for using JavaScript with HTML5 and explain how to: Interact with web browser windows Script HTML documents and document elements Modify and apply CSS styles and classes Respond to user input events Communicate with web servers Store data locally on the user's computer This book is a perfect companion to jQuery Pocket Reference.","language":"en","currency":"USD","id":"1449335993","title":"JavaScript Pocket Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ss5zPx4SNGsC&source=gbs_api","authors":["David Flanagan"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7xWjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19,"subtitle":"Get Up to Speed With JavaScript in a Weekend","description":"Get a Jump Start on JavaScript today! JavaScript is a key technology in modern web development, enabling you to craft interactive, usable and engaging experiences for your users. In just one weekend with this SitePoint book, you'll learn how to: Use JavaScript to solve real world problems: build forms, track user events and craft animations Use JavaScript with HTML5 and CSS3 Build an entire JavaScript-powered application from scratch: a task management application Plus you'll discover how to use modern techniques such as Canvas and Ajax.","language":"en","currency":"USD","id":"1457192160","title":"Jump Start JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7xWjBgAAQBAJ&source=gbs_api","authors":["Ara Pehlivanian","Don Nguyen"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pyZIBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Coding, Capabilities, and Tooling","description":"Pro JavaScript Development is a practical guide for front-end web developers who are experienced at building web pages with HTML, CSS, and JavaScript, and now wish to advance their JavaScript skills to a higher level. You will learn how to build large, well-structured, high quality, mobile-optimized web sites and apps, using the latest supported browser APIs, language features, and tools. This book teaches and shows you in practical hands-on terms how you can: Master the performance, reliability, stability, and code manageability of your JavaScript Understand and write efficient object-oriented and prototypal code, including full understanding of the ‘this’ keyword Boost the performance of your JavaScript code Architect large web applications using common design patterns Write high quality JavaScript code and avoid the pitfalls most likely to cause errors Manage code dependencies with AMD and RequireJS Develop for mobile, build games, and set up a real-time video chat using modern APIs such as Geolocation, Canvas and WebRTC Document your code as the professionals do Write command-line and web server applications in JavaScript with Node.js, Use build tools, such as Grunt and Gulp, to automate repetitive tasks and improve your development workflow Using real-world examples and applications that you'll build yourself, Pro JavaScript Development has unique, practical content that will make you a better JavaScript developer. Become a master of the latest JavaScript coding techniques and tools, and harness its best capabilities today.","language":"en","currency":"USD","id":"1430262699","title":"Pro JavaScript Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pyZIBAAAQBAJ&source=gbs_api","authors":["Den Odell"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nBuA0hmspdMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"68 Specific Ways to Harness the Power of JavaScript","description":"“It’s uncommon to have a programming language wonk who can speak in such comfortable and friendly language as David does. His walk through the syntax and semantics of JavaScript is both charming and hugely insightful; reminders of gotchas complement realistic use cases, paced at a comfortable curve. You’ll find when you finish the book that you’ve gained a strong and comprehensive sense of mastery.” —Paul Irish, developer advocate, Google Chrome “This is not a book for those looking for shortcuts; rather it is hard-won experience distilled into a guided tour. It’s one of the few books on JS that I’ll recommend without hesitation.” —Alex Russell, TC39 member, software engineer, Google In order to truly master JavaScript, you need to learn how to work effectively with the language’s flexible, expressive features and how to avoid its pitfalls. No matter how long you’ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful language, so you can build more predictable, reliable, and maintainable programs. Author David Herman, with his years of experience on Ecma’s JavaScript standardization committee, illuminates the language’s inner workings as never before—helping you take full advantage of JavaScript’s expressiveness. Reflecting the latest versions of the JavaScript standard, the book offers well-proven techniques and best practices you’ll rely on for years to come. Effective JavaScript is organized around 68 proven approaches for writing better JavaScript, backed by concrete examples. You’ll learn how to choose the right programming style for each project, manage unanticipated problems, and work more successfully with every facet of JavaScript programming from data structures to concurrency. Key features include Better ways to use prototype-based object-oriented programming Subtleties and solutions for working with arrays and dictionary objects Precise and practical explanations of JavaScript’s functions and variable scoping semantics Useful JavaScript programming patterns and idioms, such as options objects and method chaining In-depth guidance on using JavaScript’s unique “run-to-completion” approach to concurrency","language":"en","currency":"USD","id":"0132902257","title":"Effective JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nBuA0hmspdMC&source=gbs_api","authors":["David Herman"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HpoQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Expert JavaScript is your definitive guide to understanding how and why JavaScript behaves the way it does. Master the inner workings of JavaScript by learning in detail how modern applications are made. In covering lesser-understood aspects of this powerful language and truly understanding how it works, your JavaScript code and programming skills will improve. You will learn about core fundamentals of JavaScript, including deep dives into functions, scopes, closures, and practical object-oriented code. Mark Daggett explains clearly how closures, events, and asynchronous code really operate, as well as conventions and concepts to write JavaScript in a clear, pragmatic style. Many of the changes in ECMAScript6 and its implications are all explained. You'll be introduced to modern workflow tools to make application development faster, more enjoyable, and ostensibly more profitable. You'll understand how to measure code quality and write more testable JavaScript, and finally you'll learn about real-world applications of JavaScript, including JavaScript-powered robots. JavaScript is one of the most powerful languages on the web today, and it is only getting stronger. This book will take you through the process of planning, coding, testing, profiling and finally releasing your application, at expert level. With more frameworks and more improvements than ever, now is the time to become an expert at JavaScript. Make this journey - use Expert JavaScript today.","language":"en","currency":"USD","id":"143026098X","title":"Expert JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HpoQAwAAQBAJ&source=gbs_api","authors":["Mark E. Daggett"]},{"pageCount":18,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UKaDF-3H_rIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"A decade ago, Ajax took the Web out of childhood, and now HTML5 and JavaScript are moving the Web into full adulthood. This insightful overview provides striking examples of how these technologies have teamed up to give the Web a truly open platform. Author Kyle Simpson (HTML5 Cookbook) shows you how JavaScript unlocks the power of all of the new functionality in HTML5, giving web applications the capabilities developers have wanted for years. These technologies now provide the raw tools you need in the presentation layer to replace everything you used to do with Flash. You’ll discover how: HTML5 builds natively into the web platform things we find most commonly useful, such as audio, video, and drawing The Canvas element is changing graphic animations, games, audio visualization, charting, and video effects Geolocation has spawned “geofencing” and augmented reality Web Workers allows calculations to be performed in the background, rather than compete with the UI Web Sockets is enabling realtime communication for chat, live tech support, multi-user collaboration, and gaming Mobile device APIs will give web apps direct access the phone’s camera, vibration, and other capabilities","language":"en","currency":"USD","id":"1449339069","title":"JavaScript and HTML5 Now","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UKaDF-3H_rIC&source=gbs_api","authors":["Kyle Simpson"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W218yMY2MhcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"For JavaScript developers working on increasingly large and complex projects, effective automated testing is crucial to success. Test-Driven JavaScript Development is a complete, best-practice guide to agile JavaScript testing and quality assurance with the test-driven development (TDD) methodology. Leading agile JavaScript developer Christian Johansen covers all aspects of applying state-of-the-art automated testing in JavaScript environments, walking readers through the entire development lifecycle, from project launch to application deployment, and beyond. Using real-life examples driven by unit tests, Johansen shows how to use TDD to gain greater confidence in your code base, so you can fearlessly refactor and build more robust, maintainable, and reliable JavaScript code at lower cost. Throughout, he addresses crucial issues ranging from code design to performance optimization, offering realistic solutions for developers, QA specialists, and testers. Coverage includes • Understanding automated testing and TDD • Building effective automated testing workflows • Testing code for both browsers and servers (using Node.js) • Using TDD to build cleaner APIs, better modularized code, and more robust software • Writing testable code • Using test stubs and mocks to test units in isolation • Continuously improving code through refactoring • Walking through the construction and automated testing of fully functional software The accompanying Web site, tddjs.com, contains all of the book’s code listings and additional resources.","language":"en","currency":"USD","id":"0321684052","title":"Test-Driven JavaScript Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W218yMY2MhcC&source=gbs_api","authors":["Christian Johansen"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_fmFbly0mxsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":null,"description":"JavaScript is an object-oriented scripting language that enables you to modify a document's structure, styling, and content in response to user actions. This handy pocket serves as both a quick introduction to the language and acts a valuable reference. It's packed with tips as well as JavaScript syntax, methods, and properties. Concise and inexpensive, it's exactly the guide many web designers and developers need.","language":"en","currency":"USD","id":"0321713133","title":"The JavaScript Pocket Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_fmFbly0mxsC&source=gbs_api","authors":["Lenny Burdette"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IKlCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Your hands-on guide to JavaScript fundamentals Expand your expertise—and teach yourself the fundamentals of JavaScript. If you have previous programming experience but are new to JavaScript, this tutorial delivers the step-by-step guidance and coding exercises you need to master core topics and techniques. Discover how to: Work with JavaScript syntax, variables, and data types Master techniques for building cross-browser programs Speed up and simplify app development with jQuery Quickly retrieve data from a server using AJAX requests Adapt your app for mobile devices with jQuery Mobile Build Windows 8 apps using HTML, CSS, and JavaScript","language":"en","currency":"USD","id":"0735667314","title":"JavaScript Step by Step","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IKlCAwAAQBAJ&source=gbs_api","authors":["Steve Suehring"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ju4W2ZA7hi4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"In just a short time, you can learn how to use Ajax, JavaScript, and PHP to create interactive interfaces to your web applications by combining these powerful technologies. No previous Ajax programming experience is required. Using a straightforward, step-by-step approach, each lesson in this book builds on the previous ones, enabling you to learn the essentials of Ajax programming with JavaScript, PHP, and related technologies from the ground up. Regardless of whether you run Linux, Windows, or Mac OS X, the enclosed CD includes a complete Ajax programming starter kit that gives you all the programming tools, reference information, JavaScript libraries, and server software you need to set up a stable environment for learning, testing, and production. Learn how to… Build better, more interactive interfaces for your web applications Make JavaScript, HTML, XML, and PHP work together to create Ajax effects Compile an Ajax application Create and consume web services with SOAP and REST Avoid common errors and troubleshoot programs Use popular Ajax libraries to speed up and improve common programming tasks On the CD XAMPP for Windows, Mac OS X, and Linux—an easy-to-install package to set up a PHP- and MySQL-enabled Apache server on your computer The jEdit programming editor for Windows, Mac, and Linux Prototype, Scriptaculous, Rico, and XOAD—popular JavaScript libraries for creating Ajax applications and effects A complete Ajax, HTML, XML, and PHP tutorial reference library in searchable PDF format Source code for the examples in the book Phil Ballard is a software engineering consultant and developer specializing in website and intranet design and development for an international portfolio of clients. He has an honors degree from the University of Leeds, England, and has worked for several years in commercial and managerial roles in the high technology sector. Michael Moncur is a freelance webmaster and author. He runs a network of websites and has written several bestselling books about web development, networking, certification programs, and databases. Category: Web Development Covers: Ajax, JavaScript and PHP User Level: Beginning–Intermediate","language":"en","currency":"USD","id":"0768685443","title":"Sams Teach Yourself Ajax, JavaScript, and PHP All in One","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ju4W2ZA7hi4C&source=gbs_api","authors":["Phil Ballard","Michael Moncur"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ED6ph4WEIoQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Build Faster Web Application Interfaces","description":"If you're like most developers, you rely heavily on JavaScript to build interactive and quick-responding web applications. The problem is that all of those lines of JavaScript code can slow down your apps. This book reveals techniques and strategies to help you eliminate performance bottlenecks during development. You'll learn how to improve execution time, downloading, interaction with the DOM, page life cycle, and more. Yahoo! frontend engineer Nicholas C. Zakas and five other JavaScript experts—Ross Harmes, Julien Lecomte, Steven Levithan, Stoyan Stefanov, and Matt Sweeney—demonstrate optimal ways to load code onto a page, and offer programming tips to help your JavaScript run as efficiently and quickly as possible. You'll learn the best practices to build and deploy your files to a production environment, and tools that can help you find problems once your site goes live. Identify problem code and use faster alternatives to accomplish the same task Improve scripts by learning how JavaScript stores and accesses data Implement JavaScript code so that it doesn't slow down interaction with the DOM Use optimization techniques to improve runtime performance Learn ways to ensure the UI is responsive at all times Achieve faster client-server communication Use a build system to minify files, and HTTP compression to deliver them to the browser","language":"en","currency":"USD","id":"9781449388744","title":"High Performance JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ED6ph4WEIoQC&source=gbs_api","authors":["Nicholas C. Zakas"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rkRArW8H_MoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Ensuring Reliable Code","description":"One skill that’s essential for any professional JavaScript developer is the ability to write testable code. This book shows you what writing and maintaining testable JavaScript for the client- or server-side actually entails, whether you’re creating a new application or rewriting legacy code. From methods to reduce code complexity to unit testing, code coverage, debugging, and automation, you’ll learn a holistic approach for writing JavaScript code that you and your colleagues can easily fix and maintain going forward. Testing JavaScript code is complicated. This book helps experienced JavaScript developers simply the process considerably. Get an overview of Agile, test-driven development, and behavior-driven development Use patterns from static languages and standards-based JavaScript to reduce code complexity Learn the advantages of event-based architectures, including modularity, loose coupling, and reusability Explore tools for writing and running unit tests at the functional and application level Generate code coverage to measure the scope and effectiveness of your tests Conduct integration, performance, and load testing, using Selenium or CasperJS Use tools for in-browser, Node.js, mobile, and production debugging Understand what, when, and how to automate your development processes","language":"en","currency":"USD","id":"1449323545","title":"Testable JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rkRArW8H_MoC&source=gbs_api","authors":["Mark Ethan Trostler"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7pTviyp3SZYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Second Editon","description":"Beginning JavaScript with DOM Scripting and Ajax is an essential resource for modern JavaScript programming. This completely updated second edition covers everything you need to know to get up-to-speed with JavaScript development and add dynamic enhancements to web pages, right from the basics. As well as focusing on client-side JavaScript, you will also learn how to work with the Browser Object Model, the Document Object Model (DOM), how to use XML and JSON as well as communicate with service side scripts such as PHP. Find out how to: Construct good JavaScript syntax following modern coding practices Use JavaScript to communicate with the server and retrieve data Dynamically manipulate markup, validate forms and deal with images Debug applications using features inside the browser JavaScript is one of the most important technologies on the web. It provides the means to add dynamic functionality to your web pages and serves as the backbone of Ajax-style web development. Beginning JavaScript with DOM Scripting and Ajax will take you from being a JavaScript novice to work freely with this important technology - begin your JavaScript journey today!","language":"en","currency":"USD","id":"1430250933","title":"Beginning JavaScript with DOM Scripting and Ajax","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7pTviyp3SZYC&source=gbs_api","authors":["Russ Ferguson","Christian Heilmann"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ExJ9_sor87QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Develop and Design","description":"It’s time for a current, definitive JavaScript book, and in this comprehensive beginner’s guide, bestselling author Larry Ullman teaches the language as it is implemented today. Larry demonstrates how to build upon JavaScript’s ease of use, while demystifying its often-cryptic syntax, especially for those who have not programmed before. This book enforces modern JavaScript’s best practices and embraces key Web development approaches such as progressive enhancement and unobtrusive scripting. The author demonstrates loads of real-world code and makes it available for download. You’ll learn about JavaScript itself and the relationship between JavaScript and HTML. Next you’ll explore variables, common operators, and control structures. Then you’ll create functions, handle events, and do more with HTML forms. You’ll master Ajax, work with frameworks, and use JavaScript with PHP to create a complete example. The result is a book that helps you not just tinker with JavaScript but to thoroughly comprehend it. This book includes: Easy step-by-step instruction, ample illustrations, and clear examples Real-world techniques to build your skills Insight into best practices from a veteran Web expert Emphasis on strategies for creating reliable code that will work on all of today’s browsers and devices, even those without JavaScript","language":"en","currency":"USD","id":"0132905876","title":"Modern JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ExJ9_sor87QC&source=gbs_api","authors":["Larry Ullman"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8RZaz4UZ_KkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"From Library User to JavaScript Developer","description":"If you’re an advanced beginner or intermediate JavaScript developer, JavaScript Enlightenment will solidify your understanding of the language—especially if you use a JavaScript library. In this concise book, JavaScript expert Cody Lindley (jQuery Cookbook) provides an accurate view of the language by examining its objects and supporting nuances. Libraries and frameworks help you build web applications quickly and efficiently, but when things go wrong or performance becomes an issue, knowing how and why they work is critical. If you’re ready to go under the hood and get your hands dirty with JavaScript internals, this is your book. Get a short and digestible summary of ECMA-262, Edition 3, backed by real code you can run instantly Examine the creation of JavaScript objects Learn complex values, primitive values, scope, and inheritance Understand the importance of the head object Work with string, number, and Boolean objects and values Discover how to use the null value and the built-in math object Get into the details—beyond Mozilla’s reference guide for JavaScript 1.5","language":"en","currency":"USD","id":"1449344437","title":"JavaScript Enlightenment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8RZaz4UZ_KkC&source=gbs_api","authors":["Cody Lindley"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vJBsBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"Go beyond design concepts—build dynamic datavisualizations using JavaScript JavaScript and jQuery for Data Analysis and Visualizationgoes beyond design concepts to show readers how to build dynamic,best-of-breed visualizations using JavaScript—the mostpopular language for web programming. The authors show data analysts, developers, and web designershow they can put the power and flexibility of modern JavaScriptlibraries to work to analyze data and then present it usingbest-of-breed visualizations. They also demonstrate the use of eachtechnique with real-world use cases, showing how to apply theappropriate JavaScript and jQuery libraries to achieve the desiredvisualization. All of the key techniques and tools are explained in thisfull-color, step-by-step guide. The companion website includes allsample codes used to generate the visualizations in the book, datasets, and links to the libraries and other resources covered. Go beyond basic design concepts and get a firm grasp ofvisualization approaches and techniques using JavaScript andjQuery Discover detailed, step-by-step directions for buildingspecific types of data visualizations in this full-color guide Learn more about the core JavaScript and jQuery libraries thatenable analysis and visualization Find compelling stories in complex data, and create amazingvisualizations cost-effectively Let JavaScript and jQuery for Data Analysis andVisualization be the resource that guides you through themyriad strategies and solutions for combining analysis andvisualization with stunning results.","language":"en","currency":"USD","id":"1118847229","title":"JavaScript and jQuery for Data Analysis and Visualization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vJBsBQAAQBAJ&source=gbs_api","authors":["Jon Raasch","Graham Murray","Vadim Ogievetsky","Joseph Lowery"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MPPy5KpAZQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"for Scientists and Engineers","description":"Dual-use technological writing at its best. This book presents HTML and JavaScript in a way that uniquely meets the needs of students in both engineering and the sciences. The author shows how to create simple client-side applications for scientific and engineering calculations. Complete HTML\/JavaScript examples with science\/engineering applications are used throughout to guide the reader comprehensively through the subject. The book gives the reader a sufficient understanding of HTML and JavaScript to write their online applications. This book emphasises basic programming principles in a modern Web-oriented environment, making it suitable for an introductory programming course for non-computer science majors. It is also ideal for self-study.","language":"en","currency":"USD","id":"1846286573","title":"An Introduction to HTML and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MPPy5KpAZQ0C&source=gbs_api","authors":["David R. Brooks"]},{"pageCount":415,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NTh1O5X47FEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"For Scientists and Engineers","description":"This book enables readers to quickly develop a working knowledge of HTML, JavaScript and PHP. The text emphasizes a hands-on approach to learning and makes extensive use of examples. A detailed science, engineering, or mathematics background is not required to understand the material, making the book ideally suitable for self-study or an introductory course in programming. Features: describes the creation and use of HTML documents; presents fundamental concepts of client-side and server-side programming languages; examines JavaScript and PHP implementation of arrays, built-in and user-defined methods and functions, math capabilities, and input processing with HTML forms; extends programming fundamentals to include reading and writing server-based files, command-line interfaces, and an introduction to GD graphics; appendices include a brief introduction to using a “pseudocode” approach to organizing solutions to computing problems; includes a Glossary and an extensive set of programming exercises.","language":"en","currency":"USD","id":"9780857294494","title":"Guide to HTML, JavaScript and PHP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NTh1O5X47FEC&source=gbs_api","authors":["David R. Brooks"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fru9BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is ideal for any JavaScript developer who is interested in producing well-tested code. If you have no prior experience with testing, Node.js, or any other tool, do not worry, as they will be explained from scratch.","language":"en","currency":"USD","id":"1784390178","title":"Learning Behavior-driven Development with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fru9BgAAQBAJ&source=gbs_api","authors":["Enrique Amodeo"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z6ThAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Exploring the Modern Capabilities of JavaScript and HTML5","description":"JavaScript Creativity teaches you how to use every feature of this versatile and powerful language in exciting and creative ways. JavaScript can be used for so much more than simple interactivity. Master your use of canvas, animation, audio and video, 3D visualizations, motion detection and real-time collaboration. In every chapter of this book you will learn how to use and evolve JavaScript's creative capabilities in your own projects, as well as having project examples to follow throughout. Specifically, you will learn how to: Expertly use canvas and animation Push audio and video to their full capabilities Code and manipulate advanced 3D visualizations Create your own music directly from the browser Implement real-time collaboration with Node.js Explore real-time audio and video with WebRTC Play with motion detection and gesture control Combine all features into one social music creation experiment, similar to Google's 'Jam with Chrome' JavaScript Creativity is for the developer who has a working knowledge of JavaScript and wants to take their code to the next level. Every feature explored can be manipulated and implemented in your everyday projects to really impress your clients or just increase your code skill. This book is an exciting, action-packed introduction to all the advanced and truly creative aspects of this language - start creative coding today!","language":"en","currency":"USD","id":"1430259450","title":"JavaScript Creativity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z6ThAwAAQBAJ&source=gbs_api","authors":["Shane Hudson"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GpkCj_mgWU0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Hands-On Guide to the Fundamentals of Modern JavaScript","description":"Get Started Fast with Modern JavaScript Web Development! With the arrival of HTML5, jQuery, and Ajax, JavaScript web development skills are more valuable than ever! This complete, hands-on JavaScript tutorial covers everything you need to know now. Using line-by-line code walkthroughs and end-of-chapter exercises, top web developer and speaker Tim Wright will help you get results fast, even if you’ve never written a line of JavaScript before. Smart, friendly, enthusiastic, and packed with modern examples, Learning JavaScript covers both design-level and development-level JavaScript. You’ll find expert knowledge and best practices for everything from jQuery and interface design to code organization and front-end templating. Wright’s focused coverage includes regular break points and clear reviews that make modern JavaScript easier to learn—and easier to use! Learning JavaScript is your fastest route to success with JavaScript—whether you’re entirely new to the language or you need to sharpen and upgrade skills you first learned a decade ago! Coverage includes • Mastering all of the JavaScript concepts and terminology you need to write new programs or efficiently modify existing code • Creating robust, secure code for both the design and development levels • Maximizing usability, reusability, accessibility, clarity, security, and performance • Taking full advantage of the browser environments your code will run in • Accessing the DOM to create behaviors and data interactions • Storing data for easy and efficient access • Using variables, functions, loops, and other core language features • Interacting with users through events • Communicating with servers through Ajax • Improving your productivity with JavaScript libraries","language":"en","currency":"USD","id":"0133016277","title":"Learning JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GpkCj_mgWU0C&source=gbs_api","authors":["Tim Wright"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJifBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"If you are a JavaScript developer working with asynchronous operations and want to know more about promises, then this book is ideal for you. Having a detailed explanation of JavaScript promises will be perfect as your next step towards adopting this new standard and using the API in your web and JavaScript applications.","language":"en","currency":"USD","id":"1783985658","title":"JavaScript Promises Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJifBAAAQBAJ&source=gbs_api","authors":["Rami Sarieddine"]},{"pageCount":95,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fn1bS4dR1r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.16,"subtitle":null,"description":"The JavaScript Programming Language provides a brief introduction to the JavaScript language that is now an important component of every programmers tool box. It offers an overview of JavaScript to students interested in pursuing advanced programming skills. Clear and Concise, The JavaScript Programming Language is an excellent primer to this popular dynamic language and is ideal for use on its own or when coupled with one of Jones and Bartlett's outstanding introductory computer science texts.","language":"en","currency":"USD","id":"1449662676","title":"The JavaScript Programming Language","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fn1bS4dR1r4C&source=gbs_api","authors":["Ray Toal","John David Dionisio"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RmphScK8u-gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Foundation HTML5 Animation with JavaScript covers everything that you need to know to create dynamic scripted animation using the HTML5 canvas. It provides information on all the relevant math you'll need, before moving on to physics concepts like acceleration, velocity, easing, springs, collision detection, conservation of momentum, 3D, and forward and inverse kinematics. Foundation HTML5 Animation with JavaScript is a fantastic resource for all web developers working in HTML5 or switching over from Flash to create standards-compliant games, applications, and animations that will work across all modern browsers and most mobile devices, including iPhones, iPads, and Android devices. You will learn how to utilize the amazing animation and physics-based code originally created by author Keith Peters in his hugely successful Foundation ActionScript Animation in all of your HTML5 applications. In no time at all, you'll understand the concepts behind scripted animation and also have the ability to create all manner of exciting animations and games.","language":"en","currency":"USD","id":"1430236663","title":"Foundation HTML5 Animation with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RmphScK8u-gC&source=gbs_api","authors":["Billy Lamberta","Keith Peters"]},{"pageCount":357,"thumbnail":"http:\/\/books.google.com\/books\/content?id=v_oIIyw1vSIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Create scalable, reusable high-quality JavaScript applications and libraries","language":"en","currency":"USD","id":"184719415X","title":"Object-Oriented JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=v_oIIyw1vSIC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yt1SDVNqsIoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"with HTML5 canvas, jQuery, and More","description":"With HTML5 and improved web browser support, JavaScript has become the tool of choice for creating high-performance web graphics. This faced-paced book shows you how to use JavaScript, jQuery, DHTML, and HTML5's Canvas element to create rich web applications for computers and mobile devices. By following real-world examples, experienced web developers learn fun and useful approaches to arcade games, DHTML effects, business dashboards, and other applications. This book serves complex subjects in easily digestible pieces, and each topic acts as a foundation for the next. Tackle JavaScript optimization and understand how it impacts performance Create fast-moving graphics by combining old-school DHTML with jQuery Learn advanced UI techniques using the jQuery UI and Ext JS libraries Build games with collision detection, object handling, and JavaScript scrolling techniques Master HTML5 Canvas basics for drawings, fills, bitmaps, animation, and more Create applications for the small screen with jQuery Mobile and PhoneGap Use Google’s data visualization tools to create interactive dashboards","language":"en","currency":"USD","id":"1449313078","title":"Supercharged JavaScript Graphics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yt1SDVNqsIoC&source=gbs_api","authors":["Raffaele Cecco"]},{"pageCount":620,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BZ4QAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"With jqPlot, d3, and Highcharts","description":"Beginning JavaScript Charts shows how to convert your data into eye-catching, innovative, animated, and highly interactive browser-based charts. This book is suitable for developers of all experience levels and needs: for those who love fast and effective solutions, you can use the jqPlot library to generate charts with amazing effects and animations using only a few lines of code; if you want more power and need to create data visualization beyond traditional charts, then D3 is the JavaScript library for you; finally, if you need a high-performance, professional solution for interactive charts, then the Highcharts library is also covered. If you are an experienced developer and want to take things further, then Beginning JavaScript Charts also shows you how to develop your own graphics library starting from scratch using jQuery. At the end of the book, you will have a good knowledge of all the elements needed to manage data from every possible source, from high-end scientific instruments to Arduino boards, from PHP SQL databases queries to simple HTML tables, and from Matlab calculations to reports in Excel. You will be able to provide cutting-edge charts exploiting the growing power of modern browsers. Create all kinds of charts using the latest technologies available on browsers (HTML5, CSS3, jQuery, jqPlot, D3, Highcharts, and SVG) Full of step-by-step examples, Beginning JavaScript Charts introduces you gradually to all aspects of chart development, from the data source to the choice of which solution to apply. This book provides a number of tools that can be the starting point for any project requiring graphical representations of data, whether using commercial libraries or your own","language":"en","currency":"USD","id":"1430262907","title":"Beginning JavaScript Charts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BZ4QAwAAQBAJ&source=gbs_api","authors":["Fabio Nelli"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t6-jBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":"Everything You Need to Learn JavaScript From Scratch","description":"Everything you need to learn JavaScript from Scratch! Packed with numerous examples, Simply JavaScript is a step-by-step introduction to programming in JavaScript the right way. Learn how easy it is to use JavaScript to solve real-world problems, build smarter forms, track user events (such as mouse clicks and key strokes), and design eye-catching animations. Then move into more powerful techniques using the DOM and Ajax. Learn JavaScript's built-in functions, methods, and properties. Easily integrate JavaScript in your web site. Use JavaScript to validate form entries and interact with your users. Understand how to respond to user events. Create animations that bring your web site to life. Start programming using the DOM and Ajax. Unlike other JavaScript books, modern best practices such as progressive enhancement, accessibility and unobtrusive scripting are used from the very beginning. All the code in the book is also cross-browser compatible and downloadable for free, so you can get started instantly!","language":"en","currency":"USD","id":"1457191652","title":"Simply JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t6-jBgAAQBAJ&source=gbs_api","authors":["Kevin Yank","Cameron Adams"]},{"pageCount":1224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WMr2NEG88icC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The bestselling JavaScript reference, now updated to reflect changes in technology and best practices As the most comprehensive book on the market, the JavaScript Bible is a classic bestseller that keeps you up to date on the latest changes in JavaScript, the leading technology for incorporating interactivity into Web pages. Part tutorial, part reference, this book serves as both a learning tool for building new JavaScript skills as well as a detailed reference for the more experienced JavaScript user. You'll get up-to-date coverage on the latest JavaScript practices that have been implemented since the previous edition, as well as the most updated code listings that reflect new concepts. Plus, you'll learn how to apply the latest JavaScript exception handling and custom object techniques. Coverage includes: JavaScript's Role in the World Wide Web and Beyond Developing a Scripting Strategy Selecting and Using Your Tools JavaScript Essentials Your First JavaScript Script Browser and Document Objects Scripts and HTML Documents Programming Fundamentals Window and Document Objects Forms and Form Elements Strings, Math, and Dates Scripting Frames and Multiple Windows Images and Dynamic HTML The String Object The Math, Number, and Boolean Objects The Date Object The Array Object JSON - Native JavaScript Object Notation E4X - Native XML Processing Control Structures and Exception Handling JavaScript Operators Function Objects and Custom Objects Global Functions and Statements Document Object Model Essentials Generic HTML Element Objects Window and Frame Objects Location and History Objects Document and Body Objects Link and Anchor Objects Image, Area, Map, and Canvas Objects Event Objects Practical examples of working code round out this new edition and contribute to helping you learn JavaScript quickly yet thoroughly.","language":"en","currency":"USD","id":"0470952806","title":"JavaScript Bible","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WMr2NEG88icC&source=gbs_api","authors":["Danny Goodman","Michael Morrison","Paul Novitski","Tia Gustaff Rayl"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_b7njGGMvSYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Already comfortable with JavaScript and HTML? Microsoft has just empowered you to build breakthrough apps for Windows 8. It’s a remarkable opportunity--and best-selling Microsoft web development author Stephen Walther will show you how to take full advantage of it. Offering the same deep insight and practical code that has made his ASP.NET Unleashed the #1 ASP.NET book of all time, Walther covers everything you need to build, test, and distribute outstanding Windows 8 software with JavaScript and HTML5. Walther clearly demonstrates the unique advantages Windows 8 offers to web developers. He guides you through using Microsoft’s new WinJS library to develop apps for Microsoft’s brand-new version of Windows--you learn how to use JavaScript templates, controls, and data binding. You’ll find in-depth coverage of everything from displaying data with a ListView control to supporting SkyDrive cloud storage, creating games to using IndexedDB and HTML5 forms. If you’re a web developer, Windows 8 gives you millions of new potential users--and you already have many of the skills you’ll need to reach them. Get this book, master the tools and techniques you don’t already know--and go after that huge new market! Detailed information on how to... Get your app published in the Windows Store Create apps that work great with touch, keyboard, stylus, and mouse Use JavaScript controls such as the Tooltip, Rating, DatePicker, and FlipView controls Thoroughly master using the WinJS ListView control to display, sort, and filter data Use HTML5 Canvas to build arcade games Store data on the local file system, via remote web services, or in IndexedDB databases Use Live Services to authenticate users, retrieve user profiles, and interact with SkyDrive Create custom WinJS controls with Page Controls Build apps that gracefully adapt to different screen resolutions and orientations Take pictures from your computer’s webcam and play sounds","language":"en","currency":"USD","id":"0133033864","title":"Windows 8 Apps with HTML5 and JavaScript Unleashed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_b7njGGMvSYC&source=gbs_api","authors":["Stephen Walther"]},{"pageCount":508,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pXi7AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"with HTML5 Canvas","description":"Have you ever wanted to include believable physical behaviors in your games and projects to give them that extra edge? Physics for JavaScript Games, Animation, and Simulations teaches you how to incorporate real physics, such as gravity, friction, and buoyancy, into your HTML5 games, animations, and simulations. It also includes more advanced topics, such as particle systems, which are essential for creating effects such as sparks or smoke. The book also addresses the key issue of balancing accuracy and simplicity in your games and simulations, and the final chapters provide you with the information and the code to make the right choice for your project. Physics for JavaScript Games, Animation, and Simulations assumes you have a basic knowledge of JavaScript and HTML5. However, no previous knowledge of physics is required—only some very basic math skills. The authors present everything from basic principles to advanced concepts in an approachable way, so you’ll be able to follow the logic and easily adapt the principles to your own applications. The book is packed full of practical examples of how you can apply physics to your own games and applications. Spring behaviors can be used for anything from tweaking lowrider suspension to creating cloth simulation; flotation mechanics enable the simulation of submersibles or dirigibles; you can even create your own solar system with accurate orbits and gravity. It doesn’t matter if you’re modeling the Lorentz force in an electromagnetic field or you’re modeling the lift force in a flight simulator, Physics for JavaScript Games, Animation, and Simulations enables you to fill your games and applications with accurate and realistic effects.","language":"en","currency":"USD","id":"1430263385","title":"Physics for JavaScript Games, Animation, and Simulations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pXi7AwAAQBAJ&source=gbs_api","authors":["Adrian Dobre","Dev Ramtal"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ERTgAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Beginning Windows Store Application Development – HTML and JavaScript Edition introduces you to the Windows 8 modern app design paradigm and the new Windows 8 programming model developed around this paradigm. You'll learn to build rich, immersive applications designed to run on the many devices powered by Windows 8. The authors draw on their extensive practical experience to provide not only a comprehensive introduction to the model and its features, but guidance on best practices and a real-world sample application that you develop over the course of the book. Beginning Windows Store Application Development – HTML and JavaScript Edition also emphasizes how devices will be used and applications will be built in a world that has become far more connected. The book takes you beyond the syntax of any development language and examines factors such as application design, user experience, social integration, and maintaining data and settings across multiple devices.","language":"en","currency":"USD","id":"1430257806","title":"Beginning Windows Store Application Development: HTML and JavaScript Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ERTgAAAAQBAJ&source=gbs_api","authors":["Scott Isaacs","Kyle Burns"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=D9wWS6HAfzUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Bridging the Gap Between the Web and the Mobile Web","description":"This hands-on book looks past the hype and buzzwords surrounding HTML5 and gives you a conservative and practical approach to using HTML5, JavaScript MVC frameworks, and the latest W3C specifications. You’ll quickly master how to build mobile and desktop web apps that are widely supported across all major web browsers and devices. Even though Web Storage, Web Workers, Geolocation, Device Orientation, and WebSockets have been covered many times in the past, it is often from a very high or basic level. This book goes into the trenches to review actual use cases for each of these APIs and gives real-world examples on how to use each one. If you're familiar with JavaScript, CSS and HTML basics and are ready to start piecing together the architecture of HTML5, then this book is for you. Assemble a coherent architectural whole from HTML5’s complex collection of parts Gain a clear understanding of client-side architecture and the \"mobile first\" approach Design, create, and tune eye-catching and robust mobile web apps Explore how the top five JavaScript MVC frameworks interact with the server Learn best practices for setting up a raw WebSocket server Examine how sites such as Google, Twitter, and Amazon store data on the client Use real-world methods for applying geolocation, and learn the pitfalls of various implementations Process images and other data in the background with Web Workers","language":"en","currency":"USD","id":"144933301X","title":"HTML5 and JavaScript Web Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=D9wWS6HAfzUC&source=gbs_api","authors":["Wesley Hales"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oUpYRNKCjrgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Whether you're an old-school scripter who needs to modernize your JavaScripting skills or a standards-aware Web developer who needs best practices and code examples, you'll welcome this guide from a JavaScript master. Other JavaScript books use example scripts that have little bearing on real-world Web development and are useful only in the chapter at hand. In contrast, Peter-Paul Koch's book uses eight real-world scripts he created for real-world clients in order to earn real-world money. That means the scripts are guaranteed to do something useful (and sellable!) that enhances the usability of the page they're used on. The book's example scripts include one that sorts a data table according to the user's search queries, a form validation script, a script that shows form fields only when the user needs them, a drop-down menu, and a data retrieval script that uses simple Ajax and shows the data in an animation. After an overview of JavaScript's purpose, Peter-Paul provides theoretical chapters on the context (jobs for JavaScript, CSS vs. JavaScript), the browsers (debugging, the arcana of the browser string), and script preparation. Then follow practical chapters on Core, BOM, Events, DOM, CSS Modification, and Data Retrieval, all of which are explained through a combination of theoretical instruction and the taking apart of the relevant sections of the example scripts.","language":"en","currency":"USD","id":"9780132704953","title":"ppk on JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oUpYRNKCjrgC&source=gbs_api","authors":["Peter-Paul Koch"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E_amBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"for Phones, Tablets, and Desktop","description":"Building JavaScript Games teaches game programming through a series of engaging, arcade-style games that quickly expand your JavaScript and HTML5 skills. JavaScript is in the top ten most-used programming languages world wide, and is the basis for applications that can run in any modern browser, on any device from smart phone to tablet to PC. Especial emphasis is given to touch-based interface, but all games also run using a regular mouse and keyboard setup. The four games you’ll develop from reading this book are: Painter Jewel Jam Penguin Pairs Tick Tick These four games are casual, arcade-style games representing the aim-and-shoot, puzzle, maze, and platform styles of game play. The approach in Building JavaScript Games follows the basic structure of a game rather than the syntax of a language. From almost the very first chapter you are building games to run on your phone or other device and show to your friends. Successive projects teach about handling player input, manipulating game objects, designing game worlds, managing levels, and realism through physics. All told, you’ll develop four well-designed games, making Building JavaScript Games one of the most enjoyable ways there is to learn about programming browser-based games. The final chapters in the book contain a very nice bonus of sorts. In them you will find excerpts from interviews with two prominent people from the game industry: Mark Overmars, who is CTO of Tingly Games and creator of GameMaker, and Peter Vesterbacka, the CMO of Rovio Entertainment - the creators of the Angry Birds franchise. Their insight and perspective round off what is already a fun and valuable book.","language":"en","currency":"USD","id":"1430265396","title":"Building JavaScript Games","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E_amBAAAQBAJ&source=gbs_api","authors":["Arjan Egges"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RUjnAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Robust Web Architecture with Node, HTML5, and Modern JS Libraries","description":"Take advantage of JavaScript’s power to build robust web-scale or enterprise applications that are easy to extend and maintain. By applying the design patterns outlined in this practical book, experienced JavaScript developers will learn how to write flexible and resilient code that’s easier—yes, easier—to work with as your code base grows. JavaScript may be the most essential web programming language, but in the real world, JavaScript applications often break when you make changes. With this book, author Eric Elliott shows you how to add client- and server-side features to a large JavaScript application without negatively affecting the rest of your code. Examine the anatomy of a large-scale JavaScript application Build modern web apps with the capabilities of desktop applications Learn best practices for code organization, modularity, and reuse Separate your application into different layers of responsibility Build efficient, self-describing hypermedia APIs with Node.js Test, integrate, and deploy software updates in rapid cycles Control resource access with user authentication and authorization Expand your application’s reach through internationalization","language":"en","currency":"USD","id":"1491950250","title":"Programming JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RUjnAwAAQBAJ&source=gbs_api","authors":["Eric Elliott"]},{"pageCount":190,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bjw0IHfUCzMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"A practical, example-driven guide to using, automating, and integrating JavaScript Unit tests for the busy and conscientious JavaScript developer striving for excellence and success. JavaScript Unit Testing is a must have guide for every web developer, designer, architect, and JavaScript coder seeking to ensure the highest quality of their web applications and JS code. Knowledge of JavaScript is assumed.","language":"en","currency":"USD","id":"1782160639","title":"JavaScript Unit Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bjw0IHfUCzMC&source=gbs_api","authors":["Hazem Saleh"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JR0oAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Pushing the Limits","description":"Take your JavaScript knowledge as far as it can go JavaScript has grown up, and it's a hot topic. Newer and fasterJavaScript VMs and frameworks built upon them have increased thepopularity of JavaScript for server-side web applications, and richJS applications are being developed for mobile devices. This bookdelivers a compelling tutorial, showing you how to build areal-world app from the ground up. Experienced developers who wantto master the latest techniques and redefine their skills will findthis deep dive into JavaScript's hidden functionalities gives themthe tools to create truly amazing and complex applications. JavaScript has evolved into much more than simple client-sidescripting; this book delves into advanced topics not generallyfound in other more intermediate JS development books Expert author delivers an in-depth tutorial showing how tobuild a real-world app that is loosely coupled, with each componentbuilt to exist separately Explores how to build a backbone app, the importance ofJavaScript templates, Node.js and MongoDB, 3D Canvas using WebGL \/Three.js, how to convert a desktop app into a dedicated mobile app,and much more Ideal for experienced developers with a deep knowledge ofJavaScript as well as online developers with strong graphic designskills who are experienced in HTML\/CSS and want to develop theirfront-end skills JavaScript Programming: Pushing the Limits will arm youwith the skills to create killer apps for the 21st Century.","language":"en","currency":"USD","id":"1118524403","title":"JavaScript Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JR0oAAAAQBAJ&source=gbs_api","authors":["Jon Raasch"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OIhuxqUO2TcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Introducing Functional Programming with Underscore.js","description":"How can you overcome JavaScript language oddities and unsafe features? With this book, you’ll learn how to create code that’s beautiful, safe, and simple to understand and test by using JavaScript’s functional programming support. Author Michael Fogus shows you how to apply functional-style concepts with Underscore.js, a JavaScript library that facilitates functional programming techniques. Sample code is available on GitHub at https:\/\/github.com\/funjs\/book-source. Fogus helps you think in a functional way to help you minimize complexity in the programs you build. If you’re a JavaScript programmer hoping to learn functional programming techniques, or a functional programmer looking to learn JavaScript, this book is the ideal introduction. Use applicative programming techniques with first-class functions Understand how and why you might leverage variable scoping and closures Delve into higher-order functions—and learn how they take other functions as arguments for maximum advantage Explore ways to compose new functions from existing functions Get around JavaScript’s limitations for using recursive functions Reduce, hide, or eliminate the footprint of state change in your programs Practice flow-based programming with chains and functional pipelines Discover how to code without using classes","language":"en","currency":"USD","id":"1449360785","title":"Functional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OIhuxqUO2TcC&source=gbs_api","authors":["Michael Fogus"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bzekBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.","language":"en","currency":"USD","id":"1118903439","title":"Beginning JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bzekBgAAQBAJ&source=gbs_api","authors":["Jeremy McPeak"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bzekBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.","language":"en","currency":"USD","id":"1118903439","title":"Beginning JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bzekBgAAQBAJ&source=gbs_api","authors":["Jeremy McPeak"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L46fX62D5qYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A JavaScript and jQuery Developer's Guide","description":"With Learning JavaScript Design Patterns, you’ll learn how to write beautiful, structured, and maintainable JavaScript by applying classical and modern design patterns to the language. If you want to keep your code efficient, more manageable, and up-to-date with the latest best practices, this book is for you. Explore many popular design patterns, including Modules, Observers, Facades, and Mediators. Learn how modern architectural patterns—such as MVC, MVP, and MVVM—are useful from the perspective of a modern web application developer. This book also walks experienced JavaScript developers through modern module formats, how to namespace code effectively, and other essential topics. Learn the structure of design patterns and how they are written Understand different pattern categories, including creational, structural, and behavioral Walk through more than 20 classical and modern design patterns in JavaScript Use several options for writing modular code—including the Module pattern, Asyncronous Module Definition (AMD), and CommonJS Discover design patterns implemented in the jQuery library Learn popular design patterns for writing maintainable jQuery plug-ins \"This book should be in every JavaScript developer’s hands. It’s the go-to book on JavaScript patterns that will be read and referenced many times in the future.\"—Andrée Hansson, Lead Front-End Developer, presis!","language":"en","currency":"USD","id":"1449334873","title":"Learning JavaScript Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L46fX62D5qYC&source=gbs_api","authors":["Addy Osmani"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JwnQsegEStEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Pro JavaScript with MooTools is unlike any other JavaScript book on the market today. While similar books focus on either JavaScript as a language of the browser or how to use JavaScript frameworks, Pro JavaScript with MooTools fills the gap between these topics and moves beyond—exploring the advanced features of JavaScript and how the MooTools framework uses these features to further improve the language itself. The book itself takes a unique three-pronged approach. It first walks you through the advanced features of JavaScript and the MooTools framework, including native augmentation and type creation, a comprehensive discussion of JavaScript functions, object-oriented programming with native JavaScript and MooTools Classes, and the MooTools Class internals. You’ll then learn all about Javascript in the DOM: the Elements classes and its internals, the MooTools Event system, Selector engines and MooTools Slick, Ajax and the Request Object, and animation and the Fx classes. The final section really sets the book apart from all others, as it discusses JavaScript outside the browsers. You’ll take an in-depth look at CommonJS and MooTools, using MooTools outside the browser to build ORM, creating simple CommonJS applications via the MooTools Deck framework, and creating complex server-side applications using Raccoon.","language":"en","currency":"USD","id":"143023055X","title":"Pro JavaScript with MooTools","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JwnQsegEStEC&source=gbs_api","authors":["Mark Obcena"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=siwEAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.27,"subtitle":"Bringing classic computing approaches to the Web","description":"As an experienced JavaScript developer moving to server-side programming, you need to implement classic data structures and algorithms associated with conventional object-oriented languages like C# and Java. This practical guide shows you how to work hands-on with a variety of storage mechanisms—including linked lists, stacks, queues, and graphs—within the constraints of the JavaScript environment. Determine which data structures and algorithms are most appropriate for the problems you’re trying to solve, and understand the tradeoffs when using them in a JavaScript program. An overview of the JavaScript features used throughout the book is also included. This book covers: Arrays and lists: the most common data structures Stacks and queues: more complex list-like data structures Linked lists: how they overcome the shortcomings of arrays Dictionaries: storing data as key-value pairs Hashing: good for quick insertion and retrieval Sets: useful for storing unique elements that appear only once Binary Trees: storing data in a hierarchical manner Graphs and graph algorithms: ideal for modeling networks Algorithms: including those that help you sort or search data Advanced algorithms: dynamic programming and greedy algorithms","language":"en","currency":"USD","id":"144937395X","title":"Data Structures and Algorithms with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=siwEAwAAQBAJ&source=gbs_api","authors":["Michael McMillan"]},{"pageCount":315,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3UMRoqheU3sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Clear and practical recipes for building web applications using JavaScript and AJAX without having to learn Objective-C or Cocoa.","language":"en","currency":"USD","id":"1849691096","title":"IPhone JavaScript Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3UMRoqheU3sC&source=gbs_api","authors":["Arturo Fernandez Montoro"]},{"pageCount":832,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vlZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"With jQuery, CSS & HTML5","description":"Build interactive, data-driven websites with the potent combination of open source technologies and web standards, even if you have only basic HTML knowledge. In this update to this popular hands-on guide, you’ll tackle dynamic web programming with the latest versions of today’s core technologies: PHP, MySQL, JavaScript, CSS, HTML5, and key jQuery libraries. Web designers will learn how to use these technologies together and pick up valuable web programming practices along the way—including how to optimize websites for mobile devices. At the end of the book, you’ll put everything together to build a fully functional social networking site suitable for both desktop and mobile browsers. Explore MySQL, from database structure to complex queries Use the MySQLi extension, PHP’s improved MySQL interface Create dynamic PHP web pages that tailor themselves to the user Manage cookies and sessions and maintain a high level of security Enhance the JavaScript language with jQuery and jQuery mobile libraries Use Ajax calls for background browser-server communication Style your web pages by acquiring CSS2 and CSS3 skills Implement HTML5 features, including geolocation, audio, video, and the canvas element Reformat your websites into mobile web apps","language":"en","currency":"USD","id":"1491979097","title":"Learning PHP, MySQL & JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vlZaDwAAQBAJ&source=gbs_api","authors":["Robin Nixon"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"A project based guide to help you get started with web development by building real-world and modern web applications About This Book Learn JavaScript from scratch by building clones of popular web applications Understand the core concepts and techniques surrounding JavaScript with this power-packed hands-on guide Explore modern JavaScript frameworks and libraries such as Node, React and Webpack Who This Book Is For The target audience for this book is developers with little or basic knowledge of working with JavaScript. If you are an emerging web developer with experience in building static web pages using HTML and CSS, this book will teach you to add JavaScript elements to make your website interactive and dynamic. What You Will Learn A strong understanding of web application development with JavaScript and ES6. A firm foundation on which to master other JavaScript frameworks and libraries. Write maintainable and scalable code by organizing functions into modules. Importance of tools such as Node, NPM, Babel, and Webpack in Front-end development. Work with real-time data such as incoming video streams, texts, and so on Integrate React with JavaScript to build large-scale applications. Utilize Redux to manage data across React components and greatly speed up the development process In Detail JavaScript is the programming language that all web developers need to learn. The first item on our JavaScript to-do list is building g a To-do list app, which you'll have done by the end of the first chapter. You'll explore DOM manipulation with JavaScript and work with event listeners. You'll work with images and text to build a Meme creator. You will also learn about ES (ECMAScript) classes, and will be introduced to layouts using the CSS3 Flexbox. You'll also develop a responsive Event Registration form that allows users to register for your upcoming event and use charts and graphics to display registration data. You will then build a weather application, which will show you different ways perform AJAX requests and work with dynamic, external data. WebRTC enables real-time communication in a web browser; you'll learn how to use it when you build a real-time video-call and chat application later in the book. Towards the end of the book, you will meet React, Facebook's JavaScript library for building user interfaces. You'll throw together a blog with React, and get a feel for why this kind of JavaScript framework is used to build large-scale applications. To make your blog more maintainable and scalable, you'll use Redux to manage data across React components. Style and approach This project-based guide will teach you all the facets of JavaScript through real-world app examples.","language":"en","currency":"USD","id":"1788299000","title":"JavaScript by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJZGDwAAQBAJ&source=gbs_api","authors":["Dani Akash S"]},{"pageCount":233,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nw8NDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.71,"subtitle":"Learn to Code with the Web Audio API","description":"Learn how to program JavaScript while creating interactive audio applications with JavaScript for Sound Artists: Learn to Code With the Web Audio API! William Turner and Steve Leonard showcase the basics of JavaScript language programing so that readers can learn how to build browser based audio applications, such as music synthesizers and drum machines. The companion website offers further opportunity for growth. Web Audio API instruction includes oscillators, audio file loading and playback, basic audio manipulation, panning and time. This book encompasses all of the basic features of JavaScript with aspects of the Web Audio API to heighten the capability of any browser. Key Features Uses the readers existing knowledge of audio technology to facilitate learning how to program using JavaScript. The teaching will be done through a series of annotated examples and explanations. Downloadable code examples and links to additional reference material included on the books companion website. This book makes learning programming more approachable to nonprofessional programmers The context of teaching JavaScript for the creative audio community in this manner does not exist anywhere else in the market and uses example-based teaching","language":"en","currency":"USD","id":"1317334949","title":"JavaScript for Sound Artists","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nw8NDgAAQBAJ&source=gbs_api","authors":["William Turner","Steve Leonard"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OY0pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Dive into ES6 and the Future of JavaScript","description":"To get the most out of modern JavaScript, you need learn the latest features of its parent specification, ECMAScript 6 (ES6). This book provides a highly practical look at ES6, without getting lost in the specification or its implementation details. Armed with practical examples, author Nicolas Bevacqua shows you new ways to deal with asynchronous flow control, declare objects or functions, and create proxies or unique sets, among many other features. The first title in Bevacqua’s Modular JavaScript series, Practical Modern JavaScript prepares JavaScript and Node.js developers for applied lessons in modular design, testing, and deployment in subsequent books. This book explains: How JavaScript and its standards development process have evolved Essential ES6 changes, including arrow functions, destructuring, let and const Class syntax for declaring object prototypes, and the new Symbol primitive How to handle flow control with Promises, iterators, generators, and async functions ES6 collection built-in types for creating object maps and unique sets How and when to use the new Proxy and Reflect built-ins Changes to Array, Math, numbers, strings, Unicode, and regular expressions, and other improvements since ES5","language":"en","currency":"USD","id":"1491943548","title":"Practical Modern JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OY0pDwAAQBAJ&source=gbs_api","authors":["Nicolas Bevacqua"]},{"pageCount":375,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0bmK3Ey9LLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.75,"subtitle":null,"description":"Even if you have no programming experience, you'll learn to create dynamic, interactive Web pages with help from this easy-to-use, self-teaching guide. Author and programming instructor Jim Keogh covers the basics of this leading Web development language and explains how to write cross-browser JavaScript programs in no time.","language":"en","currency":"USD","id":"9780071471398","title":"JavaScript Demystified","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0bmK3Ey9LLUC&source=gbs_api","authors":["Jim Keogh"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NVjKLIj0808C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Fully updated for the latest JavaScript standard and featuring a new chapter on HTML5 and jQuery JavaScript: A Beginner's Guide shows how to create dynamic Web pages complete with special effects using today's leading Web development language. With the growth of HTML 5, JavaScript is expected to grow even more to script the canvas element, add drag and drop functionality, and more. This fast-paced tutorial provides step-by-step coverage of the fundamentals, including variables, functions, operators, event handlers, objects, arrays, strings, and forms. The book then moves to more advanced techniques, including debugging, accessibility, and security. This pedagogically rich, hands-on guide explains how JavaScript works with HTML 5 and covers the new features available in JavaScript. Key Skills & Concepts--Chapter-opening lists of specific skills covered in the chapter Ask the Expert--Q & A sections filled with bonus information and helpful tips Try This--Hands-on exercises that show you how to apply your skills Notes--Extra information related to the topic being covered Tips--Helpful reminders or alternate ways of doing things Self-Tests--End-of-chapter reviews to test your knowledge Annotated syntax--Example code with commentary that describes the programming techniques being illustrated Code downloads provided for projects in the book","language":"en","currency":"USD","id":"0071809384","title":"JavaScript: A Beginner's Guide, Fourth Edition (INKLING CH)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NVjKLIj0808C&source=gbs_api","authors":["John Pollock"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mPkdocbvG_MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.08,"subtitle":null,"description":"100 JavaScript power solutions in one handy guide This practical resource contains 100 ready-to-run JavaScript plug-ins you can use to create dynamic Web content. The book begins by explaining JavaScript, Cascading Style Sheets (CSS), and the Document Object Model (DOM). Then, each chapter in Plug-In JavaScript offers complete, working examples for specific end results you can achieve right away. Using these plug-ins, you'll be able to build JavaScript projects quicker and easier than ever, as many complex tasks are reduced to a single function call. Get ready-made JavaScript plug-ins for: Resizing and repositioning objects Fading between objects Movement and animation Chaining and interaction Menus and navigation Text effects Audio and visual effects Cookies, Ajax, and security Forms and validation And much more Download all of the plug-ins at the book's companion website.","language":"en","currency":"USD","id":"0071738622","title":"Plug-In JavaScript 100 Power Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mPkdocbvG_MC&source=gbs_api","authors":["Robin Nixon"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cgYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":"A Playful Introduction to Programming","description":"JavaScript is the programming language of the Internet, the secret sauce that makes the Web awesome, your favorite sites interactive, and online games fun! JavaScript for Kids is a lighthearted introduction that teaches programming essentials through patient, step-by-step examples paired with funny illustrations. You’ll begin with the basics, like working with strings, arrays, and loops, and then move on to more advanced topics, like building interactivity with jQuery and drawing graphics with Canvas. Along the way, you’ll write games such as Find the Buried Treasure, Hangman, and Snake. You’ll also learn how to: –Create functions to organize and reuse your code –Write and modify HTML to create dynamic web pages –Use the DOM and jQuery to make your web pages react to user input –Use the Canvas element to draw and animate graphics –Program real user-controlled games with collision detection and score keeping With visual examples like bouncing balls, animated bees, and racing cars, you can really see what you’re programming. Each chapter builds on the last, and programming challenges at the end of each chapter will stretch your brain and inspire your own amazing programs. Make something cool with JavaScript today! Ages 10+ (and their parents!)","language":"en","currency":"USD","id":"1593276591","title":"JavaScript for Kids","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cgYvDwAAQBAJ&source=gbs_api","authors":["Nick Morgan"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=r1PODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":null,"description":"JavaScript is the native language of the Internet. Originally created to make web pages more dynamic, it is now used for software projects of all kinds, including scientific visualization and data services. However, most data scientists have little or no experience with JavaScript, and most introductions to the language are written for people who want to build shopping carts rather than share maps of coral reefs. This book will introduce you to JavaScript's power and idiosyncrasies and guide you through the key features of the language and its tools and libraries. The book places equal focus on client- and server-side programming, and shows readers how to create interactive web content, build and test data services, and visualize data in the browser. Topics include: The core features of modern JavaScript Creating templated web pages Making those pages interactive using React Data visualization using Vega-Lite Using Data-Forge to wrangle tabular data Building a data service with Express Unit testing with Mocha All of the material is covered by the Creative Commons Attribution-Noncommercial 4.0 International license (CC-BY-NC-4.0) and is included in the book's companion website at http:\/\/js4ds.org . Maya Gans is a freelance data scientist and front-end developer by way of quantitative biology. Toby Hodges is a bioinformatician turned community coordinator who works at the European Molecular Biology Laboratory. Greg Wilson co-founded Software Carpentry, and is now part of the education team at RStudio","language":"en","currency":"USD","id":"1000028593","title":"JavaScript for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=r1PODwAAQBAJ&source=gbs_api","authors":["Maya Gans","Toby Hodges","Greg Wilson"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSVTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.99,"subtitle":"A Modern Introduction to Programming","description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you'll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you'll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn't it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.","language":"en","currency":"USD","id":"1593279515","title":"Eloquent JavaScript, 3rd Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSVTDwAAQBAJ&source=gbs_api","authors":["Marijn Haverbeke"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PRlytmflmhoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn HTML5 and JavaScript for Android teaches the essential HTML5 and JavaScript skills you need to make great apps for the Android platform and browser. This book guides you through the creation of a mobile web app. You'll put the HTML5, CSS3 and JavaScript skills you learn into practice, giving you invaluable first-hand experience that will serve you well as you go on to develop your own web apps for Android smartphones and tablets. Throughout this book, you will learn new skills and bring these altogether to create a web app that runs on the Android platform as well as other mobile platforms.","language":"en","currency":"USD","id":"1430243481","title":"Learn HTML5 and JavaScript for Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PRlytmflmhoC&source=gbs_api","authors":["Gavin Williams"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MwwxCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Angu Java jQue All One Sa_p1","description":"Learn AngularJS, JavaScript and jQuery Web Application Development In just a short time, you can learn the basics of the JavaScript language, jQuery library, and AngularJS framework – and find out how to use them to build well-designed, reusable components for web applications. Sams Teach Yourself AngularJS, JavaScript, and jQuery All in One assumes absolutely no previous knowledge of JavaScript or jQuery. The authors begin by helping students gain the relevant JavaScript skills they need, introducing JavaScript in a way specifically designed for modern AngularJS web development. Each short, easy lesson builds on all that's come before, teaching new concepts and techniques from the ground up, through practical examples and hands-on problem solving. As you complete the lessons in this book, you'll gain a practical understanding of how to provide rich user interactions in your web pages, adding dynamic code that allows web pages to instantly react to mouse clicks and finger swipes, and interact with back-end services to store and retrieve data from the web server. Learn how to: Create powerful, highly interactive single-page web applications Leverage AngularJS’s innovative MVC approach to web development Use JavaScript in modern frameworks Implement JavaScript, jQuery, and AngularJS together in web pages Dynamically modify page elements in the browser Use browser events to interact with the user directly Implement client-side services that interact with web servers Integrate rich user interface components, including zoomable images and expandable lists Enhance user experience by creating AngularJS templates with built-in directives Bind user interface elements and events to the data model to add flexibility and support more robust interactivity Define custom AngularJS directives to extend HTML’s capabilities Build dynamic browser views to provide richer user interaction Create custom services you can integrate into many AngularJS applications Develop a well-structured code base that’s easy to reuse and maintain Contents at a Glance Part I: An Introduction to AngularJS, jQuery, and JavaScript Development 1 Introduction to Dynamic Web Programming 2 Debugging JavaScript in Web Pages 3 Understanding Dynamic Web Page Anatomy 4 Adding CSS\/CSS3 Styles to Allow Dynamic Design and Layout 5 Jumping into jQuery and JavaScript Syntax 6 Understanding and Using JavaScript Objects Part II: Implementing jQuery and JavaScript in Web Pages 7 Accessing DOM Elements Using JavaScript and jQuery Objects 8 Navigating and Manipulating jQuery Objects and DOM Elements with jQuery 9 Applying JavaScript and jQuery Events for Richly Interactive Web Pages 10 Dynamically Accessing and Manipulating Web Pages with JavaScript and jQuery 11 Working with Window, Browser, and Other Non-Web Page Elements Part III: Building Richly Interactive Web Pages with jQuery 12 Enhancing User Interaction Through jQuery Animation and Other Special Effects 13 Interacting with Web Forms in jQuery and JavaScript 14 Creating Advanced Web Page Elements in jQuery 15 Accessing Server-Side Data via JavaScript and jQuery AJAX Requests Part IV: Utilizing jQuery UI 16 Introducing jQuery UI 17 Using jQuery UI Effects 18 Advanced Interactions With jQuery UI Interaction Widgets 19 Using jQuery UI Widgets to Add Rich Interactions to Web Pages Part V: Building Web Applications with AngularJS 20 Getting Started with AngularJS 21 Understanding AngularJS Application Dynamics 22 Implementing the Scope as a Data Model 23 Using AngularJS Templates to Create Views 24 Implementing Directives in AngularJS Views 25 Creating Your Own Custom Directives to Extend HTML 26 Using Events to Interact with Data in the Model 27 Implementing AngularJS Services in Web Applications 28 Creating Your Own Custom AngularJS Services 29 Creating Rich Web Application Components the AngularJS Way","language":"en","currency":"USD","id":"0134171691","title":"AngularJS, JavaScript, and jQuery All in One, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MwwxCgAAQBAJ&source=gbs_api","authors":["Brad Dayley","Brendan Dayley"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rhijBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":null,"description":"Learn JavaScript from scratch! Packed with numerous examples, JavaScript: Novice to Ninja is a fun, step-by-step and comprehensive introduction to development in JavaScript. Discover how to use JavaScript to solve real-world problems, build smarter forms, track user events, and design eye-catching animations. Learn JavaScript's built-in functions, methods, and properties. Use JavaScript to validate form entries and interact with your users. Understand how to respond to user events and add interactivity to your applications. Create animations that bring your web site to life. Start programming using the DOM And much more!","language":"en","currency":"USD","id":"1457192632","title":"JavaScript: Novice to Ninja","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rhijBgAAQBAJ&source=gbs_api","authors":["Darren Jones"]},{"pageCount":241,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oMO4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Your Complete Guide to the New Features Introduced in JavaScript, Starting from ES6 to ES9","description":"JavaScript has finally grown up. Armed with a slew of new features, JavaScript now makes writing the code that powers your applications elegant, concise, and easy to understand. This book is a pragmatic guide to the new features introduced in JavaScript, starting with Edition 6 of ECMAScript, and ending with Edition 9. Using a \"compare and contrast\" approach, each chapter offers a deep dive into new features, highlighting how best to use them moving forward. As you progress through the book, you'll be offered multiple opportunities to see the new features in action, and in concert with one another. Backed by an example-driven writing style, you'll learn by doing, and get ready to embrace the new world of JavaScript. What You'll Learn Provide a deep exposition of the new features introduced in ES6 through ES9 Review how JavaScript's new features by-pass any limitations of an existing approach Examine the refactoring necessary to go from old to new Demonstrate how JavaScript's new features work in unison with each other Who This Book Is For New and experienced developers who wish to keep abreast of the changes to JavaScript and deepen their understanding of the language.","language":"en","currency":"USD","id":"1484253949","title":"JavaScript Next","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oMO4DwAAQBAJ&source=gbs_api","authors":["Raju Gandhi"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tYIFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":2.97,"subtitle":"JavaScript Syntax, What JavaScript is Use for in Website Development, JavaScript Variable, Strings, Popup Boxes, JavaScript Objects, Function, and Event Handlers","description":"This is a guide on how to use JavaScript to give dynamic features to a static website, development of web base applications through the knowledge of JavaScript Variable, Operators, Boolean, Even Handlers, Strings, Popup Boxes, Maths object e.t.c . It also entails other areas of application of JavaScript outside the Web. What You will Learn: *JavaScript Syntax *What JavaScript is Use for in Website Development. *Types of JavaScript *Where You can Place JavaScript *Javascript Display Methods *Popup Boxes *Date and Time *Function *Event Handlers *Colors in HTML Document using JavaScript. *Repeated Performance *Document Formatting *Event Object *JavaScript Variable *JavaScript Operators *Strings *JavaScript Booleans *JavaScript Math Object *JavaScript uses Outside Web Pages.","language":"en","currency":"USD","id":"171658938X","title":"JavaScript Fundamentals: JavaScript Syntax, What JavaScript is Use for in Website Development, JavaScript Variable, Strings, Popup Boxes, JavaScript Objects, Function, and Event Handlers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tYIFEAAAQBAJ&source=gbs_api","authors":["Steven Bright"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EJzuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":"The New Toys","description":"All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property\/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.","language":"en","currency":"USD","id":"1119367972","title":"JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EJzuDwAAQBAJ&source=gbs_api","authors":["T. J. Crowder"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0HxVDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Turning Bad Code Into Good Code","description":"How often do you hear people say things like this? \"Our JavaScript is a mess, but we’re thinking about using [framework of the month].\" Like it or not, JavaScript is not going away. No matter what framework or ”compiles-to-js” language or library you use, bugs and performance concerns will always be an issue if the underlying quality of your JavaScript is poor. Rewrites, including porting to the framework of the month, are terribly expensive and unpredictable. The bugs won’t magically go away, and can happily reproduce themselves in a new context. To complicate things further, features will get dropped, at least temporarily. The other popular method of fixing your JS is playing “JavaScript Jenga,” where each developer slowly and carefully takes their best guess at how the out-of-control system can be altered to allow for new features, hoping that this doesn’t bring the whole stack of blocks down. This book provides clear guidance on how best to avoid these pathological approaches to writing JavaScript: Recognize you have a problem with your JavaScript quality. Forgive the code you have now, and the developers who made it. Learn repeatable, memorable, and time-saving refactoring techniques. Apply these techniques as you work, fixing things along the way. Internalize these techniques, and avoid writing as much problematic code to begin with. Bad code doesn’t have to stay that way. And making it better doesn’t have to be intimidating or unreasonably expensive.","language":"en","currency":"USD","id":"1491964871","title":"Refactoring JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0HxVDgAAQBAJ&source=gbs_api","authors":["Evan Burchard"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XiWGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Speed up web development with the powerful features and benefits of JavaScript","description":"Gain a deeper understanding of JavaScript and apply it to build small applications in backend, frontend, and mobile frameworks. Key Features Explore the new ES6 syntax, the event loop, and asynchronous programming Learn the test-driven development approach when building apps Master advanced JavaScript concepts to enhance your web developments skill Book Description If you are looking for a programming language to develop flexible and efficient applications, JavaScript is an obvious choice. Advanced JavaScript is a hands-on guide that takes you through JavaScript and its many features, one step at a time. You'll begin by learning how to use the new JavaScript syntax in ES6, and then work through the many other features that modern JavaScript has to offer. As you progress through the chapters, you’ll use asynchronous programming with callbacks and promises, handle browser events, and perform Document Object Model (DOM) manipulation. You'll also explore various methods of testing JavaScript projects. In the concluding chapters, you'll discover functional programming and learn to use it to build your apps. With this book as your guide, you'll also be able to develop APIs using Node.js and Express, create front-ends using React\/Redux, and build mobile apps using React\/Expo. By the end of Advanced JavaScript, you will have explored the features and benefits of JavaScript to build small applications. What you will learn Examine major features in ES6 and implement those features to build applications Create promise and callback handlers to work with asynchronous processes Develop asynchronous flows using Promise chaining and async\/await syntax Manipulate the DOM with JavaScript Handle JavaScript browser events Explore Test Driven Development and build code tests with JavaScript code testing frameworks. List the benefits and drawbacks of functional programming compared to other styles Construct applications with the Node.js backend framework and the React frontend framework Who this book is for This book is designed to target anyone who wants to write JavaScript in a professional environment. We expect the audience to have used JavaScript in some capacity and be familiar with the basic syntax. This book would be good for a tech enthusiast wondering when to use generators or how to use Promises and Callbacks effectively, or a novice developer who wants to deepen their knowledge on JavaScript and understand TDD.","language":"en","currency":"USD","id":"1789803896","title":"Advanced JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XiWGDwAAQBAJ&source=gbs_api","authors":["Zachary Shute"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"A Developer's Guide with CSS and JavaScript","description":"If you already have even basic familiarity with HTML, CSS, and JavaScript, you’re ready to learn how to build a browser-based game. In Build an HTML5 Game, you’ll use your skills to create a truly cross-platform bubble-shooter game—playable in both desktop and mobile browsers. As you follow along with this in-depth, hands-on tutorial, you’ll learn how to: –Send sprites zooming around the screen with JavaScript animations –Make things explode with a jQuery plug-in –Use hitboxes and geometry to detect collisions –Implement game logic to display levels and respond to player input –Convey changes in game state with animation and sound –Add flair to a game interface with CSS transitions and transformations –Gain pixel-level control over your game display with the HTML canvas The programming starts right away in Chapter 1—no hemming and hawing, history, or throat clearing. Exercises at the end of each chapter challenge you to dig in to the bubble shooter’s code and modify the game. Go ahead. Take the plunge. Learn to create a complete HTML5 game right now and then use your newfound skills to build your own mega-popular, addictive game.","language":"en","currency":"USD","id":"1593276788","title":"Build an HTML5 Game","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eAYvDwAAQBAJ&source=gbs_api","authors":["Karl Bunyan"]},{"pageCount":856,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2w7_BOl1eL8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"The Definitive Guide to HTML & CSS--Fully Updated Written by a Web development expert, the fifth edition of this trusted resource has been thoroughly revised and reorganized to address HTML5, the revolutionary new Web standard. The book covers all the elements supported in today's Web browsers--from the standard (X)HTML tags to the archaic and proprietary tags that may be encountered. HTML & CSS: The Complete Reference, Fifth Edition contains full details on CSS 2.1 as well as every proprietary and emerging CSS3 property currently supported. Annotated examples of correct markup and style show you how to use all of these technologies to build impressive Web pages. Helpful appendixes cover the syntax of character entities, fonts, colors, and URLs. This comprehensive reference is an essential tool for professional Web developers. Master transitional HTML 4.01 and XHTML 1.0 markup Write emerging standards-based markup with HTML5 Enhance presentation with Cascading Style Sheets (CSS1 and CSS 2.1) Learn proprietary and emerging CSS3 features Learn how to read (X)HTML document type definitions (DTDs) Apply everything in an open standards-focused fashion Thomas A. Powell is president of PINT, Inc. (pint.com), a nationally recognized Web agency. He developed the Web Publishing Certificate program for the University of California, San Diego Extension and is an instructor for the Computer Science Department at UCSD. He is the author of the previous bestselling editions of this book and Ajax: The Complete Reference, and co-author of JavaScript: The Complete Reference.","language":"en","currency":"USD","id":"9780071741705","title":"HTML & CSS: The Complete Reference, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2w7_BOl1eL8C&source=gbs_api","authors":["Thomas Powell"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gTJdA3X04toC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Enhance your Joomla! Sites with the power of jQuery extensions, plugins, and more.","language":"en","currency":"USD","id":"1849512051","title":"Joomla! 1.5 Javascript Jquery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gTJdA3X04toC&source=gbs_api","authors":["Jose Argudo Blanco"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=91CH2q7bR2IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"A Concise Guide to Mastering JavaScript","description":"If you want to significantly expand your web development skills beyond PHP, this practical, hands-on book teaches you ECMAScript—the core JavaScript language—from the ground up. You’ll discover some similarities between JavaScript and PHP, such as conditions and loops, but the primary focus is on JavaScript’s unique object creation, classes, prototypes, and inheritance. JavaScript knowledge is essential for working with today’s Web, whether you’re building applications for the client, the server, or for mobile use—and your PHP experience gives you a head start. This book will help you become fluent with JavaScript quickly, and then serve as a handy reference once you start coding. Explore JavaScript syntax, including variables, arrays, loops, and conditions Learn how functions are important in JavaScript—and why they’re actually objects Delve into JavaScript’s object-oriented features, including prototypes, code reuse, and inheritance Examine the built-in API and explore its global functions, properties, and objects Learn about updates in ECMAScript5, the latest version of the standard Use common design patterns to organize your code in large applications","language":"en","currency":"USD","id":"1449370314","title":"JavaScript for PHP Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=91CH2q7bR2IC&source=gbs_api","authors":["Stoyan Stefanov"]}]