[{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zGEYAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Designing and Developing Distributed Web Services","description":"Learn how to design and develop distributed web services in Java, using RESTful architectural principles and the JAX-RS 2.0 specification in Java EE 7. By focusing on implementation rather than theory, this hands-on reference demonstrates how easy it is to get started with services based on the REST architecture. With the book’s technical guide, you’ll learn how REST and JAX-RS work and when to use them. The RESTEasy workbook that follows provides step-by-step instructions for installing, configuring, and running several working JAX-RS examples, using the JBoss RESTEasy implementation of JAX-RS 2.0. Learn JAX-RS 2.0 features, including a client API, server-side asynchronous HTTP, and filters and interceptors Examine the design of a distributed RESTful interface for an e-commerce order entry system Use the JAX-RS Response object to return complex responses to your client (ResponseBuilder) Increase the performance of your services by leveraging HTTP caching protocols Deploy and integrate web services within Java EE7, servlet containers, EJB, Spring, and JPA Learn popular mechanisms to perform authentication on the Web, including client-side SSL and OAuth 2.0","language":"en","currency":"USD","id":"1449361455","title":"RESTful Java with JAX-RS 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zGEYAgAAQBAJ&source=gbs_api","authors":["Bill Burke"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8ccrObyz8oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"From the world’s bestselling programming author Using the practical pedagogy that has made his other Beginner’s Guides so successful, Herb Schildt provides new Swing programmers with a completely integrated learning package. Perfect for the classroom or self-study, Swing: A Beginner’s Guide delivers the appropriate mix of theory and practical coding. You will be programming as early as Chapter 1.","language":"en","currency":"USD","id":"0071706941","title":"Swing: A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8ccrObyz8oC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Create Expressive, Concise, and Scalable Applications","description":"Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. The first edition of this book was released as Programming Scala. Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. This thorough introduction to Scala will get you coding in this powerful language right away. You'll start from the familiar ground of Java and, with easy-to-follow examples, you'll learn how to create highly concise and expressive applications with Scala. You'll find out when and how to mix both imperative and functional style, and how to use parallel collections and Akka actors to create high-performance concurrent applications that effectively use multicore processors. Scala has evolved since the first edition of this book, and Pragmatic Scala is a significant update. We've revised each chapter, and added three new chapters and six new sections to explore the new features in Scala. You'll learn how to: Safely manage concurrency with parallel collections and Akka actors Create expressive readable code with value classes and improved implicit conversions Create strings from data with no sweat using string interpolation Create domain-specific languages Optimize your recursions with tail call optimization Whether you're interested in creating concise, robust single-threaded applications or highly expressive, thread-safe concurrent programs, this book has you covered. What You Need: The Scala compiler (2.x) and the JDK are required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680504207","title":"Pragmatic Scala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lfHo7uMk7r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.63,"subtitle":"Practical Guide for Programmers","description":"The networking capabilities of the Java platform have been extended considerably since the first edition of the book. This new edition covers version 1.5-1.7, the most current iterations, as well as making the following improvements: The API (application programming interface) reference sections in each chapter, which describe the relevant parts of each class, have been replaced with (i) a summary section that lists the classes and methods used in the code, and (ii) a \"gotchas\" section that mentions nonobvious or poorly-documented aspects of the objects. In addition, the book covers several new classes and capabilities introduced in the last few revisions of the Java platform. New abstractions to be covered include NetworkInterface, InterfaceAddress, Inet4\/6Address, SocketAddress\/InetSocketAddress, Executor, and others; extended access to low-level network information; support for IPv6; more complete access to socket options; and scalable I\/O. The example code is also modified to take advantage of new language features such as annotations, enumerations, as well as generics and implicit iterators where appropriate. Most Internet applications use sockets to implement network communication protocols. This book's focused, tutorial-based approach helps the reader master the tasks and techniques essential to virtually all client-server projects using sockets in Java. Chapter 1 provides a general overview of networking concepts to allow readers to synchronize the concepts with terminology. Chapter 2 introduces the mechanics of simple clients and servers. Chapter 3 covers basic message construction and parsing. Chapter 4 then deals with techniques used to build more robust clients and servers. Chapter 5 (NEW) introduces the scalable interface facilities which were introduced in Java 1.5, including the buffer and channel abstractions. Chapter 6 discusses the relationship between the programming constructs and the underlying protocol implementations in more detail. Programming concepts are introduced through simple program examples accompanied by line-by-line code commentary that describes the purpose of every part of the program. No other resource presents so concisely or so effectively the material necessary to get up and running with Java sockets programming. Focused, tutorial-based instruction in key sockets programming techniques allows reader to quickly come up to speed on Java applications. Concise and up-to-date coverage of the most recent platform (1.7) for Java applications in networking technology.","language":"en","currency":"USD","id":"9780080568782","title":"TCP\/IP Sockets in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lfHo7uMk7r4C&source=gbs_api","authors":["Kenneth L. Calvert","Michael J. Donahoo"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTZqecc9olUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Build Better Applications with Coding and Design Patterns","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","language":"en","currency":"USD","id":"9781449396947","title":"JavaScript Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTZqecc9olUC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uq9PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn how to implement design patterns in Java: each pattern in Java Design Patterns is a complete implementation and the output is generated using Eclipse, making the code accessible to all. The examples are chosen so you will be able to absorb the core concepts easily and quickly. This book presents the topic of design patterns in Java in such a way that anyone can grasp the idea. By giving easy to follow examples, you will understand the concepts with increasing depth. The examples presented are straightforward and the topic is presented in a concise manner. Key features of the book: Each of the 23 patterns is described with straightforward Java code. There is no need to know advanced concepts of Java to use this book. Each of the concepts is connected with a real world example and a computer world example. The book uses Eclipse IDE to generate the output because it is the most popular IDE in this field. This is a practitioner's book on design patterns in Java. Design patterns are a popular topic in software development. A design pattern is a common, well-described solution to a common software problem. There is a lot of written material available on design patterns, but scattered and not in one single reference source. Also, many of these examples are unnecessarily big and complex.","language":"en","currency":"USD","id":"1484218027","title":"Java Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uq9PCwAAQBAJ&source=gbs_api","authors":["Vaskaran Sarcar"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":851,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Eh5NcvegzMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":"Exam 310-065","description":"The Best Fully Integrated Study System Available--Written by the Lead Developers of Exam 310-065 With hundreds of practice questions and hands-on exercises, SCJP Sun Certified Programmer for Java 6 Study Guide covers what you need to know--and shows you how to prepare--for this challenging exam. 100% complete coverage of all official objectives for exam 310-065 Exam Objective Highlights in every chapter point out certification objectives to ensure you're focused on passing the exam Exam Watch sections in every chapter highlight key exam topics covered Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all SCJP exam topics, including: Declarations and Access Control · Object Orientation · Assignments · Operators · Flow Control, Exceptions, and Assertions · Strings, I\/O, Formatting, and Parsing · Generics and Collections · Inner Classes · Threads · Development CD-ROM includes: Complete MasterExam practice testing engine, featuring: Two full practice exams; Detailed answers with explanations; Score Report performance assessment tool Electronic book for studying on the go Bonus coverage of the SCJD exam included! Bonus downloadable MasterExam practice test with free online registration.","language":"en","currency":"USD","id":"9780071591072","title":"SCJP Sun Certified Programmer for Java 6 Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Eh5NcvegzMkC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to integrate machine learning with distributed search and analytics","description":"Leverage Elastic Stack’s machine learning features to gain valuable insight from your data Key Features Combine machine learning with the analytic capabilities of Elastic Stack Analyze large volumes of search data and gain actionable insight from them Use external analytical tools with your Elastic Stack to improve its performance Book Description Machine Learning with the Elastic Stack is a comprehensive overview of the embedded commercial features of anomaly detection and forecasting. The book starts with installing and setting up Elastic Stack. You will perform time series analysis on varied kinds of data, such as log files, network flows, application metrics, and financial data. As you progress through the chapters, you will deploy machine learning within the Elastic Stack for logging, security, and metrics. In the concluding chapters, you will see how machine learning jobs can be automatically distributed and managed across the Elasticsearch cluster and made resilient to failure. By the end of this book, you will understand the performance aspects of incorporating machine learning within the Elastic ecosystem and create anomaly detection jobs and view results from Kibana directly. What you will learn Install the Elastic Stack to use machine learning features Understand how Elastic machine learning is used to detect a variety of anomaly types Apply effective anomaly detection to IT operations and security analytics Leverage the output of Elastic machine learning in custom views, dashboards, and proactive alerting Combine your created jobs to correlate anomalies of different layers of infrastructure Learn various tips and tricks to get the most out of Elastic machine learning Who this book is for If you are a data professional eager to gain insight on Elasticsearch data without having to rely on a machine learning specialist or custom development, Machine Learning with the Elastic Stack is for you. Those looking to integrate machine learning within their search and analytics applications will also find this book very useful. Prior experience with the Elastic Stack is needed to get the most out of this book.","language":"en","currency":"USD","id":"1788471776","title":"Machine Learning with the Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyOGDwAAQBAJ&source=gbs_api","authors":["Rich Collier","Bahaaldine Azarmi"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uCR8AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Java EE 7 Tutorial: Volume 1, Fifth Edition, is a task-oriented, example-driven guide to developing enterprise applications for the Java Platform, Enterprise Edition 7 (Java EE 7). Written by members of the Java EE documentation team at Oracle, this book provides new and intermediate Java programmers with a deep understanding of the platform. This guide includes descriptions of platform features and provides instructions for using the latest versions of NetBeans IDE and GlassFish Server Open Source Edition. The book introduces platform basics, including resource creation, resource injection, and packaging. It covers JavaServer Faces, Java Servlets, the Java API for WebSocket, the Java API for JSON Processing (JSON-P), internationalization and localization, Bean Validation, Contexts and Dependency Injection for Java EE (CDI), and web services (JAX-WS and JAX-RS).","language":"en","currency":"USD","id":"0133901580","title":"The Java EE 7 Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uCR8AwAAQBAJ&source=gbs_api","authors":["Eric Jendrock","Ricardo Cervera-Navarro","Ian Evans","Kim Haase","William Markito"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qsa-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":"Leverage Clojure's polymorphic tools to develop your applications","description":"Learn when and how to use Clojure's polymorphic features to develop efficient multithreaded applications Key Features Get to grips with the different polymorphic tools that Clojure offers Develop a taste for good Clojure designs through various engaging examples Study various design principles and learn ways to use them in your applications Book Description Clojure is a modern, dynamic language that you can use to develop robust, multithreaded programs. Clojure Polymorphism is a comprehensive guide that shows you how to use Clojure's features to your advantage. The book begins by describing examples that show how to define and implement abstractions with plain functions and multimethods. Then you'll analyze these examples and separate the good and bad aspects of their design principles. You'll also learn how to perform data transformation abstraction with a plain function and discover how to write new cross-platform predicates while keeping the core of your abstraction free from reader conditionals. The later chapters explain the considerations to keep in mind when implementing Clojure protocols on the Java Virtual Machine (JVM). By the end of this book, you'll know how to use the various polymorphic tools of Clojure to your advantage while designing your applications. What you will learn Explore how polymorphism is implemented in Clojure Discover what design principles to use when creating and implementing abstractions Explore different ways to implement protocols in Clojure Implement various design principles while working with the JVM Write and compare plain functions and multimethods for transforming data Analyze functions and abstractions for their performance and flexibility Learn about common “gotchas” to avoid errors when writing code Who this book is for Clojure Polymorphism is useful for all programmers who want to leverage Clojure's polymorphic tools to build efficient applications. To get the most out of this book, you must be a moderately proficient Clojure programmer.","language":"en","currency":"USD","id":"1838988378","title":"Clojure Polymorphism","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qsa-DwAAQBAJ&source=gbs_api","authors":["Paul Stadig"]},{"pageCount":381,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0D-qCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Definition, Verification, Validation","description":"The origin of this book goes back to the Dagstuhl seminar on Logic for System Engineering, organized during the first week of March 1997 by S. Jiihnichen, J. Loeckx, and M. Wirsing. During that seminar, after Egon Borger's talk on How to Use Abstract State Machines in Software Engineering, Wolfram Schulte, at the time a research assistant at the University of Ulm, Germany, questioned whether ASMs provide anything special as a scientifically well founded and rigorous yet simple and industrially viable framework for high level design and analysis of complex systems, and for natural refinements of models to executable code. Wolfram Schulte argued, referring to his work with K. Achatz on A Formal Object-Oriented Method Inspired by Fusion and Object-Z [1], that with current techniques of functional programming and of axiomatic specification, one can achieve the same result. An intensive and long debate arose from this discussion. At the end of the week, it led Egon Borger to propose a collaboration on a real-life specification project of Wolfram Schulte's choice, as a comparative field test of purely functional declarative methods and of their enhancement within an integrated abstract state-based operational (ASM) approach. After some hesitation, in May 1997 Wolfram Schulte accepted the offer and chose as the theme a high-level specification of Java and of the Java Virtual Machine.","language":"en","currency":"USD","id":"3642594956","title":"Java and the Java Virtual Machine","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0D-qCAAAQBAJ&source=gbs_api","authors":["Robert F. Stärk","Joachim Schmid","Egon Börger"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I_3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Automating the Container Orchestration Platform","description":"Operators are a way of packaging, deploying, and managing Kubernetes applications. A Kubernetes application doesn’t just run on Kubernetes; it’s composed and managed in Kubernetes terms. Operators add application-specific operational knowledge to a Kubernetes cluster, making it easier to automate complex, stateful applications and to augment the platform. Operators can coordinate application upgrades seamlessly, react to failures automatically, and streamline repetitive maintenance like backups. Think of Operators as site reliability engineers in software. They work by extending the Kubernetes control plane and API, helping systems integrators, cluster administrators, and application developers reliably deploy and manage key services and components. Using real-world examples, authors Jason Dobies and Joshua Wood demonstrate how to use Operators today and how to create Operators for your applications with the Operator Framework and SDK. Learn how to establish a Kubernetes cluster and deploy an Operator Examine a range of Operators from usage to implementation Explore the three pillars of the Operator Framework: the Operator SDK, the Operator Lifecycle Manager, and Operator Metering Build Operators from the ground up using the Operator SDK Build, package, and run an Operator in development, testing, and production phases Learn how to distribute your Operator for installation on Kubernetes clusters","language":"en","currency":"USD","id":"1492047996","title":"Kubernetes Operators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I_3RDwAAQBAJ&source=gbs_api","authors":["Jason Dobies","Joshua Wood"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YTCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build complete data analysis flows, from data collection to visualization","description":"A practical guide to getting the most out of Excel, using it for data preparation, applying machine learning models (including cloud services) and understanding the outcome of the data analysis. Key Features Use Microsoft's product Excel to build advanced forecasting models using varied examples Cover range of machine learning tasks such as data mining, data analytics, smart visualization, and more Derive data-driven techniques using Excel plugins and APIs without much code required Book Description We have made huge progress in teaching computers to perform difficult tasks, especially those that are repetitive and time-consuming for humans. Excel users, of all levels, can feel left behind by this innovation wave. The truth is that a large amount of the work needed to develop and use a machine learning model can be done in Excel. The book starts by giving a general introduction to machine learning, making every concept clear and understandable. Then, it shows every step of a machine learning project, from data collection, reading from different data sources, developing models, and visualizing the results using Excel features and offerings. In every chapter, there are several examples and hands-on exercises that will show the reader how to combine Excel functions, add-ins, and connections to databases and to cloud services to reach the desired goal: building a full data analysis flow. Different machine learning models are shown, tailored to the type of data to be analyzed. At the end of the book, the reader is presented with some advanced use cases using Automated Machine Learning, and artificial neural network, which simplifies the analysis task and represents the future of machine learning. What you will learn Use Excel to preview and cleanse datasets Understand correlations between variables and optimize the input to machine learning models Use and evaluate different machine learning models from Excel Understand the use of different visualizations Learn the basic concepts and calculations to understand how artificial neural networks work Learn how to connect Excel to the Microsoft Azure cloud Get beyond proof of concepts and build fully functional data analysis flows Who this book is for This book is for data analysis, machine learning enthusiasts, project managers, and someone who doesn't want to code much for performing core tasks of machine learning. Each example will help you perform end-to-end smart analytics. Working knowledge of Excel is required.","language":"en","currency":"USD","id":"178934512X","title":"Hands-On Machine Learning with Microsoft Excel 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YTCWDwAAQBAJ&source=gbs_api","authors":["Julio Cesar Rodriguez Martino"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SE2iRgeYYwcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Social network analysis applications have experienced tremendous advances within the last few years due in part to increasing trends towards users interacting with each other on the internet. Social networks are organized as graphs, and the data on social networks takes on the form of massive streams, which are mined for a variety of purposes. Social Network Data Analytics covers an important niche in the social network analytics field. This edited volume, contributed by prominent researchers in this field, presents a wide selection of topics on social network data mining such as Structural Properties of Social Networks, Algorithms for Structural Discovery of Social Networks and Content Analysis in Social Networks. This book is also unique in focussing on the data analytical aspects of social networks in the internet scenario, rather than the traditional sociology-driven emphasis prevalent in the existing books, which do not focus on the unique data-intensive characteristics of online social networks. Emphasis is placed on simplifying the content so that students and practitioners benefit from this book. This book targets advanced level students and researchers concentrating on computer science as a secondary text or reference book. Data mining, database, information security, electronic commerce and machine learning professionals will find this book a valuable asset, as well as primary associations such as ACM, IEEE and Management Science.","language":"en","currency":"USD","id":"1441984623","title":"Social Network Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SE2iRgeYYwcC&source=gbs_api","authors":["Charu C. Aggarwal"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pTYkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Enterprise and the Cloud","description":"The Complete Guide to Optimizing Systems Performance Written by the winner of the 2013 LISA Award for Outstanding Achievement in System Administration Large-scale enterprise, cloud, and virtualized computing systems have introduced serious performance challenges. Now, internationally renowned performance expert Brendan Gregg has brought together proven methodologies, tools, and metrics for analyzing and tuning even the most complex environments. Systems Performance: Enterprise and the Cloud focuses on Linux® and Unix® performance, while illuminating performance issues that are relevant to all operating systems. You’ll gain deep insight into how systems work and perform, and learn methodologies for analyzing and improving system and application performance. Gregg presents examples from bare-metal systems and virtualized cloud tenants running Linux-based Ubuntu®, Fedora®, CentOS, and the illumos-based Joyent® SmartOS™ and OmniTI OmniOS®. He systematically covers modern systems performance, including the “traditional” analysis of CPUs, memory, disks, and networks, and new areas including cloud computing and dynamic tracing. This book also helps you identify and fix the “unknown unknowns” of complex performance: bottlenecks that emerge from elements and interactions you were not aware of. The text concludes with a detailed case study, showing how a real cloud customer issue was analyzed from start to finish. Coverage includes • Modern performance analysis and tuning: terminology, concepts, models, methods, and techniques • Dynamic tracing techniques and tools, including examples of DTrace, SystemTap, and perf • Kernel internals: uncovering what the OS is doing • Using system observability tools, interfaces, and frameworks • Understanding and monitoring application performance • Optimizing CPUs: processors, cores, hardware threads, caches, interconnects, and kernel scheduling • Memory optimization: virtual memory, paging, swapping, memory architectures, busses, address spaces, and allocators • File system I\/O, including caching • Storage devices\/controllers, disk I\/O workloads, RAID, and kernel I\/O • Network-related performance issues: protocols, sockets, interfaces, and physical connections • Performance implications of OS and hardware-based virtualization, and new issues encountered with cloud computing • Benchmarking: getting accurate results and avoiding common mistakes This guide is indispensable for anyone who operates enterprise or cloud environments: system, network, database, and web admins; developers; and other professionals. For students and others new to optimization, it also provides exercises reflecting Gregg’s extensive instructional experience.","language":"en","currency":"USD","id":"0133390101","title":"Systems Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pTYkAQAAQBAJ&source=gbs_api","authors":["Brendan Gregg"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Solutions for Modular, Functional, Reactive, and Multithreaded programming","description":"A definitive guide to learning the key concepts of modern application development in Java About This Book Learn the latest features of Java 9 Extend your Java knowledge and take your application to new levels by making it fast, secure, and scalable Delve into the intricacies of Modular programming in Java 9 Who This Book Is For The book is for intermediate to advanced Java programmers who want to make their applications fast, secure, and scalable. What You Will Learn Set up JDK and know the differences in the JDK 9 installation Implement OO designs using classes and interfaces Manage operating system processes Understand the new modular JDK and modular programming Create a modular application with clear dependencies Build graphical user interfaces using JavaFX Use the new HTTP Client API Learn about the new diagnostic features in Java 9 See how to use the new jShell REPL tool Execute ES6-compliant JavaScript code from your Java applications In Detail Java is an object-oriented programming language. It is one of the most widely accepted languages because of its design and programming features, particularly in its promise that you can write a program once and run it anywhere. This cookbook offers a range of software development examples in simple and straightforward Java 9 code, providing step-by-step resources and time-saving methods to help you solve data problems efficiently. Starting with the installation of Java, each recipe addresses a specific problem, with a discussion that explains the solution and offers insight into how it works. We cover major concepts such as Project Jigsaw and various tools that will enable you to modularize your applications. You will learn new features in the form of recipes that will make your applications modular, secure, and fast. Style and approach Each recipe in this book contains a series of complete instructions to perform a core task, plus an explanation of the purpose behind it. Similar methods or further refinements are included with each recipe to provide comprehensive guidance.","language":"en","currency":"USD","id":"1786464985","title":"Java 9 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OpZGDwAAQBAJ&source=gbs_api","authors":["Mohamed Sanaulla","Nick Samoylov"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build strong foundation for entering the world of Machine Learning and data science with the help of this comprehensive guide About This Book Get started in the field of Machine Learning with the help of this solid, concept-rich, yet highly practical guide. Your one-stop solution for everything that matters in mastering the whats and whys of Machine Learning algorithms and their implementation. Get a solid foundation for your entry into Machine Learning by strengthening your roots (algorithms) with this comprehensive guide. Who This Book Is For This book is for IT professionals who want to enter the field of data science and are very new to Machine Learning. Familiarity with languages such as R and Python will be invaluable here. What You Will Learn Acquaint yourself with important elements of Machine Learning Understand the feature selection and feature engineering process Assess performance and error trade-offs for Linear Regression Build a data model and understand how it works by using different types of algorithm Learn to tune the parameters of Support Vector machines Implement clusters to a dataset Explore the concept of Natural Processing Language and Recommendation Systems Create a ML architecture from scratch. In Detail As the amount of data continues to grow at an almost incomprehensible rate, being able to understand and process data is becoming a key differentiator for competitive organizations. Machine learning applications are everywhere, from self-driving cars, spam detection, document search, and trading strategies, to speech recognition. This makes machine learning well-suited to the present-day era of Big Data and Data Science. The main challenge is how to transform data into actionable knowledge. In this book you will learn all the important Machine Learning algorithms that are commonly used in the field of data science. These algorithms can be used for supervised as well as unsupervised learning, reinforcement learning, and semi-supervised learning. A few famous algorithms that are covered in this book are Linear regression, Logistic Regression, SVM, Naive Bayes, K-Means, Random Forest, TensorFlow, and Feature engineering. In this book you will also learn how these algorithms work and their practical implementation to resolve your problems. This book will also introduce you to the Natural Processing Language and Recommendation systems, which help you run multiple algorithms simultaneously. On completion of the book you will have mastered selecting Machine Learning algorithms for clustering, classification, or regression based on for your problem. Style and approach An easy-to-follow, step-by-step guide that will help you get to grips with real -world applications of Algorithms for Machine Learning.","language":"en","currency":"USD","id":"1785884514","title":"Machine Learning Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-ZDDwAAQBAJ&source=gbs_api","authors":["Giuseppe Bonaccorso"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jz7EDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In order to remain competitive in today's world, companies need to be able to integrate internally and externally by connecting sensors, customers and partners with the information in their systems of record. In short, they need to integrate with everything. This IBM® Redbooks® publication describes how IBM Application Integration Suite and IBM Messaging portfolio can be used to satisfy the needs of core hybrid integration use cases, accelerating companies in their digital transformation journey. All concepts are explained within the context of these use cases: Joining the API economy Improving productivity Refactoring for innovation The target audience for this book is cloud and integration architects and specialists who are implementing hybrid integration solutions.","language":"en","currency":"USD","id":"0738442267","title":"An Architectural and Practical Guide to IBM Hybrid Integration Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jz7EDQAAQBAJ&source=gbs_api","authors":["Carsten Börnert","Kim Clark","Shahir Daya","Matthieu Debeaux","Gerd Diederichs","Vasfi Gucer","Shamim Hossain","Gary Kean","Carlo Marcoli","Shohei Matsumoto","Amar Shah","Johan Thole","IBM Redbooks"]},{"pageCount":888,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8RD-eBVQtgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"A complete update to the definitive, bestselling guide to the #1 certification for Java programmers Written and revised by the co-developers of the original SCJP exam and now published in the Oracle Press brand Includes two complete practice exams—250+ practice exam questions in book and via electronic content Replaces SCJP Sun Certified Programmer for Java Study Guide—150,000 copies sold","language":"en","currency":"USD","id":"0071771999","title":"OCA\/OCP Java SE 7 Programmer I & II Study Guide (Exams 1Z0-803 & 1Z0-804)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8RD-eBVQtgC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":524,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X8IYQKjMN9cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Your Ultimate \"How-To\" Guide to Java Programming! Legendary programming author Herb Schildt shares some of his favorite programming techniques in this high-powered Java \"cookbook.\" Organized for quick reference, each recipe shows how to accomplish a practical programming task. A recipe begins with a list of key ingredients (the classes, methods, and interfaces) followed by step-by-step instructions that show how to assemble them into a complete solution. Detailed discussions explain the how and why behind each step, and a full code example puts the recipe into action. Each recipe ends with a list of options and alternatives that suggest ways to adapt the technique to fit a variety of situations. Whether you're a beginner or an experienced pro, you'll find recipes that are sure to satisfy your Java programming appetite! Topics include: String Handling Regular Expressions File Handling Applets Servlets Swing The Collections Framework Multithreading Formatting Data Learn how to: Find substrings that match a regular expression Use regular expressions to tokenize a string Compress and decompress data files Create a ZIP file Format time and date Use printf( ) to display formatted data Reverse, rotate, and shuffle a list Use a Comparator with a collection Create a simple Swing application Create a Swing-based applet Create a simple servlet Use a cookie with a servlet Synchronize threads Monitor a thread's state Set and obtain a thread's priority Use JScrollPane to automate scrolling Access a resource using HttpURLConnection Schedule a task for future execution Use reflection to dynamically create an object and call methods Much, much more","language":"en","currency":"USD","id":"0071596445","title":"Herb Schildt's Java Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X8IYQKjMN9cC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kX7SDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. The professional programmer’s Deitel® guide to C# 6 and object-oriented development for Windows® Written for programmers with a background in high-level language programming, C# 6 for Programmers applies the Deitel signature live-code approach to teaching programming and explores Microsoft’s C# 6 and .NET in depth. Concepts are presented in the context of 170+ fully coded and tested apps, complete with syntax shading, code highlighting, code walkthroughs, program outputs and hundreds of savvy software-development tips. Start with an introduction to C# using an early classes and objects approach, then rapidly move on to more advanced topics, including LINQ, asynchronous programming with async and await and more. You’ll enjoy the treatment of object-oriented programming and an object-oriented design\/UML® ATM case study, including a complete C# implementation. When you’ve mastered the book, you’ll be ready to start building industrial-strength, object-oriented C# apps. Paul Deitel and Harvey Deitel are the founders of Deitel & Associates, Inc., the internationally recognized programming languages authoring and corporate training organization. Millions of people worldwide have used Deitel textbooks, professional books, LiveLessons™ video products, e-books, resource centers and REVEL™ interactive multimedia courses with integrated labs and assessment to master major programming languages and platforms, including C#, C++, C, Java™, Android™ app development, iOS app development, Swift™, Visual Basic®, Python™ and Internet and web programming. Features: •Use with Windows® 7, 8 or 10. •Integrated coverage of new C# 6 functionality: string interpolation, expression-bodied methods and properties, auto-implemented property initializers, getter-only properties, nameof, null-conditional operator, exception filters and more. •Entertaining and challenging code examples. •Deep treatment of classes, objects, inheritance, polymorphism and interfaces. •Generics, LINQ and generic collections; PLINQ (Parallel LINQ) for multicore performance. •Asynchronous programming with async and await; functional programming with lambdas, delegates and immutability. •Files; relational database with LINQ to Entities. •Object-oriented design ATM case study with full code implementation. •Emphasis on performance and software engineering principles","language":"en","currency":"USD","id":"0134596366","title":"C# 6 for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kX7SDAAAQBAJ&source=gbs_api","authors":["Paul Deitel","Harvey Deitel"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5FVOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In this exclusive eBook, preview excerpts from brand-new and forthcoming Oracle Press Java JDK 8 books. Written by leading Java experts, Oracle Press books offer the most definitive, complete, and up-to-date coverage of the latest Java release. Featuring an introduction by bestselling programming author Herb Schildt, this eBook includes chapters from the following Oracle Press books: Java: The Complete Reference, Ninth Edition by Herb Schildt Java: A Beginner’s Guide, Sixth Edition by Herb Schildt Mastering Lambdas: Java Programming in a Multicore World by Maurice Naftalin Quick Start Guide to JavaFX by J.F. DiMarzio Mastering JavaFX 8 Controls: Create Custom JavaFX 8 Controls for Cross-Platform Applications by Hendrik Ebbers","language":"en","currency":"USD","id":"0071836500","title":"Java 8 Preview Sampler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5FVOAwAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Maurice Naftalin","Hendrik Ebbers","J. F. DiMarzio"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ETGMKA6tfoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Complete coverage of the newest exam release from the Linux Professional Institute, and the first step toward LPIC-1 and CompTIA Linux+ Linux Essentials All-in-One Exam Guide covers this \"first-of-its-kind\" program intended for the academic sector, aspiring IT professionals, and anyone new to the world of Linux and open source technology. This comprehensive, classroom-based reference offers 100% coverage of all exam objectives for the Linux Essentials exam. The book includes expert discussion sidebars to convey in-depth information. Tip, Caution, and Note icons highlight key topics; end-of-chapter quizzes test retention and exam readiness; and Exam Tips guide you through tough technical topics that may be tricky come exam day. The All-in-One also includes hands-on examples and exercises that reinforce practical learning for real-world applicability. Electronic content includes a practice exam (Windows based).","language":"en","currency":"USD","id":"0071811001","title":"LPI Linux Essentials Certification All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ETGMKA6tfoC&source=gbs_api","authors":["Robb Tracy"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zGEYAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Designing and Developing Distributed Web Services","description":"Learn how to design and develop distributed web services in Java, using RESTful architectural principles and the JAX-RS 2.0 specification in Java EE 7. By focusing on implementation rather than theory, this hands-on reference demonstrates how easy it is to get started with services based on the REST architecture. With the book’s technical guide, you’ll learn how REST and JAX-RS work and when to use them. The RESTEasy workbook that follows provides step-by-step instructions for installing, configuring, and running several working JAX-RS examples, using the JBoss RESTEasy implementation of JAX-RS 2.0. Learn JAX-RS 2.0 features, including a client API, server-side asynchronous HTTP, and filters and interceptors Examine the design of a distributed RESTful interface for an e-commerce order entry system Use the JAX-RS Response object to return complex responses to your client (ResponseBuilder) Increase the performance of your services by leveraging HTTP caching protocols Deploy and integrate web services within Java EE7, servlet containers, EJB, Spring, and JPA Learn popular mechanisms to perform authentication on the Web, including client-side SSL and OAuth 2.0","language":"en","currency":"USD","id":"1449361455","title":"RESTful Java with JAX-RS 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zGEYAgAAQBAJ&source=gbs_api","authors":["Bill Burke"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8ccrObyz8oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"From the world’s bestselling programming author Using the practical pedagogy that has made his other Beginner’s Guides so successful, Herb Schildt provides new Swing programmers with a completely integrated learning package. Perfect for the classroom or self-study, Swing: A Beginner’s Guide delivers the appropriate mix of theory and practical coding. You will be programming as early as Chapter 1.","language":"en","currency":"USD","id":"0071706941","title":"Swing: A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8ccrObyz8oC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Create Expressive, Concise, and Scalable Applications","description":"Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. The first edition of this book was released as Programming Scala. Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. This thorough introduction to Scala will get you coding in this powerful language right away. You'll start from the familiar ground of Java and, with easy-to-follow examples, you'll learn how to create highly concise and expressive applications with Scala. You'll find out when and how to mix both imperative and functional style, and how to use parallel collections and Akka actors to create high-performance concurrent applications that effectively use multicore processors. Scala has evolved since the first edition of this book, and Pragmatic Scala is a significant update. We've revised each chapter, and added three new chapters and six new sections to explore the new features in Scala. You'll learn how to: Safely manage concurrency with parallel collections and Akka actors Create expressive readable code with value classes and improved implicit conversions Create strings from data with no sweat using string interpolation Create domain-specific languages Optimize your recursions with tail call optimization Whether you're interested in creating concise, robust single-threaded applications or highly expressive, thread-safe concurrent programs, this book has you covered. What You Need: The Scala compiler (2.x) and the JDK are required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680504207","title":"Pragmatic Scala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lfHo7uMk7r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.63,"subtitle":"Practical Guide for Programmers","description":"The networking capabilities of the Java platform have been extended considerably since the first edition of the book. This new edition covers version 1.5-1.7, the most current iterations, as well as making the following improvements: The API (application programming interface) reference sections in each chapter, which describe the relevant parts of each class, have been replaced with (i) a summary section that lists the classes and methods used in the code, and (ii) a \"gotchas\" section that mentions nonobvious or poorly-documented aspects of the objects. In addition, the book covers several new classes and capabilities introduced in the last few revisions of the Java platform. New abstractions to be covered include NetworkInterface, InterfaceAddress, Inet4\/6Address, SocketAddress\/InetSocketAddress, Executor, and others; extended access to low-level network information; support for IPv6; more complete access to socket options; and scalable I\/O. The example code is also modified to take advantage of new language features such as annotations, enumerations, as well as generics and implicit iterators where appropriate. Most Internet applications use sockets to implement network communication protocols. This book's focused, tutorial-based approach helps the reader master the tasks and techniques essential to virtually all client-server projects using sockets in Java. Chapter 1 provides a general overview of networking concepts to allow readers to synchronize the concepts with terminology. Chapter 2 introduces the mechanics of simple clients and servers. Chapter 3 covers basic message construction and parsing. Chapter 4 then deals with techniques used to build more robust clients and servers. Chapter 5 (NEW) introduces the scalable interface facilities which were introduced in Java 1.5, including the buffer and channel abstractions. Chapter 6 discusses the relationship between the programming constructs and the underlying protocol implementations in more detail. Programming concepts are introduced through simple program examples accompanied by line-by-line code commentary that describes the purpose of every part of the program. No other resource presents so concisely or so effectively the material necessary to get up and running with Java sockets programming. Focused, tutorial-based instruction in key sockets programming techniques allows reader to quickly come up to speed on Java applications. Concise and up-to-date coverage of the most recent platform (1.7) for Java applications in networking technology.","language":"en","currency":"USD","id":"9780080568782","title":"TCP\/IP Sockets in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lfHo7uMk7r4C&source=gbs_api","authors":["Kenneth L. Calvert","Michael J. Donahoo"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTZqecc9olUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Build Better Applications with Coding and Design Patterns","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","language":"en","currency":"USD","id":"9781449396947","title":"JavaScript Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTZqecc9olUC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uq9PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn how to implement design patterns in Java: each pattern in Java Design Patterns is a complete implementation and the output is generated using Eclipse, making the code accessible to all. The examples are chosen so you will be able to absorb the core concepts easily and quickly. This book presents the topic of design patterns in Java in such a way that anyone can grasp the idea. By giving easy to follow examples, you will understand the concepts with increasing depth. The examples presented are straightforward and the topic is presented in a concise manner. Key features of the book: Each of the 23 patterns is described with straightforward Java code. There is no need to know advanced concepts of Java to use this book. Each of the concepts is connected with a real world example and a computer world example. The book uses Eclipse IDE to generate the output because it is the most popular IDE in this field. This is a practitioner's book on design patterns in Java. Design patterns are a popular topic in software development. A design pattern is a common, well-described solution to a common software problem. There is a lot of written material available on design patterns, but scattered and not in one single reference source. Also, many of these examples are unnecessarily big and complex.","language":"en","currency":"USD","id":"1484218027","title":"Java Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uq9PCwAAQBAJ&source=gbs_api","authors":["Vaskaran Sarcar"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":851,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Eh5NcvegzMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":"Exam 310-065","description":"The Best Fully Integrated Study System Available--Written by the Lead Developers of Exam 310-065 With hundreds of practice questions and hands-on exercises, SCJP Sun Certified Programmer for Java 6 Study Guide covers what you need to know--and shows you how to prepare--for this challenging exam. 100% complete coverage of all official objectives for exam 310-065 Exam Objective Highlights in every chapter point out certification objectives to ensure you're focused on passing the exam Exam Watch sections in every chapter highlight key exam topics covered Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all SCJP exam topics, including: Declarations and Access Control · Object Orientation · Assignments · Operators · Flow Control, Exceptions, and Assertions · Strings, I\/O, Formatting, and Parsing · Generics and Collections · Inner Classes · Threads · Development CD-ROM includes: Complete MasterExam practice testing engine, featuring: Two full practice exams; Detailed answers with explanations; Score Report performance assessment tool Electronic book for studying on the go Bonus coverage of the SCJD exam included! Bonus downloadable MasterExam practice test with free online registration.","language":"en","currency":"USD","id":"9780071591072","title":"SCJP Sun Certified Programmer for Java 6 Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Eh5NcvegzMkC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to integrate machine learning with distributed search and analytics","description":"Leverage Elastic Stack’s machine learning features to gain valuable insight from your data Key Features Combine machine learning with the analytic capabilities of Elastic Stack Analyze large volumes of search data and gain actionable insight from them Use external analytical tools with your Elastic Stack to improve its performance Book Description Machine Learning with the Elastic Stack is a comprehensive overview of the embedded commercial features of anomaly detection and forecasting. The book starts with installing and setting up Elastic Stack. You will perform time series analysis on varied kinds of data, such as log files, network flows, application metrics, and financial data. As you progress through the chapters, you will deploy machine learning within the Elastic Stack for logging, security, and metrics. In the concluding chapters, you will see how machine learning jobs can be automatically distributed and managed across the Elasticsearch cluster and made resilient to failure. By the end of this book, you will understand the performance aspects of incorporating machine learning within the Elastic ecosystem and create anomaly detection jobs and view results from Kibana directly. What you will learn Install the Elastic Stack to use machine learning features Understand how Elastic machine learning is used to detect a variety of anomaly types Apply effective anomaly detection to IT operations and security analytics Leverage the output of Elastic machine learning in custom views, dashboards, and proactive alerting Combine your created jobs to correlate anomalies of different layers of infrastructure Learn various tips and tricks to get the most out of Elastic machine learning Who this book is for If you are a data professional eager to gain insight on Elasticsearch data without having to rely on a machine learning specialist or custom development, Machine Learning with the Elastic Stack is for you. Those looking to integrate machine learning within their search and analytics applications will also find this book very useful. Prior experience with the Elastic Stack is needed to get the most out of this book.","language":"en","currency":"USD","id":"1788471776","title":"Machine Learning with the Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyOGDwAAQBAJ&source=gbs_api","authors":["Rich Collier","Bahaaldine Azarmi"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uCR8AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Java EE 7 Tutorial: Volume 1, Fifth Edition, is a task-oriented, example-driven guide to developing enterprise applications for the Java Platform, Enterprise Edition 7 (Java EE 7). Written by members of the Java EE documentation team at Oracle, this book provides new and intermediate Java programmers with a deep understanding of the platform. This guide includes descriptions of platform features and provides instructions for using the latest versions of NetBeans IDE and GlassFish Server Open Source Edition. The book introduces platform basics, including resource creation, resource injection, and packaging. It covers JavaServer Faces, Java Servlets, the Java API for WebSocket, the Java API for JSON Processing (JSON-P), internationalization and localization, Bean Validation, Contexts and Dependency Injection for Java EE (CDI), and web services (JAX-WS and JAX-RS).","language":"en","currency":"USD","id":"0133901580","title":"The Java EE 7 Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uCR8AwAAQBAJ&source=gbs_api","authors":["Eric Jendrock","Ricardo Cervera-Navarro","Ian Evans","Kim Haase","William Markito"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qsa-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":"Leverage Clojure's polymorphic tools to develop your applications","description":"Learn when and how to use Clojure's polymorphic features to develop efficient multithreaded applications Key Features Get to grips with the different polymorphic tools that Clojure offers Develop a taste for good Clojure designs through various engaging examples Study various design principles and learn ways to use them in your applications Book Description Clojure is a modern, dynamic language that you can use to develop robust, multithreaded programs. Clojure Polymorphism is a comprehensive guide that shows you how to use Clojure's features to your advantage. The book begins by describing examples that show how to define and implement abstractions with plain functions and multimethods. Then you'll analyze these examples and separate the good and bad aspects of their design principles. You'll also learn how to perform data transformation abstraction with a plain function and discover how to write new cross-platform predicates while keeping the core of your abstraction free from reader conditionals. The later chapters explain the considerations to keep in mind when implementing Clojure protocols on the Java Virtual Machine (JVM). By the end of this book, you'll know how to use the various polymorphic tools of Clojure to your advantage while designing your applications. What you will learn Explore how polymorphism is implemented in Clojure Discover what design principles to use when creating and implementing abstractions Explore different ways to implement protocols in Clojure Implement various design principles while working with the JVM Write and compare plain functions and multimethods for transforming data Analyze functions and abstractions for their performance and flexibility Learn about common “gotchas” to avoid errors when writing code Who this book is for Clojure Polymorphism is useful for all programmers who want to leverage Clojure's polymorphic tools to build efficient applications. To get the most out of this book, you must be a moderately proficient Clojure programmer.","language":"en","currency":"USD","id":"1838988378","title":"Clojure Polymorphism","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qsa-DwAAQBAJ&source=gbs_api","authors":["Paul Stadig"]},{"pageCount":381,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0D-qCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Definition, Verification, Validation","description":"The origin of this book goes back to the Dagstuhl seminar on Logic for System Engineering, organized during the first week of March 1997 by S. Jiihnichen, J. Loeckx, and M. Wirsing. During that seminar, after Egon Borger's talk on How to Use Abstract State Machines in Software Engineering, Wolfram Schulte, at the time a research assistant at the University of Ulm, Germany, questioned whether ASMs provide anything special as a scientifically well founded and rigorous yet simple and industrially viable framework for high level design and analysis of complex systems, and for natural refinements of models to executable code. Wolfram Schulte argued, referring to his work with K. Achatz on A Formal Object-Oriented Method Inspired by Fusion and Object-Z [1], that with current techniques of functional programming and of axiomatic specification, one can achieve the same result. An intensive and long debate arose from this discussion. At the end of the week, it led Egon Borger to propose a collaboration on a real-life specification project of Wolfram Schulte's choice, as a comparative field test of purely functional declarative methods and of their enhancement within an integrated abstract state-based operational (ASM) approach. After some hesitation, in May 1997 Wolfram Schulte accepted the offer and chose as the theme a high-level specification of Java and of the Java Virtual Machine.","language":"en","currency":"USD","id":"3642594956","title":"Java and the Java Virtual Machine","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0D-qCAAAQBAJ&source=gbs_api","authors":["Robert F. Stärk","Joachim Schmid","Egon Börger"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I_3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Automating the Container Orchestration Platform","description":"Operators are a way of packaging, deploying, and managing Kubernetes applications. A Kubernetes application doesn’t just run on Kubernetes; it’s composed and managed in Kubernetes terms. Operators add application-specific operational knowledge to a Kubernetes cluster, making it easier to automate complex, stateful applications and to augment the platform. Operators can coordinate application upgrades seamlessly, react to failures automatically, and streamline repetitive maintenance like backups. Think of Operators as site reliability engineers in software. They work by extending the Kubernetes control plane and API, helping systems integrators, cluster administrators, and application developers reliably deploy and manage key services and components. Using real-world examples, authors Jason Dobies and Joshua Wood demonstrate how to use Operators today and how to create Operators for your applications with the Operator Framework and SDK. Learn how to establish a Kubernetes cluster and deploy an Operator Examine a range of Operators from usage to implementation Explore the three pillars of the Operator Framework: the Operator SDK, the Operator Lifecycle Manager, and Operator Metering Build Operators from the ground up using the Operator SDK Build, package, and run an Operator in development, testing, and production phases Learn how to distribute your Operator for installation on Kubernetes clusters","language":"en","currency":"USD","id":"1492047996","title":"Kubernetes Operators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I_3RDwAAQBAJ&source=gbs_api","authors":["Jason Dobies","Joshua Wood"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YTCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build complete data analysis flows, from data collection to visualization","description":"A practical guide to getting the most out of Excel, using it for data preparation, applying machine learning models (including cloud services) and understanding the outcome of the data analysis. Key Features Use Microsoft's product Excel to build advanced forecasting models using varied examples Cover range of machine learning tasks such as data mining, data analytics, smart visualization, and more Derive data-driven techniques using Excel plugins and APIs without much code required Book Description We have made huge progress in teaching computers to perform difficult tasks, especially those that are repetitive and time-consuming for humans. Excel users, of all levels, can feel left behind by this innovation wave. The truth is that a large amount of the work needed to develop and use a machine learning model can be done in Excel. The book starts by giving a general introduction to machine learning, making every concept clear and understandable. Then, it shows every step of a machine learning project, from data collection, reading from different data sources, developing models, and visualizing the results using Excel features and offerings. In every chapter, there are several examples and hands-on exercises that will show the reader how to combine Excel functions, add-ins, and connections to databases and to cloud services to reach the desired goal: building a full data analysis flow. Different machine learning models are shown, tailored to the type of data to be analyzed. At the end of the book, the reader is presented with some advanced use cases using Automated Machine Learning, and artificial neural network, which simplifies the analysis task and represents the future of machine learning. What you will learn Use Excel to preview and cleanse datasets Understand correlations between variables and optimize the input to machine learning models Use and evaluate different machine learning models from Excel Understand the use of different visualizations Learn the basic concepts and calculations to understand how artificial neural networks work Learn how to connect Excel to the Microsoft Azure cloud Get beyond proof of concepts and build fully functional data analysis flows Who this book is for This book is for data analysis, machine learning enthusiasts, project managers, and someone who doesn't want to code much for performing core tasks of machine learning. Each example will help you perform end-to-end smart analytics. Working knowledge of Excel is required.","language":"en","currency":"USD","id":"178934512X","title":"Hands-On Machine Learning with Microsoft Excel 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YTCWDwAAQBAJ&source=gbs_api","authors":["Julio Cesar Rodriguez Martino"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SE2iRgeYYwcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Social network analysis applications have experienced tremendous advances within the last few years due in part to increasing trends towards users interacting with each other on the internet. Social networks are organized as graphs, and the data on social networks takes on the form of massive streams, which are mined for a variety of purposes. Social Network Data Analytics covers an important niche in the social network analytics field. This edited volume, contributed by prominent researchers in this field, presents a wide selection of topics on social network data mining such as Structural Properties of Social Networks, Algorithms for Structural Discovery of Social Networks and Content Analysis in Social Networks. This book is also unique in focussing on the data analytical aspects of social networks in the internet scenario, rather than the traditional sociology-driven emphasis prevalent in the existing books, which do not focus on the unique data-intensive characteristics of online social networks. Emphasis is placed on simplifying the content so that students and practitioners benefit from this book. This book targets advanced level students and researchers concentrating on computer science as a secondary text or reference book. Data mining, database, information security, electronic commerce and machine learning professionals will find this book a valuable asset, as well as primary associations such as ACM, IEEE and Management Science.","language":"en","currency":"USD","id":"1441984623","title":"Social Network Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SE2iRgeYYwcC&source=gbs_api","authors":["Charu C. Aggarwal"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pTYkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Enterprise and the Cloud","description":"The Complete Guide to Optimizing Systems Performance Written by the winner of the 2013 LISA Award for Outstanding Achievement in System Administration Large-scale enterprise, cloud, and virtualized computing systems have introduced serious performance challenges. Now, internationally renowned performance expert Brendan Gregg has brought together proven methodologies, tools, and metrics for analyzing and tuning even the most complex environments. Systems Performance: Enterprise and the Cloud focuses on Linux® and Unix® performance, while illuminating performance issues that are relevant to all operating systems. You’ll gain deep insight into how systems work and perform, and learn methodologies for analyzing and improving system and application performance. Gregg presents examples from bare-metal systems and virtualized cloud tenants running Linux-based Ubuntu®, Fedora®, CentOS, and the illumos-based Joyent® SmartOS™ and OmniTI OmniOS®. He systematically covers modern systems performance, including the “traditional” analysis of CPUs, memory, disks, and networks, and new areas including cloud computing and dynamic tracing. This book also helps you identify and fix the “unknown unknowns” of complex performance: bottlenecks that emerge from elements and interactions you were not aware of. The text concludes with a detailed case study, showing how a real cloud customer issue was analyzed from start to finish. Coverage includes • Modern performance analysis and tuning: terminology, concepts, models, methods, and techniques • Dynamic tracing techniques and tools, including examples of DTrace, SystemTap, and perf • Kernel internals: uncovering what the OS is doing • Using system observability tools, interfaces, and frameworks • Understanding and monitoring application performance • Optimizing CPUs: processors, cores, hardware threads, caches, interconnects, and kernel scheduling • Memory optimization: virtual memory, paging, swapping, memory architectures, busses, address spaces, and allocators • File system I\/O, including caching • Storage devices\/controllers, disk I\/O workloads, RAID, and kernel I\/O • Network-related performance issues: protocols, sockets, interfaces, and physical connections • Performance implications of OS and hardware-based virtualization, and new issues encountered with cloud computing • Benchmarking: getting accurate results and avoiding common mistakes This guide is indispensable for anyone who operates enterprise or cloud environments: system, network, database, and web admins; developers; and other professionals. For students and others new to optimization, it also provides exercises reflecting Gregg’s extensive instructional experience.","language":"en","currency":"USD","id":"0133390101","title":"Systems Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pTYkAQAAQBAJ&source=gbs_api","authors":["Brendan Gregg"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Solutions for Modular, Functional, Reactive, and Multithreaded programming","description":"A definitive guide to learning the key concepts of modern application development in Java About This Book Learn the latest features of Java 9 Extend your Java knowledge and take your application to new levels by making it fast, secure, and scalable Delve into the intricacies of Modular programming in Java 9 Who This Book Is For The book is for intermediate to advanced Java programmers who want to make their applications fast, secure, and scalable. What You Will Learn Set up JDK and know the differences in the JDK 9 installation Implement OO designs using classes and interfaces Manage operating system processes Understand the new modular JDK and modular programming Create a modular application with clear dependencies Build graphical user interfaces using JavaFX Use the new HTTP Client API Learn about the new diagnostic features in Java 9 See how to use the new jShell REPL tool Execute ES6-compliant JavaScript code from your Java applications In Detail Java is an object-oriented programming language. It is one of the most widely accepted languages because of its design and programming features, particularly in its promise that you can write a program once and run it anywhere. This cookbook offers a range of software development examples in simple and straightforward Java 9 code, providing step-by-step resources and time-saving methods to help you solve data problems efficiently. Starting with the installation of Java, each recipe addresses a specific problem, with a discussion that explains the solution and offers insight into how it works. We cover major concepts such as Project Jigsaw and various tools that will enable you to modularize your applications. You will learn new features in the form of recipes that will make your applications modular, secure, and fast. Style and approach Each recipe in this book contains a series of complete instructions to perform a core task, plus an explanation of the purpose behind it. Similar methods or further refinements are included with each recipe to provide comprehensive guidance.","language":"en","currency":"USD","id":"1786464985","title":"Java 9 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OpZGDwAAQBAJ&source=gbs_api","authors":["Mohamed Sanaulla","Nick Samoylov"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build strong foundation for entering the world of Machine Learning and data science with the help of this comprehensive guide About This Book Get started in the field of Machine Learning with the help of this solid, concept-rich, yet highly practical guide. Your one-stop solution for everything that matters in mastering the whats and whys of Machine Learning algorithms and their implementation. Get a solid foundation for your entry into Machine Learning by strengthening your roots (algorithms) with this comprehensive guide. Who This Book Is For This book is for IT professionals who want to enter the field of data science and are very new to Machine Learning. Familiarity with languages such as R and Python will be invaluable here. What You Will Learn Acquaint yourself with important elements of Machine Learning Understand the feature selection and feature engineering process Assess performance and error trade-offs for Linear Regression Build a data model and understand how it works by using different types of algorithm Learn to tune the parameters of Support Vector machines Implement clusters to a dataset Explore the concept of Natural Processing Language and Recommendation Systems Create a ML architecture from scratch. In Detail As the amount of data continues to grow at an almost incomprehensible rate, being able to understand and process data is becoming a key differentiator for competitive organizations. Machine learning applications are everywhere, from self-driving cars, spam detection, document search, and trading strategies, to speech recognition. This makes machine learning well-suited to the present-day era of Big Data and Data Science. The main challenge is how to transform data into actionable knowledge. In this book you will learn all the important Machine Learning algorithms that are commonly used in the field of data science. These algorithms can be used for supervised as well as unsupervised learning, reinforcement learning, and semi-supervised learning. A few famous algorithms that are covered in this book are Linear regression, Logistic Regression, SVM, Naive Bayes, K-Means, Random Forest, TensorFlow, and Feature engineering. In this book you will also learn how these algorithms work and their practical implementation to resolve your problems. This book will also introduce you to the Natural Processing Language and Recommendation systems, which help you run multiple algorithms simultaneously. On completion of the book you will have mastered selecting Machine Learning algorithms for clustering, classification, or regression based on for your problem. Style and approach An easy-to-follow, step-by-step guide that will help you get to grips with real -world applications of Algorithms for Machine Learning.","language":"en","currency":"USD","id":"1785884514","title":"Machine Learning Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-ZDDwAAQBAJ&source=gbs_api","authors":["Giuseppe Bonaccorso"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jz7EDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In order to remain competitive in today's world, companies need to be able to integrate internally and externally by connecting sensors, customers and partners with the information in their systems of record. In short, they need to integrate with everything. This IBM® Redbooks® publication describes how IBM Application Integration Suite and IBM Messaging portfolio can be used to satisfy the needs of core hybrid integration use cases, accelerating companies in their digital transformation journey. All concepts are explained within the context of these use cases: Joining the API economy Improving productivity Refactoring for innovation The target audience for this book is cloud and integration architects and specialists who are implementing hybrid integration solutions.","language":"en","currency":"USD","id":"0738442267","title":"An Architectural and Practical Guide to IBM Hybrid Integration Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jz7EDQAAQBAJ&source=gbs_api","authors":["Carsten Börnert","Kim Clark","Shahir Daya","Matthieu Debeaux","Gerd Diederichs","Vasfi Gucer","Shamim Hossain","Gary Kean","Carlo Marcoli","Shohei Matsumoto","Amar Shah","Johan Thole","IBM Redbooks"]},{"pageCount":888,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8RD-eBVQtgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"A complete update to the definitive, bestselling guide to the #1 certification for Java programmers Written and revised by the co-developers of the original SCJP exam and now published in the Oracle Press brand Includes two complete practice exams—250+ practice exam questions in book and via electronic content Replaces SCJP Sun Certified Programmer for Java Study Guide—150,000 copies sold","language":"en","currency":"USD","id":"0071771999","title":"OCA\/OCP Java SE 7 Programmer I & II Study Guide (Exams 1Z0-803 & 1Z0-804)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8RD-eBVQtgC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":524,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X8IYQKjMN9cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Your Ultimate \"How-To\" Guide to Java Programming! Legendary programming author Herb Schildt shares some of his favorite programming techniques in this high-powered Java \"cookbook.\" Organized for quick reference, each recipe shows how to accomplish a practical programming task. A recipe begins with a list of key ingredients (the classes, methods, and interfaces) followed by step-by-step instructions that show how to assemble them into a complete solution. Detailed discussions explain the how and why behind each step, and a full code example puts the recipe into action. Each recipe ends with a list of options and alternatives that suggest ways to adapt the technique to fit a variety of situations. Whether you're a beginner or an experienced pro, you'll find recipes that are sure to satisfy your Java programming appetite! Topics include: String Handling Regular Expressions File Handling Applets Servlets Swing The Collections Framework Multithreading Formatting Data Learn how to: Find substrings that match a regular expression Use regular expressions to tokenize a string Compress and decompress data files Create a ZIP file Format time and date Use printf( ) to display formatted data Reverse, rotate, and shuffle a list Use a Comparator with a collection Create a simple Swing application Create a Swing-based applet Create a simple servlet Use a cookie with a servlet Synchronize threads Monitor a thread's state Set and obtain a thread's priority Use JScrollPane to automate scrolling Access a resource using HttpURLConnection Schedule a task for future execution Use reflection to dynamically create an object and call methods Much, much more","language":"en","currency":"USD","id":"0071596445","title":"Herb Schildt's Java Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X8IYQKjMN9cC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kX7SDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. The professional programmer’s Deitel® guide to C# 6 and object-oriented development for Windows® Written for programmers with a background in high-level language programming, C# 6 for Programmers applies the Deitel signature live-code approach to teaching programming and explores Microsoft’s C# 6 and .NET in depth. Concepts are presented in the context of 170+ fully coded and tested apps, complete with syntax shading, code highlighting, code walkthroughs, program outputs and hundreds of savvy software-development tips. Start with an introduction to C# using an early classes and objects approach, then rapidly move on to more advanced topics, including LINQ, asynchronous programming with async and await and more. You’ll enjoy the treatment of object-oriented programming and an object-oriented design\/UML® ATM case study, including a complete C# implementation. When you’ve mastered the book, you’ll be ready to start building industrial-strength, object-oriented C# apps. Paul Deitel and Harvey Deitel are the founders of Deitel & Associates, Inc., the internationally recognized programming languages authoring and corporate training organization. Millions of people worldwide have used Deitel textbooks, professional books, LiveLessons™ video products, e-books, resource centers and REVEL™ interactive multimedia courses with integrated labs and assessment to master major programming languages and platforms, including C#, C++, C, Java™, Android™ app development, iOS app development, Swift™, Visual Basic®, Python™ and Internet and web programming. Features: •Use with Windows® 7, 8 or 10. •Integrated coverage of new C# 6 functionality: string interpolation, expression-bodied methods and properties, auto-implemented property initializers, getter-only properties, nameof, null-conditional operator, exception filters and more. •Entertaining and challenging code examples. •Deep treatment of classes, objects, inheritance, polymorphism and interfaces. •Generics, LINQ and generic collections; PLINQ (Parallel LINQ) for multicore performance. •Asynchronous programming with async and await; functional programming with lambdas, delegates and immutability. •Files; relational database with LINQ to Entities. •Object-oriented design ATM case study with full code implementation. •Emphasis on performance and software engineering principles","language":"en","currency":"USD","id":"0134596366","title":"C# 6 for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kX7SDAAAQBAJ&source=gbs_api","authors":["Paul Deitel","Harvey Deitel"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5FVOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In this exclusive eBook, preview excerpts from brand-new and forthcoming Oracle Press Java JDK 8 books. Written by leading Java experts, Oracle Press books offer the most definitive, complete, and up-to-date coverage of the latest Java release. Featuring an introduction by bestselling programming author Herb Schildt, this eBook includes chapters from the following Oracle Press books: Java: The Complete Reference, Ninth Edition by Herb Schildt Java: A Beginner’s Guide, Sixth Edition by Herb Schildt Mastering Lambdas: Java Programming in a Multicore World by Maurice Naftalin Quick Start Guide to JavaFX by J.F. DiMarzio Mastering JavaFX 8 Controls: Create Custom JavaFX 8 Controls for Cross-Platform Applications by Hendrik Ebbers","language":"en","currency":"USD","id":"0071836500","title":"Java 8 Preview Sampler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5FVOAwAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Maurice Naftalin","Hendrik Ebbers","J. F. DiMarzio"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ETGMKA6tfoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Complete coverage of the newest exam release from the Linux Professional Institute, and the first step toward LPIC-1 and CompTIA Linux+ Linux Essentials All-in-One Exam Guide covers this \"first-of-its-kind\" program intended for the academic sector, aspiring IT professionals, and anyone new to the world of Linux and open source technology. This comprehensive, classroom-based reference offers 100% coverage of all exam objectives for the Linux Essentials exam. The book includes expert discussion sidebars to convey in-depth information. Tip, Caution, and Note icons highlight key topics; end-of-chapter quizzes test retention and exam readiness; and Exam Tips guide you through tough technical topics that may be tricky come exam day. The All-in-One also includes hands-on examples and exercises that reinforce practical learning for real-world applicability. Electronic content includes a practice exam (Windows based).","language":"en","currency":"USD","id":"0071811001","title":"LPI Linux Essentials Certification All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ETGMKA6tfoC&source=gbs_api","authors":["Robb Tracy"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zGEYAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Designing and Developing Distributed Web Services","description":"Learn how to design and develop distributed web services in Java, using RESTful architectural principles and the JAX-RS 2.0 specification in Java EE 7. By focusing on implementation rather than theory, this hands-on reference demonstrates how easy it is to get started with services based on the REST architecture. With the book’s technical guide, you’ll learn how REST and JAX-RS work and when to use them. The RESTEasy workbook that follows provides step-by-step instructions for installing, configuring, and running several working JAX-RS examples, using the JBoss RESTEasy implementation of JAX-RS 2.0. Learn JAX-RS 2.0 features, including a client API, server-side asynchronous HTTP, and filters and interceptors Examine the design of a distributed RESTful interface for an e-commerce order entry system Use the JAX-RS Response object to return complex responses to your client (ResponseBuilder) Increase the performance of your services by leveraging HTTP caching protocols Deploy and integrate web services within Java EE7, servlet containers, EJB, Spring, and JPA Learn popular mechanisms to perform authentication on the Web, including client-side SSL and OAuth 2.0","language":"en","currency":"USD","id":"1449361455","title":"RESTful Java with JAX-RS 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zGEYAgAAQBAJ&source=gbs_api","authors":["Bill Burke"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8ccrObyz8oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"From the world’s bestselling programming author Using the practical pedagogy that has made his other Beginner’s Guides so successful, Herb Schildt provides new Swing programmers with a completely integrated learning package. Perfect for the classroom or self-study, Swing: A Beginner’s Guide delivers the appropriate mix of theory and practical coding. You will be programming as early as Chapter 1.","language":"en","currency":"USD","id":"0071706941","title":"Swing: A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8ccrObyz8oC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Create Expressive, Concise, and Scalable Applications","description":"Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. The first edition of this book was released as Programming Scala. Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. This thorough introduction to Scala will get you coding in this powerful language right away. You'll start from the familiar ground of Java and, with easy-to-follow examples, you'll learn how to create highly concise and expressive applications with Scala. You'll find out when and how to mix both imperative and functional style, and how to use parallel collections and Akka actors to create high-performance concurrent applications that effectively use multicore processors. Scala has evolved since the first edition of this book, and Pragmatic Scala is a significant update. We've revised each chapter, and added three new chapters and six new sections to explore the new features in Scala. You'll learn how to: Safely manage concurrency with parallel collections and Akka actors Create expressive readable code with value classes and improved implicit conversions Create strings from data with no sweat using string interpolation Create domain-specific languages Optimize your recursions with tail call optimization Whether you're interested in creating concise, robust single-threaded applications or highly expressive, thread-safe concurrent programs, this book has you covered. What You Need: The Scala compiler (2.x) and the JDK are required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680504207","title":"Pragmatic Scala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lfHo7uMk7r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.63,"subtitle":"Practical Guide for Programmers","description":"The networking capabilities of the Java platform have been extended considerably since the first edition of the book. This new edition covers version 1.5-1.7, the most current iterations, as well as making the following improvements: The API (application programming interface) reference sections in each chapter, which describe the relevant parts of each class, have been replaced with (i) a summary section that lists the classes and methods used in the code, and (ii) a \"gotchas\" section that mentions nonobvious or poorly-documented aspects of the objects. In addition, the book covers several new classes and capabilities introduced in the last few revisions of the Java platform. New abstractions to be covered include NetworkInterface, InterfaceAddress, Inet4\/6Address, SocketAddress\/InetSocketAddress, Executor, and others; extended access to low-level network information; support for IPv6; more complete access to socket options; and scalable I\/O. The example code is also modified to take advantage of new language features such as annotations, enumerations, as well as generics and implicit iterators where appropriate. Most Internet applications use sockets to implement network communication protocols. This book's focused, tutorial-based approach helps the reader master the tasks and techniques essential to virtually all client-server projects using sockets in Java. Chapter 1 provides a general overview of networking concepts to allow readers to synchronize the concepts with terminology. Chapter 2 introduces the mechanics of simple clients and servers. Chapter 3 covers basic message construction and parsing. Chapter 4 then deals with techniques used to build more robust clients and servers. Chapter 5 (NEW) introduces the scalable interface facilities which were introduced in Java 1.5, including the buffer and channel abstractions. Chapter 6 discusses the relationship between the programming constructs and the underlying protocol implementations in more detail. Programming concepts are introduced through simple program examples accompanied by line-by-line code commentary that describes the purpose of every part of the program. No other resource presents so concisely or so effectively the material necessary to get up and running with Java sockets programming. Focused, tutorial-based instruction in key sockets programming techniques allows reader to quickly come up to speed on Java applications. Concise and up-to-date coverage of the most recent platform (1.7) for Java applications in networking technology.","language":"en","currency":"USD","id":"9780080568782","title":"TCP\/IP Sockets in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lfHo7uMk7r4C&source=gbs_api","authors":["Kenneth L. Calvert","Michael J. Donahoo"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTZqecc9olUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Build Better Applications with Coding and Design Patterns","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","language":"en","currency":"USD","id":"9781449396947","title":"JavaScript Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTZqecc9olUC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uq9PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn how to implement design patterns in Java: each pattern in Java Design Patterns is a complete implementation and the output is generated using Eclipse, making the code accessible to all. The examples are chosen so you will be able to absorb the core concepts easily and quickly. This book presents the topic of design patterns in Java in such a way that anyone can grasp the idea. By giving easy to follow examples, you will understand the concepts with increasing depth. The examples presented are straightforward and the topic is presented in a concise manner. Key features of the book: Each of the 23 patterns is described with straightforward Java code. There is no need to know advanced concepts of Java to use this book. Each of the concepts is connected with a real world example and a computer world example. The book uses Eclipse IDE to generate the output because it is the most popular IDE in this field. This is a practitioner's book on design patterns in Java. Design patterns are a popular topic in software development. A design pattern is a common, well-described solution to a common software problem. There is a lot of written material available on design patterns, but scattered and not in one single reference source. Also, many of these examples are unnecessarily big and complex.","language":"en","currency":"USD","id":"1484218027","title":"Java Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uq9PCwAAQBAJ&source=gbs_api","authors":["Vaskaran Sarcar"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":851,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Eh5NcvegzMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":"Exam 310-065","description":"The Best Fully Integrated Study System Available--Written by the Lead Developers of Exam 310-065 With hundreds of practice questions and hands-on exercises, SCJP Sun Certified Programmer for Java 6 Study Guide covers what you need to know--and shows you how to prepare--for this challenging exam. 100% complete coverage of all official objectives for exam 310-065 Exam Objective Highlights in every chapter point out certification objectives to ensure you're focused on passing the exam Exam Watch sections in every chapter highlight key exam topics covered Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all SCJP exam topics, including: Declarations and Access Control · Object Orientation · Assignments · Operators · Flow Control, Exceptions, and Assertions · Strings, I\/O, Formatting, and Parsing · Generics and Collections · Inner Classes · Threads · Development CD-ROM includes: Complete MasterExam practice testing engine, featuring: Two full practice exams; Detailed answers with explanations; Score Report performance assessment tool Electronic book for studying on the go Bonus coverage of the SCJD exam included! Bonus downloadable MasterExam practice test with free online registration.","language":"en","currency":"USD","id":"9780071591072","title":"SCJP Sun Certified Programmer for Java 6 Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Eh5NcvegzMkC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to integrate machine learning with distributed search and analytics","description":"Leverage Elastic Stack’s machine learning features to gain valuable insight from your data Key Features Combine machine learning with the analytic capabilities of Elastic Stack Analyze large volumes of search data and gain actionable insight from them Use external analytical tools with your Elastic Stack to improve its performance Book Description Machine Learning with the Elastic Stack is a comprehensive overview of the embedded commercial features of anomaly detection and forecasting. The book starts with installing and setting up Elastic Stack. You will perform time series analysis on varied kinds of data, such as log files, network flows, application metrics, and financial data. As you progress through the chapters, you will deploy machine learning within the Elastic Stack for logging, security, and metrics. In the concluding chapters, you will see how machine learning jobs can be automatically distributed and managed across the Elasticsearch cluster and made resilient to failure. By the end of this book, you will understand the performance aspects of incorporating machine learning within the Elastic ecosystem and create anomaly detection jobs and view results from Kibana directly. What you will learn Install the Elastic Stack to use machine learning features Understand how Elastic machine learning is used to detect a variety of anomaly types Apply effective anomaly detection to IT operations and security analytics Leverage the output of Elastic machine learning in custom views, dashboards, and proactive alerting Combine your created jobs to correlate anomalies of different layers of infrastructure Learn various tips and tricks to get the most out of Elastic machine learning Who this book is for If you are a data professional eager to gain insight on Elasticsearch data without having to rely on a machine learning specialist or custom development, Machine Learning with the Elastic Stack is for you. Those looking to integrate machine learning within their search and analytics applications will also find this book very useful. Prior experience with the Elastic Stack is needed to get the most out of this book.","language":"en","currency":"USD","id":"1788471776","title":"Machine Learning with the Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyOGDwAAQBAJ&source=gbs_api","authors":["Rich Collier","Bahaaldine Azarmi"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uCR8AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Java EE 7 Tutorial: Volume 1, Fifth Edition, is a task-oriented, example-driven guide to developing enterprise applications for the Java Platform, Enterprise Edition 7 (Java EE 7). Written by members of the Java EE documentation team at Oracle, this book provides new and intermediate Java programmers with a deep understanding of the platform. This guide includes descriptions of platform features and provides instructions for using the latest versions of NetBeans IDE and GlassFish Server Open Source Edition. The book introduces platform basics, including resource creation, resource injection, and packaging. It covers JavaServer Faces, Java Servlets, the Java API for WebSocket, the Java API for JSON Processing (JSON-P), internationalization and localization, Bean Validation, Contexts and Dependency Injection for Java EE (CDI), and web services (JAX-WS and JAX-RS).","language":"en","currency":"USD","id":"0133901580","title":"The Java EE 7 Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uCR8AwAAQBAJ&source=gbs_api","authors":["Eric Jendrock","Ricardo Cervera-Navarro","Ian Evans","Kim Haase","William Markito"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qsa-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":"Leverage Clojure's polymorphic tools to develop your applications","description":"Learn when and how to use Clojure's polymorphic features to develop efficient multithreaded applications Key Features Get to grips with the different polymorphic tools that Clojure offers Develop a taste for good Clojure designs through various engaging examples Study various design principles and learn ways to use them in your applications Book Description Clojure is a modern, dynamic language that you can use to develop robust, multithreaded programs. Clojure Polymorphism is a comprehensive guide that shows you how to use Clojure's features to your advantage. The book begins by describing examples that show how to define and implement abstractions with plain functions and multimethods. Then you'll analyze these examples and separate the good and bad aspects of their design principles. You'll also learn how to perform data transformation abstraction with a plain function and discover how to write new cross-platform predicates while keeping the core of your abstraction free from reader conditionals. The later chapters explain the considerations to keep in mind when implementing Clojure protocols on the Java Virtual Machine (JVM). By the end of this book, you'll know how to use the various polymorphic tools of Clojure to your advantage while designing your applications. What you will learn Explore how polymorphism is implemented in Clojure Discover what design principles to use when creating and implementing abstractions Explore different ways to implement protocols in Clojure Implement various design principles while working with the JVM Write and compare plain functions and multimethods for transforming data Analyze functions and abstractions for their performance and flexibility Learn about common “gotchas” to avoid errors when writing code Who this book is for Clojure Polymorphism is useful for all programmers who want to leverage Clojure's polymorphic tools to build efficient applications. To get the most out of this book, you must be a moderately proficient Clojure programmer.","language":"en","currency":"USD","id":"1838988378","title":"Clojure Polymorphism","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qsa-DwAAQBAJ&source=gbs_api","authors":["Paul Stadig"]},{"pageCount":381,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0D-qCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Definition, Verification, Validation","description":"The origin of this book goes back to the Dagstuhl seminar on Logic for System Engineering, organized during the first week of March 1997 by S. Jiihnichen, J. Loeckx, and M. Wirsing. During that seminar, after Egon Borger's talk on How to Use Abstract State Machines in Software Engineering, Wolfram Schulte, at the time a research assistant at the University of Ulm, Germany, questioned whether ASMs provide anything special as a scientifically well founded and rigorous yet simple and industrially viable framework for high level design and analysis of complex systems, and for natural refinements of models to executable code. Wolfram Schulte argued, referring to his work with K. Achatz on A Formal Object-Oriented Method Inspired by Fusion and Object-Z [1], that with current techniques of functional programming and of axiomatic specification, one can achieve the same result. An intensive and long debate arose from this discussion. At the end of the week, it led Egon Borger to propose a collaboration on a real-life specification project of Wolfram Schulte's choice, as a comparative field test of purely functional declarative methods and of their enhancement within an integrated abstract state-based operational (ASM) approach. After some hesitation, in May 1997 Wolfram Schulte accepted the offer and chose as the theme a high-level specification of Java and of the Java Virtual Machine.","language":"en","currency":"USD","id":"3642594956","title":"Java and the Java Virtual Machine","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0D-qCAAAQBAJ&source=gbs_api","authors":["Robert F. Stärk","Joachim Schmid","Egon Börger"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I_3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Automating the Container Orchestration Platform","description":"Operators are a way of packaging, deploying, and managing Kubernetes applications. A Kubernetes application doesn’t just run on Kubernetes; it’s composed and managed in Kubernetes terms. Operators add application-specific operational knowledge to a Kubernetes cluster, making it easier to automate complex, stateful applications and to augment the platform. Operators can coordinate application upgrades seamlessly, react to failures automatically, and streamline repetitive maintenance like backups. Think of Operators as site reliability engineers in software. They work by extending the Kubernetes control plane and API, helping systems integrators, cluster administrators, and application developers reliably deploy and manage key services and components. Using real-world examples, authors Jason Dobies and Joshua Wood demonstrate how to use Operators today and how to create Operators for your applications with the Operator Framework and SDK. Learn how to establish a Kubernetes cluster and deploy an Operator Examine a range of Operators from usage to implementation Explore the three pillars of the Operator Framework: the Operator SDK, the Operator Lifecycle Manager, and Operator Metering Build Operators from the ground up using the Operator SDK Build, package, and run an Operator in development, testing, and production phases Learn how to distribute your Operator for installation on Kubernetes clusters","language":"en","currency":"USD","id":"1492047996","title":"Kubernetes Operators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I_3RDwAAQBAJ&source=gbs_api","authors":["Jason Dobies","Joshua Wood"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YTCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build complete data analysis flows, from data collection to visualization","description":"A practical guide to getting the most out of Excel, using it for data preparation, applying machine learning models (including cloud services) and understanding the outcome of the data analysis. Key Features Use Microsoft's product Excel to build advanced forecasting models using varied examples Cover range of machine learning tasks such as data mining, data analytics, smart visualization, and more Derive data-driven techniques using Excel plugins and APIs without much code required Book Description We have made huge progress in teaching computers to perform difficult tasks, especially those that are repetitive and time-consuming for humans. Excel users, of all levels, can feel left behind by this innovation wave. The truth is that a large amount of the work needed to develop and use a machine learning model can be done in Excel. The book starts by giving a general introduction to machine learning, making every concept clear and understandable. Then, it shows every step of a machine learning project, from data collection, reading from different data sources, developing models, and visualizing the results using Excel features and offerings. In every chapter, there are several examples and hands-on exercises that will show the reader how to combine Excel functions, add-ins, and connections to databases and to cloud services to reach the desired goal: building a full data analysis flow. Different machine learning models are shown, tailored to the type of data to be analyzed. At the end of the book, the reader is presented with some advanced use cases using Automated Machine Learning, and artificial neural network, which simplifies the analysis task and represents the future of machine learning. What you will learn Use Excel to preview and cleanse datasets Understand correlations between variables and optimize the input to machine learning models Use and evaluate different machine learning models from Excel Understand the use of different visualizations Learn the basic concepts and calculations to understand how artificial neural networks work Learn how to connect Excel to the Microsoft Azure cloud Get beyond proof of concepts and build fully functional data analysis flows Who this book is for This book is for data analysis, machine learning enthusiasts, project managers, and someone who doesn't want to code much for performing core tasks of machine learning. Each example will help you perform end-to-end smart analytics. Working knowledge of Excel is required.","language":"en","currency":"USD","id":"178934512X","title":"Hands-On Machine Learning with Microsoft Excel 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YTCWDwAAQBAJ&source=gbs_api","authors":["Julio Cesar Rodriguez Martino"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SE2iRgeYYwcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Social network analysis applications have experienced tremendous advances within the last few years due in part to increasing trends towards users interacting with each other on the internet. Social networks are organized as graphs, and the data on social networks takes on the form of massive streams, which are mined for a variety of purposes. Social Network Data Analytics covers an important niche in the social network analytics field. This edited volume, contributed by prominent researchers in this field, presents a wide selection of topics on social network data mining such as Structural Properties of Social Networks, Algorithms for Structural Discovery of Social Networks and Content Analysis in Social Networks. This book is also unique in focussing on the data analytical aspects of social networks in the internet scenario, rather than the traditional sociology-driven emphasis prevalent in the existing books, which do not focus on the unique data-intensive characteristics of online social networks. Emphasis is placed on simplifying the content so that students and practitioners benefit from this book. This book targets advanced level students and researchers concentrating on computer science as a secondary text or reference book. Data mining, database, information security, electronic commerce and machine learning professionals will find this book a valuable asset, as well as primary associations such as ACM, IEEE and Management Science.","language":"en","currency":"USD","id":"1441984623","title":"Social Network Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SE2iRgeYYwcC&source=gbs_api","authors":["Charu C. Aggarwal"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pTYkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Enterprise and the Cloud","description":"The Complete Guide to Optimizing Systems Performance Written by the winner of the 2013 LISA Award for Outstanding Achievement in System Administration Large-scale enterprise, cloud, and virtualized computing systems have introduced serious performance challenges. Now, internationally renowned performance expert Brendan Gregg has brought together proven methodologies, tools, and metrics for analyzing and tuning even the most complex environments. Systems Performance: Enterprise and the Cloud focuses on Linux® and Unix® performance, while illuminating performance issues that are relevant to all operating systems. You’ll gain deep insight into how systems work and perform, and learn methodologies for analyzing and improving system and application performance. Gregg presents examples from bare-metal systems and virtualized cloud tenants running Linux-based Ubuntu®, Fedora®, CentOS, and the illumos-based Joyent® SmartOS™ and OmniTI OmniOS®. He systematically covers modern systems performance, including the “traditional” analysis of CPUs, memory, disks, and networks, and new areas including cloud computing and dynamic tracing. This book also helps you identify and fix the “unknown unknowns” of complex performance: bottlenecks that emerge from elements and interactions you were not aware of. The text concludes with a detailed case study, showing how a real cloud customer issue was analyzed from start to finish. Coverage includes • Modern performance analysis and tuning: terminology, concepts, models, methods, and techniques • Dynamic tracing techniques and tools, including examples of DTrace, SystemTap, and perf • Kernel internals: uncovering what the OS is doing • Using system observability tools, interfaces, and frameworks • Understanding and monitoring application performance • Optimizing CPUs: processors, cores, hardware threads, caches, interconnects, and kernel scheduling • Memory optimization: virtual memory, paging, swapping, memory architectures, busses, address spaces, and allocators • File system I\/O, including caching • Storage devices\/controllers, disk I\/O workloads, RAID, and kernel I\/O • Network-related performance issues: protocols, sockets, interfaces, and physical connections • Performance implications of OS and hardware-based virtualization, and new issues encountered with cloud computing • Benchmarking: getting accurate results and avoiding common mistakes This guide is indispensable for anyone who operates enterprise or cloud environments: system, network, database, and web admins; developers; and other professionals. For students and others new to optimization, it also provides exercises reflecting Gregg’s extensive instructional experience.","language":"en","currency":"USD","id":"0133390101","title":"Systems Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pTYkAQAAQBAJ&source=gbs_api","authors":["Brendan Gregg"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Solutions for Modular, Functional, Reactive, and Multithreaded programming","description":"A definitive guide to learning the key concepts of modern application development in Java About This Book Learn the latest features of Java 9 Extend your Java knowledge and take your application to new levels by making it fast, secure, and scalable Delve into the intricacies of Modular programming in Java 9 Who This Book Is For The book is for intermediate to advanced Java programmers who want to make their applications fast, secure, and scalable. What You Will Learn Set up JDK and know the differences in the JDK 9 installation Implement OO designs using classes and interfaces Manage operating system processes Understand the new modular JDK and modular programming Create a modular application with clear dependencies Build graphical user interfaces using JavaFX Use the new HTTP Client API Learn about the new diagnostic features in Java 9 See how to use the new jShell REPL tool Execute ES6-compliant JavaScript code from your Java applications In Detail Java is an object-oriented programming language. It is one of the most widely accepted languages because of its design and programming features, particularly in its promise that you can write a program once and run it anywhere. This cookbook offers a range of software development examples in simple and straightforward Java 9 code, providing step-by-step resources and time-saving methods to help you solve data problems efficiently. Starting with the installation of Java, each recipe addresses a specific problem, with a discussion that explains the solution and offers insight into how it works. We cover major concepts such as Project Jigsaw and various tools that will enable you to modularize your applications. You will learn new features in the form of recipes that will make your applications modular, secure, and fast. Style and approach Each recipe in this book contains a series of complete instructions to perform a core task, plus an explanation of the purpose behind it. Similar methods or further refinements are included with each recipe to provide comprehensive guidance.","language":"en","currency":"USD","id":"1786464985","title":"Java 9 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OpZGDwAAQBAJ&source=gbs_api","authors":["Mohamed Sanaulla","Nick Samoylov"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build strong foundation for entering the world of Machine Learning and data science with the help of this comprehensive guide About This Book Get started in the field of Machine Learning with the help of this solid, concept-rich, yet highly practical guide. Your one-stop solution for everything that matters in mastering the whats and whys of Machine Learning algorithms and their implementation. Get a solid foundation for your entry into Machine Learning by strengthening your roots (algorithms) with this comprehensive guide. Who This Book Is For This book is for IT professionals who want to enter the field of data science and are very new to Machine Learning. Familiarity with languages such as R and Python will be invaluable here. What You Will Learn Acquaint yourself with important elements of Machine Learning Understand the feature selection and feature engineering process Assess performance and error trade-offs for Linear Regression Build a data model and understand how it works by using different types of algorithm Learn to tune the parameters of Support Vector machines Implement clusters to a dataset Explore the concept of Natural Processing Language and Recommendation Systems Create a ML architecture from scratch. In Detail As the amount of data continues to grow at an almost incomprehensible rate, being able to understand and process data is becoming a key differentiator for competitive organizations. Machine learning applications are everywhere, from self-driving cars, spam detection, document search, and trading strategies, to speech recognition. This makes machine learning well-suited to the present-day era of Big Data and Data Science. The main challenge is how to transform data into actionable knowledge. In this book you will learn all the important Machine Learning algorithms that are commonly used in the field of data science. These algorithms can be used for supervised as well as unsupervised learning, reinforcement learning, and semi-supervised learning. A few famous algorithms that are covered in this book are Linear regression, Logistic Regression, SVM, Naive Bayes, K-Means, Random Forest, TensorFlow, and Feature engineering. In this book you will also learn how these algorithms work and their practical implementation to resolve your problems. This book will also introduce you to the Natural Processing Language and Recommendation systems, which help you run multiple algorithms simultaneously. On completion of the book you will have mastered selecting Machine Learning algorithms for clustering, classification, or regression based on for your problem. Style and approach An easy-to-follow, step-by-step guide that will help you get to grips with real -world applications of Algorithms for Machine Learning.","language":"en","currency":"USD","id":"1785884514","title":"Machine Learning Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-ZDDwAAQBAJ&source=gbs_api","authors":["Giuseppe Bonaccorso"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jz7EDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In order to remain competitive in today's world, companies need to be able to integrate internally and externally by connecting sensors, customers and partners with the information in their systems of record. In short, they need to integrate with everything. This IBM® Redbooks® publication describes how IBM Application Integration Suite and IBM Messaging portfolio can be used to satisfy the needs of core hybrid integration use cases, accelerating companies in their digital transformation journey. All concepts are explained within the context of these use cases: Joining the API economy Improving productivity Refactoring for innovation The target audience for this book is cloud and integration architects and specialists who are implementing hybrid integration solutions.","language":"en","currency":"USD","id":"0738442267","title":"An Architectural and Practical Guide to IBM Hybrid Integration Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jz7EDQAAQBAJ&source=gbs_api","authors":["Carsten Börnert","Kim Clark","Shahir Daya","Matthieu Debeaux","Gerd Diederichs","Vasfi Gucer","Shamim Hossain","Gary Kean","Carlo Marcoli","Shohei Matsumoto","Amar Shah","Johan Thole","IBM Redbooks"]},{"pageCount":888,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8RD-eBVQtgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"A complete update to the definitive, bestselling guide to the #1 certification for Java programmers Written and revised by the co-developers of the original SCJP exam and now published in the Oracle Press brand Includes two complete practice exams—250+ practice exam questions in book and via electronic content Replaces SCJP Sun Certified Programmer for Java Study Guide—150,000 copies sold","language":"en","currency":"USD","id":"0071771999","title":"OCA\/OCP Java SE 7 Programmer I & II Study Guide (Exams 1Z0-803 & 1Z0-804)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8RD-eBVQtgC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":524,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X8IYQKjMN9cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Your Ultimate \"How-To\" Guide to Java Programming! Legendary programming author Herb Schildt shares some of his favorite programming techniques in this high-powered Java \"cookbook.\" Organized for quick reference, each recipe shows how to accomplish a practical programming task. A recipe begins with a list of key ingredients (the classes, methods, and interfaces) followed by step-by-step instructions that show how to assemble them into a complete solution. Detailed discussions explain the how and why behind each step, and a full code example puts the recipe into action. Each recipe ends with a list of options and alternatives that suggest ways to adapt the technique to fit a variety of situations. Whether you're a beginner or an experienced pro, you'll find recipes that are sure to satisfy your Java programming appetite! Topics include: String Handling Regular Expressions File Handling Applets Servlets Swing The Collections Framework Multithreading Formatting Data Learn how to: Find substrings that match a regular expression Use regular expressions to tokenize a string Compress and decompress data files Create a ZIP file Format time and date Use printf( ) to display formatted data Reverse, rotate, and shuffle a list Use a Comparator with a collection Create a simple Swing application Create a Swing-based applet Create a simple servlet Use a cookie with a servlet Synchronize threads Monitor a thread's state Set and obtain a thread's priority Use JScrollPane to automate scrolling Access a resource using HttpURLConnection Schedule a task for future execution Use reflection to dynamically create an object and call methods Much, much more","language":"en","currency":"USD","id":"0071596445","title":"Herb Schildt's Java Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X8IYQKjMN9cC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kX7SDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. The professional programmer’s Deitel® guide to C# 6 and object-oriented development for Windows® Written for programmers with a background in high-level language programming, C# 6 for Programmers applies the Deitel signature live-code approach to teaching programming and explores Microsoft’s C# 6 and .NET in depth. Concepts are presented in the context of 170+ fully coded and tested apps, complete with syntax shading, code highlighting, code walkthroughs, program outputs and hundreds of savvy software-development tips. Start with an introduction to C# using an early classes and objects approach, then rapidly move on to more advanced topics, including LINQ, asynchronous programming with async and await and more. You’ll enjoy the treatment of object-oriented programming and an object-oriented design\/UML® ATM case study, including a complete C# implementation. When you’ve mastered the book, you’ll be ready to start building industrial-strength, object-oriented C# apps. Paul Deitel and Harvey Deitel are the founders of Deitel & Associates, Inc., the internationally recognized programming languages authoring and corporate training organization. Millions of people worldwide have used Deitel textbooks, professional books, LiveLessons™ video products, e-books, resource centers and REVEL™ interactive multimedia courses with integrated labs and assessment to master major programming languages and platforms, including C#, C++, C, Java™, Android™ app development, iOS app development, Swift™, Visual Basic®, Python™ and Internet and web programming. Features: •Use with Windows® 7, 8 or 10. •Integrated coverage of new C# 6 functionality: string interpolation, expression-bodied methods and properties, auto-implemented property initializers, getter-only properties, nameof, null-conditional operator, exception filters and more. •Entertaining and challenging code examples. •Deep treatment of classes, objects, inheritance, polymorphism and interfaces. •Generics, LINQ and generic collections; PLINQ (Parallel LINQ) for multicore performance. •Asynchronous programming with async and await; functional programming with lambdas, delegates and immutability. •Files; relational database with LINQ to Entities. •Object-oriented design ATM case study with full code implementation. •Emphasis on performance and software engineering principles","language":"en","currency":"USD","id":"0134596366","title":"C# 6 for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kX7SDAAAQBAJ&source=gbs_api","authors":["Paul Deitel","Harvey Deitel"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5FVOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In this exclusive eBook, preview excerpts from brand-new and forthcoming Oracle Press Java JDK 8 books. Written by leading Java experts, Oracle Press books offer the most definitive, complete, and up-to-date coverage of the latest Java release. Featuring an introduction by bestselling programming author Herb Schildt, this eBook includes chapters from the following Oracle Press books: Java: The Complete Reference, Ninth Edition by Herb Schildt Java: A Beginner’s Guide, Sixth Edition by Herb Schildt Mastering Lambdas: Java Programming in a Multicore World by Maurice Naftalin Quick Start Guide to JavaFX by J.F. DiMarzio Mastering JavaFX 8 Controls: Create Custom JavaFX 8 Controls for Cross-Platform Applications by Hendrik Ebbers","language":"en","currency":"USD","id":"0071836500","title":"Java 8 Preview Sampler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5FVOAwAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Maurice Naftalin","Hendrik Ebbers","J. F. DiMarzio"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ETGMKA6tfoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Complete coverage of the newest exam release from the Linux Professional Institute, and the first step toward LPIC-1 and CompTIA Linux+ Linux Essentials All-in-One Exam Guide covers this \"first-of-its-kind\" program intended for the academic sector, aspiring IT professionals, and anyone new to the world of Linux and open source technology. This comprehensive, classroom-based reference offers 100% coverage of all exam objectives for the Linux Essentials exam. The book includes expert discussion sidebars to convey in-depth information. Tip, Caution, and Note icons highlight key topics; end-of-chapter quizzes test retention and exam readiness; and Exam Tips guide you through tough technical topics that may be tricky come exam day. The All-in-One also includes hands-on examples and exercises that reinforce practical learning for real-world applicability. Electronic content includes a practice exam (Windows based).","language":"en","currency":"USD","id":"0071811001","title":"LPI Linux Essentials Certification All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ETGMKA6tfoC&source=gbs_api","authors":["Robb Tracy"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zGEYAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Designing and Developing Distributed Web Services","description":"Learn how to design and develop distributed web services in Java, using RESTful architectural principles and the JAX-RS 2.0 specification in Java EE 7. By focusing on implementation rather than theory, this hands-on reference demonstrates how easy it is to get started with services based on the REST architecture. With the book’s technical guide, you’ll learn how REST and JAX-RS work and when to use them. The RESTEasy workbook that follows provides step-by-step instructions for installing, configuring, and running several working JAX-RS examples, using the JBoss RESTEasy implementation of JAX-RS 2.0. Learn JAX-RS 2.0 features, including a client API, server-side asynchronous HTTP, and filters and interceptors Examine the design of a distributed RESTful interface for an e-commerce order entry system Use the JAX-RS Response object to return complex responses to your client (ResponseBuilder) Increase the performance of your services by leveraging HTTP caching protocols Deploy and integrate web services within Java EE7, servlet containers, EJB, Spring, and JPA Learn popular mechanisms to perform authentication on the Web, including client-side SSL and OAuth 2.0","language":"en","currency":"USD","id":"1449361455","title":"RESTful Java with JAX-RS 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zGEYAgAAQBAJ&source=gbs_api","authors":["Bill Burke"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8ccrObyz8oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"From the world’s bestselling programming author Using the practical pedagogy that has made his other Beginner’s Guides so successful, Herb Schildt provides new Swing programmers with a completely integrated learning package. Perfect for the classroom or self-study, Swing: A Beginner’s Guide delivers the appropriate mix of theory and practical coding. You will be programming as early as Chapter 1.","language":"en","currency":"USD","id":"0071706941","title":"Swing: A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8ccrObyz8oC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Create Expressive, Concise, and Scalable Applications","description":"Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. The first edition of this book was released as Programming Scala. Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. This thorough introduction to Scala will get you coding in this powerful language right away. You'll start from the familiar ground of Java and, with easy-to-follow examples, you'll learn how to create highly concise and expressive applications with Scala. You'll find out when and how to mix both imperative and functional style, and how to use parallel collections and Akka actors to create high-performance concurrent applications that effectively use multicore processors. Scala has evolved since the first edition of this book, and Pragmatic Scala is a significant update. We've revised each chapter, and added three new chapters and six new sections to explore the new features in Scala. You'll learn how to: Safely manage concurrency with parallel collections and Akka actors Create expressive readable code with value classes and improved implicit conversions Create strings from data with no sweat using string interpolation Create domain-specific languages Optimize your recursions with tail call optimization Whether you're interested in creating concise, robust single-threaded applications or highly expressive, thread-safe concurrent programs, this book has you covered. What You Need: The Scala compiler (2.x) and the JDK are required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680504207","title":"Pragmatic Scala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lfHo7uMk7r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.63,"subtitle":"Practical Guide for Programmers","description":"The networking capabilities of the Java platform have been extended considerably since the first edition of the book. This new edition covers version 1.5-1.7, the most current iterations, as well as making the following improvements: The API (application programming interface) reference sections in each chapter, which describe the relevant parts of each class, have been replaced with (i) a summary section that lists the classes and methods used in the code, and (ii) a \"gotchas\" section that mentions nonobvious or poorly-documented aspects of the objects. In addition, the book covers several new classes and capabilities introduced in the last few revisions of the Java platform. New abstractions to be covered include NetworkInterface, InterfaceAddress, Inet4\/6Address, SocketAddress\/InetSocketAddress, Executor, and others; extended access to low-level network information; support for IPv6; more complete access to socket options; and scalable I\/O. The example code is also modified to take advantage of new language features such as annotations, enumerations, as well as generics and implicit iterators where appropriate. Most Internet applications use sockets to implement network communication protocols. This book's focused, tutorial-based approach helps the reader master the tasks and techniques essential to virtually all client-server projects using sockets in Java. Chapter 1 provides a general overview of networking concepts to allow readers to synchronize the concepts with terminology. Chapter 2 introduces the mechanics of simple clients and servers. Chapter 3 covers basic message construction and parsing. Chapter 4 then deals with techniques used to build more robust clients and servers. Chapter 5 (NEW) introduces the scalable interface facilities which were introduced in Java 1.5, including the buffer and channel abstractions. Chapter 6 discusses the relationship between the programming constructs and the underlying protocol implementations in more detail. Programming concepts are introduced through simple program examples accompanied by line-by-line code commentary that describes the purpose of every part of the program. No other resource presents so concisely or so effectively the material necessary to get up and running with Java sockets programming. Focused, tutorial-based instruction in key sockets programming techniques allows reader to quickly come up to speed on Java applications. Concise and up-to-date coverage of the most recent platform (1.7) for Java applications in networking technology.","language":"en","currency":"USD","id":"9780080568782","title":"TCP\/IP Sockets in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lfHo7uMk7r4C&source=gbs_api","authors":["Kenneth L. Calvert","Michael J. Donahoo"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTZqecc9olUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.99,"subtitle":"Build Better Applications with Coding and Design Patterns","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","language":"en","currency":"USD","id":"9781449396947","title":"JavaScript Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTZqecc9olUC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uq9PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn how to implement design patterns in Java: each pattern in Java Design Patterns is a complete implementation and the output is generated using Eclipse, making the code accessible to all. The examples are chosen so you will be able to absorb the core concepts easily and quickly. This book presents the topic of design patterns in Java in such a way that anyone can grasp the idea. By giving easy to follow examples, you will understand the concepts with increasing depth. The examples presented are straightforward and the topic is presented in a concise manner. Key features of the book: Each of the 23 patterns is described with straightforward Java code. There is no need to know advanced concepts of Java to use this book. Each of the concepts is connected with a real world example and a computer world example. The book uses Eclipse IDE to generate the output because it is the most popular IDE in this field. This is a practitioner's book on design patterns in Java. Design patterns are a popular topic in software development. A design pattern is a common, well-described solution to a common software problem. There is a lot of written material available on design patterns, but scattered and not in one single reference source. Also, many of these examples are unnecessarily big and complex.","language":"en","currency":"USD","id":"1484218027","title":"Java Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uq9PCwAAQBAJ&source=gbs_api","authors":["Vaskaran Sarcar"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":851,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Eh5NcvegzMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":"Exam 310-065","description":"The Best Fully Integrated Study System Available--Written by the Lead Developers of Exam 310-065 With hundreds of practice questions and hands-on exercises, SCJP Sun Certified Programmer for Java 6 Study Guide covers what you need to know--and shows you how to prepare--for this challenging exam. 100% complete coverage of all official objectives for exam 310-065 Exam Objective Highlights in every chapter point out certification objectives to ensure you're focused on passing the exam Exam Watch sections in every chapter highlight key exam topics covered Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all SCJP exam topics, including: Declarations and Access Control · Object Orientation · Assignments · Operators · Flow Control, Exceptions, and Assertions · Strings, I\/O, Formatting, and Parsing · Generics and Collections · Inner Classes · Threads · Development CD-ROM includes: Complete MasterExam practice testing engine, featuring: Two full practice exams; Detailed answers with explanations; Score Report performance assessment tool Electronic book for studying on the go Bonus coverage of the SCJD exam included! Bonus downloadable MasterExam practice test with free online registration.","language":"en","currency":"USD","id":"9780071591072","title":"SCJP Sun Certified Programmer for Java 6 Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Eh5NcvegzMkC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to integrate machine learning with distributed search and analytics","description":"Leverage Elastic Stack’s machine learning features to gain valuable insight from your data Key Features Combine machine learning with the analytic capabilities of Elastic Stack Analyze large volumes of search data and gain actionable insight from them Use external analytical tools with your Elastic Stack to improve its performance Book Description Machine Learning with the Elastic Stack is a comprehensive overview of the embedded commercial features of anomaly detection and forecasting. The book starts with installing and setting up Elastic Stack. You will perform time series analysis on varied kinds of data, such as log files, network flows, application metrics, and financial data. As you progress through the chapters, you will deploy machine learning within the Elastic Stack for logging, security, and metrics. In the concluding chapters, you will see how machine learning jobs can be automatically distributed and managed across the Elasticsearch cluster and made resilient to failure. By the end of this book, you will understand the performance aspects of incorporating machine learning within the Elastic ecosystem and create anomaly detection jobs and view results from Kibana directly. What you will learn Install the Elastic Stack to use machine learning features Understand how Elastic machine learning is used to detect a variety of anomaly types Apply effective anomaly detection to IT operations and security analytics Leverage the output of Elastic machine learning in custom views, dashboards, and proactive alerting Combine your created jobs to correlate anomalies of different layers of infrastructure Learn various tips and tricks to get the most out of Elastic machine learning Who this book is for If you are a data professional eager to gain insight on Elasticsearch data without having to rely on a machine learning specialist or custom development, Machine Learning with the Elastic Stack is for you. Those looking to integrate machine learning within their search and analytics applications will also find this book very useful. Prior experience with the Elastic Stack is needed to get the most out of this book.","language":"en","currency":"USD","id":"1788471776","title":"Machine Learning with the Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyOGDwAAQBAJ&source=gbs_api","authors":["Rich Collier","Bahaaldine Azarmi"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uCR8AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Java EE 7 Tutorial: Volume 1, Fifth Edition, is a task-oriented, example-driven guide to developing enterprise applications for the Java Platform, Enterprise Edition 7 (Java EE 7). Written by members of the Java EE documentation team at Oracle, this book provides new and intermediate Java programmers with a deep understanding of the platform. This guide includes descriptions of platform features and provides instructions for using the latest versions of NetBeans IDE and GlassFish Server Open Source Edition. The book introduces platform basics, including resource creation, resource injection, and packaging. It covers JavaServer Faces, Java Servlets, the Java API for WebSocket, the Java API for JSON Processing (JSON-P), internationalization and localization, Bean Validation, Contexts and Dependency Injection for Java EE (CDI), and web services (JAX-WS and JAX-RS).","language":"en","currency":"USD","id":"0133901580","title":"The Java EE 7 Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uCR8AwAAQBAJ&source=gbs_api","authors":["Eric Jendrock","Ricardo Cervera-Navarro","Ian Evans","Kim Haase","William Markito"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qsa-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":"Leverage Clojure's polymorphic tools to develop your applications","description":"Learn when and how to use Clojure's polymorphic features to develop efficient multithreaded applications Key Features Get to grips with the different polymorphic tools that Clojure offers Develop a taste for good Clojure designs through various engaging examples Study various design principles and learn ways to use them in your applications Book Description Clojure is a modern, dynamic language that you can use to develop robust, multithreaded programs. Clojure Polymorphism is a comprehensive guide that shows you how to use Clojure's features to your advantage. The book begins by describing examples that show how to define and implement abstractions with plain functions and multimethods. Then you'll analyze these examples and separate the good and bad aspects of their design principles. You'll also learn how to perform data transformation abstraction with a plain function and discover how to write new cross-platform predicates while keeping the core of your abstraction free from reader conditionals. The later chapters explain the considerations to keep in mind when implementing Clojure protocols on the Java Virtual Machine (JVM). By the end of this book, you'll know how to use the various polymorphic tools of Clojure to your advantage while designing your applications. What you will learn Explore how polymorphism is implemented in Clojure Discover what design principles to use when creating and implementing abstractions Explore different ways to implement protocols in Clojure Implement various design principles while working with the JVM Write and compare plain functions and multimethods for transforming data Analyze functions and abstractions for their performance and flexibility Learn about common “gotchas” to avoid errors when writing code Who this book is for Clojure Polymorphism is useful for all programmers who want to leverage Clojure's polymorphic tools to build efficient applications. To get the most out of this book, you must be a moderately proficient Clojure programmer.","language":"en","currency":"USD","id":"1838988378","title":"Clojure Polymorphism","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qsa-DwAAQBAJ&source=gbs_api","authors":["Paul Stadig"]},{"pageCount":381,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0D-qCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Definition, Verification, Validation","description":"The origin of this book goes back to the Dagstuhl seminar on Logic for System Engineering, organized during the first week of March 1997 by S. Jiihnichen, J. Loeckx, and M. Wirsing. During that seminar, after Egon Borger's talk on How to Use Abstract State Machines in Software Engineering, Wolfram Schulte, at the time a research assistant at the University of Ulm, Germany, questioned whether ASMs provide anything special as a scientifically well founded and rigorous yet simple and industrially viable framework for high level design and analysis of complex systems, and for natural refinements of models to executable code. Wolfram Schulte argued, referring to his work with K. Achatz on A Formal Object-Oriented Method Inspired by Fusion and Object-Z [1], that with current techniques of functional programming and of axiomatic specification, one can achieve the same result. An intensive and long debate arose from this discussion. At the end of the week, it led Egon Borger to propose a collaboration on a real-life specification project of Wolfram Schulte's choice, as a comparative field test of purely functional declarative methods and of their enhancement within an integrated abstract state-based operational (ASM) approach. After some hesitation, in May 1997 Wolfram Schulte accepted the offer and chose as the theme a high-level specification of Java and of the Java Virtual Machine.","language":"en","currency":"USD","id":"3642594956","title":"Java and the Java Virtual Machine","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0D-qCAAAQBAJ&source=gbs_api","authors":["Robert F. Stärk","Joachim Schmid","Egon Börger"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I_3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Automating the Container Orchestration Platform","description":"Operators are a way of packaging, deploying, and managing Kubernetes applications. A Kubernetes application doesn’t just run on Kubernetes; it’s composed and managed in Kubernetes terms. Operators add application-specific operational knowledge to a Kubernetes cluster, making it easier to automate complex, stateful applications and to augment the platform. Operators can coordinate application upgrades seamlessly, react to failures automatically, and streamline repetitive maintenance like backups. Think of Operators as site reliability engineers in software. They work by extending the Kubernetes control plane and API, helping systems integrators, cluster administrators, and application developers reliably deploy and manage key services and components. Using real-world examples, authors Jason Dobies and Joshua Wood demonstrate how to use Operators today and how to create Operators for your applications with the Operator Framework and SDK. Learn how to establish a Kubernetes cluster and deploy an Operator Examine a range of Operators from usage to implementation Explore the three pillars of the Operator Framework: the Operator SDK, the Operator Lifecycle Manager, and Operator Metering Build Operators from the ground up using the Operator SDK Build, package, and run an Operator in development, testing, and production phases Learn how to distribute your Operator for installation on Kubernetes clusters","language":"en","currency":"USD","id":"1492047996","title":"Kubernetes Operators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I_3RDwAAQBAJ&source=gbs_api","authors":["Jason Dobies","Joshua Wood"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YTCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build complete data analysis flows, from data collection to visualization","description":"A practical guide to getting the most out of Excel, using it for data preparation, applying machine learning models (including cloud services) and understanding the outcome of the data analysis. Key Features Use Microsoft's product Excel to build advanced forecasting models using varied examples Cover range of machine learning tasks such as data mining, data analytics, smart visualization, and more Derive data-driven techniques using Excel plugins and APIs without much code required Book Description We have made huge progress in teaching computers to perform difficult tasks, especially those that are repetitive and time-consuming for humans. Excel users, of all levels, can feel left behind by this innovation wave. The truth is that a large amount of the work needed to develop and use a machine learning model can be done in Excel. The book starts by giving a general introduction to machine learning, making every concept clear and understandable. Then, it shows every step of a machine learning project, from data collection, reading from different data sources, developing models, and visualizing the results using Excel features and offerings. In every chapter, there are several examples and hands-on exercises that will show the reader how to combine Excel functions, add-ins, and connections to databases and to cloud services to reach the desired goal: building a full data analysis flow. Different machine learning models are shown, tailored to the type of data to be analyzed. At the end of the book, the reader is presented with some advanced use cases using Automated Machine Learning, and artificial neural network, which simplifies the analysis task and represents the future of machine learning. What you will learn Use Excel to preview and cleanse datasets Understand correlations between variables and optimize the input to machine learning models Use and evaluate different machine learning models from Excel Understand the use of different visualizations Learn the basic concepts and calculations to understand how artificial neural networks work Learn how to connect Excel to the Microsoft Azure cloud Get beyond proof of concepts and build fully functional data analysis flows Who this book is for This book is for data analysis, machine learning enthusiasts, project managers, and someone who doesn't want to code much for performing core tasks of machine learning. Each example will help you perform end-to-end smart analytics. Working knowledge of Excel is required.","language":"en","currency":"USD","id":"178934512X","title":"Hands-On Machine Learning with Microsoft Excel 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YTCWDwAAQBAJ&source=gbs_api","authors":["Julio Cesar Rodriguez Martino"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SE2iRgeYYwcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Social network analysis applications have experienced tremendous advances within the last few years due in part to increasing trends towards users interacting with each other on the internet. Social networks are organized as graphs, and the data on social networks takes on the form of massive streams, which are mined for a variety of purposes. Social Network Data Analytics covers an important niche in the social network analytics field. This edited volume, contributed by prominent researchers in this field, presents a wide selection of topics on social network data mining such as Structural Properties of Social Networks, Algorithms for Structural Discovery of Social Networks and Content Analysis in Social Networks. This book is also unique in focussing on the data analytical aspects of social networks in the internet scenario, rather than the traditional sociology-driven emphasis prevalent in the existing books, which do not focus on the unique data-intensive characteristics of online social networks. Emphasis is placed on simplifying the content so that students and practitioners benefit from this book. This book targets advanced level students and researchers concentrating on computer science as a secondary text or reference book. Data mining, database, information security, electronic commerce and machine learning professionals will find this book a valuable asset, as well as primary associations such as ACM, IEEE and Management Science.","language":"en","currency":"USD","id":"1441984623","title":"Social Network Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SE2iRgeYYwcC&source=gbs_api","authors":["Charu C. Aggarwal"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pTYkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Enterprise and the Cloud","description":"The Complete Guide to Optimizing Systems Performance Written by the winner of the 2013 LISA Award for Outstanding Achievement in System Administration Large-scale enterprise, cloud, and virtualized computing systems have introduced serious performance challenges. Now, internationally renowned performance expert Brendan Gregg has brought together proven methodologies, tools, and metrics for analyzing and tuning even the most complex environments. Systems Performance: Enterprise and the Cloud focuses on Linux® and Unix® performance, while illuminating performance issues that are relevant to all operating systems. You’ll gain deep insight into how systems work and perform, and learn methodologies for analyzing and improving system and application performance. Gregg presents examples from bare-metal systems and virtualized cloud tenants running Linux-based Ubuntu®, Fedora®, CentOS, and the illumos-based Joyent® SmartOS™ and OmniTI OmniOS®. He systematically covers modern systems performance, including the “traditional” analysis of CPUs, memory, disks, and networks, and new areas including cloud computing and dynamic tracing. This book also helps you identify and fix the “unknown unknowns” of complex performance: bottlenecks that emerge from elements and interactions you were not aware of. The text concludes with a detailed case study, showing how a real cloud customer issue was analyzed from start to finish. Coverage includes • Modern performance analysis and tuning: terminology, concepts, models, methods, and techniques • Dynamic tracing techniques and tools, including examples of DTrace, SystemTap, and perf • Kernel internals: uncovering what the OS is doing • Using system observability tools, interfaces, and frameworks • Understanding and monitoring application performance • Optimizing CPUs: processors, cores, hardware threads, caches, interconnects, and kernel scheduling • Memory optimization: virtual memory, paging, swapping, memory architectures, busses, address spaces, and allocators • File system I\/O, including caching • Storage devices\/controllers, disk I\/O workloads, RAID, and kernel I\/O • Network-related performance issues: protocols, sockets, interfaces, and physical connections • Performance implications of OS and hardware-based virtualization, and new issues encountered with cloud computing • Benchmarking: getting accurate results and avoiding common mistakes This guide is indispensable for anyone who operates enterprise or cloud environments: system, network, database, and web admins; developers; and other professionals. For students and others new to optimization, it also provides exercises reflecting Gregg’s extensive instructional experience.","language":"en","currency":"USD","id":"0133390101","title":"Systems Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pTYkAQAAQBAJ&source=gbs_api","authors":["Brendan Gregg"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Solutions for Modular, Functional, Reactive, and Multithreaded programming","description":"A definitive guide to learning the key concepts of modern application development in Java About This Book Learn the latest features of Java 9 Extend your Java knowledge and take your application to new levels by making it fast, secure, and scalable Delve into the intricacies of Modular programming in Java 9 Who This Book Is For The book is for intermediate to advanced Java programmers who want to make their applications fast, secure, and scalable. What You Will Learn Set up JDK and know the differences in the JDK 9 installation Implement OO designs using classes and interfaces Manage operating system processes Understand the new modular JDK and modular programming Create a modular application with clear dependencies Build graphical user interfaces using JavaFX Use the new HTTP Client API Learn about the new diagnostic features in Java 9 See how to use the new jShell REPL tool Execute ES6-compliant JavaScript code from your Java applications In Detail Java is an object-oriented programming language. It is one of the most widely accepted languages because of its design and programming features, particularly in its promise that you can write a program once and run it anywhere. This cookbook offers a range of software development examples in simple and straightforward Java 9 code, providing step-by-step resources and time-saving methods to help you solve data problems efficiently. Starting with the installation of Java, each recipe addresses a specific problem, with a discussion that explains the solution and offers insight into how it works. We cover major concepts such as Project Jigsaw and various tools that will enable you to modularize your applications. You will learn new features in the form of recipes that will make your applications modular, secure, and fast. Style and approach Each recipe in this book contains a series of complete instructions to perform a core task, plus an explanation of the purpose behind it. Similar methods or further refinements are included with each recipe to provide comprehensive guidance.","language":"en","currency":"USD","id":"1786464985","title":"Java 9 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OpZGDwAAQBAJ&source=gbs_api","authors":["Mohamed Sanaulla","Nick Samoylov"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build strong foundation for entering the world of Machine Learning and data science with the help of this comprehensive guide About This Book Get started in the field of Machine Learning with the help of this solid, concept-rich, yet highly practical guide. Your one-stop solution for everything that matters in mastering the whats and whys of Machine Learning algorithms and their implementation. Get a solid foundation for your entry into Machine Learning by strengthening your roots (algorithms) with this comprehensive guide. Who This Book Is For This book is for IT professionals who want to enter the field of data science and are very new to Machine Learning. Familiarity with languages such as R and Python will be invaluable here. What You Will Learn Acquaint yourself with important elements of Machine Learning Understand the feature selection and feature engineering process Assess performance and error trade-offs for Linear Regression Build a data model and understand how it works by using different types of algorithm Learn to tune the parameters of Support Vector machines Implement clusters to a dataset Explore the concept of Natural Processing Language and Recommendation Systems Create a ML architecture from scratch. In Detail As the amount of data continues to grow at an almost incomprehensible rate, being able to understand and process data is becoming a key differentiator for competitive organizations. Machine learning applications are everywhere, from self-driving cars, spam detection, document search, and trading strategies, to speech recognition. This makes machine learning well-suited to the present-day era of Big Data and Data Science. The main challenge is how to transform data into actionable knowledge. In this book you will learn all the important Machine Learning algorithms that are commonly used in the field of data science. These algorithms can be used for supervised as well as unsupervised learning, reinforcement learning, and semi-supervised learning. A few famous algorithms that are covered in this book are Linear regression, Logistic Regression, SVM, Naive Bayes, K-Means, Random Forest, TensorFlow, and Feature engineering. In this book you will also learn how these algorithms work and their practical implementation to resolve your problems. This book will also introduce you to the Natural Processing Language and Recommendation systems, which help you run multiple algorithms simultaneously. On completion of the book you will have mastered selecting Machine Learning algorithms for clustering, classification, or regression based on for your problem. Style and approach An easy-to-follow, step-by-step guide that will help you get to grips with real -world applications of Algorithms for Machine Learning.","language":"en","currency":"USD","id":"1785884514","title":"Machine Learning Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-ZDDwAAQBAJ&source=gbs_api","authors":["Giuseppe Bonaccorso"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jz7EDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In order to remain competitive in today's world, companies need to be able to integrate internally and externally by connecting sensors, customers and partners with the information in their systems of record. In short, they need to integrate with everything. This IBM® Redbooks® publication describes how IBM Application Integration Suite and IBM Messaging portfolio can be used to satisfy the needs of core hybrid integration use cases, accelerating companies in their digital transformation journey. All concepts are explained within the context of these use cases: Joining the API economy Improving productivity Refactoring for innovation The target audience for this book is cloud and integration architects and specialists who are implementing hybrid integration solutions.","language":"en","currency":"USD","id":"0738442267","title":"An Architectural and Practical Guide to IBM Hybrid Integration Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jz7EDQAAQBAJ&source=gbs_api","authors":["Carsten Börnert","Kim Clark","Shahir Daya","Matthieu Debeaux","Gerd Diederichs","Vasfi Gucer","Shamim Hossain","Gary Kean","Carlo Marcoli","Shohei Matsumoto","Amar Shah","Johan Thole","IBM Redbooks"]},{"pageCount":888,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I8RD-eBVQtgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"A complete update to the definitive, bestselling guide to the #1 certification for Java programmers Written and revised by the co-developers of the original SCJP exam and now published in the Oracle Press brand Includes two complete practice exams—250+ practice exam questions in book and via electronic content Replaces SCJP Sun Certified Programmer for Java Study Guide—150,000 copies sold","language":"en","currency":"USD","id":"0071771999","title":"OCA\/OCP Java SE 7 Programmer I & II Study Guide (Exams 1Z0-803 & 1Z0-804)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I8RD-eBVQtgC&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":524,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X8IYQKjMN9cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Your Ultimate \"How-To\" Guide to Java Programming! Legendary programming author Herb Schildt shares some of his favorite programming techniques in this high-powered Java \"cookbook.\" Organized for quick reference, each recipe shows how to accomplish a practical programming task. A recipe begins with a list of key ingredients (the classes, methods, and interfaces) followed by step-by-step instructions that show how to assemble them into a complete solution. Detailed discussions explain the how and why behind each step, and a full code example puts the recipe into action. Each recipe ends with a list of options and alternatives that suggest ways to adapt the technique to fit a variety of situations. Whether you're a beginner or an experienced pro, you'll find recipes that are sure to satisfy your Java programming appetite! Topics include: String Handling Regular Expressions File Handling Applets Servlets Swing The Collections Framework Multithreading Formatting Data Learn how to: Find substrings that match a regular expression Use regular expressions to tokenize a string Compress and decompress data files Create a ZIP file Format time and date Use printf( ) to display formatted data Reverse, rotate, and shuffle a list Use a Comparator with a collection Create a simple Swing application Create a Swing-based applet Create a simple servlet Use a cookie with a servlet Synchronize threads Monitor a thread's state Set and obtain a thread's priority Use JScrollPane to automate scrolling Access a resource using HttpURLConnection Schedule a task for future execution Use reflection to dynamically create an object and call methods Much, much more","language":"en","currency":"USD","id":"0071596445","title":"Herb Schildt's Java Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X8IYQKjMN9cC&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kX7SDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. The professional programmer’s Deitel® guide to C# 6 and object-oriented development for Windows® Written for programmers with a background in high-level language programming, C# 6 for Programmers applies the Deitel signature live-code approach to teaching programming and explores Microsoft’s C# 6 and .NET in depth. Concepts are presented in the context of 170+ fully coded and tested apps, complete with syntax shading, code highlighting, code walkthroughs, program outputs and hundreds of savvy software-development tips. Start with an introduction to C# using an early classes and objects approach, then rapidly move on to more advanced topics, including LINQ, asynchronous programming with async and await and more. You’ll enjoy the treatment of object-oriented programming and an object-oriented design\/UML® ATM case study, including a complete C# implementation. When you’ve mastered the book, you’ll be ready to start building industrial-strength, object-oriented C# apps. Paul Deitel and Harvey Deitel are the founders of Deitel & Associates, Inc., the internationally recognized programming languages authoring and corporate training organization. Millions of people worldwide have used Deitel textbooks, professional books, LiveLessons™ video products, e-books, resource centers and REVEL™ interactive multimedia courses with integrated labs and assessment to master major programming languages and platforms, including C#, C++, C, Java™, Android™ app development, iOS app development, Swift™, Visual Basic®, Python™ and Internet and web programming. Features: •Use with Windows® 7, 8 or 10. •Integrated coverage of new C# 6 functionality: string interpolation, expression-bodied methods and properties, auto-implemented property initializers, getter-only properties, nameof, null-conditional operator, exception filters and more. •Entertaining and challenging code examples. •Deep treatment of classes, objects, inheritance, polymorphism and interfaces. •Generics, LINQ and generic collections; PLINQ (Parallel LINQ) for multicore performance. •Asynchronous programming with async and await; functional programming with lambdas, delegates and immutability. •Files; relational database with LINQ to Entities. •Object-oriented design ATM case study with full code implementation. •Emphasis on performance and software engineering principles","language":"en","currency":"USD","id":"0134596366","title":"C# 6 for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kX7SDAAAQBAJ&source=gbs_api","authors":["Paul Deitel","Harvey Deitel"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5FVOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In this exclusive eBook, preview excerpts from brand-new and forthcoming Oracle Press Java JDK 8 books. Written by leading Java experts, Oracle Press books offer the most definitive, complete, and up-to-date coverage of the latest Java release. Featuring an introduction by bestselling programming author Herb Schildt, this eBook includes chapters from the following Oracle Press books: Java: The Complete Reference, Ninth Edition by Herb Schildt Java: A Beginner’s Guide, Sixth Edition by Herb Schildt Mastering Lambdas: Java Programming in a Multicore World by Maurice Naftalin Quick Start Guide to JavaFX by J.F. DiMarzio Mastering JavaFX 8 Controls: Create Custom JavaFX 8 Controls for Cross-Platform Applications by Hendrik Ebbers","language":"en","currency":"USD","id":"0071836500","title":"Java 8 Preview Sampler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5FVOAwAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Maurice Naftalin","Hendrik Ebbers","J. F. DiMarzio"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ETGMKA6tfoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Complete coverage of the newest exam release from the Linux Professional Institute, and the first step toward LPIC-1 and CompTIA Linux+ Linux Essentials All-in-One Exam Guide covers this \"first-of-its-kind\" program intended for the academic sector, aspiring IT professionals, and anyone new to the world of Linux and open source technology. This comprehensive, classroom-based reference offers 100% coverage of all exam objectives for the Linux Essentials exam. The book includes expert discussion sidebars to convey in-depth information. Tip, Caution, and Note icons highlight key topics; end-of-chapter quizzes test retention and exam readiness; and Exam Tips guide you through tough technical topics that may be tricky come exam day. The All-in-One also includes hands-on examples and exercises that reinforce practical learning for real-world applicability. Electronic content includes a practice exam (Windows based).","language":"en","currency":"USD","id":"0071811001","title":"LPI Linux Essentials Certification All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ETGMKA6tfoC&source=gbs_api","authors":["Robb Tracy"]}]