[{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J0C7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn object-oriented programming and kickstart your career in software development","description":"This Java book will guide you through Java development and help you build the knowledge and confidence to progress from the basics to become a skilled Java developer. All the key tools that you'll need to solve real-world problems are clearly explained and demonstrated with engaging, practical examples.","language":"en","currency":"USD","id":"1839218118","title":"The The Java Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J0C7DwAAQBAJ&source=gbs_api","authors":["David Cuartielles","Andreas Göransson","Eric Foster-Johnson"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ka2VUBqHiWkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day. This highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing. Each chapter in the book consists of several “items” presented in the form of a short, standalone essay that provides specific advice, insight into Java platform subtleties, and outstanding code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why. Highlights include: New coverage of generics, enums, annotations, autoboxing, the for-each loop, varargs, concurrency utilities, and much more Updated techniques and best practices on classic topics, including objects, classes, libraries, methods, and serialization How to avoid the traps and pitfalls of commonly misunderstood subtleties of the language Focus on the language and its most fundamental libraries: java.lang, java.util, and, to a lesser extent, java.util.concurrent and java.io Simply put, Effective Java™, Second Edition, presents the most practical, authoritative guidelines available for writing efficient, well-designed programs.","language":"en","currency":"USD","id":"9780132778046","title":"Effective Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ka2VUBqHiWkC&source=gbs_api","authors":["Joshua Bloch"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EK43StEVfJIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.1,"subtitle":null,"description":"Threads are a fundamental part of the Java platform. As multicore processors become the norm, using concurrency effectively becomes essential for building high-performance applications. Java SE 5 and 6 are a huge step forward for the development of concurrent applications, with improvements to the Java Virtual Machine to support high-performance, highly scalable concurrent classes and a rich set of new concurrency building blocks. In Java Concurrency in Practice , the creators of these new facilities explain not only how they work and how to use them, but also the motivation and design patterns behind them. However, developing, testing, and debugging multithreaded programs can still be very difficult; it is all too easy to create concurrent programs that appear to work, but fail when it matters most: in production, under heavy load. Java Concurrency in Practice arms readers with both the theoretical underpinnings and concrete techniques for building reliable, scalable, maintainable concurrent applications. Rather than simply offering an inventory of concurrency APIs and mechanisms, it provides design rules, patterns, and mental models that make it easier to build concurrent programs that are both correct and performant. This book covers: Basic concepts of concurrency and thread safety Techniques for building and composing thread-safe classes Using the concurrency building blocks in java.util.concurrent Performance optimization dos and don'ts Testing concurrent programs Advanced topics such as atomic variables, nonblocking algorithms, and the Java Memory Model","language":"en","currency":"USD","id":"9780132702256","title":"Java Concurrency in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EK43StEVfJIC&source=gbs_api","authors":["Tim Peierls","Brian Goetz","Joshua Bloch","Joseph Bowbeer","Doug Lea","David Holmes"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ka2VUBqHiWkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day. This highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing. Each chapter in the book consists of several “items” presented in the form of a short, standalone essay that provides specific advice, insight into Java platform subtleties, and outstanding code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why. Highlights include: New coverage of generics, enums, annotations, autoboxing, the for-each loop, varargs, concurrency utilities, and much more Updated techniques and best practices on classic topics, including objects, classes, libraries, methods, and serialization How to avoid the traps and pitfalls of commonly misunderstood subtleties of the language Focus on the language and its most fundamental libraries: java.lang, java.util, and, to a lesser extent, java.util.concurrent and java.io Simply put, Effective Java™, Second Edition, presents the most practical, authoritative guidelines available for writing efficient, well-designed programs.","language":"en","currency":"USD","id":"9780132778046","title":"Effective Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ka2VUBqHiWkC&source=gbs_api","authors":["Joshua Bloch"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=r10U16kgmkwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":null,"description":"Covering the latest in Java technologies, Object-Oriented Programming and Java teaches the subject in a systematic, fundamentals-first approach. It begins with the description of real-world object interaction scenarios and explains how they can be translated, represented and executed using object-oriented programming paradigm. By establishing a solid foundation in the understanding of object-oriented programming concepts and their applications, this book provides readers with the pre-requisites for writing proper object-oriented programs using Java.","language":"en","currency":"USD","id":"1846289637","title":"Object-Oriented Programming and Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=r10U16kgmkwC&source=gbs_api","authors":["Danny Poo","Derek Kiong","Swarnalatha Ashok"]},{"pageCount":462,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zoAoubEN2PMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Software Development in Java is a comprehensive introduction to all aspects of software development. The authors discuss software engineering processes such as problem specification, modularization, aesthetic programming, stepwise re-finement, testing, verification, and documentation. Besides these topics, software developers also need to understand performance analysis and measurement methods and make choices between data structures and algorithms. Software De-velopment in Java also covers these topics. The authors use Java to teach soft-ware development and for the many examples. Software Development in Java is appropriate for use as a textbook for courses on good software development, introduction to computer science, and advanced programming. It is also a valuable reference book for the experienced program-mer. Software Development in Java is a must for software developers.","language":"en","currency":"USD","id":"9780929306261","title":"Software Development in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zoAoubEN2PMC&source=gbs_api","authors":["Sartaj Sahni","Raj Kumar"]},{"pageCount":728,"thumbnail":"http:\/\/books.google.com\/books\/content?id=42etT_9-_9MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"Tips and Techniques for Putting I\/O to Work","description":"All of Java's Input\/Output (I\/O) facilities are based on streams, which provide simple ways to read and write data of different types. Java provides many different kinds of streams, each with its own application. The universe of streams is divided into four largecategories: input streams and output streams, for reading and writing binary data; and readers and writers, for reading and writing textual (character) data. You're almost certainly familiar with the basic kinds of streams--but did you know that there's a CipherInputStream for reading encrypted data? And a ZipOutputStream for automaticallycompressing data? Do you know how to use buffered streams effectively to make your I\/O operations more efficient? Java I\/O, 2nd Edition has been updated for Java 5.0 APIs and tells you all you ever need to know about streams--and probably more. A discussion of I\/O wouldn't be complete without treatment of character sets and formatting. Java supports the Unicode standard, which provides definitions for the character sets of most written languages. Consequently, Java is the first programming language that lets you do I\/O in virtually any language. Java also provides a sophisticated model for formatting textual and numeric data. Java I\/O, 2nd Edition shows you how to control number formatting, use characters aside from the standard (but outdated) ASCII character set, and get a head start on writing truly multilingual software. Java I\/O, 2nd Edition includes: Coverage of all I\/O classes and related classes In-depth coverage of Java's number formatting facilities and its support for international character sets","language":"en","currency":"USD","id":"9781449390884","title":"Java I\/O","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=42etT_9-_9MC&source=gbs_api","authors":["Elliotte Rusty Harold"]},{"pageCount":722,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G_hGOkywlhEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Tutorial Companion to Java in a Nutshell","description":"The author of the best-selling Java in a Nutshell has created an entire book of real-world Java programming examples that you can learn from. If you learn best \"by example,\" this is the book for you.This third edition covers Java 1.4 and contains 193 complete, practical examples: over 21,900 lines of densely commented, professionally written Java code, covering 20 distinct client-side and server-side APIs. It includes new chapters on the Java Sound API and the New I\/O API. The chapters on XML and servlets have been rewritten to cover the latest versions of the specifications and to demonstrate best practices for Java 1.4. New and updated examples throughout the book demonstrate many other new Java features and APIs.Java Examples in a Nutshell is a companion volume to Java in a Nutshell, Java Foundation Classes in a Nutshell, and Java Enterprise in a Nutshell. It picks up where those quick references leave off, providing a wealth of examples for both novices and experts. This book doesn't hold your hand; it simply delivers well-commented working examples with succinct explanations to help you learn and explore Java and its APIs.Java Examples in a Nutshell contains examples that demonstrate: Core APIs, including I\/O, New I\/O, threads, networking, security, serialization, and reflection Desktop APIs, highlighting Swing GUIs, Java 2D graphics, preferences, printing, drag-and-drop, JavaBeans, applets, and sound Enterprise APIs, including JDBC (database access), JAXP (XML parsing and transformation), Servlets 2.4, JSP 2.0 (JavaServer Pages), and RMI The book begins with introductory examples demonstrating structured and object-oriented programming techniques for new Java programmers. A special index at the end of the book makes it easy to look up examples that use a particular Java class or accomplish a desired task. In between, each chapter includes exercises that challenge readers and suggest further avenues for exploration.","language":"en","currency":"USD","id":"9780596552329","title":"Java Examples in a Nutshell","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G_hGOkywlhEC&source=gbs_api","authors":["David Flanagan"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S5ebGvuLJqQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":null,"description":"Design Patterns in Java™ gives you the hands-on practice and deep insight you need to fully leverage the significant power of design patterns in any Java software project. The perfect complement to the classic Design Patterns, this learn-by-doing workbook applies the latest Java features and best practices to all of the original 23 patterns identified in that groundbreaking text. Drawing on their extensive experience as Java instructors and programmers, Steve Metsker and Bill Wake illuminate each pattern with real Java programs, clear UML diagrams, and compelling exercises. You'll move quickly from theory to application–learning how to improve new code and refactor existing code for simplicity, manageability, and performance. Coverage includes Using Adapter to provide consistent interfaces to clients Using Facade to simplify the use of reusable toolkits Understanding the role of Bridge in Java database connectivity The Observer pattern, Model-View-Controller, and GUI behavior Java Remote Method Invocation (RMI) and the Proxy pattern Streamlining designs using the Chain of Responsibility pattern Using patterns to go beyond Java's built-in constructor features Implementing Undo capabilities with Memento Using the State pattern to manage state more cleanly and simply Optimizing existing codebases with extension patterns Providing thread-safe iteration with the Iterator pattern Using Visitor to define new operations without changing hierarchy classes If you're a Java programmer wanting to save time while writing better code, this book's techniques, tips, and clear explanations and examples will help you harness the power of patterns to improve every program you write, design, or maintain. All source code is available for download at http:\/\/www.oozinoz.com.","language":"en","currency":"USD","id":"9780321629944","title":"Design Patterns in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S5ebGvuLJqQC&source=gbs_api","authors":["Steven John Metsker","William C. Wake"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0dsIPdbr4o8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.64,"subtitle":null,"description":"Adoption of Bluetooth wireless technology has become ubiquitous in the last few years. One of the biggest steps forward is the standardization of Java APIs for Bluetooth wireless technology (JABWT). The latest updates to this standard is explained in detail in this book. The JABWT standard, defined by the JSR-82 Java Specification Request, supports rapid development of Bluetooth applications that are portable, secure, and highly-usable. Wireless device manufacturers have responded overwhelmingly to the JABWT specification by implementing JABWT applications in mobile phones and other personal wireless communications products. Bluetooth Application Programming Essentials: Programming with the Java APIs explains in detail how to write Bluetooth applications using the Java APIs to exploit the power of both technologies. Written by the specification lead for JSR-82 and two other key participants in developing the standards of JABWT, this book provides the authoritative explanations and concrete examples needed to get started right away. This book provides embedded Java developers with to-the-point information on the APIs in the specification with detailed programmatic examples of the APIs in use. A NEW chapter on the Push Registry definition (a new feature in the 1.1 version of JSR-82) has been added. Finally, the new Essentials version of the book will update the remaining chapters to reflect changes in the latest Bluetooth spec (2.1) and the industry as a whole. By focusing only on the essentials, this concise resource enables software and hardware vendors to quickly develop Bluetooth applications for mobile devices in an increasingly competitive market. The updated material examines crucial programming areas (including RFCOMM, OBEX, device discovery, service discovery, and L2CAP), which allows developers to not only successfully design, but master and build Java APIs for Bluetooth Wireless Technology. Includes a new and valuable chapter that delineates the pivotal Push Registry feature - a recent development that will help programmers avoid the common problem of connection collision. By providing real-world issues and problems involved in implementing the Java APIs specification, the book allows developers to identify with the text and encourages repeated reference.","language":"en","currency":"USD","id":"0080561004","title":"Bluetooth Application Programming with the Java APIs Essentials Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0dsIPdbr4o8C&source=gbs_api","authors":["Timothy J. Thompson","C Bala Kumar","Paul J. Kline"]},{"pageCount":648,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CXnCJhrB3g4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Integration Strategies, Patterns, and Best Practices","description":"Java EE and .NET Interoperability addresses issues encountered during the integration process, such as a diverse technology set, incompatible APIs, and disparate environment maintenance. The experienced authors outline strategies, approaches, and best practices, including messaging, Web services, and integration-related frameworks and patterns. The book also introduces readers to Service Oriented Architecture (SOA), the building block for scalable and reliable enterprise integration solutions. This indispensable book provides the Java EE and .NET developer community with multiple strategies to integrate between Java EE and .NET platforms that save developers time and effort. Applying proven interoperability solutions significantly reduces the application development cycle. Coverage includes · Effective Java EE—.NET integration strategies and best practices · Detailed enterprise coverage, as well as standalone Java EE component integration with .NET · SOA as a building block for Java EE—.NET interoperability · Interoperability security issues and risk mitigation · Managing reliability, availability, and scalability for Web services built on Java EE and .NET · The latest interoperability standards and specifications, including Web SSO MEX and WS-Management · Current interoperability technologies, such as Windows Communication Foundation, WSE 3.0, JAX-WS, and Enterprise Service Bus","language":"en","currency":"USD","id":"9780132715706","title":"Java EE and .NET Interoperability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CXnCJhrB3g4C&source=gbs_api","authors":["Marina Fisher","Sonu Sharma","Ray Lai","Laurence Moroney"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=emcgAeq_oXgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"From Novice to Professional","description":"Beginning Java SE 6 by Sing Li et al should be the first beginning level tutorial on the new Java SE 6, and is ideal for learning the new core Java Standard Edition (SE) 6 platform. Each chapter in the book introduces a particular API area, discusses the APIs, and provides a hands-on example showing its use. Each chapter is independent of the other, and sharply focuses on one API area. It is a fun, highly visual book with many chapters on GUI, graphics, and gaming.","language":"en","currency":"USD","id":"9781430202462","title":"Beginning Java SE 6 Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=emcgAeq_oXgC&source=gbs_api","authors":["Jeff Friesen"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qRQ-ZWYY5ygC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Agile Java™ Development With Spring, Hibernate and Eclipse is a book about robust technologies and effective methods which help bring simplicity back into the world of enterprise Java development. The three key technologies covered in this book, the Spring Framework, Hibernate and Eclipse, help reduce the complexity of enterprise Java development significantly. Furthermore, these technologies enable plain old Java objects (POJOs) to be deployed in light-weight containers versus heavy-handed remote objects that require heavy EJB containers. This book also extensively covers technologies such as Ant, JUnit, JSP tag libraries and touches upon other areas such as such logging, GUI based debugging, monitoring using JMX, job scheduling, emailing, and more. Also, Extreme Programming (XP), Agile Model Driven Development (AMDD) and refactoring are methods that can expedite the software development projects by reducing the amount of up front requirements and design; hence these methods are embedded throughout the book but with just enough details and examples to not sidetrack the focus of this book. In addition, this book contains well separated, subjective material (opinion sidebars), comic illustrations, tips and tricks, all of which provide real-world and practical perspectives on relevant topics. Last but not least, this book demonstrates the complete lifecycle by building and following a sample application, chapter-by-chapter, starting from conceptualization to production using the technology and processes covered in this book. In summary, by using the technologies and methods covered in this book, the reader will be able to effectively develop enterprise-class Java applications, in an agile manner!","language":"en","currency":"USD","id":"9780132714907","title":"Agile Java Development with Spring, Hibernate and Eclipse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qRQ-ZWYY5ygC&source=gbs_api","authors":["Anil Hemrajani"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AcI6_aBD17sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":5,"subtitle":"The Art, Philosophy, and Science of Object-oriented Programming","description":"Java For Artists: The Art, Philosophy, and Science of Object-Oriented Programming is a Java programming language text\/tradebook that targets beginner and intermediate Java programmers.","language":"en","currency":"USD","id":"1932504052","title":"Java for Artists","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AcI6_aBD17sC&source=gbs_api","authors":["Rick Miller","Raffi Kasparian"]},{"pageCount":928,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YPjZNlEgAMcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Fully updated for the Java 2 Platform, Standard Edition version 5.0, the third edition of this praised book is a one-stop resource for serious Java developers. This book shows you the parts of Java Swing API that you will use daily to create graphical user interfaces (GUI). You will also learn about the Model-View-Controller architecture that lies behind all Swing components, and about customizing components for specific environments. Author John Zukowski also provides custom editors and renderers for use with tables, trees, and list components. You'll encounter an overview of Swing architecture, and learn about core Swing components, toggelable components, event handling with the Swing Component Set, Swing menus and toolbars, borders, pop-ups, choosers, and more.","language":"en","currency":"USD","id":"9781430200338","title":"The Definitive Guide to Java Swing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YPjZNlEgAMcC&source=gbs_api","authors":["John Zukowski"]},{"pageCount":228,"thumbnail":"http:\/\/books.google.com\/books\/content?id=scYxbeL-ofQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.39,"subtitle":"The Essentials of XMLHttpRequest and XML Programming with Java","description":"This practical guide shows you how to make your Java web applications more responsive and dynamic by incorporating new Ajaxian features, including suggestion lists, drag-and-drop, and more. Java developers can choose between many different ways of incorporating Ajax, from building JavaScript into your applications \"by hand\" to using the new Google Web Toolkit (GWT). Ajax on Java starts with an introduction to Ajax, showing you how to write some basic applications that use client-side JavaScript to request information from a Java servlet and display it without doing a full page reload. It also presents several strategies for communicating between the client and the server, including sending raw data, and using XML or JSON (JavaScript Object Notation) for sending more complex collections of data. The book then branches out into different approaches for incorporating Ajax, which include: The Prototype and script.aculo.us Javascript libraries, the Dojo and Rico libraries, and DWR Integrating Ajax into Java ServerPages (JSP) applications Using Ajax with Struts Integrating Ajax into Java ServerFaces (JSF) applications Using Google's GWT, which offers a pure Java approach to developing web applications: your client-side components are written in Java, and compiled into HTML and JavaScript Ajax gives web developers the ability to build applications that are more interactive, more dynamic, more exciting and enjoyable for your users. If you're a Java developer and haven't tried Ajax, but would like to get started, this book is essential. Your users will be grateful.","language":"en","currency":"USD","id":"0596553641","title":"Ajax on Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=scYxbeL-ofQC&source=gbs_api","authors":["Steven Douglas Olson"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t23WnrIZ7LoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Ajax (Asynchronous JavaScript and XML) is the ultimate web programming methodology for producing dynamic, rich web experiences. Java developers are crying out for guides showing how to add Ajax functionality to web applications, and this book meets their needs with Pro Ajax and Java. This is the book every Java developer needs to become expert in Ajax. The authors provide the reader with the perfect Java\/Ajax toolkit to get started quickly, exploring Ajax development in detail using the 4 most popular Java web application frameworks: Struts, Spring, JSF, and Tapestry.","language":"en","currency":"USD","id":"9781430201823","title":"Pro Ajax and Java Frameworks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t23WnrIZ7LoC&source=gbs_api","authors":["Nathaniel Schutta","Ryan Asleson"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lq1BKNCW9-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Using Hibernate, JSPs and Servlets","description":"This book jumps to the \"good stuff\" from the outset, allowing students to quickly start writing real applications. It introduces readers to a 3-tiered, Model-View-Controller architecture by using Hibernate, JSPs, and Java Servlets. This book uses existing powerful technologies such as JSP, JavaBeans, Annotations, JSTL, Java 1.5, Hibernate, Apache Velocity and Tomcat. It also presents Model 1 architectures using Servlets and JSP as alternatives to Perl and PHP. Written for novice developers, this book provides an introductory course in web development for undergraduates as well as web developers.","language":"en","currency":"USD","id":"1846288630","title":"Web Development with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lq1BKNCW9-wC&source=gbs_api","authors":["Tim Downey"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QBp2qSknzRIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":null,"description":"This book covers developing web applications with Ruby on Rails. It discusses Ajax, directory services, and web services. The book details the configuration of Ruby on Rails with different databases such as MySQL, Oracle and SQL Server 2005. In addition, it makes a comparison with PHP, the most commonly used scripting language for developing web applications. The book also provides example applications that may be modified to suit a developer’s application.","language":"en","currency":"USD","id":"3540731458","title":"Ruby on Rails for PHP and Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QBp2qSknzRIC&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PpZdFY99S5UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"This book is a thorough introduction to Java Message Service (JMS), the standard Java application program interface (API) from Sun Microsystems that supports the formal communication known as \"messaging\" between computers in a network. JMS provides a common interface to standard messaging protocols and to special messaging services in support of Java programs. The messages exchange crucial data between computers, rather than between users--information such as event notification and service requests. Messaging is often used to coordinate programs in dissimilar systems or written in different programming languages.Using the JMS interface, a programmer can invoke the messaging services of IBM's MQSeries, Progress Software's SonicMQ, and other popular messaging product vendors. In addition, JMS supports messages that contain serialized Java objects and messages that contain Extensible Markup Language (XML) pages.Messaging is a powerful new paradigm that makes it easier to uncouple different parts of an enterprise application. Messaging clients work by sending messages to a message server, which is responsible for delivering the messages to their destination. Message delivery is asynchronous, meaning that the client can continue working without waiting for the message to be delivered. The contents of the message can be anything from a simple text string to a serialized Java object or an XML document.Java Message Service shows how to build applications using the point-to-point and publish-and-subscribe models; how to use features like transactions and durable subscriptions to make an application reliable; and how to use messaging within Enterprise JavaBeans. It also introduces a new EJB type, the MessageDrivenBean, that is part of EJB 2.0, and discusses integration of messaging into J2EE.","language":"en","currency":"USD","id":"9780596550509","title":"Java Message Service","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PpZdFY99S5UC&source=gbs_api","authors":["David A Chappell","Richard Monson-Haefel"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SYa-IVsfEWwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.04,"subtitle":null,"description":"Java Programmers, Preprare for Microsoft's .NET initiative while enhancing your repertoire and marketability with C# for Java Progammers! C# for Java Programmers will prepare readers for the .NET framework by building on what they already know about object-oriented languages and give them the means to maintain their flexibility and effectiveness in an un-certain marketplace. This book will compare and contrast the advantages and disadvantages of both Java and C# to allow programmers to make their own decisions regarding what each language is best used for. Whatever your feelings are about Microsoft and its .NET initiative, there can be no denying that C# is here to stay. The C# language, a close cousin to Java, is a new object-oriented programming language (OOPL) designed to work within the .NET framework. It improves upon many of the vague or ill-defined areas of C++ that frequently lead programmers into trouble. C# is a strongly-typed, object-oriented language designed to give the optimum blend of simplicity, expressiveness, and performance. Written specifically for Java programmers. C# for Java Programmers is not an introductory guide to C#, but builds on what Java programmers already know about object-oriented languages to give them an efficient means for making in-roads to the .NET framework. Compare and Contrast. This book will compare and contrast many of the advantages and drawbacks of Java and C# to allow programmers to make informed, intelligent decisions based on the unique uses of each language.","language":"en","currency":"USD","id":"9780080476353","title":"C# For Java Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SYa-IVsfEWwC&source=gbs_api","authors":["Harold Cabrera"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bfklZrnmG2sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Security for Mobile Devices","description":"This book is a comprehensive presentation of embedded Java security. It is compared with the security model of the Java 2 Standard Edition in order to view the impact of limited resources on security. No other book specifically addresses the topic of embedded Java security. Furthermore, the book provides hints and suggestions as ways for hardening security, and offers researchers and practitioners alike a broader and deeper understanding of the issues involved in embedded Java security, and – as a larger view - mobile devices security. The author is a well-known authority and expert in mobile computing and embedded devices.","language":"en","currency":"USD","id":"1846287111","title":"Embedded Java Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bfklZrnmG2sC&source=gbs_api","authors":["Mourad Debbabi","Mohamed Saleh","Chamseddine Talhi","Sami Zhioua"]},{"pageCount":600,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TtTBNaORMxMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":null,"description":"Step-by-step guide that introduces novices to using all major features of Eclipse 3 Eclipse is an open source extensible integrated development environment (IDE) that helps Java programmers build best-of-breed integrated tools covering the whole software lifecycle-from conceptual modeling to deployment Eclipse is fast becoming the development platform of choice for the Java community Packed with code-rich, real-world examples that show programmers how to speed up the development of applications by reusing and extending existing Eclipse components Describes SWT and JFace (Eclipse's alternative to the Java AWT and Swing) and demonstrates them in practice in a JavaLayer based MP3 player Shows how Eclipse can be used as a tool platform and application framework","language":"en","currency":"USD","id":"0470021624","title":"Professional Eclipse 3 for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TtTBNaORMxMC&source=gbs_api","authors":["Berthold Daum"]},{"pageCount":80,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6l8XFu905FIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.76,"subtitle":null,"description":"This document reviews security features of two most popular modern development platforms--Java and .NET (Java v1.4.2\/J2EE v1.4 and .NET v1.1). The platform choice is not random, because they represent, to a certain extent, competition between UNIX-like and Windows systems, which largely defined software evolution over the last decade. Although Java applications run on Windows, and there exist UNIX bridges for .NET, the Java\/UNIX and .NET\/Windows combinations are used for development of a significant portion (if not majority) of applications on their respective operating systems, so both platforms deserve a careful examination of their capabilities.Such an examination is especially important since different aspects of UNIX\/Windows and Java\/.NET competition have been flaming endless heated debates between proponents of both camps, which often blindly deny merits of the opposite side while at the same time praising their preferred solution. The material here is purposely structured by general categories of protection mechanism and reviewing each platform$B!G(Bs features in those areas. This allows starting each topic with a platform-neutral security concept and performing relatively deep drill-downs for each technology without losing track of the overall focus of providing an unbiased side-by-side comparison.The document is based on the research material that was used as a foundation of the feature article, \"Securing .NET and Enterprise Java: Side by Side\", which was written by Vincent Dovydaitis and myself and appeared in Numbers 3-4 of Computer Security Journal in 2002. The following areas will be considered: Security Configuration and Code Containment Cryptography and Communication Code Protection and Code Access Security, or CAS Authentication and User Access Security, or UAS","language":"en","currency":"USD","id":"059600821X","title":"Java Vs. .NET Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6l8XFu905FIC&source=gbs_api","authors":["Denis Piliptchouk"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YMQqZoc6L3EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.39,"subtitle":"Unearthing the Excellence in Java","description":"What if you could condense Java down to its very best features and build better applications with that simpler version? In this book, veteran Sun Labs engineer Jim Waldo reveals which parts of Java are most useful, and why those features make Java among the best programming languages available. Every language eventually builds up crud, Java included. The core language has become increasingly large and complex, and the libraries associated with it have grown even more. Learn how to take advantage of Java's best features by working with an example application throughout the book. You may not like some of the features Jim Waldo considers good, but they'll actually help you write better code. Learn how the type system and packages help you build large-scale software Use exceptions to make code more reliable and easier to maintain Manage memory automatically with garbage collection Discover how the JVM provides portability, security, and nearly bug-free code Use Javadoc to embed documentation within the code Take advantage of reusable data structures in the collections library Use Java RMI to move code and data in a distributed network Learn how Java concurrency constructs let you exploit multicore processors","language":"en","currency":"USD","id":"9781449390709","title":"Java: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YMQqZoc6L3EC&source=gbs_api","authors":["Jim Waldo"]},{"pageCount":344,"thumbnail":"http:\/\/books.google.com\/books\/content?id=e4T6DiT4JA0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.41,"subtitle":null,"description":"This book is designed to introduce object-oriented programming (OOP) in C++ and Java, and is divided into four areas of coverage: Preliminaries: Explains the basic features of C, C++, and Java such as data types, operators, control structures, storage classes, and array structures. Part I : Covers classes, objects, data abstraction, function overloading, information hiding, memory management, inheritance, binding, polymorphism, class template using working illustrations based on simple concepts. Part II : Discusses all the paradigms of Java programming with ready-to-use programs. Part III : Contains eight Java packages with their full structures. The book offers straightforward explanations of the concepts of OOP and discusses the use of C++ and Java in OOP through small but effective illustrations. It is ideally suited for undergraduate\/postgraduate courses in computer science. The IT professionals should also find the book useful.","language":"en","currency":"USD","id":"9788120316201","title":"OBJECT-ORIENTED PROGRAMMING WITH C++ AND JAVA","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=e4T6DiT4JA0C&source=gbs_api","authors":["DEBASIS SAMANTA"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kj4ssIGaUo4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.19,"subtitle":"Practical Guide for Programmers","description":"If you're an experienced programmer, you already have a rock-solid foundation for learning Java. All you need is a resource that takes your experience into account and explains Java's key principles and techniques in an intelligent, efficient way. Java: Practical Guide for Programmers is precisely that resource. Here, you won't have to wade through hundreds of pages of overly simplistic material to learn the basics of Java programming. Instead, you get highly focused instruction in the core elements of Java 1.4, accompanied by carefully chosen examples and line-by-line analyses that are right to the point. You'll be astonished at how soon you can begin productive coding in Java, and how quickly your skills will progress. Written expressly for people who already know a procedural or object-oriented programming language. Takes a concise approach designed to make the most of the experience you already have. Covers the core elements of Java 1.4, including language syntax, OO features, collections, exception handling, input\/output, threads, event handling, and Swing components. Filled with incisive coding examples and line-by-line analyses.","language":"en","currency":"USD","id":"9780080509563","title":"Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kj4ssIGaUo4C&source=gbs_api","authors":["Michael Sikora"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MTqJBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Java 8 Recipes offers solutions to common programming problems encountered while developing Java-based applications. Fully updated with the newest features and techniques available, Java 8 Recipes provides code examples involving Lambdas, embedded scripting with Nashorn, the new date-time API, stream support, functional interfaces, and much more. Especial emphasis is given to features such as lambdas that are newly introduced in Java 8. Content is presented in the popular problem-solution format: Look up the programming problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! The problem-solution approach sets Java 8 Recipes apart. Java 8 Recipes is focused less on the language itself and more on what you can do with it that is useful. The book respects your time by always focusing on a task that you might want to perform using the language. Solutions come first. Explanations come later. You are free to crib from the book and apply the code examples directly to your own projects. Covers the newly-released Java 8, including a brand new chapter on lambdas Focuses especially on up-and-coming technologies such as Project Nashorn and Java FX 2.0 Respects your time by focusing on practical solutions you can implement in your own code","language":"en","currency":"USD","id":"1430268263","title":"Java 8 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MTqJBAAAQBAJ&source=gbs_api","authors":["Carl Dea","Mark Beaty","Freddy Guime","John OConner","Josh Juneau"]},{"pageCount":600,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ikFMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.99,"subtitle":"Complete First Time Beginner's Reference for the Really Impatient.","description":"Essential Java Skills--Made Easy! What Special – In this book I covered and explained several topics of latest Java 8 Features in detail for Developers & Fresher’s, Topics Like– Lambdas. || Java 8 Functional interface, || Stream and Time API in Java 8. This Java book doesn't require previous programming experience. However, if you come from a C or C++ programming background, then you will be able to learn faster. Learn the all basics and advanced features of Java programming in no time from Bestseller Java Programming Author Harry. H. Chaudhary (More than 1,67,000 Books Sold !). This Java Guide, starts with the basics and Leads to Advance features of Java in detail with thousands of Java Codes and new features of Java 8 like Lambdas. Java 8 Functional interface, || Stream and Time API in Java 8. , I promise this book will make you expert level champion of java. Anyone can learn java through this book at expert level. The main objective of this java book is not to give you just Java Programming Knowledge, I have followed a pattern of improving the question solution of thousands of Codes with clear theory explanations with different Java complexities for each java topic problem, and you will find multiple solutions for complex java problems. Engineering Students and fresh developers can also use this book. This book covers common core syllabus for all Computer Science Professional Degrees If you are really serious then go ahead and make your day with this ultimate java book. First Part- Teach you how to compile and run a Java program, shows you everything you need to develop, compile, debug, and run Java programs. And then discusses the keywords, syntax, and constructs that form the core of the Java language. After that it leads you to advanced features of java, including multithreaded programming and Applets. Learning a new language is no easy task especially when it’s an oop’s programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. This Java Book is very serious java stuff: A complete introduction to Java. You'll learn everything from the fundamentals to advanced topics, if you've read this book, you know what to expect--a visually rich format designed for the way your brain works. To use this book does not require any previous programming experience. However, if you come from a C\/C++ background, then you will be able to advance a bit more rapidly. As most readers will know, Java is similar, in form and spirit, to C\/C++. Thus, knowledge of those languages helps, but is not necessary. Even if you have never programmed before, you can learn to program in Java using this book. Inside Contents (Chapters): 1. (Overview of Java) 2.(Java Language) 3.(Control Statements) 4.(Scanner class, Arrays & Command Line Args) 5.(Class & Objects in Java) 6.(Inheritance in Java) 7.(Object oriented programming) 8.(Packages in Java) 9.(Interface in Java) 10.(String and StringBuffer) 11.(Exception Handling) 12.(Multi-Threaded Programming) 13.(Modifiers\/Visibility modes) 14.(Wrapper Class) 15.(Input\/Output in Java) 16.(Applet Fundamentals) 17.(Abstract Windows Toolkit)(AWT) 18.(Introduction To AWT Events) 19.(Painting in AWT) 20.( java.lang.Object Class ) 21.(Collection Framework) PART - II (Java 8 Features for Developers) 22. Java 8 Features for Developers – Lambdas. 23. Java 8 Functional interface,Stream & Time API. 24. Key Features that Make Java More Secure than Other Languages.","language":"en","currency":"USD","id":"1500864560","title":"Java :","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ikFMBAAAQBAJ&source=gbs_api","authors":["Harry. H. Chaudhary.","Java Guru."]},{"pageCount":872,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GE20llWQnUwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Java 7 Recipes offers solutions to common programming problems encountered every day while developing Java-based applications. Fully updated with the newest features and techniques available, Java 7 Recipes provides code examples involving Servlets, Java FX 2.0, XML, Java Swing, and much more. Content is presented in the popular problem-solution format: Look up the programming problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! The problem-solution approach sets Java 7 Recipes apart from other books on the topic. Java 7 Recipes is focused less on the language itself and more on what you can do with it that is useful. The book respects your time by always focusing on a task that you might want to perform using the language. Solutions come first. Explanations come later. You are free to crib from the book and apply the code examples directly to your own projects. Covers all-new release of Java: Java 7 Focuses especially on up-and-coming technologies such as Java FX 2.0 Respects your time by focusing on practical solutions you can implement in your own code","language":"en","currency":"USD","id":"1430240571","title":"Java 7 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GE20llWQnUwC&source=gbs_api","authors":["Josh Juneau","Mark Beaty","Carl Dea","Freddy Guime","John OConner"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f2B0vMXsOOsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Essential Code and Commands Java Phrasebook gives you the code phrases you need to quickly and effectively complete your programming projects in Java. Concise and Accessible Easy to carry and easy to use—lets you ditch all those bulky books for one portable guide Flexible and Functional Packed with more than 100 customizable code snippets—so you can readily code functional Java in just about any situation Timothy Fisher has been working professionally in the Java software development field since 1997 and is currently a consultant for the Compuware Corporation in Detroit, Michigan. He enjoys writing about technology and has been a contributor to Java Developer’s Journal and XML Journal. Tim is also passionate about education and the use of advanced Internet technologies for education. Programming \/ Java","language":"en","currency":"USD","id":"9780132715003","title":"Java Phrasebook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f2B0vMXsOOsC&source=gbs_api","authors":["Timothy R. Fisher"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wvW4rEQMQ1QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Android development is hot, and many programmers are interested in joining the fun. However, because this technology is based on Java, you should first obtain a solid grasp of the Java language and its foundational APIs to improve your chances of succeeding as an Android app developer. After all, you will be busy learning the architecture of an Android app, the various Android-specific APIs, and Android-specific tools. If you do not already know Java fundamentals, you will probably end up with a massive headache from also having to quickly cram those fundamentals into your knowledge base. Learn Java for Android Development teaches programmers of any skill level the essential Java language and foundational Java API skills that must be learned to improve the programmer’s chances of succeeding as an Android app developer. Each of the book’s 10 chapters provides an exercise section that gives you the opportunity to reinforce your understanding of the chapter’s material. Answers to the book’s more than 300 exercises are provided in an appendix. Additionally, author Jeff Friesen has created six bonus chapters that you can download from his personal site, located at http:\/\/tutortutor.ca\/cgi-bin\/makepage.cgi?\/books\/ljfad. Once you complete this book, you will be ready to dive into Android, and you can start that journey by obtaining a copy of Beginning Android 2.","language":"en","currency":"USD","id":"1430231572","title":"Learn Java for Android Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wvW4rEQMQ1QC&source=gbs_api","authors":["Jeff Friesen"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":600,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LTonVjwyLYYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Have you thought about building games for your cell phone or other wireless devices? Whether you are a first–time wireless Java developer or an experienced professional, Beginning JavaTM ME Platform brings exciting wireless and mobile Java application development right to your door and device! Beginning JavaTM ME Platform empowers you with the flexibility and power to start building Java applications for your Java–enabled mobile device or cell phone. The book covers sound HTTPS support, user interface API enhancements, the Mobile Media API, the Game API, 3D graphics, Bluetooth, and more. Furthermore, this book is easy to read and includes many practical, hands–on, and ready–to–use code examples.","language":"en","currency":"USD","id":"1430210621","title":"Beginning Java ME Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LTonVjwyLYYC&source=gbs_api","authors":["Ray Rischpater"]},{"pageCount":620,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hGF55D0dF0EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Writing and Deploying Secure Applications","description":"One of Java's most striking claims is that it provides a secure programming environment. Yet despite endless discussion, few people understand precisely what Java's claims mean and how it backs up those claims. If you're a developer, network administrator or anyone else who must understand or work with Java's security mechanisms, Java Security is the in-depth exploration you need.Java Security, 2nd Edition, focuses on the basic platform features of Java that provide security--the class loader, the bytecode verifier, and the security manager--and recent additions to Java that enhance this security model: digital signatures, security providers, and the access controller. The book covers the security model of Java 2, Version 1.3, which is significantly different from that of Java 1.1. It has extensive coverage of the two new important security APIs: JAAS (Java Authentication and Authorization Service) and JSSE (Java Secure Sockets Extension). Java Security, 2nd Edition, will give you a clear understanding of the architecture of Java's security model and how to use that model in both programming and administration.The book is intended primarily for programmers who want to write secure Java applications. However, it is also an excellent resource for system and network administrators who are interested in Java security, particularly those who are interested in assessing the risk of using Java and need to understand how the security model works in order to assess whether or not Java meets their security needs.","language":"en","currency":"USD","id":"1449372112","title":"Java Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hGF55D0dF0EC&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cfJzBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The release of Java SE 8 introduced significant enhancements that impact the Core Java technologies and APIs at the heart of the Java platform. Many old Java idioms are no longer required and new features like lambda expressions will increase programmer productivity, but navigating these changes can be challenging. Core Java® for the Impatient is a complete but concise guide to Java SE 8. Written by Cay Horstmann—the author of Java SE 8 for the Really Impatient and Core Java™, the classic, two-volume introduction to the Java language—this indispensable new tutorial offers a faster, easier pathway for learning the language and libraries. Given the size of the language and the scope of the new features introduced in Java SE 8, there’s plenty of material to cover, but it’s presented in small chunks organized for quick access and easy understanding. If you’re an experienced programmer, Horstmann’s practical insights and sample code will help you quickly take advantage of lambda expressions (closures), streams, and other Java language and platform improvements. Horstmann covers everything developers need to know about modern Java, including Crisp and effective coverage of lambda expressions, enabling you to express actions with a concise syntax A thorough introduction to the new streams API, which makes working with data far more flexible and efficient A treatment of concurrent programming that encourages you to design your programs in terms of cooperating tasks instead of low-level threads and locks Up-to-date coverage of new libraries like Date and Time Other new features that will be especially valuable for server-side or mobile programmers Whether you are just getting started with modern Java or are an experienced developer, this guide will be invaluable for anyone who wants to write tomorrow’s most robust, efficient, and secure Java code.","language":"en","currency":"USD","id":"013384496X","title":"Core Java for the Impatient","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cfJzBgAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Cd1o9M8G_nkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"A Look at What's New","description":"Introducing Java EE 7: A Look at What’s New guides you through the new features and enhancements in each of the technologies comprising the Java EE platform. Readers of this book will not have to wade through introductory material or information covering features that have been part of the EE platform for years. Instead, developers can pick this book up and read it to brush up on those features that have changed or have been added for the EE 7 release. This handy reference helps you move forward from Java EE 6 to the new EE 7 platform quickly and easily. Java is a mature programming language that has been refined over the years into a productive language widely used in enterprise application development. Although the language contains frameworks and methodologies that have been used for years, it is important to make use of the most current features available in the language in order to achieve the best results. Introducing Java EE 7: A Look at What’s New covers the solutions using the most current Java Enterprise technologies, including EJB 3.2, JSF 2.2, and JAX-RS 2.0. Build a streamlined and reliable application that uses the latest in Java technologies, and develop it much faster than you did with the older technologies. Rejuvenate your Java expertise to use the freshest capabilities, or perhaps learn Java Enterprise development for the first time and discover one of the most widely used and most powerful technologies available for application development today. Get up and running quickly with the new features of EE 7! Designed to get you up and running quickly with the newly released Java EE 7 Includes real world examples of how to use new and updated features. Demonstrates the latest productivity enhancements in the platform","language":"en","currency":"USD","id":"1430258497","title":"Introducing Java EE 7","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Cd1o9M8G_nkC&source=gbs_api","authors":["Josh Juneau"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eeLhBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Master Java EE design pattern implementation to improve yourdesign skills and your application’s architecture Professional Java EE Design Patterns is the perfectcompanion for anyone who wants to work more effectively with JavaEE, and the only resource that covers both the theory andapplication of design patterns in solving real-world problems. Theauthors guide readers through both the fundamental and advancedfeatures of Java EE 7, presenting patterns throughout, anddemonstrating how they are used in day-to-day problem solving. As the most popular programming language in community-drivenenterprise software, Java EE provides an API and runtimeenvironment that is a superset of Java SE. Written for the juniorand experienced Java EE developer seeking to improve design qualityand effectiveness, the book covers areas including: Implementation and problem-solving with design patterns Connection between existing Java SE design patterns and newJava EE concepts Harnessing the power of Java EE in design patterns Individually-based focus that fully explores each pattern Colorful war-stories showing how patterns were used in thefield to solve real-life problems Unlike most Java EE books that simply offer descriptions orrecipes, this book drives home the implementation of the pattern toreal problems to ensure that the reader learns how the patternsshould be used and to be aware of their pitfalls. For the programmer looking for a comprehensive guide that isactually useful in the everyday workflow, Professional Java EEDesign Patterns is the definitive resource on the market.","language":"en","currency":"USD","id":"1118843584","title":"Professional Java EE Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eeLhBQAAQBAJ&source=gbs_api","authors":["Murat Yener","Alex Theedom"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nyAC9FhqwV0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Key Elements and Practical Programming","description":"This book presents a guide to the core features of Java – and some more recent innovations – enabling the reader to build skills and confidence though tried-and-trusted stages, supported by exercises that reinforce key learning points. All of the most useful and commonly applied Java syntax and libraries are introduced, along with many example programs that can provide the basis for more substantial applications. Use of the Eclipse IDE and the JUnit testing framework is integral to the book, ensuring maximum productivity and code quality, although to ensure that skills are not confined to one environment the fundamentals of the Java compiler and run time are also explained. Additionally, coverage of the Ant tool will equip the reader with the skills to automatically build, test and deploy applications independent of an IDE. Features: presents information on Java 7; contains numerous code examples and exercises; provides source code, self-test questions and PowerPoint slides at an associated website.","language":"en","currency":"USD","id":"1447124790","title":"Foundational Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nyAC9FhqwV0C&source=gbs_api","authors":["David Parsons"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A5qLBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"The Object-Oriented Approach","description":"A comprehensive Java guide, with samples, exercises, casestudies, and step-by-step instruction Beginning Java Programming: The Object Oriented Approachis a straightforward resource for getting started with one of theworld's most enduringly popular programming languages. Based onclasses taught by the authors, the book starts with the basics andgradually builds into more advanced concepts. The approach utilizesan integrated development environment that allows readers toimmediately apply what they learn, and includes step-by-stepinstruction with plenty of sample programs. Each chapter containsexercises based on real-world business and educational scenarios,and the final chapter uses case studies to combine several conceptsand put readers' new skills to the test. Beginning Java Programming: The Object Oriented Approachprovides both the information and the tools beginners need todevelop Java skills, from the general concepts of object-orientedprogramming. Learn to: Understand the Java language and object-oriented conceptimplementation Use Java to access and manipulate external data Make applications accessible to users with GUIs Streamline workflow with object-oriented patterns The book is geared for those who want to use Java in an appliedenvironment while learning at the same time. Useful as either acourse text or a stand-alone self-study program, Beginning JavaProgramming is a thorough, comprehensive guide.","language":"en","currency":"USD","id":"1118739515","title":"Beginning Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A5qLBgAAQBAJ&source=gbs_api","authors":["Bart Baesens","Aimee Backiel","Seppe vanden Broucke"]},{"pageCount":828,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PufbAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Language Syntax, Arrays, Data Types, Objects, and Regular Expressions","description":"Beginning Java 8 Fundamentals provides a comprehensive approach to learning the Java programming language, especially the object-oriented fundamentals necessary at all levels of Java development. Author Kishori Sharan provides over 90 diagrams and 240 complete programs to help beginners and intermediate level programmers learn the topics faster. Starting with basic programming concepts, the author walks you through writing your first Java program step-by-step. Armed with that practical experience, you'll be ready to learn the core of the Java language. The book continues with a series of foundation topics, including using data types, working with operators, and writing statements in Java. These basics lead onto the heart of the Java language: object-oriented programming. By learning topics such as classes, objects, interfaces, and inheritance you'll have a good understanding of Java's object-oriented model. The final collection of topics takes what you've learned and turns you into a real Java programmer. You'll see how to take the power of object-oriented programming and write programs that can handle errors and exceptions, process strings and dates, format data, and work with arrays to manipulate data.","language":"en","currency":"USD","id":"1430266538","title":"Beginning Java 8 Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PufbAwAAQBAJ&source=gbs_api","authors":["Kishori Sharan"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TnU_BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Lambda Expressions, Inner Classes, Threads, I\/O, Collections, and Streams","description":"Beginning Java 8 Language Features covers essential and advanced features of the Java programming language such as the new lambda expressions (closures), inner classes, threads, I\/O, Collections, garbage collection, streams, and more. Author Kishori Sharan provides over 60 diagrams and 290 complete programs to help you visualize and better understand the topics covered in this book. The book starts with a series of chapters on the essential language features provided by Java, including annotations, inner classes, reflection, and generics. These topics are then complemented by details of how to use lambda expressions, allowing you to build powerful and efficient Java programs. The chapter on threads follows this up and discusses everything from the very basic concepts of a thread to the most advanced topics such as synchronizers, the fork\/join framework, and atomic variables. This book contains unmatched coverage of Java I\/O, including NIO 2.0, the Path API, the FileVisitor API, the watch service and asynchronous file I\/O. With this in-depth knowledge, your data- and file-management programs will be able to take advantage of every feature of Java's powerful I\/O framework. Finally, you'll learn how to use the Stream API, a new, exciting addition to Java 8, to perform aggregate operations on collections of data elements using functional-style programming. You'll examine the details of stream processing such as creating streams from different data sources, learning the difference between sequential and parallel streams, applying the filter-map-reduce pattern, and dealing with optional values.","language":"en","currency":"USD","id":"1430266597","title":"Beginning Java 8 Language Features","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TnU_BAAAQBAJ&source=gbs_api","authors":["Kishori Sharan"]},{"pageCount":808,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NYKMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Swing, JavaFX, JavaScript, JDBC and Network Programming APIs","description":"Beginning Java 8 APIs, Extensions and Libraries completes the Apress Java learning journey and is a comprehensive approach to learning the Java Swing, JavaFX, Java Scripting, JDBC and network programming APIs. This book covers the key extensions of the Java programming language such as Swing, JavaFX, network programming, and JDBC. Each topic starts with a discussion of the topic's background. A step-by-step process, with small snippets of Java code, provides easy-to-follow instructions. At the end of a topic, a complete and ready-to-run Java program is provided. This book contains over 130 images and diagrams to help you visualize and better understand the topics. More than 130 complete programs allow you to practice and quickly learn the topics. The Swing chapters discuss various aspects of working with a GUI, from the very basic concepts of developing a Swing application, to the most advanced topics, such as decorating a Swing component with a JLayer, drag-and-drop features, Synth Skinnable L&F, etc. The chapter on network programming covers the basics of network technologies first, and then, the advanced topics of network programming, using a Java class library. It covers IPv4 and IPv6, addressing schemes, subnetting, supernetting, multicasting, TCP\/IP sockets, UPD sockets, asynchronous socket I\/O, etc. The chapter on JDBC provides the details of connecting and working with databases such as Oracle, SQL Server, MySQL, DB2, Java DB (Apache Derby), Sybase, Adaptive Server Anywhere, etc. It contains a complete discussion on processing a ResultSet and a RowSet. It discusses how to use the RowSetFactory, to obtain a RowSet object of a specific type. Working with Large Objects (LOBs), such as Blob, Clob, and NClob, is covered in detail with Java code examples and database scripts.","language":"en","currency":"USD","id":"1430266627","title":"Beginning Java 8 APIs, Extensions and Libraries","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NYKMBAAAQBAJ&source=gbs_api","authors":["Kishori Sharan"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4kZdePXe6M4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":160.76,"subtitle":null,"description":"Ideal for the introductory programming course, An Introduction to Programming Using Java covers all recommended topics put forth by the ACM\/IEEE curriculum guidelines in a concise format that is perfect for the one-term course. An integrated lab manual enhances the learning process by providing real-world, hands-on projects. This unique approach allows readers to test their understanding of the key material at hand. Sample exams urge readers to assess their progress through the course and are ideal study aids for in-class testing. The author's innovative, accessible approach engages and excites students on the capabilities of programming using Java! TuringsCraft CodeLab access is available for adopting professors. Custom CodeLab: CodeLab is a web-based interactive programming exercise service that has been customized to accompany this text. It provides numerous short exercises, each focused on a particular programming idea or language construct. The student types in code and the system immediately judges its correctness, offering hints when the submission is incorrect. See CodeLab in action! A Jones & Bartlett Learning demonstration site is available online at jblearning.turingscraft.com. Look to the Samples and Additional Resources section below to review sample chapters! Key Features: • Covers all recommended topics put forth by the ACM\/IEEE curriculum guidelines in a concise format that is perfect for the one-term course. • An integrated lab manual enhances the learning process with hands-on projects. • Uses a computer in lab exercises to teach students some of the finer points of Java • Introduces Objects early (Ch.1) • Explains abstract classes and interfaces in the context of generic programming. With this approach, students quickly grasp the conceptual and technical aspects of these constructs.","language":"en","currency":"USD","id":"1449633374","title":"An Introduction to Programming Using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4kZdePXe6M4C&source=gbs_api","authors":["Anthony J. Dos Reis"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pcBPYsdXJWQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Applications in Finance and Investment","description":"This book describes the principles of model building in financial engineering. It explains those models as designs and working implementations for Java-based applications. The book provides software professionals with an accessible source of numerical methods or ready-to-use code for use in business applications. It is the first book to cover the topic of Java implementations for finance\/investment applications and is written specifically to be accessible to software practitioners without prior accountancy\/finance training. The book develops a series of packaged classes explained and designed to allow the financial engineer complete flexibility.","language":"en","currency":"USD","id":"1846287413","title":"Java Methods for Financial Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pcBPYsdXJWQC&source=gbs_api","authors":["Philip Barker"]},{"pageCount":600,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0o-AAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Written by the inventors of the technology, The Java® Virtual Machine Specification, Java SE 8 Edition is the definitive technical reference for the Java Virtual Machine. The book provides complete, accurate, and detailed coverage of the Java Virtual Machine. It fully describes the new features added in Java SE 8, including the invocation of default methods and the class file extensions for type annotations and method parameters. The book also clarifies the interpretation of class file attributes and the rules of bytecode verification.","language":"en","currency":"USD","id":"0133922723","title":"The Java Virtual Machine Specification, Java SE 8 Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0o-AAwAAQBAJ&source=gbs_api","authors":["Tim Lindholm","Frank Yellin","Gilad Bracha","Alex Buckley"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=95HzjxTELRkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Written by the inventors of the technology, The Java® Virtual Machine Specification, Java SE 7 Edition, is the definitive technical reference for the Java Virtual Machine. The book provides complete, accurate, and detailed coverage of the Java Virtual Machine. It fully describes the invokedynamic instruction and method handle mechanism added in Java SE 7, and gives the formal Prolog specification of the type-checking verifier introduced in Java SE 6. The book also includes the class file extensions for generics and annotations defined in Java SE 5.0, and aligns the instruction set and initialization rules with the Java Memory Model.","language":"en","currency":"USD","id":"0133260461","title":"The Java Virtual Machine Specification, Java SE 7 Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=95HzjxTELRkC&source=gbs_api","authors":["Tim Lindholm","Frank Yellin","Gilad Bracha","Alex Buckley"]},{"pageCount":748,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NNuX4zsWHrYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Java EE 7 Recipes takes an example-based approach in showing how to program Enterprise Java applications in many different scenarios. Be it a small-business web application, or an enterprise database application, Java EE 7 Recipes provides effective and proven solutions to accomplish just about any task that you may encounter. You can feel confident using the reliable solutions that are demonstrated in this book in your personal or corporate environment. The solutions in Java EE 7 Recipes are built using the most current Java Enterprise specifications, including EJB 3.2, JSF 2.2, Expression Language 3.0, Servlet 3.1, and JMS 2.0. While older technologies and frameworks exist, it is important to be forward-looking and take advantage of all that the latest technologies offer. Rejuvenate your Java expertise to use the freshest capabilities, or perhaps learn Java Enterprise development for the first time and discover one of the most widely used and most powerful platforms available for application development today. Let Java EE 7 Recipes show you the way by showing how to build streamlined and reliable applications much faster and easier than ever before by making effective use of the latest frameworks and features on offer in the Java EE 7 release. Shows off the most current Java Enterprise Edition technologies. Provides solutions to creating sophisticated user interfaces. Demonstrates proven solutions for effective database access.","language":"en","currency":"USD","id":"1430244267","title":"Java EE 7 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NNuX4zsWHrYC&source=gbs_api","authors":["Josh Juneau"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QOhxBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are completely new to either Java, Android, or game programming and are aiming to publish Android games, then this book is for you. This book also acts as a refresher for those who already have experience in Java on another platforms or other object-oriented languages.","language":"en","currency":"USD","id":"1784393843","title":"Learning Java by Building Android Games","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QOhxBgAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Rr1OwYRj8XMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Java Enterprise Edition (Java EE) continues to be one of the leading Java technologies and platforms. Beginning Java EE 7 is the first tutorial book on Java EE 7. Step by step and easy to follow, this book describes many of the Java EE 7 specifications and reference implementations, and shows them in action using practical examples. This definitive book also uses the newest version of GlassFish to deploy and administer the code examples. Written by an expert member of the Java EE specification request and review board in the Java Community Process (JCP), this book contains the best information possible, from an expert’s perspective on enterprise Java technologies.","language":"en","currency":"USD","id":"1430246278","title":"Beginning Java EE 7","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Rr1OwYRj8XMC&source=gbs_api","authors":["Antonio Goncalves"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RM9sLE0ntQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Traps, Pitfalls, and Corner Cases","description":"\"Every programming language has its quirks. This lively book reveals oddities of the Java programming language through entertaining and thought-provoking programming puzzles.\" --Guy Steele, Sun Fellow and coauthor of The Java™ Language Specification \"I laughed, I cried, I threw up (my hands in admiration).\" --Tim Peierls, president, Prior Artisans LLC, and member of the JSR 166 Expert Group How well do you really know Java? Are you a code sleuth? Have you ever spent days chasing a bug caused by a trap or pitfall in Java or its libraries? Do you like brainteasers? Then this is the book for you! In the tradition of Effective Java™, Bloch and Gafter dive deep into the subtleties of the Java programming language and its core libraries. Illustrated with visually stunning optical illusions, Java™ Puzzlers features 95 diabolical puzzles that educate and entertain. Anyone with a working knowledge of Java will understand the puzzles, but even the most seasoned veteran will find them challenging. Most of the puzzles take the form of a short program whose behavior isn't what it seems. Can you figure out what it does? Puzzles are grouped loosely according to the features they use, and detailed solutions follow each puzzle. The solutions go well beyond a simple explanation of the program's behavior--they show you how to avoid the underlying traps and pitfalls for good. A handy catalog of traps and pitfalls at the back of the book provides a concise taxonomy for future reference. Solve these puzzles and you'll never again fall prey to the counterintuitive or obscure behaviors that can fool even the most experienced programmers.","language":"en","currency":"USD","id":"0321643518","title":"Java Puzzlers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RM9sLE0ntQ0C&source=gbs_api","authors":["Joshua Bloch","Neal Gafter"]},{"pageCount":976,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PbcWAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.49,"subtitle":null,"description":"Give your beginning programmers a thorough, engaging and hands-on introduction to developing applications with Farrell's JAVA PROGRAMMING, 7E. This complete guide provides the details and real-world exercises today's readers need to master Java, one of the most widely used tool among professional programmers for building visually interesting GUI and Web-based applications. With JAVA PROGRAMMING, 7E even first-time programmers can quickly develop useful programs while learning the basic principles of structured and object-oriented programming. The text explains concepts clearly and reinforces the reader-friendly presentation with meaningful real-world exercises. Full programming examples emphasize learning in context. Updated You Do It sections, all-new programming exercises, and new continuing cases help students build skills critical for ongoing programming success. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","language":"en","currency":"USD","id":"128562470X","title":"Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PbcWAAAAQBAJ&source=gbs_api","authors":["Joyce Farrell"]},{"pageCount":580,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kENMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.99,"subtitle":"Advanced Features (Core Series) Updated To Java 8.","description":"Essential Java Skills--Made Easy! What Special – In this book I covered and explained several topics of latest Java 8 Features in detail for Developers & Fresher’s, Topics Like– Lambdas. || Java 8 Functional interface, || Stream and Time API in Java 8. This Java book doesn't require previous programming experience. However, if you come from a C or C++ programming background, then you will be able to learn faster. Learn the all basics and advanced features of Java programming in no time from Bestseller Java Programming Author Harry. H. Chaudhary (More than 1,67,000 Books Sold !). This Java Guide, starts with the basics and Leads to Advance features of Java in detail with thousands of Java Codes and new features of Java 8 like Lambdas. Java 8 Functional interface, || Stream and Time API in Java 8. , I promise this book will make you expert level champion of java. Anyone can learn java through this book at expert level. The main objective of this java book is not to give you just Java Programming Knowledge, I have followed a pattern of improving the question solution of thousands of Codes with clear theory explanations with different Java complexities for each java topic problem, and you will find multiple solutions for complex java problems. Engineering Students and fresh developers can also use this book. This book covers common core syllabus for all Computer Science Professional Degrees If you are really serious then go ahead and make your day with this ultimate java book. First Part- Teach you how to compile and run a Java program, shows you everything you need to develop, compile, debug, and run Java programs. And then discusses the keywords, syntax, and constructs that form the core of the Java language. After that it leads you to advanced features of java, including multithreaded programming and Applets. Learning a new language is no easy task especially when it’s an oop’s programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. This Java Book is very serious java stuff: A complete introduction to Java. You'll learn everything from the fundamentals to advanced topics, if you've read this book, you know what to expect--a visually rich format designed for the way your brain works. To use this book does not require any previous programming experience. However, if you come from a C\/C++ background, then you will be able to advance a bit more rapidly. As most readers will know, Java is similar, in form and spirit, to C\/C++. Thus, knowledge of those languages helps, but is not necessary. Even if you have never programmed before, you can learn to program in Java using this book. Inside Contents (Chapters): 1. (Overview of Java) 2.(Java Language) 3.(Control Statements) 4.(Scanner class, Arrays & Command Line Args) 5.(Class & Objects in Java) 6.(Inheritance in Java) 7.(Object oriented programming) 8.(Packages in Java) 9.(Interface in Java) 10.(String and StringBuffer) 11.(Exception Handling) 12.(Multi-Threaded Programming) 13.(Modifiers\/Visibility modes) 14.(Wrapper Class) 15.(Input\/Output in Java) 16.(Applet Fundamentals) 17.(Abstract Windows Toolkit)(AWT) 18.(Introduction To AWT Events) 19.(Painting in AWT) 20.( java.lang.Object Class ) 21.(Collection Framework) PART - II (Java 8 Features for Developers) 22. Java 8 Features for Developers – Lambdas. 23. Java 8 Functional interface,Stream & Time API. 24. Key Features that Make Java More Secure than Other Languages.","language":"en","currency":"USD","id":"1500865095","title":"Core Java Professional :","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kENMBAAAQBAJ&source=gbs_api","authors":["Harry. H. Chaudhary.","Java Guru."]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XqUdAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Distributed computing and Java go together naturally. As the first language designed from the bottom up with networking in mind, Java makes it very easy for computers to cooperate. Even the simplest applet running in a browser is a distributed application, if you think about it. The client running the browser downloads and executes code that is delivered by some other system. But even this simple applet wouldn't be possible without Java's guarantees of portability and security: the applet can run on any platform, and can't sabotage its host.Of course, when we think of distributed computing, we usually think of applications more complex than a client and server communicating with the same protocol. We usually think in terms of programs that make remote procedure calls, access remote databases, and collaborate with others to produce a single result. Java Distributed Computing discusses how to design and write such applications. It covers Java's RMI (Remote Method Invocation) facility and CORBA, but it doesn't stop there; it tells you how to design your own protocols to build message passing systems and discusses how to use Java's security facilities, how to write multithreaded servers, and more. It pays special attention to distributed data systems, collaboration, and applications that have high bandwidth requirements.In the future, distributed computing can only become more important.Java Distributed Computing provides a broad introduction to the problems you'll face and the solutions you'll find as you write distributed computing applications.Topics covered in Java Distributed Computing: Introduction to Distributed Computing Networking Basics Distributed Objects (Overview of CORBA and RMI) Threads Security Message Passing Systems Distributed Data Systems (Databases) Bandwidth Limited Applications Collaborative Systems","language":"en","currency":"USD","id":"1491903341","title":"Java Distributed Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XqUdAwAAQBAJ&source=gbs_api","authors":["Jim Farley"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mva8Cnc90d0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Building Commercial Quality Java ME Apps","description":"Pro Java ME Apps gives you, the developer, the know-how required for writing sophisticated Java ME applications and for taking advantage of this huge potential market. Java ME is the largest mobile software platform in the world, supported by over 80% of all phones. You'll cover what Java ME is and how it compares to other mobile software platforms, how to properly design and structure Java ME applications, how to think like an experienced Java ME developer, what common problems and pitfalls you may run into, how to optimize your code, and many other key topics. Unlike other Java ME books out there, which only teach the reader the basics of Java ME by way of a few simple examples, this book presents a broader, eagle-eye picture of a complete Java ME application and what writing one involves. From there, the book presents, explains, and helps you to implement all the essential aspects of Java ME development, from the user interface to client-server communication. As this unfolds, the decisions and reasoning behind the code are also presented. The book assumes that the reader is already familiar with Java ME and Java applications in general. Based on and geared towards real-life Java ME scenarios Guides the reader through the entire process of developing a high-quality Java ME application Explains the decisions made at each step, gives advice and examples of good practices vs. bad practices","language":"en","currency":"USD","id":"1430233281","title":"Pro Java ME Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mva8Cnc90d0C&source=gbs_api","authors":["Ovidiu Iliescu"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M6EQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Beginning Java with WebSphere provides a step-by-step guide for creating and installing both client- and server-based Java applications using Rapid Application Development v8, WebSphere Application Server 8.0, and Java. Since more and more Java applications are moving to the server and using HTML for the user interface, there is a minimal amount of time spent exploring the Java GUI components. More specifically, this book covers graphical user interfaces using RAD's Visual Editor, variables, conditional logic, and application improvements\/enhancements from the client side. And, from the server-side, this book covers servlets, JavaServer Pages (JSPs), database accessibility (JDBC), custom tags, and concludes with JavaServer Faces (JSFs). This book concentrate on base topics that allow you to get to the server-side and database topics quickly.","language":"en","currency":"USD","id":"1430263024","title":"Beginning Java with WebSphere","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M6EQAwAAQBAJ&source=gbs_api","authors":["Robert W. Janson"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0jnMBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":112,"subtitle":null,"description":"While teaching Java programming at Minnesota State University, the authors noticed that engineering students were enrolling in Java programming courses in order to obtain basic programming skills, but there were no Java books suitable for courses intended for engineers. They realized the need for a comprehensive Java programming tutorial that offers basic programming skills that can be applied in the field of engineering. With this in mind, the authors developed Java Programming for Engineers in order to meet the needs of both engineers and engineering students. The text uses the personal computer as a development platform and assumes no prior programming experience or knowledge. The only skills expected of the reader are basic keyboarding and user-level familiarity with the PC. Topics covered range from mathematical expressions to linear systems to engineering graphics. Chapters on problem solving skills and the designing of engineering applications walk readers through real word problems they might encounter. Divided into two parts, Part 1 is a description of the Java language, of the fundamentals of object orientation, input and output operations, and error handling. Part 2 is about Java programming for engineers. It starts with computer number systems, fixed- and variable-precision numeric data, mathematical programming in Java as could be of interest to engineers, and concludes with an overview of Java Graphics.","language":"en","currency":"USD","id":"1420000004","title":"Java Programming for Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0jnMBQAAQBAJ&source=gbs_api","authors":["Julio Sanchez","Maria P. Canton"]},{"pageCount":701,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7FHNBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":176,"subtitle":null,"description":"For a variety of reasons, the MATLAB®-Java interface was never fully documented. This is really quite unfortunate: Java is one of the most widely used programming languages, having many times the number of programmers and programming resources as MATLAB. Also unfortunate is the popular claim that while MATLAB is a fine programming platform for prototyping, it is not suitable for real-world, modern-looking applications. Undocumented Secrets of MATLAB®-Java Programming aims to correct this misconception. This book shows how using Java can significantly improve MATLAB program appearance and functionality, and that this can be done easily and even without any prior Java knowledge. Readers are led step-by-step from simple to complex customizations. Code snippets, screenshots, and numerous online references are provided to enable the utilization of this book as both a sequential tutorial and as a random-access reference suited for immediate use. Java-savvy readers will find it easy to tailor code samples for their particular needs; for Java newcomers, an introduction to Java and numerous online references are provided. This book demonstrates how The MATLAB programming environment relies on Java for numerous tasks, including networking, data-processing algorithms and graphical user-interface (GUI) We can use MATLAB for easy access to external Java functionality, either third-party or user-created Using Java, we can extensively customize the MATLAB environment and application GUI, enabling the creation of visually appealing and usable applications","language":"en","currency":"USD","id":"1439869049","title":"Undocumented Secrets of MATLAB-Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7FHNBQAAQBAJ&source=gbs_api","authors":["Yair M. Altman"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ojk25QoiTrYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"*Exploits the finer points of core and standard editions of Java 2 *Updated to include the final Java 2SE 5.0 (Tiger) release * *Ideal for experienced non-Java and Java programmers who need intermediate level book","language":"en","currency":"USD","id":"9781430200321","title":"Pro Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ojk25QoiTrYC&source=gbs_api","authors":["Terrill Brett Spell"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eVexOGk4hcYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"With Java RTS","description":"The Definitive Guide to Java RTS for Developers and Architects For Java developers and architects moving to real-time, and real-time developers moving to Java Walks through start-to-finish case study applications, identifying their constraints and discussing the APIs and design patterns used to address them Written by the former leader of the real-time Java standards process and one of Wall Street’s top real-time developers Sun Microsystems’ Java Real-Time System (Java RTS) is proving itself in numerous, wide-ranging environments, including finance, control systems, manufacturing, and defense. Java RTS and the RTSJ standard (JSR-001) eliminate the need for complicated, specialized, real-time languages and operating environments, saving money by leveraging Java’s exceptional productivity and familiarity. In Real-Time Java™ Programming, two of Sun’s top real-time programming experts present the deep knowledge and realistic code examples that developers need to succeed with Java RTS and its APIs. As they do so, the authors also illuminate the foundations of real-time programming in any RTSJ-compatible environment. Key topics include Real-time principles and concepts, and the unique requirements of real-time application design and development How Java has been adapted to real-time environments A complete chapter on garbage collection concepts and Java SE collectors Using the Java RTS APIs to solve actual real-time system problems as efficiently as possible Utilizing today’s leading Java RTS development and debugging tools Understanding real-time garbage collection, threads, scheduling, and dispatching Programming new RTSJ memory models Dealing with asynchronous event handling and asynchronous transfer of control","language":"en","currency":"USD","id":"0137042582","title":"Real-Time Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eVexOGk4hcYC&source=gbs_api","authors":["Eric J. Bruno","Greg Bollella"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=74Y7BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"","description":"This book is for you if you want to learn Java and specialize in Android application development. To save you time and effort, this book covers the most important Java programming concepts that are directly related to Android programming. All in an easy to follow tutorial. It is a guide to building real-world mobile applications in Java.","language":"en","currency":"USD","id":"0992133033","title":"Java for Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=74Y7BAAAQBAJ&source=gbs_api","authors":["Budi Kurniawan"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HjaDUhlvL8gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":"Intermediate and Advanced Language Features","description":"CodeNotes provides the most succinct, accurate, and speedy way for a developer to ramp up on a new technology or language. Unlike other programming books, CodeNotes drills down to the core aspects of a technology, focusing on the key elements needed in order to understand it quickly and implement it immediately. It is a unique resource for developers, filling the gap between comprehensive manuals and pocket references. CodeNotes for Java: Intermediate and Advanced Language Features will introduce the reader with a grasp of basic Java to advanced object oriented design techniques, collections, I\/O, multi-threaded applications, internationalization and more. Experienced Java programmers will also benefit from the numerous examples, tips and tricks and design notes that explain why these Java features are fundamentally important to every development effort. This edition of CodeNotes includes: -A global overview of a technology and explanation of what problems it can be used to solve -Real-world examples -\"How and Why\", and \"Bugs and Caveats\" sections that provide hints, tricks, workarounds, and tips on what should be taken advantage of or avoided -\"Design Notes\" illustrating many of the common use patterns for Java programs -Instructions and classroom-style tutorials throughout from expert trainers and software developers Visit www.codenotes.com for updates, source code templates, access to message boards, and discussion of specific problems with CodeNotes authors and other developers. Every CodeNotes title is written and reviewed by a team of commercial software developers and technology experts. See \"About the Authors\" at the beginning of the book for more information.","language":"en","currency":"USD","id":"0679647295","title":"CodeNotes for Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HjaDUhlvL8gC&source=gbs_api","authors":["Gregory Brill"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Behaviour-Driven Development for Testers and Developers","description":"Your customers want rock-solid, bug-free software that does exactly what they expect it to do. Yet they can't always articulate their ideas clearly enough for you to turn them into code. You need Cucumber: a testing, communication, and requirements tool-all rolled into one. All the code in this book is updated for Cucumber 2.4, Rails 5, and RSpec 3.5. Express your customers' wild ideas as a set of clear, executable specifications that everyone on the team can read. Feed those examples into Cucumber and let it guide your development. Build just the right code to keep your customers happy. You can use Cucumber to test almost any system or any platform. Get started by using the core features of Cucumber and working with Cucumber's Gherkin DSL to describe-in plain language-the behavior your customers want from the system. Then write Ruby code that interprets those plain-language specifications and checks them against your application. Next, consolidate the knowledge you've gained with a worked example, where you'll learn more advanced Cucumber techniques, test asynchronous systems, and test systems that use a database. Recipes highlight some of the most difficult and commonly seen situations the authors have helped teams solve. With these patterns and techniques, test Ajax-heavy web applications with Capybara and Selenium, REST web services, Ruby on Rails applications, command-line applications, legacy applications, and more. Written by the creator of Cucumber and the co-founders of Cucumber Ltd., this authoritative guide will give you and your team all the knowledge you need to start using Cucumber with confidence. What You Need: Windows, Mac OS X (with XCode) or Linux, Ruby 1.9.2 and upwards, Cucumber 2.4, Rails 5, and RSpec 3.5","language":"en","currency":"USD","id":"1680504967","title":"The Cucumber Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fA9QDwAAQBAJ&source=gbs_api","authors":["Matt Wynne","Aslak Hellesoy","Steve Tooke"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vUf7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Store Objects with Ease","description":"Java Data Objects revolutionizes the way Java developers interact with databases and other datastores. JDO allows you to store and retrieve objects in a way that's natural to Java programmers. Instead of working with JDBC or EJB's container-managed persistence, you work directly with your Java objects. You don't have to copy data to and from database tables or issue SELECTs to perform queries: your JDO implementation takes care of persistence behind-the-scenes, and you make queries based on the fields of your Java objects, using normal Java syntax. The result is software that is truly object-oriented: not code that is partially object-oriented, with a large database-shaped lump on the back end. JDO lets you save plain, ordinary Java objects, and does not force you to use different data models and types for dealing with storage. As a result, your code becomes easier to maintain, easier to re-use, and easier to test. And you're not tied to a specific database vendor: your JDO code is entirely database-independent. You don't even need to know whether the datastore is a relational database, an object database, or just a set of files. This book, written by the JDO Specification Lead and one of the key contributors to the JDO Specification, is the definitive work on the JDO API. It gives you a thorough introduction to JDO, starting with a simple application that demonstrates many of JDO's capabilities. It shows you how to make classes persistent, how JDO maps persistent classes to the database, how to configure JDO at runtime, how to perform transactions, and how to make queries. More advanced chapters cover optional features such as nontransactional access and optimistic transactions. The book concludes by discussing the use of JDO in web applications and J2EE environments. Whether you only want to read up on an interesting new technology, or are seriously considering an alternative to JDBC or EJB CMP, you'll find that this book is essential. It provides by far the most authoritative and complete coverage available.","language":"en","currency":"USD","id":"1491946393","title":"Java Data Objects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vUf7AAAAQBAJ&source=gbs_api","authors":["David Jordan","Craig Russell"]},{"pageCount":345,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KeziBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.21,"subtitle":"Quickstart guide for developing,deploying and securing Java EE applications on WildFly application server","description":"A hands-on practical guide disclosing all areas of Java EE 8 development on the newest WildFly application server. Covers everything from the foundation components (EJB, Servlets, CDI, JPA) to the new technology stack defined in Java Enterprise Edition 7 hence including the new Batch API, JSON-P Api, the Concurrency API,Web Sockets, the JMS 2.0 API, the core Web services stack (JAX-WS, JAX-RS). The testing area with Arquillian framework and the Security API complete the list of topics discussed in the book.","language":"en","currency":"USD","id":"8894038947","title":"Practical Java EE Development on WildFly","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KeziBAAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fiNRYlIwLu8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"What Do You Want To Do?","description":"Learning a programming language on you own can be daunting. Programming books can be confusing and incomplete. Program listings often do not work until you have mucked around using trial and error. I like to use books as reference after I have read them. Invariably, none of the books have the particular information that I want, nor do they have references to other information sources. “Java Programming -- What Do You Want To Do?” changes all that. Inside there are clear instructions on how to do what you want to do -- Basic structures, graphics programming with AWT and NetBeans, Advanced structures, test preparation, networking, cell phone programming and much more.","language":"en","currency":"USD","id":"9781450268950","title":"Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fiNRYlIwLu8C&source=gbs_api","authors":["Steven P Warr"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nP7WBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Exam 1Z0-808","description":"Full coverage of functional programming and all OCA Java Programmer exam objectives OCA, Oracle Certified Associate Java SE 8 Programmer I Study Guide, Exam 1Z0-808 is a comprehensive study guide for those taking the Oracle Certified Associate Java SE 8 Programmer I exam (1Z0-808). With complete coverage of 100% of the exam objectives, this book provides everything you need to know to confidently take the exam. The release of Java 8 brought the language's biggest changes to date, and for the first time, candidates are required to learn functional programming to pass the exam. This study guide has you covered, with thorough functional programming explanation and information on all key topic areas Java programmers need to know. You'll cover Java inside and out, and learn how to apply it efficiently and effectively to create solutions applicable to real-world scenarios. Work confidently with operators, conditionals, and loops Understand object-oriented design principles and patterns Master functional programming fundamentals","language":"en","currency":"USD","id":"1118957423","title":"OCA: Oracle Certified Associate Java SE 8 Programmer I Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nP7WBQAAQBAJ&source=gbs_api","authors":["Jeanne Boyarsky","Scott Selikoff"]},{"pageCount":808,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LqRNBdDfv-EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.34,"subtitle":null,"description":"This comprehensive and accessible text discusses all the aspects of Core Java in a simple and easy to understand language. It begins with a discussion on the fundamentals of Java and then goes on to give a description of the various operators provided by Java, different ways of making decisions through branching, and the core concepts of Java, that is, classes, objects and their features. Besides, the text also explains the intricacies of one of the most important features of object-orientation, i.e. inheritance, packages and wrapper classes, arrays, strings, string-buffers, and multi-threaded programming and its intricacies. Finally, it elaborates on the classes and interfaces of lang, util and io packages. The book is intended for the undergraduate students of Engineering [B.Tech. (Computer Science)\/B.Tech. (IT)], as well as for undergraduate and postgraduate students of Computer Applications (BCA\/MCA), and Computer Science and Information Technology—B.Sc.\/M.Sc. (Computer Science\/IT). Besides, professionals in the field will find the book quite useful. KEY FEATURES : Illustrates the topics discussed with the help of sample programs. Provides a large number of questions at the end of each chapter to test the reader’s understanding of the concepts. Gives a comprehensive Glossary of the terms used in the text. Companion Website: http:\/\/www.phindia.com\/mahesh_matha\/","language":"en","currency":"USD","id":"8120342410","title":"Core Java : a Comprehensive Study","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LqRNBdDfv-EC&source=gbs_api","authors":[]},{"pageCount":1056,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xT8qBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":null,"description":"Although traditional texts present isolated algorithms and data structures, they do not provide a unifying structure and offer little guidance on how to appropriately select among them. Furthermore, these texts furnish little, if any, source code and leave many of the more difficult aspects of the implementation as exercises. A fresh alternative to","language":"en","currency":"USD","id":"1420010336","title":"A Practical Guide to Data Structures and Algorithms using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xT8qBgAAQBAJ&source=gbs_api","authors":["Sally. A Goldman","Kenneth. J Goldman"]},{"pageCount":536,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QwUOopeuTuIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":null,"description":"This book anchors its pedagogy in the program ProgramLive that you may find at extras.springer.com, a complete multimedia module in itself. Containing over 250 recorded lectures with synchronized animation, ProgramLive allows users to see, first-hand and in real time, processes like stepwise refinement of algorithms, development of loops, execution of method calls and associated changes to the call stack, and much more. The zip file also includes all programs from the book, 35 guided instruction sets for closed lab sessions, and a 70-page hyperlinked glossary. With its comprehensive appendices and bibliography, systematic approach, and helpful interactive programs on extras.springer.com, this exciting work provides the key tools they needed for successful object-oriented programming. It is ideal for use at the undergraduate and graduate beginning level, whether in the classroom or for distance learning; furthermore, the text will also be a valuable self-study resource or reference volume in any programmer’s library.","language":"en","currency":"USD","id":"0387269347","title":"Multimedia Introduction to Programming Using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QwUOopeuTuIC&source=gbs_api","authors":["David Gries","Paul Gries"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wxTajapmFyMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":5.98,"subtitle":null,"description":"This practice-oriented text explores the intricacies of Java language in the light of different procedural and object-oriented paradigms. It is primarily focussed on the Object-Oriented Programming (OOP) paradigm using Java as a language. The text begins with the programming overview and introduces the reader to the important object-oriented (OO) terms. It then deals with Java development as well as runtime environment set-up along with the steps of compilation and running of a simple program. The text explains the philosophy of Java by highlighting its core features and demonstrating its advantages over C++. Besides, it covers GUI through Java applets, Swing, as well as concurrency handling and synchronization through threads. A chapter is exclusively devoted to fundamental data structures and their applications in Java. The book shows how Unified Modeling Language (UML) represents objects, classes, components, relationships, and architectural design. This comprehensive and student friendly book is intended as a text for the students of computer science and engineering, computer applications (BCA\/MCA), and IT courses.","language":"en","currency":"USD","id":"9788120327757","title":"JAVA AND OBJECT-ORIENTED PROGRAMMING PARADIGM","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wxTajapmFyMC&source=gbs_api","authors":["DEBASISH JANA"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HcIDAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":"Instant Help for Java Programmers","description":"When you need quick answers for developing or debugging Java programs, this pocket guide provides a handy reference to the standard features of the Java programming language and its platform. You’ll find helpful programming examples, tables, figures, and lists, as well as supplemental information about topics including the Java Scripting API, third-party tools, and the basics of the Unified Modeling Language (UML). Updated for new features through Java SE 7, this little book is an ideal companion, whether you’re in the office, in the lab, or on the road. Quickly find Java language details, such as naming conventions, fundamental types, and object-oriented programming elements Get details on the Java SE 7 platform, including development basics, memory management, concurrency, and generics Browse through basic information on NIO 2.0, the G1 Garbage Collector, and Project Coin (JSR-334) features Get supplemental references to development, CM, and test tools; libraries; IDEs; and Java-related scripting languages Find information to help you prepare for the Oracle Certified Associate Java SE 7 Programmer I exam","language":"en","currency":"USD","id":"1449343767","title":"Java 7 Pocket Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HcIDAAAAQBAJ&source=gbs_api","authors":["Robert Liguori","Patricia Liguori"]},{"pageCount":928,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZGmzqnnu904C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":91,"subtitle":null,"description":"Covers fundamental and advanced Java database programmingtechniques for beginning and experienced readers This book covers the practical considerations and applicationsin database programming using Java NetBeans IDE, JavaServer Pages,JavaServer Faces, and Java Beans, and comes complete with authenticexamples and detailed explanations. Two data-action methods are developed and presented in thisimportant resource. With Java Persistence API and plug-in Tools,readers are directed step by step through the entire databaseprogramming development process and will be able to design andbuild professional data-action projects with a few lines of code inmere minutes. The second method, runtime object, allows readers todesign and build more sophisticated and practical Java databaseapplications. Advanced and updated Java database programming techniques suchas Java Enterprise Edition development kits, Enterprise Java Beans,JavaServer Pages, JavaServer Faces, Java RowSet Object, and JavaUpdatable ResultSet are also discussed and implemented withnumerous example projects. Ideal for classroom and professional training use, this textalso features: A detailed introduction to NetBeans Integrated DevelopmentEnvironment Java web-based database programming techniques (webapplications and web services) More than thirty detailed, real-life sample projects analyzedvia line-by-line illustrations Problems and solutions for each chapter A wealth of supplemental material available for download fromthe book's ftp site, including PowerPoint slides, solution manual,JSP pages, sample image files, and sample databases Coverage of two popular database systems: SQL Server 2008 andOracle This book provides undergraduate and graduate students as wellas database programmers and software engineers with the necessarytools to handle the database programming issues in the JavaNetBeans environment. To obtain instructor materials please send an email to:pressbooks@ieee.org","language":"en","currency":"USD","id":"1118104692","title":"Practical Database Programming with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZGmzqnnu904C&source=gbs_api","authors":["Ying Bai"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VY92BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"The book is aimed at Java developers who wish to develop Java EE applications while taking advantage of NetBeans functionality to automate repetitive tasks. Familiarity with NetBeans or Java EE is not assumed.","language":"en","currency":"USD","id":"1783983531","title":"Java EE 7 Development with NetBeans 8","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VY92BgAAQBAJ&source=gbs_api","authors":["David R. Heffelfinger"]},{"pageCount":380,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fW88AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Java 7 Compatible","description":"Since the second edition of this text, the use of the Internet and networks generally has continued to expand at a phenomenal rate. This has led to both an increase in demand for network software and to improvements in the technology used to run such networks, with the latter naturally leading to changes in the former. During this time, the Java libraries have been updated to keep up with the new developments in network technology, so that the Java programming language continues to be one of the mainstays of network software development. In providing a very readable text that avoids getting immersed in low-level technical details, while still providing a useful, practical guide to network programming for both undergraduates and busy IT professionals, this third edition continues the trend of its predecessors. To retain its currency, the text has been updated to reflect changes that have taken place in Java's network technology over the past seven years (including the release of Java 7), whilst retaining its notable features of numerous code examples, screenshots and end-of-chapter exercises.","language":"en","currency":"USD","id":"1447152549","title":"An Introduction to Network Programming with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fW88AAAAQBAJ&source=gbs_api","authors":["Jan Graba"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Gr8vWj7YvFkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Austin Sincock provides step-by-step real-world examples for developing Enterprise Java applications on SAP. His is the first title that uses open-source software to help developers learn and use Java for SAP. Bridges the gap between SAP’s language ABAP and object-oriented Java Provides a complete look at SAP’s Java connector, JCo Demonstrates graphical application development for SAP using Java’s Swing libraries Shows how to deploy and build Java applications on the Tomcat Java application server Teaches how to deploy the Java-based HypersonicSQL database, use SQL to populate the database, and tie the external database into an SAP system with Java","language":"en","currency":"USD","id":"1430208112","title":"Enterprise Java for SAP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Gr8vWj7YvFkC&source=gbs_api","authors":["Austin Sincock"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EK43StEVfJIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.1,"subtitle":null,"description":"Threads are a fundamental part of the Java platform. As multicore processors become the norm, using concurrency effectively becomes essential for building high-performance applications. Java SE 5 and 6 are a huge step forward for the development of concurrent applications, with improvements to the Java Virtual Machine to support high-performance, highly scalable concurrent classes and a rich set of new concurrency building blocks. In Java Concurrency in Practice , the creators of these new facilities explain not only how they work and how to use them, but also the motivation and design patterns behind them. However, developing, testing, and debugging multithreaded programs can still be very difficult; it is all too easy to create concurrent programs that appear to work, but fail when it matters most: in production, under heavy load. Java Concurrency in Practice arms readers with both the theoretical underpinnings and concrete techniques for building reliable, scalable, maintainable concurrent applications. Rather than simply offering an inventory of concurrency APIs and mechanisms, it provides design rules, patterns, and mental models that make it easier to build concurrent programs that are both correct and performant. This book covers: Basic concepts of concurrency and thread safety Techniques for building and composing thread-safe classes Using the concurrency building blocks in java.util.concurrent Performance optimization dos and don'ts Testing concurrent programs Advanced topics such as atomic variables, nonblocking algorithms, and the Java Memory Model","language":"en","currency":"USD","id":"9780132702256","title":"Java Concurrency in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EK43StEVfJIC&source=gbs_api","authors":["Tim Peierls","Brian Goetz","Joshua Bloch","Joseph Bowbeer","Doug Lea","David Holmes"]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FFcTpMi3aKQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":91,"subtitle":null,"description":"Broad in scope, involving theory, the application of that theory, and programming technology, compiler construction is a moving target, with constant advances in compiler technology taking place. Today, a renewed focus on do-it-yourself programming makes a quality textbook on compilers, that both students and instructors will enjoy using, of even more vital importance. This book covers every topic essential to learning compilers from the ground up and is accompanied by a powerful and flexible software package for evaluating projects, as well as several tutorials, well-defined projects, and test cases.","language":"en","currency":"USD","id":"1118112776","title":"Compiler Construction Using Java, JavaCC, and Yacc","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FFcTpMi3aKQC&source=gbs_api","authors":["Anthony J. Dos Reis"]},{"pageCount":580,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2kNMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.99,"subtitle":"Complete Java Programming Guide.","description":"Essential Java Skills--Made Easy! What Special – In this book I covered and explained several topics of latest Java 8 Features in detail for Developers & Fresher’s, Topics Like– Lambdas. || Java 8 Functional interface, || Stream and Time API in Java 8. This Java book doesn't require previous programming experience. However, if you come from a C or C++ programming background, then you will be able to learn faster. Learn the all basics and advanced features of Java programming in no time from Bestseller Java Programming Author Harry. H. Chaudhary (More than 1,67,000 Books Sold !). This Java Guide, starts with the basics and Leads to Advance features of Java in detail with thousands of Java Codes and new features of Java 8 like Lambdas. Java 8 Functional interface, || Stream and Time API in Java 8. , I promise this book will make you expert level champion of java. Anyone can learn java through this book at expert level. The main objective of this java book is not to give you just Java Programming Knowledge, I have followed a pattern of improving the question solution of thousands of Codes with clear theory explanations with different Java complexities for each java topic problem, and you will find multiple solutions for complex java problems. Engineering Students and fresh developers can also use this book. This book covers common core syllabus for all Computer Science Professional Degrees If you are really serious then go ahead and make your day with this ultimate java book. First Part- Teach you how to compile and run a Java program, shows you everything you need to develop, compile, debug, and run Java programs. And then discusses the keywords, syntax, and constructs that form the core of the Java language. After that it leads you to advanced features of java, including multithreaded programming and Applets. Learning a new language is no easy task especially when it’s an oop’s programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. This Java Book is very serious java stuff: A complete introduction to Java. You'll learn everything from the fundamentals to advanced topics, if you've read this book, you know what to expect--a visually rich format designed for the way your brain works. To use this book does not require any previous programming experience. However, if you come from a C\/C++ background, then you will be able to advance a bit more rapidly. As most readers will know, Java is similar, in form and spirit, to C\/C++. Thus, knowledge of those languages helps, but is not necessary. Even if you have never programmed before, you can learn to program in Java using this book. Inside Contents (Chapters): 1. (Overview of Java) 2.(Java Language) 3.(Control Statements) 4.(Scanner class, Arrays & Command Line Args) 5.(Class & Objects in Java) 6.(Inheritance in Java) 7.(Object oriented programming) 8.(Packages in Java) 9.(Interface in Java) 10.(String and StringBuffer) 11.(Exception Handling) 12.(Multi-Threaded Programming) 13.(Modifiers\/Visibility modes) 14.(Wrapper Class) 15.(Input\/Output in Java) 16.(Applet Fundamentals) 17.(Abstract Windows Toolkit)(AWT) 18.(Introduction To AWT Events) 19.(Painting in AWT) 20.( java.lang.Object Class ) 21.(Collection Framework) PART - II (Java 8 Features for Developers) 22. Java 8 Features for Developers – Lambdas. 23. Java 8 Functional interface,Stream & Time API. 24. Key Features that Make Java More Secure than Other Languages.","language":"en","currency":"USD","id":"1500865109","title":"Core Java Professional : Think Twice - Code Once,","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2kNMBAAAQBAJ&source=gbs_api","authors":["Harry. H. Chaudhary.","Java Guru."]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W63YTzab8gkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.49,"subtitle":"Solutions to Real-World Problems","description":"Java and XML, 3rd Edition, shows you how to cut through all the hype about XML and put it to work. It teaches you how to use the APIs, tools, and tricks of XML to build real-world applications. The result is a new approach to managing information that touches everything from configuration files to web sites. After two chapters on XML basics, including XPath, XSL, DTDs, and XML Schema, the rest of the book focuses on using XML from your Java applications. This third edition of Java and XML covers all major Java XML processing libraries, including full coverage of the SAX, DOM, StAX, JDOM, and dom4j APIs as well as the latest version of the Java API for XML Processing (JAXP) and Java Architecture for XML Binding (JAXB). The chapters on web technology have been entirely rewritten to focus on the today's most relevant topics: syndicating content with RSS and creating Web 2.0 applications. You'll learn how to create, read, and modify RSS feeds for syndicated content and use XML to power the next generation of websites with Ajax and Adobe Flash. Topics include: The basics of XML, including DTDs, namespaces, XML Schema, XPath, and Transformations The SAX API, including all handlers, filters, and writers The DOM API, including DOM Level 2, Level 3, and the DOM HTML module The JDOM API, including the core and a look at XPath support The StAX API, including StAX factories, producing documents and XMLPull Data Binding with JAXB, using the new JAXB 2.0 annotations Web syndication and podcasting with RSS XML on the Presentation Layer, paying attention to Ajax and Flash applications If you are developing with Java and need to use XML, or think that you will be in the future; if you're involved in the new peer-to-peer movement, messaging, or web services; or if you're developing software for electronic commerce, Java and XML will be an indispensable companion.","language":"en","currency":"USD","id":"9780596552282","title":"Java and XML","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W63YTzab8gkC&source=gbs_api","authors":["Brett McLaughlin","Justin Edelson"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NYYQZozaFTUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"* Includes complete decompiler source * Includes complete obfuscator source * Includes a comprehensive chapter on strategies for protecting your code * Covers the basic theory behind many of the decompilers and obfuscators available on the market","language":"en","currency":"USD","id":"1430207396","title":"Decompiling Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NYYQZozaFTUC&source=gbs_api","authors":["Godfrey Nolan"]},{"pageCount":688,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KwwmBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"","description":"Updated for Java SE 8, this book teaches the three most important topics in Java programming: the language syntax, object-oriented programming (OOP) and Java core libraries. This book introduces important programming concepts and is a guide to building real-world applications, both desktop and web-based. The coverage is the most comprehensive one can find in a beginner's book.","language":"en","currency":"USD","id":"0992133041","title":"Java: A Beginner's Tutorial (4th Edition)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KwwmBgAAQBAJ&source=gbs_api","authors":["Budi Kurniawan"]},{"pageCount":102,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ORNjAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":66.09,"subtitle":null,"description":"Inhaltsangabe:Abstract: Distributed computing is playing an increasingly important role in many areas of industry, the sciences, in business processes and in the development of new and emerging technologies. It facilitates inter-process communication across heterogeneous networks, hardware platforms and operating systems. We compare four distributed and object-oriented architectures: Sockets in Java 2, Sockets in Berkeley Unix, Remote Method Invocation in Java - RMI - and the Common Object Request Broker Architecture - CORBA - of the Object Management Group consortium. We provide a survey of each of the distributed architectures including its constituting components. To present the architectures in a practical context, we amend each survey with a corresponding application framework. We conclude with a comparative study of the Socket APIs in Java 2 and in Berkeley UNIX and the distributed object models of Java RMI and CORBA. Although the distributed object model as defined by CORBA represents an adopted industry standard, Java RMI has features unattainable by CORBA. The first part of the discussion offers a comprehensive overview of the Socket architecture in Java 2 and Berkeley UNIX and the distributed object model of Java Remote Method Invocation and the Common Object Request Broker Architecture. The second part concludes the discussion with a comparative study of selected features with emphasis on the Common Object Request Broker Architecture and Java Remote Method Invocation. Chapter 1 - The TCP\/IP Protocol Suite: We provide an introductory overview of the TCP\/IP protocol suite and its architecture including layers and protocols. The TCP\/IP architecture is based on three concepts: processes, layers and protocols. There is no official protocol model as compared to the OSI proposal. We can however devise a logical structure of the TCP\/IP protocol suit based on the associated protocols and their relationships. The chapter concludes with a brief discussion of Internet-related organizations and standards. Chapter 2 - Sockets in Berkeley Unix: We present the Berkeley UNIX socket architecture in relation to the Internet communication domain and illustrate connection-oriented and connectionless models of communication. The socket architecture forms the basis for the development of distributed applications. A socket represents an endpoint of communication for connectionless or connection-oriented protocols. A socket address data structure [...]","language":"en","currency":"USD","id":"3832493336","title":"Distributed Object-Oriented Architectures: Sockets, Java RMI and CORBA","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ORNjAQAAQBAJ&source=gbs_api","authors":["Josef Stepisnik"]},{"pageCount":832,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bJxMrFjg544C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.56,"subtitle":null,"description":"Written by industry thought leaders, Java Web Services Architecture is a no-nonsense guide to web services technologies including SOAP, WSDL, UDDI and the JAX APIs. This book is useful for systems architects and provides many of the practical considerations for implementing web services including authorization, encryption, transactions and the future of Web Services. Covers all the standards, the JAX APIs, transactions, security, and more.","language":"en","currency":"USD","id":"9780080509570","title":"Java Web Services Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bJxMrFjg544C&source=gbs_api","authors":["James McGovern","Sameer Tyagi","Michael Stevens","Sunil Mathew"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bCvcMcLZwV4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"TestNG and Advanced Concepts","description":"Enterprise Java developers must achieve broader, deeper test coverage, going beyond unit testing to implement functional and integration testing with systematic acceptance. Next Generation Java™ Testing introduces breakthrough Java testing techniques and TestNG, a powerful open source Java testing platform. Cédric Beust, TestNG's creator, and leading Java developer Hani Suleiman, present powerful, flexible testing patterns that will work with virtually any testing tool, framework, or language. They show how to leverage key Java platform improvements designed to facilitate effective testing, such as dependency injection and mock objects. They also thoroughly introduce TestNG, demonstrating how it overcomes the limitations of older frameworks and enables new techniques, making it far easier to test today's complex software systems. Pragmatic and results-focused, Next Generation Java™ Testing will help Java developers build more robust code for today's mission-critical environments. This book Illuminates the tradeoffs associated with testing, so you can make better decisions about what and how to test Introduces TestNG, explains its goals and features, and shows how to apply them in real-world environments Shows how to integrate TestNG with your existing code, development frameworks, and software libraries Demonstrates how to test crucial code features, such as encapsulation, state sharing, scopes, and thread safety Shows how to test application elements, including JavaEE APIs, databases, Web pages, and XML files Presents advanced techniques: testing partial failures, factories, dependent testing, remote invocation, cluster-based test farms, and more Walks through installing and using TestNG plug-ins for Eclipse, and IDEA Contains extensive code examples Whether you use TestNG, JUnit, or another testing framework, the testing design patterns presented in this book will show you how to improve your tests by giving you concrete advice on how to make your code and your design more testable.","language":"en","currency":"USD","id":"9780132702270","title":"Next Generation Java Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bCvcMcLZwV4C&source=gbs_api","authors":["Cédric Beust","Hani Suleiman"]},{"pageCount":210,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYWnHfz5jRUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":"A Quick Reference for Simplified Enterprise Java Development","description":"This handy guide provides an overview of Java Enterprise Edition 6’s main technologies and includes extensive, easy-to-understand code samples that demonstrate the platform’s many improvements. You’ll quickly understand how Java EE 6 simplifies the process of developing and deploying web and enterprise applications. Explore what’s new in Java EE 6, including Contexts and Dependency Injection and the Java API for RESTful Web Services Discover how Java EE 6 features relate to design patterns in web and enterprise applications Get the specifications for making your application Java EE compliant Learn about revisions to Enterprise JavaBeans, JavaServer Faces, and other components Find out how Java EE 6 profiles change the platform’s “one size fits all” approach Get started with Java EE 6 development and deployment, using NetBeans IDE and GlassFish","language":"en","currency":"USD","id":"1449338348","title":"Java EE 6 Pocket Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYWnHfz5jRUC&source=gbs_api","authors":["Arun Gupta"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KXQrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Brain-Friendly Guide","description":"Learning a complex new language is no easy task especially when it s an object-oriented computer programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. It's constantly searching, scanning, waiting for something unusual to happen. After all, that's the way it was built to help you stay alive. It takes all the routine, ordinary, dull stuff and filters it to the background so it won't interfere with your brain's real work--recording things that matter. How does your brain know what matters? It's like the creators of the Head First approach say, suppose you're out for a hike and a tiger jumps in front of you, what happens in your brain? Neurons fire. Emotions crank up. Chemicals surge. That's how your brain knows. And that's how your brain will learn Java. Head First Java combines puzzles, strong visuals, mysteries, and soul-searching interviews with famous Java objects to engage you in many different ways. It's fast, it's fun, and it's effective. And, despite its playful appearance, Head First Java is serious stuff: a complete introduction to object-oriented programming and Java. You'll learn everything from the fundamentals to advanced topics, including threads, network sockets, and distributed programming with RMI. And the new. second edition focuses on Java 5.0, the latest version of the Java language and development platform. Because Java 5.0 is a major update to the platform, with deep, code-level changes, even more careful study and implementation is required. So learning the Head First way is more important than ever. If you've read a Head First book, you know what to expect--a visually rich format designed for the way your brain works. If you haven't, you're in for a treat. You'll see why people say it's unlike any other Java book you've ever read. By exploiting how your brain works, Head First Java compresses the time it takes to learn and retain--complex information. Its unique approach not only shows you what you need to know about Java syntax, it teaches you to think like a Java programmer. If you want to be bored, buy some other book. But if you want to understand Java, this book's for you.","language":"en","currency":"USD","id":"1449331440","title":"Head First Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KXQrAQAAQBAJ&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kSiDAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"75 Recommendations for Reliable and Secure Programs","description":"“A must-read for all Java developers. . . . Every developer has a responsibility to author code that is free of significant security vulnerabilities. This book provides realistic guidance to help Java developers implement desired functionality with security, reliability, and maintainability goals in mind.” –Mary Ann Davidson, Chief Security Officer, Oracle Corporation Organizations worldwide rely on Java code to perform mission-critical tasks, and therefore that code must be reliable, robust, fast, maintainable, and secure. Java™ Coding Guidelines brings together expert guidelines, recommendations, and code examples to help you meet these demands. Written by the same team that brought you The CERT® Oracle ® Secure Coding Standard for Java™, this guide extends that previous work’s expert security advice to address many additional quality attributes. You’ll find 75 guidelines, each presented consistently and intuitively. For each guideline, conformance requirements are specified; for most, noncompliant code examples and compliant solutions are also offered. The authors explain when to apply each guideline and provide references to even more detailed information. Reflecting pioneering research on Java security, Java™ Coding Guidelines offers updated techniques for protecting against both deliberate attacks and other unexpected events. You’ll find best practices for improving code reliability and clarity, and a full chapter exposing common misunderstandings that lead to suboptimal code. With a Foreword by James A. Gosling, Father of the Java Programming Language","language":"en","currency":"USD","id":"0133439542","title":"Java Coding Guidelines","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kSiDAAAAQBAJ&source=gbs_api","authors":["Fred Long","Dhruv Mohindra","Robert C. Seacord","Dean F. Sutherland","David Svoboda"]},{"pageCount":64,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DVnQxlAHbEIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A practical, focused mini book for creating Web Services in Java 7.","language":"en","currency":"USD","id":"1849687218","title":"Java 7 Jax-Ws Web Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DVnQxlAHbEIC&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":536,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hN9ow0asWaEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Java Enterprise Edition (Java EE) continues to be one of the leading Java technologies and platforms from Oracle (previously Sun). Beginning Java EE 6 Platform with GlassFish 3, Second Edition is this first tutorial book on the final version of the Java EE 6 Platform. Step by step and easy to follow, this book describes many of the Java EE 6 specifications and reference implementations, and shows them in action using practical examples. This book uses the new version of GlassFish 3 to deploy and administer the code examples. Written by an expert member of the Java EE 6 specification request and review board in the Java Community Process (JCP), this book contains the best information possible, from an expert’s perspective on enterprise Java technologies.","language":"en","currency":"USD","id":"1430228903","title":"Beginning Java EE 6 with GlassFish 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hN9ow0asWaEC&source=gbs_api","authors":["Antonio Goncalves"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g5AwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Simple Solutions to Difficult Problems in Java 8 and 9","description":"The introduction of functional programming concepts in Java SE 8 was a drastic change for this venerable object-oriented language. Lambda expressions, method references, and streams fundamentally changed the idioms of the language, and many developers have been trying to catch up ever since. This cookbook will help. With more than 70 detailed recipes, author Ken Kousen shows you how to use the newest features of Java to solve a wide range of problems. For developers comfortable with previous Java versions, this guide covers nearly all of Java SE 8, and includes a chapter focused on changes coming in Java 9. Need to understand how functional idioms will change the way you write code? This cookbook—chock full of use cases—is for you. Recipes cover: The basics of lambda expressions and method references Interfaces in the java.util.function package Stream operations for transforming and filtering data Comparators and Collectors for sorting and converting streaming data Combining lambdas, method references, and streams Creating instances and extract values from Java’s Optional type New I\/O capabilities that support functional streams The Date-Time API that replaces the legacy Date and Calendar classes Mechanisms for experimenting with concurrency and parallelism","language":"en","currency":"USD","id":"1491973129","title":"Modern Java Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g5AwDwAAQBAJ&source=gbs_api","authors":["Ken Kousen"]},{"pageCount":518,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tMjZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"An Introduction to Real-World Programming with Java","description":"If you’re new to Java—or new to programming—this best-selling book will guide you through the language features and APIs of Java 11. With fun, compelling, and realistic examples, authors Marc Loy, Patrick Niemeyer, and Daniel Leuck introduce you to Java fundamentals—including its class libraries, programming techniques, and idioms—with an eye toward building real applications. You’ll learn powerful new ways to manage resources and exceptions in your applications—along with core language features included in recent Java versions. Develop with Java, using the compiler, interpreter, and other tools Explore Java’s built-in thread facilities and concurrency package Learn text processing and the powerful regular expressions API Write advanced networked or web-based applications and services","language":"en","currency":"USD","id":"1492056227","title":"Learning Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tMjZDwAAQBAJ&source=gbs_api","authors":["Marc Loy","Patrick Niemeyer","Daniel Leuck"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SJ7aBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Java is an exciting new object-oriented technology. Hardware for supporting objects and other features of Java such as multithreading, dynamic linking and loading is the focus of this book. The impact of Java's features on micro-architectural resources and issues in the design of Java-specific architectures are interesting topics that require the immediate attention of the research community. While Java has become an important part of desktop applications, it is now being used widely in high-end server markets, and will soon be widespread in low-end embedded computing. Java Microarchitectures contains a collection of papers providing a snapshot of the state of the art in hardware support for Java. The book covers the behavior of Java applications, embedded processors for Java, memory system design, and high-performance single-chip architectures designed to execute Java applications efficiently.","language":"en","currency":"USD","id":"1461509939","title":"Java Microarchitectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SJ7aBwAAQBAJ&source=gbs_api","authors":["Vijaykrishnan Narayanan","Mario L. Wolczko"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHT3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"Java—from first steps to first apps Knowing Java is a must-have programming skill for any programmer. It’s used in a wide array of programming projects—from enterprise apps and mobile apps to big data, scientific, and financial uses. The language regularly ranks #1 in surveys of the most popular language based on number of developers, lines of code written, and real-world usage. It’s also the language of choice in AP Computer Science classes taught in the U.S. This guide provides an easy-to-follow path from understanding the basics of writing Java code to applying those skills to real projects. Split into eight minibooks covering core aspects of Java, the book introduces the basics of the Java language and object-oriented programming before setting you on the path to building web apps and databases. • Get up to speed on Java basics • Explore object-oriented programming • Learn about strings, arrays, and collections • Find out about files and databases Step-by-step instructions are provided to ensure that you don't get lost at any point along the way.","language":"en","currency":"USD","id":"1119680484","title":"Java All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHT3DwAAQBAJ&source=gbs_api","authors":["Doug Lowe"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F5vSBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":151.2,"subtitle":"Techniques and Implementation","description":"This book presents key machine vision techniques and algorithms, along with the associated Java source code. Special features include a complete self-contained treatment of all topics and techniques essential to the understanding and implementation of machine vision; an introduction to object-oriented programming and to the Java programming language, with particular reference to its imaging capabilities; Java source code for a wide range of real-world image processing and analysis functions; an introduction to the Java 2D imaging and Java Advanced Imaging (JAI) API; and a wide range of illustrative examples.","language":"en","currency":"USD","id":"1447102517","title":"Machine Vision Algorithms in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F5vSBwAAQBAJ&source=gbs_api","authors":["Paul F. Whelan","Derek Molloy"]},{"pageCount":648,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fZAwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry","description":"What separates the traditional enterprise from the likes of Amazon, Netflix, and Etsy? Those companies have refined the art of cloud native development to maintain their competitive edge and stay well ahead of the competition. This practical guide shows Java\/JVM developers how to build better software, faster, using Spring Boot, Spring Cloud, and Cloud Foundry. Many organizations have already waded into cloud computing, test-driven development, microservices, and continuous integration and delivery. Authors Josh Long and Kenny Bastani fully immerse you in the tools and methodologies that will help you transform your legacy application into one that is genuinely cloud native. In four sections, this book takes you through: The Basics: learn the motivations behind cloud native thinking; configure and test a Spring Boot application; and move your legacy application to the cloud Web Services: build HTTP and RESTful services with Spring; route requests in your distributed system; and build edge services closer to the data Data Integration: manage your data with Spring Data, and integrate distributed services with Spring’s support for event-driven, messaging-centric architectures Production: make your system observable; use service brokers to connect stateful services; and understand the big ideas behind continuous delivery","language":"en","currency":"USD","id":"144937459X","title":"Cloud Native Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fZAwDwAAQBAJ&source=gbs_api","authors":["Josh Long","Kenny Bastani"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zvkCCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":143.2,"subtitle":null,"description":"Enterprise Java experts John Hunt and Chris Loftus take the reader through the core technologies that make up the Enterprise Edition of the Java 2 platform (J2EE). They cover all the aspects of J2EE that both the professional and student needs to know to build multi-tier enterprise applications in Java. This includes the various technologies, design methodology, and design patterns. The text contains fully worked examples, built up throughout the book, which enables the reader to quickly develop multi-tier applications. An invaluable text for those who want to build enterprise wide applications in Java.","language":"en","currency":"USD","id":"1447100174","title":"Guide to J2EE: Enterprise Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zvkCCAAAQBAJ&source=gbs_api","authors":["John Hunt","Chris Loftus"]},{"pageCount":848,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h147IhQ5mSwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":null,"description":"The #1 introduction to J2SE 1.5 and enterprise\/server-side development! An international bestseller for eight years, Just Java™ 2 is the complete, accessible Java tutorial for working programmers at all levels. Fully updated and revised, this sixth edition is more than an engaging overview of Java 2 Standard Edition (J2SE 1.5) and its libraries: it’s also a practical introduction to today’s best enterprise and server-side programming techniques. Just Java™ 2, Sixth Edition, reflects both J2SE 1.5 and the latest Tomcat and servlet specifications. Extensive new coverage includes: New chapters on generics and enumerated types New coverage of Web services, with practical examples using Google and Amazon Web services Simplified interactive I\/O with printf() Autoboxing and unboxing of primitive types Static imports, foreach loop construct, and other new language features Peter van der Linden delivers expert advice, clear explanations, and crisp sample programs throughout–including dozens new to this edition. Along the way, he introduces: The core language: syntax, objects, interfaces, nested classes, compiler secrets, and much more Key libraries: date and calendar, pattern matching, network software, mapped I\/O, utilities and generic collections Server-side technology: network server systems, a complete tiny HTML Web server, and XML in Java Enterprise J2EE: Sql and JDBC™ tutorial, servlets and JSP and much more Client-side Java: fundamentals of JFC\/Swing GUI development, new class data sharing details Companion Web Site All the book’s examples and sample programs are available at http:\/\/afu.com.","language":"en","currency":"USD","id":"9780137009909","title":"Just Java 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h147IhQ5mSwC&source=gbs_api","authors":["Peter van der Linden"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FFpzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"The Big Picture","description":"The Definitive Guide to Java Platform, Enterprise Edition 7 Java EE 7: The Big Picture uniquely explores the entire Java EE 7 platform in an all-encompassing style while examining each tier of the platform in enough detail so that you can select the right technologies for specific project needs. In this authoritative guide, Java expert Danny Coward walks you through the code, applications, and frameworks that power the platform. Take full advantage of the robust capabilities of Java EE 7, increase your productivity, and meet enterprise demands with help from this Oracle Press resource. Explore the features of the Java servlet model and Java servlet API Create dynamic web content with JavaServer Pages and JavaServer Faces Build websites for nonbrowser clients with JAX-RS Push data to web clients using Java WebSockets Secure web applications Work with web component APIs Maximize enterprise beans for multithreading, asynchronous processes, transactions, and more Access relational databases with the Java Database Connectivity APIs and the Java Persistence API Understand the packaging and deployment mechanisms of Java EE applications Work with Java EE Contexts and Dependency Injection Secure enterprise beans in a Java EE application Enable parallel processing with Java EE concurrency APIs","language":"en","currency":"USD","id":"0071837337","title":"Java EE 7: The Big Picture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FFpzAwAAQBAJ&source=gbs_api","authors":["Danny Coward"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uMa5ckEbRXwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.99,"subtitle":"Web Publishing with XML and Java","description":"Thanks to the tireless efforts of open-source developers, Cocoonhas quickly gained visibility as the preeminent XML-based Webpublishing framework. Unfortunately, its documentation remains asignificant shortcoming. If you're new to Cocoon, gaining a senseof exactly what you can do with it can be difficult, and actuallygetting started can be even harder. Cocoon 2 Programming: Web Publishing with XML and Java clearlyexplains the value of Cocoon and helps you build on yourfamiliarity with XML and Java Servlets as you design, build, andimplement a range of Cocoon applications. You'll begin by learningto control presentation for various platforms, both wired andwireless. Then you'll move on to Cocoon's capabilities for logiccontrol and content management, using both sitemaps and XSP tocreate a site dynamically generated from a variety of data sourcesand types. As you'll see, Cocoon also supports powerful organizing techniquesknown as design patterns, and you'll master their use in bothpresentation and content generation. These are essential tools forthe planning of your site; for after it's implemented, you'llcommand powerful techniques for site management andoptimization. The Web's dependence on XML is growing rapidly--and with it thelist of companies that have adopted Cocoon. Is Cocoon for you?Cocoon 2 Programming will guide you through your decision and farbeyond, providing all the assistance you need to build a dynamic,XML-based site--and keep moving into the future.","language":"en","currency":"USD","id":"9780782151572","title":"Cocoon 2 Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uMa5ckEbRXwC&source=gbs_api","authors":["Bill Brogden","Conrad D'Cruz","Mark Gaither"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Vwf9CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Exam 1Z0-809","description":"Complete, trusted preparation for the Java Programmer II exam OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide is your comprehensive companion for preparing for Exam 1Z0-809 as well as upgrade Exam 1Z0-810 and Exam 1Z0-813. With full coverage of 100% of exam objectives, this invaluable guide reinforces what you know, teaches you what you don't know, and gives you the hands-on practice you need to boost your skills. Written by expert Java developers, this book goes beyond mere exam prep with the insight, explanations and perspectives that come from years of experience. You'll review the basics of object-oriented programming, understand functional programming, apply your knowledge to database work, and much more. From the basic to the advanced, this guide walks you through everything you need to know to confidently take the OCP 1Z0-809 Exam and upgrade exams 1Z0-810 and 1Z0-813. Java 8 represents the biggest changes to the language to date, and the latest exam now requires that you demonstrate functional programming competence in order to pass. This guide has you covered, with clear explanations and expert advice. Understand abstract classes, interfaces, and class design Learn object-oriented design principles and patterns Delve into functional programming, advanced strings, and localization Master IO, NIO, and JDBC with expert-led database practice If you're ready to take the next step in your IT career, OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide is your ideal companion on the road to certification.","language":"en","currency":"USD","id":"111906788X","title":"OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Vwf9CgAAQBAJ&source=gbs_api","authors":["Jeanne Boyarsky","Scott Selikoff"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YRXOvf2VZRAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":null,"description":"Scientific Data Analysis using Jython Scripting and Java presents practical approaches for data analysis using Java scripting based on Jython, a Java implementation of the Python language. The chapters essentially cover all aspects of data analysis, from arrays and histograms to clustering analysis, curve fitting, metadata and neural networks. A comprehensive coverage of data visualisation tools implemented in Java is also included. Written by the primary developer of the jHepWork data-analysis framework, the book provides a reliable and complete reference source laying the foundation for data-analysis applications using Java scripting. More than 250 code snippets (of around 10-20 lines each) written in Jython and Java, plus several real-life examples help the reader develop a genuine feeling for data analysis techniques and their programming implementation. This is the first data-analysis and data-mining book which is completely based on the Jython language, and opens doors to scripting using a fully multi-platform and multi-threaded approach. Graduate students and researchers will benefit from the information presented in this book.","language":"en","currency":"USD","id":"9781849962872","title":"Scientific Data Analysis using Jython Scripting and Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YRXOvf2VZRAC&source=gbs_api","authors":["Sergei V. Chekanov"]},{"pageCount":540,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7j2TDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"A Game Application Approach","description":"This is a one-semester, introductory programming textbook in Java that uses game applications as a central pedagogical tool to improve student engagement, learning outcomes, and retention. Game programming is incorporated into the text in a way that does not compromise the amount of material traditionally covered in a basic programming course and permits instructors who are not familiar with game programming and computer graphics concepts to realize the verified pedagogical advantages of game applications. The companion disc includes a game environment that is easily integrated into projects created with the popular Java Development Environments, including Eclipse, NetBeans, and JCreator in a student-friendly way and also includes a set of executable student games to pique their interest by giving them a glimpse into their future capabilities. The material presented in the book is in full compliance with the 2013 ACM\/IEEE computer science curriculum guidelines. It has been used to teach programming to students whose majors are within and outside of the computing fields. Ancillaries include a comprehensive instructor’s resource disc with programming solutions, slides, quizzes, projects, and more. FEATURES: * Uses an objects-early approach to learning Java * Follows the 2013 ACM\/IEEE computer science curriculum guidelines * Integrates game applications as a central pedagogical tool to improve student engagement, learning outcomes, and retention * Includes a companion disc with projects created with the popular Java Development Environments; also includes a set of executable student games, source code, and figures * Uses working programs to illustrate concepts under discussion * Complete instructor’s resource package available upon adoption","language":"en","currency":"USD","id":"1683920384","title":"Programming Essentials Using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7j2TDgAAQBAJ&source=gbs_api","authors":["William McAllister","S. Jane Fritz"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=awnmD1w4_T8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Secrets of the Java Masters","description":"Java has quickly become one of the most important languages in programming, particularly for professional and enterprise-level projects. From its infancy as a language primarily used for web applets to its maturity through servlets, Enterprise JavaBeans, and database access, Java has become a complex and robust tool for today's developer.Hardcore Java takes this language and breaks it apart, piece by piece, revealing the important secrets and tricks that will take you from a junior-level programmer to a seasoned and expert developer. You'll fly through the fundamentals and quickly find yourself learning about advanced memory management techniques, optimization and bytecode-level enhancements, and the techniques required to build lightning-fast GUIs. Throughout the book, you'll also master the art of writing and maintaining bulletproof and error-proof code, all while grasping the intricacies of the Java language.Hardcore Java covers: Use of the final keyword to optimize and protect your Java classes. Complete and thorough coverage of all types of nested classes, including how to optimize anonymous and inner classes. Detailed discussion of immutable objects, including unique tips on when to use them (and when not to). Elimination of bugs through exception-handling management. In-depth studies of constants, including their impact on the Java memory model. The most thorough discussion of reflection in print, moving far beyond other books' \"Hello World\" coverage. Construction and use of dynamic proxies, in both Java Standard and Enterprise editions. Expansive coverage of weak references, including usage patterns and their role in garbage collection and memory management. Hardcore Java is an invaluable addition to every programmer's library, and even the most advanced developers will find themselves moving beyond their own conceptions into truly advanced applications of the language. Thousands of lines of code, heavily commented and easily runnable, illustrate each concept in the book.","language":"en","currency":"USD","id":"9780596552442","title":"Hardcore Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=awnmD1w4_T8C&source=gbs_api","authors":["Robert Simmons Jr"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h12VBGKX9fsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"“The definitive master class in performance tuning Java applications…if you love all the gory details, this is the book for you.” –James Gosling, creator of the Java Programming Language Improvements in the Java platform and new multicore\/multiprocessor hardware have made it possible to dramatically improve the performance and scalability of Java software. Java™ Performance covers the latest Oracle and third-party tools for monitoring and measuring performance on a wide variety of hardware architectures and operating systems. The authors present dozens of tips and tricks you’ll find nowhere else. You’ll learn how to construct experiments that identify opportunities for optimization, interpret the results, and take effective action. You’ll also find powerful insights into microbenchmarking–including how to avoid common mistakes that can mislead you into writing poorly performing software. Then, building on this foundation, you’ll walk through optimizing the Java HotSpot VM, standard and multitiered applications; Web applications, and more. Coverage includes Taking a proactive approach to meeting application performance and scalability goals Monitoring Java performance at the OS level in Windows, Linux, and Oracle Solaris environments Using modern Java Virtual Machine (JVM) and OS observability tools to profile running systems, with almost no performance penalty Gaining “under the hood” knowledge of the Java HotSpot VM that can help you address most Java performance issues Integrating JVM-level and application monitoring Mastering Java method and heap (memory) profiling Tuning the Java HotSpot VM for startup, memory footprint, response time, and latency Determining when Java applications require rework to meet performance goals Systematically profiling and tuning performance in both Java SE and Java EE applications Optimizing the performance of the Java HotSpot VM Using this book, you can squeeze maximum performance and value from all your Java applications–no matter how complex they are, what platforms they’re running on, or how long you’ve been running them.","language":"en","currency":"USD","id":"0132905248","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h12VBGKX9fsC&source=gbs_api","authors":["Charlie Hunt","Binu John"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=beNVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Practical Techniques for Improving JVM Application Performance","description":"Performance tuning is an experimental science, but that doesn’t mean engineers should resort to guesswork and folklore to get the job done. Yet that’s often the case. With this practical book, intermediate to advanced Java technologists working with complex technology stacks will learn how to tune Java applications for performance using a quantitative, verifiable approach. Most resources on performance tend to discuss the theory and internals of Java virtual machines, but this book focuses on the practicalities of performance tuning by examining a wide range of aspects. There are no simple recipes, tips and tricks, or algorithms to learn. Performance tuning is a process of defining and determining desired outcomes. And it requires diligence. Learn how Java principles and technology make the best use of modern hardware and operating systems Explore several performance tests and common anti-patterns that can vex your team Understand the pitfalls of measuring Java performance numbers and the drawbacks of microbenchmarking Dive into JVM garbage collection logging, monitoring, tuning, and tools Explore JIT compilation and Java language performance techniques Learn performance aspects of the Java Collections API and get an overview of Java concurrency","language":"en","currency":"USD","id":"1492039276","title":"Optimizing Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=beNVDwAAQBAJ&source=gbs_api","authors":["Benjamin J Evans","James Gough","Chris Newland"]},{"pageCount":728,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6jYiAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Essential Java Programming Skills--Made Easy! Fully updated for Java Platform, Standard Edition 8 (Java SE 8), Java: A Beginner's Guide, Sixth Edition gets you started programming in Java right away. Bestselling programming author Herb Schildt begins with the basics, such as how to create, compile, and run a Java program. He then moves on to the keywords, syntax, and constructs that form the core of the Java language. This Oracle Press resource also covers some of Java's more advanced features, including multithreaded programming, generics, and Swing. Of course, new Java SE 8 features such as lambda expressions and default interface methods are described. An introduction to JavaFX, Java's newest GUI, concludes this step-by-step tutorial. Designed for Easy Learning: Key Skills & Concepts -- Chapter-opening lists of specific skills covered in the chapter Ask the Expert -- Q&A sections filled with bonus information and helpful tips Try This -- Hands-on exercises that show you how to apply your skills Self Tests -- End-of-chapter quizzes to reinforce your skills Annotated Syntax -- Example code with commentary that describes the programming techniques being illustrated The book's code examples are available FREE for download.","language":"en","currency":"USD","id":"0071809260","title":"Java: A Beginner's Guide, Sixth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6jYiAwAAQBAJ&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8y9MDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"A new edition of the bestselling guide to Java If you want to learn to speak the world’s most popular programming language like a native, Java For Dummies is your ideal companion. With a focus on reusing existing code, it quickly and easily shows you how to create basic Java objects, work with Java classes and methods, understand the value of variables, learn to control program flow with loops or decision-making statements, and so much more! Java is everywhere, runs on almost any computer, and is the engine that drives the coolest applications. Written for anyone who’s ever wanted to tackle programming with Java but never knew quite where to begin, this bestselling guide is your ticket to success! Featuring updates on everything you’ll encounter in Java 9—and brimming with tons of step-by-step instruction—it’s the perfect resource to get you up and running with Java in a jiffy! Discover the latest features and tools in Java 9 Learn to combine several smaller programs to create a bigger program Create basic Java objects and reuse code Confidently handle exceptions and events If you’re ready to jump into Java, this bestselling guide will help keep your head above water!","language":"en","currency":"USD","id":"1119235588","title":"Java For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8y9MDgAAQBAJ&source=gbs_api","authors":["Barry A. Burd"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sQh-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, test, and troubleshoot enterprise applications and microservices with Kotlin and Java EE","description":"Build Java Enterprise Applications and learn how Kotlin makes it easier to code them using components like JSF 2.3, Enterprise JavaBeans (EJB) 3.2, Contexts and Dependency Injection (CDI) 2.0, the Java API for WebSockets, JAX-RS 2.1, Servlet 4.0. Key Features An in-depth guide updated with all the latest features of Kotlin 1.2 and Java EE 8 Build microservices in Java EE with the help of Kotlin use cases Explore coroutines, garbage collection, multithreading, memory management and more Book Description Kotlin was developed with a view to solving programmers’ difficulties and operational challenges. This book guides you in making Kotlin and Java EE work in unison to build enterprise-grade applications. Together, they can be used to create services of any size with just a few lines of code and let you focus on the business logic. Kotlin for Enterprise Applications using Java EE begins with a brief tour of Kotlin and helps you understand what makes it a popular and reasonable choice of programming language for application development, followed by its incorporation in the Java EE platform. We will then learn how to build applications using the Java Persistence API (JPA) and Enterprise JavaBeans (EJB), as well as develop RESTful web services and MicroServices. As we work our way through the chapters, we’ll use various performance improvement and monitoring tools for your application and see how they optimize real-world applications. At each step along the way, we will see how easy it is to develop enterprise applications in Kotlin. By the end of this book, we will have learned design patterns and how to implement them using Kotlin. What you will learn Understand Kotlin syntax and appreciate why it’s gaining in popularity Explore the Java EE ecosystem and the APIs in Java EE Implement applications using Kotlin Overcome the challenges of developing the Java EE system using Kotlin Gain insights into Java Message Services (JMS) Build RESTful MicroServices and secure applications Optimize applications with performance and monitoring tools Understand design patterns and implement them Who this book is for Kotlin for Enterprise Applications using Java EE is for Java EE developers who want to build their enterprise project or application with Kotlin or migrate from Java to Kotlin. Basic knowledge of programming is necessary to understand the key concepts covered in this book.","language":"en","currency":"USD","id":"1788994396","title":"Kotlin for Enterprise Applications using Java EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sQh-DwAAQBAJ&source=gbs_api","authors":["Raghavendra Rao K"]},{"pageCount":144,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"290 Core Java Interview Questions 77 HR Interview Questions Real life scenario based questions Strategies to respond to interview questions 2 Aptitude Tests Core Java Interview Questions You’ll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today’s competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver’s seat and helps them steer their way to impress the interviewer. The following is included in this book: a) 290 CORE JAVA Interview Questions, Answers and proven strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on https:\/\/www.vibrantpublishers.com","language":"en","currency":"USD","id":"194638318X","title":"CORE JAVA Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gTQ82IGz0uQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Definitive Guide to Rich Clients with Java Technology","description":"In Pro JavaFX 2: A Definitive Guide to Rich Clients with Java Technology, Jim Weaver, Weiqi Gao, Stephen Chin, Dean Iverson, and Johan Vos show you how you can use the JavaFX platform to create rich-client Java applications. You'll see how JavaFX provides a powerful Java-based UI platform capable of handling large-scale data-driven business applications. Covering the JavaFX API, development tools, and best practices, this book provides code examples that explore the exciting new features provided with JavaFX 2. It contains engaging tutorials that cover virtually every facet of JavaFX development and reference materials on JavaFX that augment the JavaFX API documentation. Written in an engaging and friendly style, Pro JavaFX 2 is an essential guide to JavaFX 2.","language":"en","currency":"USD","id":"1430268735","title":"Pro JavaFX 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gTQ82IGz0uQC&source=gbs_api","authors":["James Weaver","Weiqi Gao","Stephen Chin","Dean Iverson","Johan Vos"]},{"pageCount":234,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wa1C0_PIzOoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":"GWT Java AJAX Programming : a Practical Guide to Google Web Toolkit for Creating AJAX Applications with Java","description":"\"This book is for Java developers who want to create Ajax interfaces using the Google Web Toolkit (GWT). It focuses on useful, practical tasks from the first chapter. The book is aimed at programmers who want to use GWT to create interfaces for their professional web applications. It concentrates on the serious side of Ajax: creating powerful, productive applications for browser platforms\"--Resource description p.","language":"en","currency":"USD","id":"1847191010","title":"Google Web Toolkit","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wa1C0_PIzOoC&source=gbs_api","authors":["Prabhakar Chaganti"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SVdSUcdONukC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"CodeNotes provides the most succinct, accurate, and speedy way for a developer to ramp up on a new technology or language. Unlike other programming books, CodeNotes drills down to the core aspects of a technology, focusing on the key elements needed in order to understand it quickly and implement it immediately. It is a unique resource for developers, filling the gap between comprehensive manuals and pocket references. CodeNotes for Web Services in Java and .NET examines the core specifications and technologies required for building SOAP-based web services in both Java and .NET. Not only will you find descriptions of SOAP, WSDL, and UDDI; you will also see how to use each of these specifications with Java and .NET. In addition, you will find specific sections on cross-language and cross-platform compatibility between web services. This edition of CodeNotes includes: • A global overview of this technology and explanation of what problems it can be used to solve • Real-world examples • “How and Why” sections that provide hints, tricks, workarounds, and tips on what should be taken advantage of or avoided • Instructions and classroom-style tutorials throughout from expert trainers and software developers","language":"en","currency":"USD","id":"158836254X","title":"CodeNotes for Web Services in Java and .NET","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SVdSUcdONukC&source=gbs_api","authors":["Gregory Brill"]}]