[{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LZQ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Patterns and Practices for Developing Maintainable Applications","description":"The upcoming Java 9 module system will affect existing applications and offer new ways of creating modular and maintainable applications. With this hands-on book, Java developers will learn not only about the joys of modularity, but also about the patterns needed to create truly modular and reliable applications. Authors Sander Mak and Paul Bakker teach you the concepts behind the Java 9 module system, along with the new tools it offers. You’ll also learn how to modularize existing code and how to build new Java applications in a modular way. Understand Java 9 module system concepts Master the patterns and practices for building truly modular applications Migrate existing applications and libraries to Java 9 modules Use JDK 9 tools for modular development and migration","language":"en","currency":"USD","id":"1491954116","title":"Java 9 Modularity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LZQ0DwAAQBAJ&source=gbs_api","authors":["Sander Mak","Paul Bakker"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UglvAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Virtualizing and Tuning Large-Scale Java Platforms Technical best practices and real-world tips for optimizing enterprise Java applications on VMware vSphere® Enterprises no longer ask, “Can Java be virtualized”? Today, they ask, “Just how large can we scale virtualized Java application platforms, and just how efficiently can we tune them?” Now, the leading expert on Java virtualization answers these questions, offering detailed technical information you can apply in any production or QA\/test environment. Emad Benjamin has spent nine years virtualizing VMware’s own enterprise Java applications and working with nearly 300 leading VMware customers on projects of all types and sizes—from 100 JVMs to 10,000+, with heaps from 1GB to 360GB, and including massive big-data applications built on clustered JVMs. Reflecting all this experience, he shows you how to successfully size and tune any Java workload. This reference and performance “cookbook” identifies high-value optimization opportunities that apply to physical environments, virtual environments, or both. You learn how to rationalize and scale existing Java infrastructure, modernize architecture for new applications, and systematically benchmark and improve every aspect of virtualized Java performance. Throughout, Benjamin offers real performance studies, specific advice, and “from-the-trenches” insights into monitoring and troubleshooting. Coverage includes --Performance issues associated with large-scale Java platforms, including consolidation, elasticity, and flexibility --Technical considerations arising from theoretical and practical limits of Java platforms --Building horizontal in-memory databases with VMware vFabric SQLFire to improve scalability and response times --Tuning large-scale Java using throughput\/parallel GC and Concurrent Mark and Sweep (CMS) techniques --Designing and sizing a new virtualized Java environment --Designing and sizing new large-scale Java platforms when migrating from physical to virtualized deployments --Designing and sizing large-scale Java platforms for latency-sensitive in-memory databases --Real-world performance studies: SQLFire vs. RDBMS, Spring-based Java web apps, vFabric SpringTrader, application tiers, data tiers, and more --Performance differences between ESXi3, 4.1, and 5 --Best-practice considerations for each type of workload: architecture, performance, design, sizing, and high availability --Identifying bottlenecks in the load balancer, web server, Java application server, or DB Server tiers --Advanced vSphere Java performance troubleshooting with esxtop --Performance FAQs: answers to specific questions enterprise customers have asked","language":"en","currency":"USD","id":"0133491412","title":"Virtualizing and Tuning Large Scale Java Platforms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UglvAgAAQBAJ&source=gbs_api","authors":["Emad Benjamin"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_g5QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Harnessing the Power Of Java 8 Lambda Expressions","description":"Intermediate level, for programmers fairly familiar with Java, but new to the functional style of programming and lambda expressions. Get ready to program in a whole new way. Functional Programming in Java will help you quickly get on top of the new, essential Java 8 language features and the functional style that will change and improve your code. This short, targeted book will help you make the paradigm shift from the old imperative way to a less error-prone, more elegant, and concise coding style that's also a breeze to parallelize. You'll explore the syntax and semantics of lambda expressions, method and constructor references, and functional interfaces. You'll design and write applications better using the new standards in Java 8 and the JDK. Lambda expressions are lightweight, highly concise anonymous methods backed by functional interfaces in Java 8. You can use them to leap forward into a whole new world of programming in Java. With functional programming capabilities, which have been around for decades in other languages, you can now write elegant, concise, less error-prone code using standard Java. This book will guide you though the paradigm change, offer the essential details about the new features, and show you how to transition from your old way of coding to an improved style. In this book you'll see popular design patterns, such as decorator, builder, and strategy, come to life to solve common design problems, but with little ceremony and effort. With these new capabilities in hand, Functional Programming in Java will help you pick up techniques to implement designs that were beyond easy reach in earlier versions of Java. You'll see how you can reap the benefits of tail call optimization, memoization, and effortless parallelization techniques. Java 8 will change the way you write applications. If you're eager to take advantage of the new features in the language, this is the book for you. What you need: Java 8 with support for lambda expressions and the JDK is required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680503545","title":"Functional Programming in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_g5QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":305,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wFwOBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":95.2,"subtitle":null,"description":"Smart cards play an increasingly important role in everyday life. We encounter them as credit cards, loyalty cards, electronic purses, health cards, ands as secure tokens for authentication or digital signatures. Their small size and the compatibility of their form with the magnetic stripe card make them ideal carriers of personal information such as secret keys, passwords, customization profiles, and medical emergency information. This book provides a guide for the rapid development of smart card applications using Java and the OpenCard Framework. It gives you the basic information you need about smart cards and how they work. A smart card provided with the book will help you to obtain first-hand experience.","language":"en","currency":"USD","id":"3642559697","title":"Smart Card Application Development Using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wFwOBwAAQBAJ&source=gbs_api","authors":["Uwe Hansmann","Martin S. Nicklous","Thomas Schäck","Achim Schneider","Frank Seliger"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wwcT08lk-DcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"A Glimpse at the Future of Programming Languages","description":"Bruce Tate, author of the Jolt Award-winning Better, Faster, Lighter Java has an intriguing notion about the future of Java, and it's causing some agitation among Java developers. Bruce believes Java is abandoning its base, and conditions are ripe for an alternative to emerge. In Beyond Java, Bruce chronicles the rise of the most successful language of all time, and then lays out, in painstaking detail, the compromises the founders had to make to establish success. Then, he describes the characteristics of likely successors to Java. He builds to a rapid and heady climax, presenting alternative languages and frameworks with productivity and innovation unmatched in Java. He closes with an evaluation of the most popular and important programming languages, and their future role in a world beyond Java. If you are agree with the book's premise--that Java's reign is coming to an end--then this book will help you start to build your skills accordingly. You can download some of the frameworks discussed and learn a few new languages. This book will teach you what a new language needs to succeed, so when things do change, you'll be more prepared. And even if you think Java is here to stay, you can use the best techniques from frameworks introduced in this book to improve what you're doing in Java today.","language":"en","currency":"USD","id":"9780596553494","title":"Beyond Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wwcT08lk-DcC&source=gbs_api","authors":["Bruce Tate"]},{"pageCount":744,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DCvc4S35iyYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Short Course on the Basics","description":"The Java® Tutorial, Fifth Edition, is based on Release 7 of the Java Platform Standard Edition. This revised and updated edition introduces the new features added to the platform, including a section on NIO.2, the new file I\/O API, and information on migrating legacy code to the new API. The deployment coverage has also been expanded, with new chapters such as “Doing More with Rich Internet Applications” and “Deployment in Depth,” and a section on the fork\/join feature has been added to the chapter on concurrency. Information reflecting Project Coin developments, including the new try-with-resources statement, the ability to catch more than one type of exception with a single exception handler, support for binary literals, and diamond syntax, which results in cleaner generics code, has been added where appropriate. The chapters covering generics, Java Web Start, and applets have also been updated. In addition, if you plan to take one of the Java SE 7 certification exams, this guide can help. A special appendix, “Preparing for Java Programming Language Certification,” lists the three exams available, details the items covered on each exam, and provides cross-references to where more information about each topic appears in the text. All of the material has been thoroughly reviewed by members of Oracle Java engineering to ensure that the information is accurate and up to date.","language":"en","currency":"USD","id":"0132761947","title":"The Java Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DCvc4S35iyYC&source=gbs_api","authors":["Sharon Biocca Zakhour","Sowmya Kannan","Raymond Gallardo"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oVadw8Jf0cYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Anyone who develops software for a living needs a proven way to produce it better, faster, and cheaper. The Productive Programmer offers critical timesaving and productivity tools that you can adopt right away, no matter what platform you use. Master developer Neal Ford not only offers advice on the mechanics of productivity-how to work smarter, spurn interruptions, get the most out your computer, and avoid repetition-he also details valuable practices that will help you elude common traps, improve your code, and become more valuable to your team. You'll learn to: Write the test before you write the code Manage the lifecycle of your objects fastidiously Build only what you need now, not what you might need later Apply ancient philosophies to software development Question authority, rather than blindly adhere to standards Make hard things easier and impossible things possible through meta-programming Be sure all code within a method is at the same level of abstraction Pick the right editor and assemble the best tools for the job This isn't theory, but the fruits of Ford's real-world experience as an Application Architect at the global IT consultancy ThoughtWorks. Whether you're a beginner or a pro with years of experience, you'll improve your work and your career with the simple and straightforward principles in The Productive Programmer.","language":"en","currency":"USD","id":"9780596551865","title":"The Productive Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oVadw8Jf0cYC&source=gbs_api","authors":["Neal Ford"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I0NWg5is6O0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.76,"subtitle":"How Tests Drive the Code","description":"Software testing is indispensable and is one of the most discussed topics in software development today. Many companies address this issue by assigning a dedicated software testing phase towards the end of their development cycle. However, quality cannot be tested into a buggy application. Early and continuous unit testing has been shown to be crucial for high quality software and low defect rates. Yet current books on testing ignore the developer's point of view and give little guidance on how to bring the overwhelming amount of testing theory into practice. Unit Testing in Java represents a practical introduction to unit testing for software developers. It introduces the basic test-first approach and then discusses a large number of special issues and problem cases. The book instructs developers through each step and motivates them to explore further. Shows how the discovery and avoidance of software errors is a demanding and creative activity in its own right and can build confidence early in a project. Demonstrates how automated tests can detect the unwanted effects of small changes in code within the entire system. Discusses how testing works with persistency, concurrency, distribution, and web applications. Includes a discussion of testing with C++ and Smalltalk.","language":"en","currency":"USD","id":"9780080520179","title":"Unit Testing in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I0NWg5is6O0C&source=gbs_api","authors":["Johannes Link"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Um15DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Essential Tools and Best Practices for Deploying Code to Production","description":"Continuous delivery adds enormous value to the business and the entire software delivery lifecycle, but adopting this practice means mastering new skills typically outside of a developer’s comfort zone. In this practical book, Daniel Bryant and Abraham Marín-Pérez provide guidance to help experienced Java developers master skills such as architectural design, automated quality assurance, and application packaging and deployment on a variety of platforms. Not only will you learn how to create a comprehensive build pipeline for continually delivering effective software, but you’ll also explore how Java application architecture and deployment platforms have affected the way we rapidly and safely deliver new software to production environments. Get advice for beginning or completing your migration to continuous delivery Design architecture to enable the continuous delivery of Java applications Build application artifacts including fat JARs, virtual machine images, and operating system container (Docker) images Use continuous integration tooling like Jenkins, PMD, and find-sec-bugs to automate code quality checks Create a comprehensive build pipeline and design software to separate the deploy and release processes Explore why functional and system quality attribute testing is vital from development to delivery Learn how to effectively build and test applications locally and observe your system while it runs in production","language":"en","currency":"USD","id":"1491985976","title":"Continuous Delivery in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Um15DwAAQBAJ&source=gbs_api","authors":["Daniel Bryant","Abraham Marín-Pérez"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=07i8DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"Using Java, Scala, Groovy, and JavaScript","description":"Get up and running fast with the basics of programming using Java as an example language. This short book gets you thinking like a programmer in an easy and entertaining way. Modern Programming Made Easy teaches you basic coding principles, including working with lists, sets, arrays, and maps; coding in the object-oriented style; and writing a web application. This book is language agnostic, but will mainly cover Java, with some references to Groovy, Scala, and JavaScript to give you a broad range of examples to consider. You will get a taste of what modern programming has to offer and set yourself up for further study and growth in your chosen language. What You'll Learn Code using the functional programming style Build and test your code Read and write from files Design user interfaces Deploy your app in the cloud Who This Book Is For“\/b> Anyone who wants to learn how to code. Whether you're a student, a teacher, looking for a career change, or just a hobbyist, this book is made for you.","language":"en","currency":"USD","id":"1484224906","title":"Modern Programming Made Easy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=07i8DQAAQBAJ&source=gbs_api","authors":["Adam L. Davis"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AKzMBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.96,"subtitle":null,"description":"While most other image processing texts approach this subject from an engineering perspective, The Art of Image Processing with Java places image processing within the realm of both engineering and computer science students by emphasizing software design. Ideal for students studying computer science or software engineering, it clearly teaches them the fundamentals of image processing. Accompanied by rich illustrations that demonstrate the results of performing processing on well-known art pieces, the text builds an accessible mathematical foundation and includes extensive sample Java code. Each chapter provides exercises to help students master the material.","language":"en","currency":"USD","id":"1439865590","title":"The Art of Image Processing with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AKzMBQAAQBAJ&source=gbs_api","authors":["Kenny A. Hunt"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FqfKFl4Bm7UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":128,"subtitle":null,"description":"Software engineering and computer science students need a resource that explains how to apply design patterns at the enterprise level, allowing them to design and implement systems of high stability and quality. Software Architecture Design Patterns in Java is a detailed explanation of how to apply design patterns and develop software architectures. It provides in-depth examples in Java, and guides students by detailing when, why, and how to use specific patterns. This textbook presents 42 design patterns, including 23 GoF patterns. Categories include: Basic, Creational, Collectional, Structural, Behavioral, and Concurrency, with multiple examples for each. The discussion of each pattern includes an example implemented in Java. The source code for all examples is found on a companion Web site. The author explains the content so that it is easy to understand, and each pattern discussion includes Practice Questions to aid instructors. The textbook concludes with a case study that pulls several patterns together to demonstrate how patterns are not applied in isolation, but collaborate within domains to solve complicated problems.","language":"en","currency":"USD","id":"9780203496213","title":"Software Architecture Design Patterns in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FqfKFl4Bm7UC&source=gbs_api","authors":["Partha Kuchana"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iFc0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":null,"description":"Data Structures and Algorithms in Java, Second Edition is designed to be easy to read and understand although the topic itself is complicated. Algorithms are the procedures that software programs use to manipulate data structures. Besides clear and simple example programs, the author includes a workshop as a small demonstration program executable on a Web browser. The programs demonstrate in graphical form what data structures look like and how they operate. In the second edition, the program is rewritten to improve operation and clarify the algorithms, the example programs are revised to work with the latest version of the Java JDK, and questions and exercises will be added at the end of each chapter making the book even more useful. Educational Supplement Suggested solutions to the programming projects found at the end of each chapter are made available to instructors at recognized educational institutions. This educational supplement can be found at www.prenhall.com, in the Instructor Resource Center.","language":"en","currency":"USD","id":"0134847997","title":"Data Structures and Algorithms in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iFc0DwAAQBAJ&source=gbs_api","authors":["Robert Lafore"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TOwESlbnaWYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":"Shaping Beginners","description":"Puzzles in Java is a preliminary tool for beginners in Java to test their skills and get an in-depth knowledge of core Java. This book consists of 299 unique puzzles that will help readers to complete the self-assessment in understanding Java. Answers to puzzles can be identified using the game codes provided in the beginning of the book. This book encourages the readers to execute the puzzles in JDK to identify the results and understand details of the puzzles.","language":"en","currency":"USD","id":"1466988827","title":"Puzzles in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TOwESlbnaWYC&source=gbs_api","authors":["Kathiravan Udayakumar"]},{"pageCount":621,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ge69DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.04,"subtitle":"Cross-Platform Mobile and Cloud Development","description":"Build enhanced visual experiences and design and deploy modern, easy-to-maintain, client applications across a variety of platforms. This book will show you how these applications can take advantage of the latest user interface components, 3D technology, and cloud services to create immersive visualizations and allow high-value data manipulation. The Definitive Guide to Modern Java Clients with JavaFX is a professional reference for building Java applications for desktop, mobile, and embedded in the Cloud age. It offers end-to-end coverage of the latest features in JavaFX and Java 13. After reading this book, you will be equipped to upgrade legacy client applications, develop cross-platform applications in Java, and build enhanced desktop and mobile native clients. What You Will Learn Create modern client applications in Java using the latest JavaFX and Java 13 Build enterprise clients that will enable integration with existing cloud services Use advanced visualization and 3D features Deploy on desktop, mobile, and embedded devices Who This Book Is For Professional Java developers who are interested in learning the latest client Java development techniques to fill out their skillset.","language":"en","currency":"USD","id":"1484249267","title":"The Definitive Guide to Modern Java Clients with JavaFX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ge69DwAAQBAJ&source=gbs_api","authors":["Stephen Chin","Johan Vos","James Weaver"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CQlpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":92,"subtitle":"Challenges of Connected Cars","description":"GPS Tracking with Java EE Components: Challenges of Connected Cars highlights how the self-driving car is actually changing the automotive industry, from programing embedded software to hosting services and data crunching, in real time, with really big data. The book analyzes how the challenges of the Self Driving Car (SDC) exceed the limits of a classical GPS Tracking System (GTS.) It provides a guidebook on setting up a tracking system by customizing its components. It also provides an overview of the prototyping and modeling process, and how the reader can modify this process for his or her own software. Every component is introduced in detail and includes a number of design decisions for development. The book introduces Java EE (JEE) Modules, and shows how they can be combined to a customizable GTS, and used as seed components to enrich existing systems with live tracking. The book also explores how to merge tracking and mapping to guide SDCs, and focuses on client server programming to provide useful information. It also discusses the challenges involved with the live coordination of moving cars. This book is designed to aid GTS developers and engineers in the automotive industry. It can also help Java Developers, not only interested in GPS Tracking, but in modern software design from many individual modules. Source code and sample applications will be available on the book's website.","language":"en","currency":"USD","id":"1351679651","title":"GPS Tracking with Java EE Components","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CQlpDwAAQBAJ&source=gbs_api","authors":["Kristof Beiglböck"]},{"pageCount":478,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M9hpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"The book is aimed at all levels of readers. Beginners can learn the basic configurations and step-by-step approaches in creating charts or Highcharts cloud. For intermediate and advanced readers, the book explores the APIs, events, server-side operations and plugins.","language":"en","currency":"USD","id":"1783287462","title":"Learning Highcharts 4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M9hpBgAAQBAJ&source=gbs_api","authors":["Joe Kuan"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tOnGBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"24-Hour Trainer","description":"Quick and painless Java programming with expert multimedia instruction Java Programming 24-Hour Trainer, 2nd Edition is your complete beginner's guide to the Java programming language, with easy-to-follow lessons and supplemental exercises that help you get up and running quickly. Step-by-step instruction walks you through the basics of object-oriented programming, syntax, interfaces, and more, before building upon your skills to develop games, web apps, networks, and automations. This second edition has been updated to align with Java SE 8 and Java EE 7, and includes new information on GUI basics, lambda expressions, streaming API, WebSockets, and Gradle. Even if you have no programming experience at all, the more than six hours of Java programming screencasts will demonstrate major concepts and procedures in a way that facilitates learning and promotes a better understanding of the development process. This is your quick and painless guide to mastering Java, whether you're starting from scratch or just looking to expand your skill set. Master the building blocks that go into any Java project Make writing code easier with the Eclipse tools Learn to connect Java applications to databases Design and build graphical user interfaces and web applications Learn to develop GUIs with JavaFX If you want to start programming quickly, Java Programming 24-Hour Trainer, 2nd Edition is your ideal solution.","language":"en","currency":"USD","id":"1118951573","title":"Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tOnGBwAAQBAJ&source=gbs_api","authors":["Yakov Fain"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zaoK0Z2STlkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Speed Up the Java Development Process","description":"This comprehensive guide shows you how to master the most importantchanges to Java since it was first released. Generics and the greatlyexpanded collection libraries have tremendously increased the power ofJava 5 and Java 6. But they have also confused many developers whohaven't known how to take advantage of these new features. Java Generics and Collections covers everything from the mostbasic uses of generics to the strangest corner cases. It teaches youeverything you need to know about the collections libraries, so you'llalways know which collection is appropriate for any given task, andhow to use it. Topics covered include: Fundamentals of generics: type parameters and generic methods Other new features: boxing and unboxing, foreach loops, varargs Subtyping and wildcards Evolution not revolution: generic libraries with legacy clients andgeneric clients with legacy libraries Generics and reflection Design patterns for generics Sets, Queues, Lists, Maps, and their implementations Concurrent programming and thread safety with collections Performance implications of different collections Generics and the new collection libraries they inspired take Java to anew level. If you want to take your software development practice toa new level, this book is essential reading. Philip Wadler is Professor of Theoretical Computer Science at theUniversity of Edinburgh, where his research focuses on the design ofprogramming languages. He is a co-designer of GJ, work thatbecame the basis for generics in Sun's Java 5.0. Maurice Naftalin is Technical Director at Morningside Light Ltd., a software consultancy in the United Kingdom. He has most recently served as an architect and mentor at NSB Retail Systems plc, and as the leader of the client development team of a major UK government social service system. \"A brilliant exposition of generics. By far the best book on thetopic, it provides a crystal clear tutorial that starts with thebasics and ends leaving the reader with a deep understanding of boththe use and design of generics.\" Gilad Bracha, Java Generics Lead, Sun Microsystems","language":"en","currency":"USD","id":"0596551509","title":"Java Generics and Collections","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zaoK0Z2STlkC&source=gbs_api","authors":["Maurice Naftalin","Philip Wadler"]},{"pageCount":729,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Sf_LBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":100,"subtitle":"Problem Solving Through Object Oriented Analysis and Design","description":"While Java texts are plentiful, it's difficult to find one that takes a real-world approach, and encourages novice programmers to build on their Java skills through practical exercise. Written by an expert with 19 experience teaching computer programming, Java Programming Fundamentals presents object-oriented programming by employing examples taken","language":"en","currency":"USD","id":"1420065483","title":"Java Programming Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Sf_LBQAAQBAJ&source=gbs_api","authors":["Premchand S. Nair"]},{"pageCount":612,"thumbnail":"http:\/\/books.google.com\/books\/content?id=urd9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Learn to Program the Fundamentals the Java 9+ Way","description":"Write your first code in Java using simple, step-by-step examples that model real-word objects and events, making learning easy. With this book you’ll be able to pick up the concepts without fuss. Java for Absolute Beginners teaches Java development in language anyone can understand, giving you the best possible start. You’ll see clear code descriptions and layout so that you can get your code running as soon as possible. After reading this book, you'll come away with the basics to get started writing programs in Java. Author Iuliana Cosmina focuses on practical knowledge and getting up to speed quickly—all the bits and pieces a novice needs to get started programming in Java. First, you’ll discover how Java is executed, what type of language it is, and what it is good for. With the theory out of the way, you’ll install Java, choose an editor such as IntelliJ IDEA, and write your first simple Java program. Along the way you’ll compile and execute this program so it can run on any platform that supports Java. As part of this tutorial you’ll see how to write high-quality code by following conventions and respecting well-known programming principles, making your projects more professional and efficient. Finally, alongside the core features of Java, you’ll learn skills in some of the newest and most exciting features of the language: Generics, Lambda expressions, modular organization, local-variable type inference, and local variable syntax for Lambda expressions. Java for Absolute Beginners gives you all you need to start your Java 9+ programming journey. No experience necessary. What You'll Learn Use data types, operators, and the new stream API Install and use a build tool such as Gradle Build interactive Java applications with JavaFX Exchange data using the new JSON APIs Play with images using multi-resolution APIs Use the publish-subscribe framework Who This Book Is For Those who are new to programming and who want to start with Java.","language":"en","currency":"USD","id":"1484237781","title":"Java for Absolute Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=urd9DwAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina"]},{"pageCount":498,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1UyYoZx2qdoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":60.76,"subtitle":null,"description":"Adoption of Bluetooth wireless technology has made great strides in the last few years. One of the biggest steps forward—the standardization of Java APIs for Bluetooth wireless technology (JABWT)—is explained in detail in this book. The JABWT standard, defined by the JSR-82 specification, supports rapid development of Bluetooth applications that are portable, secure, and highly-usable. Wireless device manufacturers have responded to the JABWT specification by announcing mobile phones and other products that will run JABWT applications. Bluetooth Application Programming with the Java APIs explains in detail how to write Bluetooth applications using the Java APIs to exploit the power of both technologies. Written by the specification lead for JSR-82 and two other key participants in the definition of JABWT, this book provides the authoritative explanations and concrete examples you need to get started right away. About the Authors C Bala Kumar is a Distinguished Member of the Technical Staff at Motorola. He chaired the industry expert group that defined the Java APIs for Bluetooth wireless technology. He currently leads the systems software team for wireless platforms in Motorola's Semiconductor Products Sector. Paul J. Kline is a Distinguished Member of the Technical Staff at Motorola and the maintenance lead for the JABWT specification. He currently works on the System Software Architecture team in Motorola's Semiconductor Products Sector. Timothy J. Thompson is a Senior Software Engineer on the System Software Architecture team in Motorola's Semiconductor Products Sector. He was the OBEX architect on the JABWT specification team at Motorola. Written by experts—the authors led the industry team that defined the JABWT standard and the Motorola team that developed the first JABWT implementation Covers JABWT in depth and goes beyond the specification to explain how to use the standard effectively A helpful resource both to Java programmers interested in Bluetooth wireless technology and to business managers interested in its potential for creating new business opportunities Digs deeply into the programming areas you must master to successfully design and build JABWT applications, including RFCOMM, OBEX, device discovery, service discovery, and L2CAP Details the real-world issues involved in programming Bluetooth devices and implementing the JABWT specification Organized into sections that explicitly address the different needs of programmers, business managers, and project managers","language":"en","currency":"USD","id":"9780080490533","title":"Bluetooth Application Programming with the Java APIs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1UyYoZx2qdoC&source=gbs_api","authors":["C Bala Kumar","Paul J. Kline","Timothy J. Thompson"]},{"pageCount":433,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZcFHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"From Beginner to Professional","description":"Learn to design and create video games using the Java programming language and the LibGDX software library. Working through the examples in this book, you will create 12 game prototypes in a variety of popular genres, from collection-based and shoot-em-up arcade games to side-scrolling platformers and sword-fighting adventure games. With the flexibility provided by LibGDX, specialized genres such as card games, rhythm games, and visual novels are also covered in this book. Major updates in this edition include chapters covering advanced topics such as alternative sources of user input, procedural content generation, and advanced graphics. Appendices containing examples for game design documentation and a complete JavaDoc style listing of the extension classes developed in the book have also been added. What You Will Learn Create 12 complete video game projects Master advanced Java programming concepts, including data structures, encapsulation, inheritance, and algorithms, in the context of game development Gain practical experience with game design topics, including user interface design, gameplay balancing, and randomized content Integrate third-party components into projects, such as particle effects, tilemaps, and gamepad controllers Who This Book Is For The target audience has a desire to make video games, and an introductory level knowledge of basic Java programming. In particular, the reader need only be familiar with: variables, conditional statements, loops, and be able to write methods to accomplish simple tasks and classes to store related data.","language":"en","currency":"USD","id":"1484233247","title":"Java Game Development with LibGDX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZcFHDwAAQBAJ&source=gbs_api","authors":["Lee Stemkoski"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PPcmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Practical Methods for Scientists and Engineers","description":"Data Science is booming thanks to R and Python, but Java brings the robustness, convenience, and ability to scale critical to today’s data science applications. With this practical book, Java software engineers looking to add data science skills will take a logical journey through the data science pipeline. Author Michael Brzustowicz explains the basic math theory behind each step of the data science process, as well as how to apply these concepts with Java. You’ll learn the critical roles that data IO, linear algebra, statistics, data operations, learning and prediction, and Hadoop MapReduce play in the process. Throughout this book, you’ll find code examples you can use in your applications. Examine methods for obtaining, cleaning, and arranging data into its purest form Understand the matrix structure that your data should take Learn basic concepts for testing the origin and validity of data Transform your data into stable and usable numerical values Understand supervised and unsupervised learning algorithms, and methods for evaluating their success Get up and running with MapReduce, using customized components suitable for data science algorithms","language":"en","currency":"USD","id":"1491934069","title":"Data Science with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PPcmDwAAQBAJ&source=gbs_api","authors":["Michael R. Brzustowicz, PhD"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=leokXF8pLY0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64,"subtitle":null,"description":"Extensively class-tested, this textbook takes an innovative approach to software testing: it defines testing as the process of applying a few well-defined, general-purpose test criteria to a structure or model of the software. It incorporates the latest innovations in testing, including techniques to test modern types of software such as OO, web applications, and embedded software. The book contains numerous examples throughout. An instructor's solution manual, PowerPoint slides, sample syllabi, additional examples and updates, testing tools for students, and example software programs in Java are available on an extensive website.","language":"en","currency":"USD","id":"9781139468671","title":"Introduction to Software Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=leokXF8pLY0C&source=gbs_api","authors":["Paul Ammann","Jeff Offutt"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iY_zAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":"Building Secure Web Applications","description":"Proven Methods for Building Secure Java-Based Web Applications Develop, deploy, and maintain secure Java applications using the expert techniques and open source libraries described in this Oracle Press guide. Iron-Clad Java presents the processes required to build robust and secure applications from the start and explains how to eliminate existing security bugs. Best practices for authentication, access control, data protection, attack prevention, error handling, and much more are included. Using the practical advice and real-world examples provided in this authoritative resource, you'll gain valuable secure software engineering skills. Establish secure authentication and session management processes Implement a robust access control design for multi-tenant web applications Defend against cross-site scripting, cross-site request forgery, and clickjacking Protect sensitive data while it is stored or in transit Prevent SQL injection and other injection attacks Ensure safe file I\/O and upload Use effective logging, error handling, and intrusion detection methods Follow a comprehensive secure software development lifecycle \"In this book, Jim Manico and August Detlefsen tackle security education from a technical perspective and bring their wealth of industry knowledge and experience to application designers. A significant amount of thought was given to include the most useful and relevant security content for designers to defend their applications. This is not a book about security theories, it’s the hard lessons learned from those who have been exploited, turned into actionable items for application designers, and condensed into print.\"—From the Foreword by Milton Smith, Oracle Senior Principal Security Product Manager, Java","language":"en","currency":"USD","id":"007183589X","title":"Iron-Clad Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iY_zAwAAQBAJ&source=gbs_api","authors":["Jim Manico","August Detlefsen"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-ZkQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Modern Java Web Development","description":"Web development is still one of today's most popular, active, and important programming and development activities. From a single web page to an e-commerce-enabled web site to a fully-fledged web application, the Java programming language and its frameworks allow you great flexibility and productivity for your web application development. Learn Java for Web Development teaches web developers who are new to Java key skills, Java-based languages, and frameworks to build simple or complex web sites and applications. As soon as you pick up this book, Vishal Layka's experience guides you on a very practical learning and building journey. You will learn the Java nuts and bolts necessary to build a simple \"HelloWorld\" Java (native) application, as well as a \"HelloWorld\" Java-based web application example that utilizes servlets and Java Server Pages (JSPs). Over the course of the book, you'll learn more about servlets and JSPs and delve into Java Server Faces (JSFs) and the expression language found in each of these by applying them in a real-world case study—a book store e-commerce application. Then you’ll build your web application using Apache Struts2 and the Spring MVC framework. The book concludes by exploring the web application that you've built and examining industry best practices and how these might fit with your application, as well as covering alternative Java Web frameworks like Groovy\/Grails and Scala\/Play 2. You also can explore the basics of Java, Groovy, and Scala in the book’s appendices. While reading this book, you'll see all this in action and you can use it as a starting point for further Java web development. Study and experiment with the many source code examples, and later apply them to your own web application building endeavors and 2:00 AM challenges.","language":"en","currency":"USD","id":"1430259841","title":"Learn Java for Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-ZkQAwAAQBAJ&source=gbs_api","authors":["Vishal Layka"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRl1CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Invoke TDD principles for end-to-end application development with Java About This Book Explore the most popular TDD tools and frameworks and become more proficient in building applications Create applications with better code design, fewer bugs, and higher test coverage, enabling you to get them to market quickly Implement test-driven programming methods into your development workflows Who This Book Is For If you're an experienced Java developer and want to implement more effective methods of programming systems and applications, then this book is for you. What You Will Learn Explore the tools and frameworks required for effective TDD development Perform the Red-Green-Refactor process efficiently, the pillar around which all other TDD procedures are based Master effective unit testing in isolation from the rest of your code Design simple and easily maintainable codes by implementing different techniques Use mocking frameworks and techniques to easily write and quickly execute tests Develop an application to implement behaviour-driven development in conjunction with unit testing Enable and disable features using Feature Toggles In Detail Test-driven development (TDD) is a development approach that relies on a test-first procedure that emphasises writing a test before writing the necessary code, and then refactoring the code to optimize it. The value of performing TDD with Java, one of the most established programming languages, is to improve the productivity of programmers, the maintainability and performance of code, and develop a deeper understanding of the language and how to employ it effectively. Starting with the basics of TDD and reasons why its adoption is beneficial, this book will take you from the first steps of TDD with Java until you are confident enough to embrace the practice in your day-to-day routine. You'll be guided through setting up tools, frameworks, and the environment you need, and will dive right in to hands-on exercises with the goal of mastering one practice, tool, or framework at a time. You'll learn about the Red-Green-Refactor procedure, how to write unit tests, and how to use them as executable documentation. With this book you'll also discover how to design simple and easily maintainable code, work with mocks, utilise behaviour-driven development, refactor old legacy code, and release a half-finished feature to production with feature toggles. You will finish this book with a deep understanding of the test-driven development methodology and the confidence to apply it to application programming with Java. Style and approach An easy-to-follow, hands-on guide to building applications through effective coding practices. This book covers practical examples by introducing different problems, each one designed as a learning exercise to help you understand each aspect of TDD.","language":"en","currency":"USD","id":"178398743X","title":"Test-Driven Java Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRl1CgAAQBAJ&source=gbs_api","authors":["Viktor Farcic","Alex Garcia"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QwZQDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Ten Guidelines for Future-Proof Code","description":"Have you ever felt frustrated working with someone else’s code? Difficult-to-maintain source code is a big problem in software development today, leading to costly delays and defects. Be part of the solution. With this practical book, you’ll learn 10 easy-to-follow guidelines for delivering C# software that’s easy to maintain and adapt. These guidelines have been derived from analyzing hundreds of real-world systems. Written by consultants from the Software Improvement Group (SIG), this book provides clear and concise explanations, with advice for turning the guidelines into practice. Examples for this edition are written in C#, while our companion Java book provides clear examples in that language. Write short units of code: limit the length of methods and constructors Write simple units of code: limit the number of branch points per method Write code once, rather than risk copying buggy code Keep unit interfaces small by extracting parameters into objects Separate concerns to avoid building large classes Couple architecture components loosely Balance the number and size of top-level components in your code Keep your codebase as small as possible Automate tests for your codebase Write clean code, avoiding \"code smells\" that indicate deeper problems","language":"en","currency":"USD","id":"1491954493","title":"Building Maintainable Software, C# Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QwZQDAAAQBAJ&source=gbs_api","authors":["Joost Visser","Sylvan Rigal","Gijs Wijnholds","Pascal van Eck","Rob van der Leek"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KdSrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. This IBM® Redbooks® publication covers Microservices best practices for Java. It focuses on creating cloud native applications using the latest version of IBM WebSphere® Application Server Liberty, IBM Bluemix® and other Open Source Frameworks in the Microservices ecosystem to highlight Microservices best practices for Java.","language":"en","currency":"USD","id":"0738442275","title":"Microservices Best Practices for Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KdSrDQAAQBAJ&source=gbs_api","authors":["Michael Hofmann","Erin Schnabel","Katherine Stanley","IBM Redbooks"]},{"pageCount":620,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M6XWCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Numerical computation, knowledge discovery and statistical data analysis integrated with powerful 2D and 3D graphics for visualization are the key topics of this book. The Python code examples powered by the Java platform can easily be transformed to other programming languages, such as Java, Groovy, Ruby and BeanShell. This book equips the reader with a computational platform which, unlike other statistical programs, is not limited by a single programming language. The author focuses on practical programming aspects and covers a broad range of topics, from basic introduction to the Python language on the Java platform (Jython), to descriptive statistics, symbolic calculations, neural networks, non-linear regression analysis and many other data-mining topics. He discusses how to find regularities in real-world data, how to classify data, and how to process data for knowledge discoveries. The code snippets are so short that they easily fit into single pages. Numeric Computation and Statistical Data Analysis on the Java Platform is a great choice for those who want to learn how statistical data analysis can be done using popular programming languages, who want to integrate data analysis algorithms in full-scale applications, and deploy such calculations on the web pages or computational servers regardless of their operating system. It is an excellent reference for scientific computations to solve real-world problems using a comprehensive stack of open-source Java libraries included in the DataMelt (DMelt) project and will be appreciated by many data-analysis scientists, engineers and students.","language":"en","currency":"USD","id":"3319285319","title":"Numeric Computation and Statistical Data Analysis on the Java Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M6XWCwAAQBAJ&source=gbs_api","authors":["Sergei V. Chekanov"]},{"pageCount":588,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2frEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Learn and Test Your Programming Skills","description":"Gain the fundamental concepts of object-oriented programming with examples in Java. This second edition comes with detailed coverage and enhanced discussion on fundamental topics such as inheritance, polymorphism, abstract classes, interfaces, and packages. This edition also includes discussions on multithread programming, generic programming, database programming, and exception handling mechanisms in Java. Finally, you will get a quick overview of design patterns including the full implementation of some important patterns. Interactive Object-Oriented Programming in Java begins with the fundamental concepts of object-oriented programming alongside Q&A sessions to further explore the topic. The book concludes with FAQs from all chapters. It also contains a section to test your skills in the language basics with examples to understand Java fundamentals including loops, arrays, and strings. You’ll use the Eclipse IDE to demonstrate the code examples in the book. After reading the book, you will have enhanced your skills in object-oriented programming in Java and you will be able to extend them in interesting ways. What You Will Learn Discover object-oriented programming with Java Test your programming skills Crack Java-based interviews with confidence Use the Eclipse IDE to write code and generate output Who This Book Is For Novice to intermediate programmers, software developers, and software testers.","language":"en","currency":"USD","id":"148425404X","title":"Interactive Object-Oriented Programming in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2frEDwAAQBAJ&source=gbs_api","authors":["Vaskaran Sarcar"]},{"pageCount":1065,"thumbnail":"http:\/\/books.google.com\/books\/content?id=srkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":57.59,"subtitle":null,"description":"Master the art of predictive modeling About This Book Load, wrangle, and analyze your data using the world's most powerful statistical programming language Familiarize yourself with the most common data mining tools of R, such as k-means, hierarchical regression, linear regression, Naive Bayes, decision trees, text mining and so on. We emphasize important concepts, such as the bias-variance trade-off and over-fitting, which are pervasive in predictive modeling Who This Book Is For If you work with data and want to become an expert in predictive analysis and modeling, then this Learning Path will serve you well. It is intended for budding and seasoned practitioners of predictive modeling alike. You should have basic knowledge of the use of R, although it's not necessary to put this Learning Path to great use. What You Will Learn Get to know the basics of R's syntax and major data structures Write functions, load data, and install packages Use different data sources in R and know how to interface with databases, and request and load JSON and XML Identify the challenges and apply your knowledge about data analysis in R to imperfect real-world data Predict the future with reasonably simple algorithms Understand key data visualization and predictive analytic skills using R Understand the language of models and the predictive modeling process In Detail Predictive analytics is a field that uses data to build models that predict a future outcome of interest. It can be applied to a range of business strategies and has been a key player in search advertising and recommendation engines. The power and domain-specificity of R allows the user to express complex analytics easily, quickly, and succinctly. R offers a free and open source environment that is perfect for both learning and deploying predictive modeling solutions in the real world. This Learning Path will provide you with all the steps you need to master the art of predictive modeling with R. We start with an introduction to data analysis with R, and then gradually you'll get your feet wet with predictive modeling. You will get to grips with the fundamentals of applied statistics and build on this knowledge to perform sophisticated and powerful analytics. You will be able to solve the difficulties relating to performing data analysis in practice and find solutions to working with “messy data”, large data, communicating results, and facilitating reproducibility. You will then perform key predictive analytics tasks using R, such as train and test predictive models for classification and regression tasks, score new data sets and so on. By the end of this Learning Path, you will have explored and tested the most popular modeling techniques in use on real-world data sets and mastered a diverse range of techniques in predictive analytics. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Data Analysis with R, Tony Fischetti Learning Predictive Analytics with R, Eric Mayor Mastering Predictive Analytics with R, Rui Miguel Forte Style and approach Learn data analysis using engaging examples and fun exercises, and with a gentle and friendly but comprehensive \"learn-by-doing\" approach. This is a practical course, which analyzes compelling data about life, health, and death with the help of tutorials. It offers you a useful way of interpreting the data that's specific to this course, but that can also be applied to any other data. This course is designed to be both a guide and a reference for moving beyond the basics of predictive modeling.","language":"en","currency":"USD","id":"1788290852","title":"R: Predictive Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=srkrDwAAQBAJ&source=gbs_api","authors":["Tony Fischetti","Eric Mayor","Rui Miguel Forte"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AcG_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Exam 1Z0-815","description":"The comprehensive study aide for those preparing for the new Oracle Certified Professional Java SE Programmer I Exam 1Z0-815 Used primarily in mobile and desktop application development, Java is a platform-independent, object-oriented programming language. It is the principal language used in Android application development as well as a popular language for client-side cloud applications. Oracle has updated its Java Programmer certification tracks for Oracle Certified Professional. OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide covers 100% of the exam objectives, ensuring that you are thoroughly prepared for this challenging certification exam. This comprehensive, in-depth study guide helps you develop the functional-programming knowledge required to pass the exam and earn certification. All vital topics are covered, including Java building blocks, operators and loops, String and StringBuilder, Array and ArrayList, and more. Included is access to Sybex's superior online interactive learning environment and test bank—containing self-assessment tests, chapter tests, bonus practice exam questions, electronic flashcards, and a searchable glossary of important terms. This indispensable guide: Clarifies complex material and strengthens your comprehension and retention of key topics Covers all exam objectives such as methods and encapsulation, exceptions, inheriting abstract classes and interfaces, and Java 8 Dates and Lambda Expressions Explains object-oriented design principles and patterns Helps you master the fundamentals of functional programming Enables you to create Java solutions applicable to real-world scenarios There are over 9 millions developers using Java around the world, yet hiring managers face challenges filling open positions with qualified candidates. The OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide will help you take the next step in your career.","language":"en","currency":"USD","id":"1119584566","title":"OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AcG_DwAAQBAJ&source=gbs_api","authors":["Jeanne Boyarsky","Scott Selikoff"]},{"pageCount":716,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YueCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Featuring JavaFX","description":"This easy-to-follow textbook teaches Java programming from first principles, as well as covering design and testing methodologies. The text is divided into two parts. Each part supports a one-semester module, the first part addressing fundamental programming concepts, and the second part building on this foundation, teaching the skills required to develop more advanced applications. This fully updated and greatly enhanced fourth edition covers the key developments introduced in Java 8, including material on JavaFX, lambda expressions and the Stream API. Topics and features: begins by introducing fundamental programming concepts such as declaration of variables, control structures, methods and arrays; goes on to cover the fundamental object-oriented concepts of classes and objects, inheritance and polymorphism; uses JavaFX throughout for constructing event-driven graphical interfaces; includes advanced topics such as interfaces and lambda expressions, generics, collection classes and exceptions; explains file-handling techniques, packages, multi-threaded programs, socket programming, remote database access and processing collections using streams; includes self-test questions and programming exercises at the end of each chapter, as well as two illuminating case studies; provides additional resources at its associated website (simply go to springer.com and search for \"Java in Two Semesters\"), including a guide on how to install and use the NetBeansTM Java IDE. Offering a gentle introduction to the field, assuming no prior knowledge of the subject, Java in Two Semesters is the ideal companion to undergraduate modules in software development or programming.","language":"en","currency":"USD","id":"3319994204","title":"Java in Two Semesters","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YueCDwAAQBAJ&source=gbs_api","authors":["Quentin Charatan","Aaron Kans"]},{"pageCount":638,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G9PXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Problems and Solutions for Java Developers","description":"Java continues to grow and evolve, and this cookbook continues to evolve in tandem. With this guide, you’ll get up to speed right away with hundreds of hands-on recipes across a broad range of Java topics. You’ll learn useful techniques for everything from string handling and functional programming to network communication. Each recipe includes self-contained code solutions that you can freely use, along with a discussion of how and why they work. If you’re familiar with Java basics, this cookbook will bolster your knowledge of the language and its many recent changes, including how to apply them in your day-to-day development. This updated edition covers changes through Java 12 and parts of 13 and 14. Recipes include: Methods for compiling, running, and debugging Packaging Java classes and building applications Manipulating, comparing, and rearranging text Regular expressions for string and pattern matching Handling numbers, dates, and times Structuring data with collections, arrays, and other types Object-oriented and functional programming techniques Input\/output, directory, and filesystem operations Network programming on both client and server Processing JSON for data interchange Multithreading and concurrency Using Java in big data applications Interfacing Java with other languages","language":"en","currency":"USD","id":"1492072532","title":"Java Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G9PXDwAAQBAJ&source=gbs_api","authors":["Ian F. Darwin"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.39,"subtitle":"Elements of Reusable Object-Oriented Software (Adobe Reader)","description":"Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.","language":"en","currency":"USD","id":"9780321700698","title":"Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6oHuKQe3TjQC&source=gbs_api","authors":["Erich Gamma","Richard Helm","Ralph Johnson","John Vlissides"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d2CMAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Short Course on the Basics","description":"Eagerly anticipated by millions of programmers, Java SE 8 is the most important Java update in many years. The addition of lambda expressions (closures) and streams represents the biggest change to Java programming since the introduction of generics and annotations. Now, with Java SE 8 for the Really Impatient , internationally renowned Java author Cay S. Horstmann concisely introduces Java 8’s most valuable new features (plus a few Java 7 innovations that haven’t gotten the attention they deserve). If you’re an experienced Java programmer, Horstmann’s practical insights and sample code will help you quickly take advantage of these and other Java language and platform improvements. This indispensable guide includes Coverage of using lambda expressions (closures) to write computation “snippets” that can be passed to utility functions The brand-new streams API that makes Java collections far more flexible and efficient Major updates to concurrent programming that make use of lambda expressions (filter\/map\/reduce) and that provide dramatic performance improvements for shared counters and hash tables A full chapter with advice on how you can put lambda expressions to work in your own programs Coverage of the long-awaited introduction of a well-designed date\/time\/calendar library (JSR 310) A concise introduction to JavaFX, which is positioned to replace Swing GUIs, and to the Nashorn Javascript engine A thorough discussion of many small library changes that make Java programming more productive and enjoyable This is the first title to cover all of these highly anticipated improvements and is invaluable for anyone who wants to write tomorrow’s most robust, efficient, and secure Java code.","language":"en","currency":"USD","id":"0133430197","title":"Java SE8 for the Really Impatient","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d2CMAgAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xCsIExQhF4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Modularity Patterns with Examples Using OSGi","description":"“I’m dancing! By god I’m dancing on the walls. I’m dancing on the ceiling. I’m ecstatic. I’m overjoyed. I’m really, really pleased.” –From the Foreword by Robert C. Martin (a.k.a. Uncle Bob) This isn’t the first book on Java application architecture. No doubt it won’t be the last. But rest assured, this title is different. The way we develop Java applications is about to change, and this title explores the new way of Java application architecture. Over the past several years, module frameworks have been gaining traction on the Java platform, and upcoming versions of Java will include a module system that allows you to leverage the power of modularity to build more resilient and flexible software systems. Modularity isn’t a new concept. But modularity will change the way we develop Java applications, and you’ll only be able to realize the benefits if you understand how to design more modular software systems. Java Application Architecture will help you Design modular software that is extensible, reusable, maintainable, and adaptable Design modular software today, in anticipation of future platform support for modularity Break large software systems into a flexible composite of collaborating modules Understand where to place your architectural focus Migrate large-scale monolithic applications to applications with a modular architecture Articulate the advantages of modular software to your team Java Application Architecture lays the foundation you’ll need to incorporate modular design thinking into your development initiatives. Before it walks you through eighteen patterns that will help you architect modular software, it lays a solid foundation that shows you why modularity is a critical weapon in your arsenal of design tools. Throughout, you’ll find examples that illustrate the concepts. By designing modular applications today, you are positioning yourself for the platform and architecture of tomorrow. That’s why Uncle Bob is dancing.","language":"en","currency":"USD","id":"0132874741","title":"Java Application Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xCsIExQhF4C&source=gbs_api","authors":["Kirk Knoernschild"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build and optimize your microservice architecture with Java","description":"An effective guide to designing, building, and deploying enterprise Java microservices with Eclipse MicroProfile Key Features Create cloud-native microservices with ease using this detailed guide Avoid vendor lock-in when implementing microservices using Eclipse MicroProfile Discover why MicroProfile is a great specification for building microservices in multi-cloud environments Book Description Eclipse MicroProfile has gained momentum in the industry as a multi-vendor, interoperable, community-driven specification. It is a major disruptor that allows organizations with large investments in enterprise Java to move to microservices without spending a lot on retraining their workforce. This book is based on MicroProfile 2.2, however, it will guide you in running your applications in MicroProfile 3.0. You'll start by understanding why microservices are important in the digital economy and how MicroProfile addresses the need for enterprise Java microservices. You'll learn about the subprojects that make up a MicroProfile, its value proposition to organizations and developers, and its processes and governance. As you advance, the book takes you through the capabilities and code examples of MicroProfile’s subprojects - Config, Fault Tolerance, Health Check, JWT Propagation, Metrics, and OpenTracing. Finally, you’ll be guided in developing a conference application using Eclipse MicroProfile, and explore possible scenarios of what’s next in MicroProfile with Jakarta EE. By the end of this book, you'll have gained a clear understanding of Eclipse MicroProfile and its role in enterprise Java microservices. What you will learn Understand why microservices are important in the digital economy Analyze how MicroProfile addresses the need for enterprise Java microservices Test and secure your applications with Eclipse MicroProfile Get to grips with various MicroProfile capabilities such as OpenAPI and Typesafe REST Client Explore reactive programming with MicroProfile Stream and Messaging candidate APIs Discover and implement coding best practices using MicroProfile Who this book is for If you’re a Java developer who wants to create enterprise microservices, this book is for you. Familiarity with Java EE and the concept of microservices will help you get the most out of this book.","language":"en","currency":"USD","id":"1838644326","title":"Hands-On Enterprise Java Microservices with Eclipse MicroProfile","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l6isDwAAQBAJ&source=gbs_api","authors":["Cesar Saavedra","Heiko W. Rupp","Jeff Mesnil","Pavol Loffay","Antoine Sabot-Durand","Scott Stark"]},{"pageCount":1040,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MdxACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Core Java® has long been recognized as the leading, no-nonsense tutorial and reference for experienced programmers who want to write robust Java code for real-world applications. Now, Core Java®, Volume I–Fundamentals, Tenth Edition, has been extensively updated to reflect the most eagerly awaited and innovative version of Java in years: Java SE 8. Rewritten and reorganized to illuminate new Java SE 8 features, idioms, and best practices, it contains hundreds of example programs–all carefully crafted for easy understanding and practical applicability. Writing for serious programmers solving real-world problems, Cay Horstmann helps you achieve a deep understanding of the Java language and library. In this first volume of the two-volume work, Horstmann focuses on fundamental language concepts and the foundations of modern user interface programming. You’ll find in-depth coverage of topics ranging from Java object-oriented programming to generics, collections, lambda expressions, Swing UI design, and the latest approaches to concurrency and functional programming. This guide will help you Leverage your existing programming knowledge to quickly master core Java syntax Understand how encapsulation, classes, and inheritance work in Java Master interfaces, inner classes, and lambda expressions for functional programming Improve program robustness with exception handling and effective debugging Write safer, more readable programs with generics and strong typing Use pre-built collections to collect multiple objects for later retrieval Master concurrent programming techniques from the ground up Build modern cross-platform GUIs with standard Swing components Deploy configurable applications and applets, and deliver them across the Internet Simplify concurrency and enhance performance with new functional techniques If you’re an experienced programmer moving to Java SE 8, Core Java®, Tenth Edition, will be your reliable, practical companion–now and for many years to come. Look for the companion volume, Core Java®, Volume II–Advanced Features, Tenth Edition (ISBN-13: 978-0-13-417729-8), for coverage of Java 8 streams, input and output, XML, databases, annotations, and other advanced topics. Register your product or convenient access to downloads, updates, and corrections as they become available. See inside the book for information.","language":"en","currency":"USD","id":"0134177355","title":"Core Java Volume I--Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MdxACwAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Zw5oBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":"Java Programming in a Multicore World","description":"The Definitive Guide to Lambda Expressions Mastering Lambdas: Java Programming in a Multicore World describes how the lambda-related features of Java SE 8 will enable Java to meet the challenges of next-generation parallel hardware architectures. The book explains how to write lambdas, and how to use them in streams and in collection processing, providing code examples throughout. You'll learn how to use lambda expressions to take full advantage of performance improvements provided by today's multicore hardware. This Oracle Press book covers: Why lambdas were needed, and how they will change Java programming Syntax of lambda expressions The basic operation of streams and pipelines Using collectors and reduction to end pipelines Creating streams Spliterators, the fork\/join framework, and exceptions Examining stream performance with microbenchmarking API evolution using default methods","language":"en","currency":"USD","id":"0071829636","title":"Mastering Lambdas","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Zw5oBAAAQBAJ&source=gbs_api","authors":["Maurice Naftalin"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NpCbAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Create Next-Generation Enterprise Applications Build and distribute business web applications that target both desktop and mobile devices. Cowritten by Java EE and NetBeans IDE experts, Java EE and HTML5 Enterprise Application Development fully explains cutting-edge, highly responsive design tools and strategies. Find out how to navigate NetBeans IDE, construct HTML5 programs, employ JavaScript APIs, integrate CSS and WebSockets, and handle security. This Oracle Press guide also offers practical coverage of SaaS, MVVM, and RESTful concepts. Explore HTML5 and Java EE 7 features Use NetBeans IDE editors, templates, and code generators Implement MVVM functionality with Knockout.js Dynamically map database objects using Java Persistence API Configure, manage, and invoke RESTful Web Services Maximize messaging efficiency through WebSockets Accept and process HTML5 Server-Sent Events streams Employ Syntactically Awesome Stylesheets, CSS3, and Sassy CSS","language":"en","currency":"USD","id":"007182314X","title":"Java EE and HTML5 Enterprise Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NpCbAgAAQBAJ&source=gbs_api","authors":["John Brock","Arun Gupta","Geertjan Wielenga"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ic0cEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":"Exam 1Z0-819 and Upgrade Exam 1Z0-817","description":"NOTE: The OCP Java SE 11 Programmer I Exam 1Z0-815 and Programmer II Exam 1Z0-816 have been retired (as of October 1, 2020), and Oracle has released a new Developer Exam 1Z0-819 to replace the previous exams. The Upgrade Exam 1Z0-817 remains the same. Improve your preparation for the OCP Java SE 11 Developer exam with these comprehensive practice tests OCP Oracle Certified Professional Java SE 11 Developer Practice Tests: Exam 1Z0-819 and Upgrade Exam 1Z0-817 offers readers over 1000 practice questions to help them hone their skills for the challenging 1Z0-819 exam as well as the 1Z0-817 upgrade exam. Covering all the objective domains that help readers master the crucial subject areas covered by the exam, OCP Oracle Certified Professional Java SE 11 Developer Practice Tests provides domain-by-domain questions as well as additional bonus practice exams to further solidify the reader’s mastery of its subjects. This book covers topics like: Understanding Java Technology and Environment Working with Java Operators, Primitives, and Strings Creating Methods and Lambda Expressions Designing Classes, Interfaces, Enums, and Annotations Writing Functional Interfaces and Streams Building Modules and Migrating Applications to Modules Applying I\/O, NIO.2, JDBC, Threads, and Concurrency Secure Coding in Java SE Application And much more Perfect for anyone studying for the OCP Java SE 11 Developer and Upgrade exams, as well as all those who wish to brush up on their Java programming skills, OCP Oracle Certified Professional Java SE 11 Developer Practice Tests: Exam 1Z0-819 and Upgade Exam 1Z0-817 is an indispensable resource that has a place on the bookshelf of every Java enthusiast, professional, and student.","language":"en","currency":"USD","id":"1119696178","title":"OCP Oracle Certified Professional Java SE 11 Developer Practice Tests","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ic0cEAAAQBAJ&source=gbs_api","authors":["Scott Selikoff","Jeanne Boyarsky"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Collective Wisdom from the Experts","description":"If you want to push your Java skills to the next level, this book provides expert advice from Java leaders and practitioners. You’ll be encouraged to look at problems in new ways, take broader responsibility for your work, stretch yourself by learning new techniques, and become as good at the entire craft of development as you possibly can. Edited by Kevlin Henney and Trisha Gee, 97 Things Every Java Programmer Should Know reflects lifetimes of experience writing Java software and living with the process of software development. Great programmers share their collected wisdom to help you rethink Java practices, whether working with legacy code or incorporating changes since Java 8. A few of the 97 things you should know: \"Behavior Is Easy, State Is Hard\"—Edson Yanaga “Learn Java Idioms and Cache in Your Brain”—Jeanne Boyarsky “Java Programming from a JVM Performance Perspective”—Monica Beckwith \"Garbage Collection Is Your Friend\"—Holly K Cummins “Java's Unspeakable Types”—Ben Evans \"The Rebirth of Java\"—Sander Mak “Do You Know What Time It Is?”—Christin Gorman","language":"en","currency":"USD","id":"1491952644","title":"97 Things Every Java Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvbkDwAAQBAJ&source=gbs_api","authors":["Kevlin Henney","Trisha Gee"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pcG3CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Use Raspberry Pi with Java to create innovative devices that power the internet of things! Raspberry Pi with Java: Programming the Internet of Things (IoT) fills an important gap in knowledge between seasoned Java developers and embedded-hardware gurus, taking a project-based approach to skills development from which both hobbyists and professionals can learn. By starting with simple projects based on open-source libraries such as Pi4J, hobbyists can get immediate results without a significant investment in time or hardware. Later projects target simplified industrial use cases where professionals can start to apply their skills to practical problems in the fields of home automation, healthcare, and robotics. This progression prepares you to be an active participant in the IoT revolution that is reshaping our lives. For the hobbyist: Hardware used in projects is affordable and easily accessible Follows a project-based learning approach with a gradual learning curve Projects are based on open-source code repositories with commercial friendly licenses For the professional computer engineer: Uses an industry-standard platform that allows for high performance, secure, production-ready applications Introduces Java SE Embedded for large devices and Java ME Embedded for small devices Code is portable to a wide variety of ARM and MIPS based platforms Provides practical skill development with advanced projects in the fields of home automation, healthcare, and robotics","language":"en","currency":"USD","id":"0071842020","title":"Raspberry Pi with Java: Programming the Internet of Things (IoT) (Oracle Press)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pcG3CgAAQBAJ&source=gbs_api","authors":["Stephen Chin","James Weaver"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=93YpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code","description":"You Will Learn Python 3! Zed Shaw has perfected the world’s best system for learning Python 3. Follow it and you will succeed—just like the millions of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. In Learn Python 3 the Hard Way, you’ll learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you’ll learn how a computer works; what good programs look like; and how to read, write, and think about code. Zed then teaches you even more in 5+ hours of video where he shows you how to break, fix, and debug your code—live, as he’s doing the exercises. Install a complete Python environment Organize and write code Fix and break code Basic mathematics Variables Strings and text Interact with users Work with files Looping and logic Data structures using lists and dictionaries Program design Object-oriented programming Inheritance and composition Modules, classes, and objects Python packaging Automated testing Basic game development Basic web development It’ll be hard at first. But soon, you’ll just get it—and that will feel great! This course will reward you for every minute you put into it. Soon, you’ll know one of the world’s most powerful, popular programming languages. You’ll be a Python programmer. This Book Is Perfect For Total beginners with zero programming experience Junior developers who know one or two languages Returning professionals who haven’t written code in years Seasoned professionals looking for a fast, simple, crash course in Python 3","language":"en","currency":"USD","id":"0134693906","title":"Learn Python 3 the Hard Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=93YpDwAAQBAJ&source=gbs_api","authors":["Zed A. Shaw"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wBQEp6ruIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"From Journeyman to Master","description":"What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” —Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” —Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” —Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” —John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” —Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” —Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” —Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” —Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” —Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.","language":"en","currency":"USD","id":"013211917X","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wBQEp6ruIAC&source=gbs_api","authors":["Andrew Hunt","David Thomas"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-g7VdTzHJkUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"Sometimes the simplest answer is the best. Many Enterprise Java developers, accustomed to dealing with Java's spiraling complexity, have fallen into the habit of choosing overly complicated solutions to problems when simpler options are available. Building server applications with \"heavyweight\" Java-based architectures, such as WebLogic, JBoss, and WebSphere, can be costly and cumbersome. When you've reached the point where you spend more time writing code to support your chosen framework than to solve your actual problems, it's time to think in terms of simplicity.In Better, Faster, Lighter Java, authors Bruce Tate and Justin Gehtland argue that the old heavyweight architectures are unwieldy, complicated, and contribute to slow and buggy application code. As an alternative means for building better applications, the authors present two \"lightweight\" open source architectures: Hibernate--a persistence framework that does its job with a minimal API and gets out of the way, and Spring--a container that's not invasive, heavy or complicated.Hibernate and Spring are designed to be fairly simple to learn and use, and place reasonable demands on system resources. Better, Faster, Lighter Java shows you how they can help you create enterprise applications that are easier to maintain, write, and debug, and are ultimately much faster.Written for intermediate to advanced Java developers, Better, Faster, Lighter Java, offers fresh ideas--often unorthodox--to help you rethink the way you work, and techniques and principles you'll use to build simpler applications. You'll learn to spend more time on what's important. When you're finished with this book, you'll find that your Java is better, faster, and lighter than ever before.","language":"en","currency":"USD","id":"9780596552794","title":"Better, Faster, Lighter Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-g7VdTzHJkUC&source=gbs_api","authors":["Bruce Tate","Justin Gehtland"]},{"pageCount":158,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ooQrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Algorithms and Information Retrieval in Java","description":"If you’re a student studying computer science or a software developer preparing for technical interviews, this practical book will help you learn and review some of the most important ideas in software engineering—data structures and algorithms—in a way that’s clearer, more concise, and more engaging than other materials. By emphasizing practical knowledge and skills over theory, author Allen Downey shows you how to use data structures to implement efficient algorithms, and then analyze and measure their performance. You’ll explore the important classes in the Java collections framework (JCF), how they’re implemented, and how they’re expected to perform. Each chapter presents hands-on exercises supported by test code online. Use data structures such as lists and maps, and understand how they work Build an application that reads Wikipedia pages, parses the contents, and navigates the resulting data tree Analyze code to predict how fast it will run and how much memory it will require Write classes that implement the Map interface, using a hash table and binary search tree Build a simple web search engine with a crawler, an indexer that stores web page contents, and a retriever that returns user query results Other books by Allen Downey include Think Java, Think Python, Think Stats, and Think Bayes.","language":"en","currency":"USD","id":"1491972319","title":"Think Data Structures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ooQrDwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":690,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-S6WDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A step-by-step guide to learning essential concepts in Java SE 10, 11, and 12","description":"A comprehensive guide to get started with Java and gain insights into major concepts such as object-oriented, functional, and reactive programming Key Features Strengthen your knowledge of important programming concepts and the latest features in Java Explore core programming topics including GUI programming, concurrency, and error handling Learn the idioms and best practices for writing high-quality Java code Book Description Java is one of the preferred languages among developers, used in everything right from smartphones, and game consoles to even supercomputers, and its new features simply add to the richness of the language. This book on Java programming begins by helping you learn how to install the Java Development Kit. You will then focus on understanding object-oriented programming (OOP), with exclusive insights into concepts like abstraction, encapsulation, inheritance, and polymorphism, which will help you when programming for real-world apps. Next, you’ll cover fundamental programming structures of Java such as data structures and algorithms that will serve as the building blocks for your apps. You will also delve into core programming topics that will assist you with error handling, debugging, and testing your apps. As you progress, you’ll move on to advanced topics such as Java libraries, database management, and network programming, which will hone your skills in building professional-grade apps. Further on, you’ll understand how to create a graphic user interface using JavaFX and learn to build scalable apps by taking advantage of reactive and functional programming. By the end of this book, you’ll not only be well versed with Java 10, 11, and 12, but also gain a perspective into the future of this language and software development in general. What you will learn Learn and apply object-oriented principles Gain insights into data structures and understand how they are used in Java Explore multithreaded, asynchronous, functional, and reactive programming Add a user-friendly graphic interface to your application Find out what streams are and how they can help in data processing Discover the importance of microservices and use them to make your apps robust and scalable Explore Java design patterns and best practices to solve everyday problems Learn techniques and idioms for writing high-quality Java code Who this book is for Students, software developers, or anyone looking to learn new skills or even a language will find this book useful. Although this book is for beginners, professional programmers can benefit from it too. Previous knowledge of Java or any programming language is not required.","language":"en","currency":"USD","id":"1789958482","title":"Learn Java 12 Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-S6WDwAAQBAJ&source=gbs_api","authors":["Nick Samoylov"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QBDlBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":null,"description":"This book assumes very little or no knowledge of how computers work, and shows how to write understandable programs in Java. Even though most readers will not wish to become professional programmers, programming is fun and useful, and, in today's world it is important for professionals in any field to appreciate what computers can (and cannot) do well. To reach this level of understanding, Per Brinch Hansen goes beyond the routine skills of a computer user and explains the art of programming in some depth, allowing readers to write Java programs for use on the WWW or company's Intranet. Although a book about programming with Java, the same methods can be used for systematic programming in such languages as C, Fortran, and Pascal. The book makes a splendid text for a one semester course on beginning programming and is backed by teaching aids available at the author's Website.","language":"en","currency":"USD","id":"1461215145","title":"Programming for Everyone in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QBDlBwAAQBAJ&source=gbs_api","authors":["Per B. Hansen"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9onCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.29,"subtitle":null,"description":"In just 21 days, you can acquire the knowledge and skills necessary to develop applications on your computer, web servers, and mobile devices. With this complete tutorial you’ll quickly master the basics and then move on to more advanced features and concepts. Completely updated for Java 11 and 12, this book teaches you about the Java language and how to use it to create applications for any computing environment. By the time you have finished the book, you’ll have well-rounded knowledge of Java and the Java class libraries. No previous programming experience required. By following the 21 carefully organized lessons in this book, anyone can learn the basics of Java programming. Learn at your own pace. You can work through each chapter sequentially to make sure you thoroughly understand all the concepts and methodologies, or you can focus on specific lessons to learn the techniques that interest you most. Test your knowledge. Each chapter ends with a Workshop section filled with questions, answers, and exercises for further study. There are even certification practice questions. Completely revised, updated, and expanded to cover the latest features of Java 11 and 12 Learn to develop Java applications using NetBeans–an excellent programming platform Easy-to-understand, practical examples clearly illustrate the fundamentals of Java programming Discover how to quickly develop programs with a graphical user interface Find out about JDBC programming with the Derby database Learn how to use Inner Classes and Lambda Expressions Learn rapid application development with Apache NetBeans Create a game using Java","language":"en","currency":"USD","id":"0134663675","title":"Sams Teach Yourself Java in 21 Days (Covers Java 11\/12)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9onCDwAAQBAJ&source=gbs_api","authors":["Rogers Cadenhead"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-ghnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Techniques for building machine learning and neural network models for NLP, 2nd Edition","description":"Explore various approaches to organize and extract useful text from unstructured data using Java Key Features Use deep learning and NLP techniques in Java to discover hidden insights in text Work with popular Java libraries such as CoreNLP, OpenNLP, and Mallet Explore machine translation, identifying parts of speech, and topic modeling Book Description Natural Language Processing (NLP) allows you to take any sentence and identify patterns, special names, company names, and more. The second edition of Natural Language Processing with Java teaches you how to perform language analysis with the help of Java libraries, while constantly gaining insights from the outcomes. You’ll start by understanding how NLP and its various concepts work. Having got to grips with the basics, you’ll explore important tools and libraries in Java for NLP, such as CoreNLP, OpenNLP, Neuroph, and Mallet. You’ll then start performing NLP on different inputs and tasks, such as tokenization, model training, parts-of-speech and parsing trees. You’ll learn about statistical machine translation, summarization, dialog systems, complex searches, supervised and unsupervised NLP, and more. By the end of this book, you’ll have learned more about NLP, neural networks, and various other trained models in Java for enhancing the performance of NLP applications. What you will learn Understand basic NLP tasks and how they relate to one another Discover and use the available tokenization engines Apply search techniques to find people, as well as things, within a document Construct solutions to identify parts of speech within sentences Use parsers to extract relationships between elements of a document Identify topics in a set of documents Explore topic modeling from a document Who this book is for Natural Language Processing with Java is for you if you are a data analyst, data scientist, or machine learning engineer who wants to extract information from a language using Java. Knowledge of Java programming is needed, while a basic understanding of statistics will be useful but not mandatory.","language":"en","currency":"USD","id":"1788993063","title":"Natural Language Processing with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-ghnDwAAQBAJ&source=gbs_api","authors":["Richard M. Reese","AshishSingh Bhatia"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fbM1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"An Accessible Guide to the Java Language and Libraries Modern Java introduces major enhancements that impact the core Java technologies and APIs at the heart of the Java platform. Many old Java idioms are no longer needed and new features such as modularization make you far more effective. However, navigating these changes can be challenging. Core Java® SE 9 for the Impatient, Second Edition, is a complete yet concise guide that includes all the latest changes up to Java SE 9. Written by Cay S. Horstmann–author of the classic two-volume Core Java–this indispensable tutorial offers a faster, easier pathway for learning modern Java. Given Java SE 9’s size and the scope of its enhancements, there’s plenty to cover, but it’s presented in small chunks organized for quick access and easy understanding. Horstmann’s practical insights and sample code help you quickly take advantage of all that’s new, from Java SE 9’s long-awaited “Project Jigsaw” module system to the improvements first introduced in Java SE 8, including lambda expressions and streams. Use modules to simplify the development of well-performing complex systems Migrate applications to work with the modularized Java API and third-party modules Test code as you create it with the new JShell Read-Eval-Print Loop (REPL) Use lambda expressions to express actions more concisely Streamline and optimize data management with today’s Streams API Leverage modern concurrent programming based on cooperating tasks Take advantage of a multitude of API improvements for working with collections, input\/output, regular expressions, and processes Whether you’re just getting started with modern Java or you’re an experienced developer, this guide will help you write tomorrow’s most robust, efficient, and secure Java code. Register your product at informit.com\/register for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134694821","title":"Core Java SE 9 for the Impatient","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fbM1DwAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":182,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qKUdAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Pragmatic Functional Programming","description":"If you’re a developer with core Java SE skills, this hands-on book takes you through the language changes in Java 8 triggered by the addition of lambda expressions. You’ll learn through code examples, exercises, and fluid explanations how these anonymous functions will help you write simple, clean, library-level code that solves business problems. Lambda expressions are a fairly simple change to Java, and the first part of the book shows you how to use them properly. Later chapters show you how lambda functions help you improve performance with parallelism, write simpler concurrent code, and model your domain more accurately, including building better DSLs. Use exercises in each chapter to help you master lambda expressions in Java 8 quickly Explore streams, advanced collections, and other Java 8 library improvements Leverage multicore CPUs and improve performance with data parallelism Use techniques to “lambdify” your existing codebase or library code Learn practical solutions for lambda expression unit testing and debugging Implement SOLID principles of object-oriented programming with lambdas Write concurrent applications that efficiently perform message passing and non-blocking I\/O","language":"en","currency":"USD","id":"1449370853","title":"Java 8 Lambdas","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qKUdAwAAQBAJ&source=gbs_api","authors":["Richard Warburton"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JQXtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Exam 1Z0-816 and Exam 1Z0-817","description":"The completely-updated preparation guide for the new OCP Oracle Certified Professional Java SE 11 Programmer II exam—covers Exam 1Z0-816 Java, a platform-independent, object-oriented programming language, is used primarily in mobile and desktop application development. It is a popular language for client-side cloud applications and the principal language used to develop Android applications. Oracle has recently updated its Java Programmer certification tracks for Oracle Certified Professional. OCP Oracle Certified Professional Java SE 11 Programmer II Study Guide ensures that you are fully prepared for this difficult certification exam. Covering 100% of exam objectives, this in-depth study guide provides comprehensive coverage of the functional-programming knowledge necessary to succeed. Every exam topic is thoroughly and completely covered including exceptions and assertions, class design, generics and collections, threads, concurrency, IO and NIO, and more. Access to Sybex's superior online interactive learning environment and test bank—including self-assessment tests, chapter tests, bonus practice exam questions, electronic flashcards, and a searchable glossary of important terms—provides everything you need to be fully prepared on exam day. This must-have guide: Covers all exam objectives such as inheriting abstract classes and interfaces, advanced strings and localization, JDBC, and Object-Oriented design principles and patterns Explains complex material and reinforces your comprehension and retention of important topics Helps you master more advanced areas of functional programming Demonstrates practical methods for building Java solutions OCP Oracle Certified Professional Java SE 11 Programmer II Study Guide will prove invaluable for anyone seeking achievement of this challenging exam, as well as junior- to senior-level programmers who uses Java as their primary programming language.","language":"en","currency":"USD","id":"1119617634","title":"OCP Oracle Certified Professional Java SE 11 Programmer II Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JQXtDwAAQBAJ&source=gbs_api","authors":["Scott Selikoff","Jeanne Boyarsky"]},{"pageCount":636,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vWI5Jx5VRgEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Brain Friendly Guide to OOA&D","description":"\"Head First Object Oriented Analysis and Design is a refreshing look at subject of OOAD. What sets this book apart is its focus on learning. The authors have made the content of OOAD accessible, usable for the practitioner.\" Ivar Jacobson, Ivar Jacobson Consulting \"I just finished reading HF OOA&D and I loved it! The thing I liked most about this book was its focus on why we do OOA&D-to write great software!\" Kyle Brown, Distinguished Engineer, IBM \"Hidden behind the funny pictures and crazy fonts is a serious, intelligent, extremely well-crafted presentation of OO Analysis and Design. As I read the book, I felt like I was looking over the shoulder of an expert designer who was explaining to me what issues were important at each step, and why.\" Edward Sciore,Associate Professor, Computer Science Department, Boston College Tired of reading Object Oriented Analysis and Design books that only makes sense after you're an expert? You've heard OOA&D can help you write great software every time-software that makes your boss happy, your customers satisfied and gives you more time to do what makes you happy. But how? Head First Object-Oriented Analysis & Design shows you how to analyze, design, and write serious object-oriented software: software that's easy to reuse, maintain, and extend; software that doesn't hurt your head; software that lets you add new features without breaking the old ones. Inside you will learn how to: Use OO principles like encapsulation and delegation to build applications that are flexible Apply the Open-Closed Principle (OCP) and the Single Responsibility Principle (SRP) to promote reuse of your code Leverage the power of design patterns to solve your problems more efficiently Use UML, use cases, and diagrams to ensure that all stakeholders arecommunicating clearly to help you deliver the right software that meets everyone's needs. By exploiting how your brain works, Head First Object-Oriented Analysis & Design compresses the time it takes to learn and retain complex information. Expect to have fun, expect to learn, expect to be writing great software consistently by the time you're finished reading this!","language":"en","currency":"USD","id":"1449368492","title":"Head First Object-Oriented Analysis and Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vWI5Jx5VRgEC&source=gbs_api","authors":["Brett McLaughlin","Gary Pollice","David West"]},{"pageCount":831,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L-U5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Solve all your Spring 5 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work over creating a project from scratch. The recipes in Spring 5 Recipes cover Spring fundamentals such as Spring IoC container, Spring AOP\/ AspectJ, and more. Other recipes include Spring enterprise solutions for topics such as Spring Java EE integration, Spring Integration, Spring Batch, Spring Remoting, messaging, transactions, and working with big data and the cloud using Hadoop and MongoDB. Finally, Spring web recipes cover Spring MVC, other dynamic scripting, integration with the popular Grails Framework (and Groovy), REST\/web services, and more. You’ll also see recipes on new topics such as Spring Framework 5, reactive Spring, Spring 5 microservices, the functional web framework and much more. This book builds upon the best-selling success of the previous editions and focuses on the latest Spring Framework features for building enterprise Java applications. What You'll Learn Get re-usable code recipes and snippets for core Spring, annotations and other development tools Access Spring MVC for web development Work with Spring REST and microservices for web services development and integration into your enterprise Java applications Use Spring Batch, NoSQL and big data for building and integrating various cloud computing services and resources Integrate Java Enterprise Edition and other Java APIs for use in Spring Use Grails code and much more Who This Book Is For Experienced Java and Spring programmers.","language":"en","currency":"USD","id":"1484227905","title":"Spring 5 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L-U5DwAAQBAJ&source=gbs_api","authors":["Marten Deinum","Daniel Rubio","Josh Long"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NLZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Invoke TDD principles for end-to-end application development, 2nd Edition","description":"This book will teach the concepts of test driven development in Java so you can build clean, maintainable and robust code Key Features Explore the most popular TDD tools and frameworks and become more proficient in building applications Create applications with better code design, fewer bugs, and higher test coverage, enabling you to get them to market quickly Implement test-driven programming methods into your development workflows Book Description Test-driven development (TDD) is a development approach that relies on a test-first procedure that emphasizes writing a test before writing the necessary code, and then refactoring the code to optimize it.The value of performing TDD with Java, one of the longest established programming languages, is to improve the productivity of programmers and the maintainability and performance of code, and develop a deeper understanding of the language and how to employ it effectively. Starting with the basics of TDD and understanding why its adoption is beneficial, this book will take you from the first steps of TDD with Java until you are confident enough to embrace the practice in your day-to-day routine.You'll be guided through setting up tools, frameworks, and the environment you need, and we will dive right into hands-on exercises with the goal of mastering one practice, tool, or framework at a time. You'll learn about the Red-Green-Refactor procedure, how to write unit tests, and how to use them as executable documentation.With this book, you'll also discover how to design simple and easily maintainable code, work with mocks, utilize behavior-driven development, refactor old legacy code, and release a half-finished feature to production with feature toggles.You will finish this book with a deep understanding of the test-driven development methodology and the confidence to apply it to application programming with Java. What you will learn Explore the tools and frameworks required for effective TDD development Perform the Red-Green-Refactor process efficiently, the pillar around which all other TDD procedures are based Master effective unit testing in isolation from the rest of your code Design simple and easily maintainable code by implementing different techniques Use mocking frameworks and techniques to easily write and quickly execute tests Develop an application to implement behavior-driven development in conjunction with unit testing Enable and disable features using feature toggles Who this book is for If you're an experienced Java developer and want to implement more effective methods of programming systems and applications, then this book is for you.","language":"en","currency":"USD","id":"1788832124","title":"Test-Driven Java Development, Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NLZTDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic","Alex Garcia"]},{"pageCount":467,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sRvHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Building Applications on the Rich Client Platform","description":"Take a detailed look at the NetBeans IDE and new features in the NetBeans Platform. Learn about support for JShell, the Jigsaw Module System, and Local Variable Type Inference, focusing on what this new version of NetBeans brings to developers who are working in Java and other supported languages. The book is a practical, hands-on guide providing a number of step-by-step recipes that help you take advantage of the power in the latest Java (and other) software platforms, and gives a good grounding on using NetBeans IDE for your projects. This book has been written by Apache community members who both use the IDE and actively contribute and develop Apache NetBeans as an open source project. Pro Apache NetBeans consists of three parts. The first part describes how to use the IDE as well as the new features that it brings to support the latest Java versions. The second part describes how you can extend NetBeans by creating plugins and writing your own applications using the Rich Client Platform. The third part describes how you can contribute to develop NetBeans IDE further, becoming part of the open source team that is driving future developments in the toolset. What You Will Learn Work faster and more effectively by applying expert tips and tricks Apply NetBeans' most cutting-edge features to your Java development Debug your applications using intuitive features built into the IDE Identify performance issues in your application by using the NetBeans profiler Develop using the latest API of the NetBeans Rich Client Platform Extend Apache NetBeans by creating plugins built on the Rich Client Platform Build NetBeans from source and understand the internals of NetBeans itself Contribute to the large community that supports and develops NetBeans Who This Book Is For Developers who want to know the latest features in NetBeans, as well as how the transition to Apache has affected the future of the NetBeans IDE. The book is also of interest to those desiring to become contributors to the NetBeans project and to influence its future development. Java developers who need to create a new desktop application from scratch also will benefit from this book.","language":"en","currency":"USD","id":"1484253701","title":"Pro Apache NetBeans","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sRvHDwAAQBAJ&source=gbs_api","authors":["Ioannis Kostaras","Constantin Drabo","Josh Juneau","Sven Reimers","Mario Schröder","Geertjan Wielenga"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9A5QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Automate Anything with BDD Tools and Techniques","description":"You can test just about anything with Cucumber. We certainly have, and in Cucumber Recipes we'll show you how to apply our hard-won field experience to your own projects. Once you've mastered the basics, this book will show you how to get the most out of Cucumber--from specific situations to advanced test-writing advice. With over forty practical recipes, you'll test desktop, web, mobile, and server applications across a variety of platforms. This book gives you tools that you can use today to automate any system that you encounter, and do it well. The Cucumber Book showed you how your team can work together to write executable specifications--documents that tell a clear story and also happen to be working test code. We'll arm you with ready-rolled solutions to real-world problems: your tests will run faster, read more clearly, and work in any environment. Our first tips will help you fit Cucumber into your workflow. Powerful filters will tame tables full of test data, transforming them into the format your application needs. Custom output formatters will generate reports for any occasion. Continuous Integration servers will run your Cucumber tests every time the code changes. Next, you'll find recipes tailored to the platform you're running on. Ever wanted to know how to test a Grails app from Cucumber? Need to put a Windows program through its paces? How about a mobile app running on Android or iOS? We'll show you how to do all of these. Throughout the book, you'll see how to make Cucumber sing as you interoperate with different platforms, languages, and environments. From embedded circuits to Python and PHP web apps, Cucumber has something for you. What You Need: You'll need basic working knowledge of Cucumber and Ruby. Individual recipes may have additional requirements; for example, a recipe on Windows automation might pull in an open source GUI driver. We've written the recipes for compatibility with Ruby 1.9.3 and 1.8.7, plus Cucumber 1.1.4. Other versions may work as well, but these are the ones we test with.","language":"en","currency":"USD","id":"1680503367","title":"Cucumber Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9A5QDwAAQBAJ&source=gbs_api","authors":["Ian Dees","Matt Wynne","Aslak Hellesoy"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-W57DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The Definitive Java Programming Guide Fully updated for Java SE 11, Java: The Complete Reference, Eleventh Edition explains how to develop, compile, debug, and run Java programs. Best-selling programming author Herb Schildt covers the entire Java language, including its syntax, keywords, and fundamental programming principles. You’ll also find information on key portions of the Java API library, such as I\/O, the Collections Framework, the stream library, and the concurrency utilities. Swing, JavaBeans, and servlets are examined and numerous examples demonstrate Java in action. Of course, the very important module system is discussed in detail. This Oracle Press resource also offers an introduction to JShell, Java’s interactive programming tool. Best of all, the book is written in the clear, crisp, uncompromising style that has made Schildt the choice of millions worldwide. Coverage includes: •Data types, variables, arrays, and operators•Control statements•Classes, objects, and methods•Method overloading and overriding•Inheritance•Local variable type inference•Interfaces and packages•Exception handling•Multithreaded programming•Enumerations, autoboxing, and annotations•The I\/O classes•Generics•Lambda expressions•Modules•String handling•The Collections Framework•Networking•Event handling•AWT•Swing •The Concurrent API•The Stream API•Regular expressions•JavaBeans•Servlets•Much, much more Code examples in the book are available for download at www.OraclePressBooks.com.","language":"en","currency":"USD","id":"1260440249","title":"Java: The Complete Reference, Eleventh Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-W57DwAAQBAJ&source=gbs_api","authors":["Herbert Schildt"]},{"pageCount":128,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rf1_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"A hands-on guide to building an enterprise-grade, scalable RESTful web service using the Spring Framework About This Book Follow best practices and explore techniques such as clustering and caching to achieve a scalable web service Leverage the Spring Framework to quickly implement RESTful endpoints Learn to implement a client library for a RESTful web service using the Spring Framework Who This Book Is For This book is intended for those who want to learn to build RESTful web services with the Spring Framework. To make best use of the code samples included in the book, you should have a basic knowledge of the Java language. Previous experience with the Spring Framework would also help you get up and running quickly. What You Will Learn Deep dive into the principles behind REST Expose CRUD operations through RESTful endpoints with the Spring Framework Devise response formats and error handling strategies, offering a consistent and flexible structure to simplify integration for service consumers Follow the best approaches for dealing with a service's evolution while maintaining backward compatibility Understand techniques to secure web services Comply with the best ways to test RESTful web services, including tips for load testing Optimise and scale web services using techniques such as caching and clustering In Detail REST is an architectural style that tackles the challenges of building scalable web services. In today's connected world, APIs have taken a central role on the web. APIs provide the fabric through which systems interact, and REST has become synonymous with APIs. The depth, breadth, and ease of use of Spring makes it one of the most attractive frameworks in the Java ecosystem. Marrying the two technologies is therefore a very natural choice. This book takes you through the design of RESTful web services and leverages the Spring Framework to implement these services. Starting from the basics of the philosophy behind REST, you'll go through the steps of designing and implementing an enterprise-grade RESTful web service. Taking a practical approach, each chapter provides code samples that you can apply to your own circumstances. This book goes beyond the use of Spring and explores approaches to tackle resilience, security, and scalability concerns. You'll learn techniques to deal with security in Spring and discover how to implement unit and integration test strategies. Finally, the book ends by walking you through building a Java client for your RESTful web service, along with some scaling techniques for it. Style and approach This book is a step-by-step, hands-on guide to designing and building RESTful web services. The book follows the natural cycle of developing these services and includes multiple code samples to help you.","language":"en","currency":"USD","id":"1785283197","title":"Building a RESTful Web Service with Spring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rf1_CwAAQBAJ&source=gbs_api","authors":["Ludovic Dewailly"]},{"pageCount":846,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gIY7BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"","description":"This book covers the most important topics any Java developer should master: object-oriented programming, Java language syntax, and the Java libraries. Designed as a guidebook for those who want to become a Java developer, Java 7: A Comprehensive Tutorial discusses the essential Java programming topics that you need to master in order teach other technologies to yourself.","language":"en","currency":"USD","id":"0980839661","title":"Java 7: A Comprehensive Tutorial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gIY7BAAAQBAJ&source=gbs_api","authors":["Budi Kurniawan"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=udgtAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Scala is a modern programming language for the Java Virtual Machine (JVM) that combines the best features of object-oriented and functional programming languages. Using Scala, you can write programs more concisely than in Java, as well as leverage the full power of concurrency. Since Scala runs on the JVM, it can access any Java library and is interoperable with Java frameworks. Scala for the Impatient concisely shows developers what Scala can do and how to do it. In this book, Cay Horstmann, the principal author of the international best-selling Core Java™, offers a rapid, code-based introduction that’s completely practical. Horstmann introduces Scala concepts and techniques in “blog-sized” chunks that you can quickly master and apply. Hands-on activities guide you through well-defined stages of competency, from basic to expert. Coverage includes Getting started quickly with Scala’s interpreter, syntax, tools, and unique idioms Mastering core language features: functions, arrays, maps, tuples, packages, imports, exception handling, and more Becoming familiar with object-oriented programming in Scala: classes, inheritance, and traits Using Scala for real-world programming tasks: working with files, regular expressions, and XML Working with higher-order functions and the powerful Scala collections library Leveraging Scala’s powerful pattern matching and case classes Creating concurrent programs with Scala actors Implementing domain-specific languages Understanding the Scala type system Applying advanced “power tools” such as annotations, implicits, and delimited continuations Scala is rapidly reaching a tipping point that will reshape the experience of programming. This book will help object-oriented programmers build on their existing skills, allowing them to immediately construct useful applications as they gradually master advanced programming techniques.","language":"en","currency":"USD","id":"0132761807","title":"Scala for the Impatient","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=udgtAAAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ug9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Design and Deploy Production-Ready Software","description":"A single dramatic software failure can cost a company millions of dollars - but can be avoided with simple changes to design and architecture. This new edition of the best-selling industry standard shows you how to create systems that run longer, with fewer failures, and recover better when bad things happen. New coverage includes DevOps, microservices, and cloud-native architecture. Stability antipatterns have grown to include systemic problems in large-scale systems. This is a must-have pragmatic guide to engineering for production systems. If you're a software developer, and you don't want to get alerts every night for the rest of your life, help is here. With a combination of case studies about huge losses - lost revenue, lost reputation, lost time, lost opportunity - and practical, down-to-earth advice that was all gained through painful experience, this book helps you avoid the pitfalls that cost companies millions of dollars in downtime and reputation. Eighty percent of project life-cycle cost is in production, yet few books address this topic. This updated edition deals with the production of today's systems - larger, more complex, and heavily virtualized - and includes information on chaos engineering, the discipline of applying randomness and deliberate stress to reveal systematic problems. Build systems that survive the real world, avoid downtime, implement zero-downtime upgrades and continuous delivery, and make cloud-native applications resilient. Examine ways to architect, design, and build software - particularly distributed systems - that stands up to the typhoon winds of a flash mob, a Slashdotting, or a link on Reddit. Take a hard look at software that failed the test and find ways to make sure your software survives. To skip the pain and get the experience...get this book.","language":"en","currency":"USD","id":"1680504525","title":"Release It!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ug9QDwAAQBAJ&source=gbs_api","authors":["Michael T. Nygard"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":898,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BUZVAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.6,"subtitle":null,"description":"Core Java for Beginners has been written keeping in mind the requirements of B.Tech and MCA students. The book introduces the core concepts of Java, along with the knowledge of fundamentals required for developing programs. Starting from the basic concepts of object-oriented programming languages, the book covers an entire range of topics, including advanced topics like RMI, JDBC, and so on. The text is replete with several examples to facilitate better understanding of the intricacies of the programming language. KEY FEATURES • Incorporates features of Java 2 and J2SE • Discusses exception handling in depth • Discusses garbage collection • Introduces new pedagogical feature 'Remember', which recapitulates the key points discussed and also clarifies finer programming and conceptual points • Presents around 350 tested programs with outputs and reinforces the learning through exercises","language":"en","currency":"USD","id":"9325968509","title":"Core Java for Beginners, 3rd Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BUZVAQAAQBAJ&source=gbs_api","authors":["Rashmi Kant Das"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Simplify the development of lightning fast applications based on microservices and reactive programming","description":"Use Spring Boot to build lightning-fast apps About This Book Get up to date with the defining characteristics of Spring Boot 2.0 in Spring Framework 5 Learn to perform Reactive programming with SpringBoot Learn about developer tools, AMQP messaging, WebSockets, security, MongoDB data access, REST, and more Who This Book Is For This book is designed for both novices and experienced Spring developers. It will teach you how to override Spring Boot's opinions and frees you from the need to define complicated configurations. What You Will Learn Create powerful, production-grade applications and services with minimal fuss Support multiple environments with one artifact, and add production-grade support with features Find out how to tweak your apps through different properties Use custom metrics to track the number of messages published and consumed Enhance the security model of your apps Make use of reactive programming in Spring Boot Build anything from lightweight unit tests to fully running embedded web container integration tests In Detail Spring Boot provides a variety of features that address today's business needs along with today's scalable requirements. In this book, you will learn how to leverage powerful databases and Spring Boot's state-of-the-art WebFlux framework. This practical guide will help you get up and running with all the latest features of Spring Boot, especially the new Reactor-based toolkit. The book starts off by helping you build a simple app, then shows you how to bundle and deploy it to the cloud. From here, we take you through reactive programming, showing you how to interact with controllers and templates and handle data access. Once you're done, you can start writing unit tests, slice tests, embedded container tests, and even autoconfiguration tests. We go into detail about developer tools, AMQP messaging, WebSockets, security, and deployment. You will learn how to secure your application using both routes and method-based rules. By the end of the book, you'll have built a social media platform from which to apply the lessons you have learned to any problem. If you want a good understanding of building scalable applications using the core functionality of Spring Boot, this is the book for you. Style and approach This book takes a tutorial-based approach to teach you all you need to know to get up and running with the latest version of Spring Boot. Filled with examples, you will gain hands-on experience of every area that Spring tackles.","language":"en","currency":"USD","id":"1786468204","title":"Learning Spring Boot 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EkBPDwAAQBAJ&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":733,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Jt3KDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"A Game Application Approach","description":"This is a Java textbook for beginning programmers that uses game programming as a central pedagogical tool to improve student engagement, learning outcomes, and retention. Game programming is incorporated into the text in a way that does not compromise the amount of material traditionally covered in a basic or advanced programming course and permits instructors who are not familiar with game programming and computer graphics concept to realize their advantages. The material presented in the book is in full compliance with the 2013 ACM\/IEEE computer science curriculum guidelines and provides an in-depth discussion of graphical user interfaces (GUIs). It has been used to teach programming to student whose majors are both within and outside of the computing fields. The companion DVD includes a game environment that is easily integrated into projects created with the popular Java Development Environments (Eclipse, NetBeans, and JCreator) and includes a set of executable student games to pique students’ interest by giving them a glimpse into their future capabilities. The material in this book can be covered within one or two courses such as a basic programming course followed by an advanced programming course. Features: Uses an objects-early approach to learning Java. Follows the 2013 ACM\/IEEE computer science curriculum guidelines Integrates game programming as central pedagogical tool to improve student engagement, learning outcomes, and retention Includes a companion DVD with projects created with the popular Java Development Environments; also includes a set of executable games, source code, and figures Uses working programs to illustrate concepts under discussion Complete instructor’s resource package available upon adoption","language":"en","currency":"USD","id":"1938549791","title":"Programming Fundamentals Using Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Jt3KDgAAQBAJ&source=gbs_api","authors":["William McAllister","S. Jane Fritz"]},{"pageCount":638,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G9PXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Problems and Solutions for Java Developers","description":"Java continues to grow and evolve, and this cookbook continues to evolve in tandem. With this guide, you’ll get up to speed right away with hundreds of hands-on recipes across a broad range of Java topics. You’ll learn useful techniques for everything from string handling and functional programming to network communication. Each recipe includes self-contained code solutions that you can freely use, along with a discussion of how and why they work. If you’re familiar with Java basics, this cookbook will bolster your knowledge of the language and its many recent changes, including how to apply them in your day-to-day development. This updated edition covers changes through Java 12 and parts of 13 and 14. Recipes include: Methods for compiling, running, and debugging Packaging Java classes and building applications Manipulating, comparing, and rearranging text Regular expressions for string and pattern matching Handling numbers, dates, and times Structuring data with collections, arrays, and other types Object-oriented and functional programming techniques Input\/output, directory, and filesystem operations Network programming on both client and server Processing JSON for data interchange Multithreading and concurrency Using Java in big data applications Interfacing Java with other languages","language":"en","currency":"USD","id":"1492072532","title":"Java Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G9PXDwAAQBAJ&source=gbs_api","authors":["Ian F. Darwin"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TLaZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Better Collaboration for Better Software","description":"Master BDD to deliver higher-value software more quickly To develop high-value products quickly, software development teams need better ways to collaborate. Agile methods like Scrum and Kanban are helpful, but they’re not enough. Teams need better ways to work inside each sprint or work item. Behavior-driven development (BDD) adds just enough structure for product experts, testers, and developers to collaborate more effectively. Drawing on extensive experience helping teams adopt BDD, Richard Lawrence and Paul Rayner show how to explore changes in system behavior with examples through conversations, how to capture your examples in expressive language, and how to flow the results into effective automated testing with Cucumber. Where most BDD resources focus on test automation, this guide goes deep into how BDD changes team collaboration and what that collaboration looks like day to day. Concrete examples and practical advice will prepare you to succeed with BDD, whatever your context or role. · Learn how to collaborate better by using concrete examples of system behavior · Identify your project’s meaningful increment of value so you’re always working on something important · Begin experimenting with BDD slowly and at low risk · Move smoothly from informal examples to automated tests in Cucumber · Use BDD to deliver more frequently with greater visibility · Make Cucumber scenarios more expressive to ensure you’re building the right thing · Grow a Cucumber suite that acts as high-value living documentation · Sustainably work with complex scenario data · Get beyond the “mini-waterfalls” that often arise on Scrum teams","language":"en","currency":"USD","id":"0132748517","title":"Behavior-Driven Development with Cucumber","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TLaZDwAAQBAJ&source=gbs_api","authors":["Richard Lawrence","Paul Rayner"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L7d0LNpSrRwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"* 1st and only book to market on the open source Spring MVC and Web Flows, positioned to become the new \"Struts.\" * Will be the only authoritative solution, by the Spring MVC and Spring Web Flows project leads themselves. * Two markets for this book. 1) Ex-patriots from the Struts world who have developed numerous web applications, but are looking for more and willing to take the initiative to experiment with new solutions; and 2) early adopter web developers into Web Flow, which has created a lot of buzz and will generate interest around this book as well as Spring MVC.","language":"en","currency":"USD","id":"9781430201335","title":"Expert Spring MVC and Web Flow","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L7d0LNpSrRwC&source=gbs_api","authors":["Colin Yates","Seth Ladd","Steven Devijver","Darren Davison"]},{"pageCount":335,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lqDSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"From Novice to Professional","description":"Discover the Ballerina programming language for next-generation microservices and native cloud application development. This book shows you that Ballerina is a cutting-edge programming language, which incorporates many of the latest technological advancements in programming language theory. You'll learn variables and types, modules and functions, flow control, error handling, concurrency, I\/O, cloud\/network programming, persistence and data access, security and more. Additionally, Beginning Ballerina Programming introduces many foundation computer science topics along the way and doesn’t assume much prior knowledge. For example, when introducing transport-level security, you will get a brief introduction to public-key cryptography, how it is different from private-key cryptography, and why we need it. This provides an added bonus for you to learn something new and general in computer science. After reading and using this book, you'll be proficient with Ballerina and cloud-first programming and apply these concepts and techniques to your next cloud application developments. What You'll Learn Start programming with Ballerina Gain the basics of network communication and programming Obtain a solid understanding of services\/API development and resilient communication Discover cloud-native technologies using Ballerina Deploy to the cloud using Ballerina Who This Book Is For Absolute beginners in computer programming: No prior experience with computer programming is expected. This can also be a reference book for experienced developers in other languages, who want to learn a modern programming language.","language":"en","currency":"USD","id":"1484251393","title":"Beginning Ballerina Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lqDSDwAAQBAJ&source=gbs_api","authors":["Anjana Fernando","Lakmal Warusawithana"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fVCuB_Xq3pAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Java Persistence API","description":"First EJB 3.0 book on the market and a definitive guide to the major innovation in EJB: the new persistence API Offers unparalleled insight and expertise: lead authored by the co-lead on the EJB 3.0 spec (Mike Keith)","language":"en","currency":"USD","id":"9781430201687","title":"Pro EJB 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fVCuB_Xq3pAC&source=gbs_api","authors":["Mike Keith","Merrick Schincariol"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1XTlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Java® Performance Companion shows how to systematically and proactively improve Java performance with today’s advanced multicore hardware and complex operating system environments. The authors, who are all leading Java performance and Java HotSpot VM experts, help you improve performance by using modern software engineering practices, avoiding common mistakes, and applying tips and tricks gleaned from years of real-world experience. Picking up where Charlie Hunt and Binu John’s classic Java Performance left off, this book provides unprecedented detail on two powerful Java platform innovations: the Garbage First (G1) garbage collector and the HotSpot VM Serviceability Agent. Coverage includes Leveraging G1 to overcome limitations in parallel, serial, and CMS garbage collection Understanding each stage of G1 GC collections, both young and old Getting under the hood with G1 and efficiently fine-tuning it for your application Identifying potential optimizations, interpreting experimental results, and taking action Exploring the internals of the HotSpot VM Using HotSpot VM Serviceability Agent to analyze, triage, and resolve diverse HotSpot VM issues Troubleshooting out of memory errors, Java level deadlocks, and HotSpot VM crashes Extending the Serviceability Agent, and using the Plugin for VisualVM Mastering useful HotSpot VM command line options not covered in Java™ Performance Java® Performance Companion can help you squeeze maximum performance and value from Java with JDK 8 or 9–for any application, in any environment. Register your product at informit.com\/register for convenient access to downloads, updates, and corrections as they become available.","language":"en","currency":"USD","id":"0133796884","title":"Java Performance Companion","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1XTlCwAAQBAJ&source=gbs_api","authors":["Charlie Hunt","Monica Beckwith","Poonam Parhar","Bengt Rutisson"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=InxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build advanced and visually stunning Java applications","description":"Design modern, rich interfaces for Java apps using JavaFX 10 Key Features Leverage advanced GUI programming techniques using the latest JavaFX 10 framework. Create dynamic content using the animation API and work with different application layers Create and customize plugins and use them efficiently in different applications Book Description : JavaFX 10 is used to create media-rich client applications. This book takes you on a journey to use JavaFX 10 to build applications that display information in a high-performance, modern user interface featuring audio, video, graphics, and animation. Mastering JavaFX 10 begins by introducing you to the JavaFX API. You will understand the steps involved in setting up your development environment and build the necessary dependencies. This is followed by exploring how to work with the assets, modules, and APIs of JavaFX. This book is filled with practical examples to guide you through the major features of JavaFX 10. In addition to this, you will acquire a practical understanding of JavaFX custom animations, merging different application layers smoothly, and creating a user-friendly GUI with ease. By the end of the book, you will be able to create a complete, feature-rich Java graphical application using JavaFX. What you will learn Construct and customize JavaFX windows Manage UI elements and arrange them on the Scene Explore the Bindings API and use it to coordinate various UI elements Use FXML to design amazing FX applications Write and manage CSS to style your applications Add audio and video to your projects Prepare your application to be launched on the target platform Who this book is for If you’re a Java developer who wants to upgrade to the latest version of JavaFX to create stunning, feature-rich graphical applications, this book is for you. Some basic knowledge of Java programming is necessary to get the most out of this book. prior JavaFX knowledge will help but is not mandatory.","language":"en","currency":"USD","id":"1788299027","title":"Mastering JavaFX 10","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=InxeDwAAQBAJ&source=gbs_api","authors":["Sergey Grinev"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8cThDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.99,"subtitle":"A Unique Step-by-Step Visual Guide to Computers, Coding, and Communication","description":"From coding languages and hardware to cyberbullying and gaming, this comprehensive homework helper for kids and parents covers the essentials of computer science. This unique visual study guide examines the technical aspects of computers, such as how they function, the latest digital devices and software, and how the Internet works. It also builds the confidence of parents and kids when facing challenges such as staying safe online, digital etiquette, and how to navigate the potential pitfalls of social media. Jargon-free language helps to explain difficult and potentially dread-inducing homework such as hacking, \"big data\" and malware, while colorful graphics help makes learning about the world of computer science exciting. Whether at home or school, this clear and helpful guide to computer science is the tool you need to be able to support students with confidence. Series Overview: DK's bestselling Help Your Kids With series contains crystal-clear visual breakdowns of important subjects. Simple graphics and jargon-free text are key to making this series a user-friendly resource for frustrated parents who want to help their children get the most out of school.","language":"en","currency":"USD","id":"0744025427","title":"Help Your Kids with Computer Science (Key Stages 1-5)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8cThDwAAQBAJ&source=gbs_api","authors":["DK"]},{"pageCount":1007,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L2vDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Study Guide Using Spring Framework 5","description":"Pass the Pivotal Certified Professional exam for Core Spring, based on the latest Spring Framework 5, using source code examples, study summaries, and mock exams. This book now includes WebFlux, reactive programming, and more found in Spring 5. You'll find a descriptive overview of certification-related Spring modules and a single example application demonstrating the use of all required Spring modules. Furthermore, in Pivotal Certified Professional Core Spring 5 Developer Exam, Second Edition, each chapter contains a brief study summary and question set, and the book’s free downloadable source code package includes one mock exam (50 questions – like a real exam). After using this study guide, you will be ready to take and pass the Pivotal Certified Professional exam. When you become Pivotal Certified, you will have one of the most valuable credentials in Java. Pivotal certification helps you advance your skills and your career, and get the maximum benefit from Spring. Passing the exam demonstrates your understanding of Spring and validates your familiarity with: container-basics, aspect oriented programming (AOP), data access and transactions, Spring Security, Spring Boot, microservices, and Spring model-view-controller (MVC). Good luck! What You Will Learn Understand the core principles of Spring Framework 5 Use dependency injection Work with aspects in Spring and do AOP (aspect oriented programming) Control transactional behavior and work with SQL and NoSQL databases Create and secure web applications based on Spring MVC Get to know the format of the exam and the type of questions in it Create Spring microservices applications Who This Book Is For Spring developers who have taken the Pivotal Core Spring class are eligible to take the Pivotal Certified Professional exam.","language":"en","currency":"USD","id":"1484251369","title":"Pivotal Certified Professional Core Spring 5 Developer Exam","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L2vDDwAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina"]},{"pageCount":596,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Develop, test, and troubleshoot Java Enterprise applications rapidly with Eclipse, 3rd Edition","description":"Develop and deploy fully functional applications and microservices utilising Tomcat, Glassfish servers, Cloud and docker in Java EE 8 Key Features Explore the complete workflow of developing enterprise Java applications Develop microservices with Docker Container and deploy it in cloud Simplify Java EE application development Book Description Java EE is one of the most popular tools for enterprise application design and development. With recent changes to Java EE 8 specifications, Java EE application development has become a lot simpler with the new specifications, some of which compete with the existing specifications. This guide provides a complete overview of developing highly performant, robust and secure enterprise applications with Java EE with Eclipse. The book begins by exploring different Java EE technologies and how to use them (JSP, JSF, JPA, JDBC, EJB, and more), along with suitable technologies for different scenarios. You will learn how to set up the development environment for Java EE applications and understand Java EE specifications in detail, with an emphasis on examples. The book takes you through deployment of an application in Tomcat, GlassFish Servers, and also in the cloud. It goes beyond the basics and covers topics like debugging, testing, deployment, and securing your Java EE applications. You'll also get to know techniques to develop cloud-ready microservices in Java EE. What you will learn Set up Eclipse, Tomcat, and Glassfish servers for Java EE application development Use JSP, Servlet, JSF, and EJBs to create a user interface and write business logic Create Java EE database applications using JDBC and JPA Handle asynchronous messages using MDBs for better scalability Deploy and debug Java EE applications and create SOAP and REST web services Write unit tests and calculate code coverage Use Eclipse MAT (Memory Analysis Tool) to debug memory issues Create and deploy microservices Who this book is for If you are a Java developer with little or no experience in Java EE application development, or if you have experience in Java EE technology but are looking for tips to simplify and accelerate your development process, then this book is for you.","language":"en","currency":"USD","id":"1788833880","title":"Java EE 8 Development with Eclipse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SMNiDwAAQBAJ&source=gbs_api","authors":["Ram Kulkarni"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=90EwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Get the steps you need to discover the world of Java 9 programming using real-world examples About This Book We bridge the gap between “learning” and “doing” by providing real-world examples that will improve your software development Our example-based approach will get you started quickly with software programming, get you up-to-speed with Java 9, and improve your Java skills This book will show you the best practices of Java coding and improve your productivity Who This Book Is For This book is for anyone who wants to learn the Java programming language. You are expected to have some prior programming experience with another language, such as JavaScript or Python, but no knowledge of earlier versions of Java is assumed. What You Will Learn Compile, package and run a trivial program using a build management tool Get to know the principles of test-driven development and dependency management Separate the wiring of multiple modules from the application logic into an application using dependency injection Benchmark Java execution using Java 9 microbenchmarking See the workings of the Spring framework and use Java annotations for the configuration Master the scripting API built into the Java language and use the built-in JavaScript interpreter Understand static versus dynamic implementation of code and high-order reactive programming in Java In Detail This book gets you started with essential software development easily and quickly, guiding you through Java's different facets. By adopting this approach, you can bridge the gap between learning and doing immediately. You will learn the new features of Java 9 quickly and experience a simple and powerful approach to software development. You will be able to use the Java runtime tools, understand the Java environment, and create Java programs. We then cover more simple examples to build your foundation before diving to some complex data structure problems that will solidify your Java 9 skills. With a special focus on modularity and HTTP 2.0, this book will guide you to get employed as a top notch Java developer. By the end of the book, you will have a firm foundation to continue your journey towards becoming a professional Java developer. Style and approach Throughout this book, our aim is to build Java programs. We will be building multiple applications ranging from simpler ones to more complex ones. Learning by doing has its advantages as you will immediately see the concepts explained in action.","language":"en","currency":"USD","id":"1786464519","title":"Java 9 Programming By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=90EwDwAAQBAJ&source=gbs_api","authors":["Peter Verhas"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qkbBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Project-Driven Guide to Fundamentals in Java","description":"Explore the latest Java-based software development techniques and methodologies through the project-based approach in this practical guide. Unlike books that use abstract examples and lots of theory, Real-World Software Development shows you how to develop several relevant projects while learning best practices along the way. With this engaging approach, junior developers capable of writing basic Java code will learn about state-of-the-art software development practices for building modern, robust and maintainable Java software. You’ll work with many different software development topics that are often excluded from software develop how-to references. Featuring real-world examples, this book teaches you techniques and methodologies for functional programming, automated testing, security, architecture, and distributed systems.","language":"en","currency":"USD","id":"1491967129","title":"Real-World Software Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qkbBDwAAQBAJ&source=gbs_api","authors":["Raoul-Gabriel Urma","Richard Warburton"]},{"pageCount":276,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1KtPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Design and create video games using Java, with the LibGDX software library. By reading Beginning Java Game Development with LibGDX, you will learn how to design video game programs and how to build them in Java. You will be able to create your own 2D games, using various hardware for input (keyboard\/mouse, gamepad controllers, or touchscreen), and create executable versions of your games. The LibGDX library facilitates the game development process by providing pre-built functionality for common tasks. It is a free, open source library that includes full cross-platform compatibility, so programs written using this library can be compiled to run on desktop computers (Windows\/MacOS), web browsers, and smartphones\/tablets (both Android and iOS). Beginning Java Game Development with LibGDX teaches by example with many game case study projects that you will build throughout the book. This ensures that you will see all of the APIs that are encountered in the book in action and learn to incorporate them into your own projects. The book also focuses on teaching core Java programming concepts and applying them to game development. What You Will Learn How to use the LibGDX framework to create a host of 2D arcade game case studies How to compile your game to run on multiple platforms, such as iOS, Android, Windows, and MacOS How to incorporate different control schemes, such as touchscreen, gamepad, and keyboard Who This Book Is ForReaders should have an introductory level knowledge of basic Java programming. In particular, you should be familiar with: variables, conditional statements, loops, and be able to write methods and classes to accomplish simple tasks. This background is equivalent to having taken a first-semester college course in Java programming.","language":"en","currency":"USD","id":"1484215001","title":"Beginning Java Game Development with LibGDX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1KtPCwAAQBAJ&source=gbs_api","authors":["LEE STEMKOSKI"]},{"pageCount":1200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9Vdg9IykL9MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"PRACTICAL, EXAMPLE-RICH COVERAGE OF: Classes, Objects, Encapsulation, Inheritance, Polymorphism, Interfaces, Nested Classes Integrated OOP Case Studies: Time, GradeBook, Employee Industrial-Strength, 95-Page OOD\/UML® 2 ATM Case Study JavaServer™ Faces, Ajax-Enabled Web Applications, Web Services, Networking JDBC™, SQL, Java DB, MySQL® Threads and the Concurrency APIs I\/O, Types, Control Statements, Methods Arrays, Generics, Collections Exception Handling, Files GUI, Graphics, GroupLayout, JDIC Using the Debugger and the API Docs And more… VISIT WWW.DEITEL.COM For information on Deitel’s Dive Into® Series corporate training courses offered at customer sites worldwide (or write to deitel@deitel.com) Download code examples Check out the growing list of programming, Web 2.0, and software-related Resource Centers To receive updates for this book, subscribe to the free DEITEL® BUZZ ONLINE e-mail newsletter at www.deitel.com\/newsletter\/subscribe.html Read archived issues of the DEITEL® BUZZ ONLINE The practicing programmer’s DEITEL® guide to Java™ development and the Powerful Java™ Platform Written for programmers with a background in high-level language programming, this book applies the Deitel signature live-code approach to teaching programming and explores the Java language and Java APIs in depth. The book presents the concepts in the context of fully tested programs, complete with syntax shading, code highlighting, line-by-line code descriptions and program outputs. The book features 220 Java applications with over 18,000 lines of proven Java code, and hundreds of tips that will help you build robust applications. Start with an introduction to Java using an early classes and objects approach, then rapidly move on to more advanced topics, including GUI, graphics, exception handling, generics, collections, JDBC™, web-application development with JavaServer™ Faces, web services and more. You’ll enjoy the Deitels’ classic treatment of object-oriented programming and the OOD\/UML® ATM case study, including a complete Java implementation. When you’re finished, you’ll have everything you need to build object-oriented Java applications. The DEITEL® Developer Series is designed for practicing programmers. The series presents focused treatments of emerging technologies, including Java™, C++, .NET, web services, Internet and web development and more. PRE-PUBLICATION REVIEWER TESTIMONIALS “Presenting software engineering side by side with core Java concepts is highly refreshing; gives readers insight into how professional software is developed.”—Clark Richey (Java Champion), RABA Technologies, LLC. “The quality of the design and code examples is second to none!”—Terrell Hull, Enterprise Architect “The JDBC chapter is very hands on. I like the fact that Java DB\/Apache Derby is used in the examples, which makes it really simple to learn and understand JDBC.”—Sandeep Konchady, Sun Microsystems “Equips you with the latest web application technologies. Examples are impressive and real! Want to develop a simple address locator with Ajax and JSF? Jump to Chapter 22.”—Vadiraj Deshpande, Sun Microsystems “Covers web services with Java SE 6 and Java EE 5 in a real-life, example-based, friendly approach. The Deitel Web Services Resource Center is really good, even for advanced developers.”—Sanjay Dhamankar, Sun Microsystems “Mandatory book for any serious Java EE developer looking for improved productivity: JSF development, visual web development and web services development have never been easier.”—Ludovic Chapenois, Sun Microsystems “I teach Java programming and object-oriented analysis and design. The OOD\/UML 2 case study is the best presentation of the ATM example I have seen.”—Craig W. Slinkman, University of Texas–Arlington “Introduces OOP and UML 2 early. The conceptual level is perfect. No other book comes close to its quality of organization and presentation. The live-code approach to presenting exemplary code makes a big difference in the learning outcome.”—Walt Bunch, Chapman University\/","language":"en","currency":"USD","id":"9780137018512","title":"Java for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9Vdg9IykL9MC&source=gbs_api","authors":["Paul J. Deitel","Harvey M. Deitel"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XjZ1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Updated for Java SE 11","description":"Fully updated for Java SE 11, this book covers the most important Java programming topics that you need to master to be able to learn other technologies yourself. By fully understanding all the chapters and doing the exercises you'll be able to perform an intermediate Java programmer's daily tasks quite well. This book offers the three subjects that a professional Java programmer must be proficient in: - Java as a programming language; - Object-oriented programming (OOP) with Java; - Java core libraries.","language":"en","currency":"USD","id":"1771970367","title":"Java: A Beginner's Tutorial (5th Edition)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XjZ1DwAAQBAJ&source=gbs_api","authors":["Budi Kurniawan"]},{"pageCount":976,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j-NVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"A Complete, Integrated Study System for OCP Exam 1Z0-809 Study for the OCP Java SE 8 Programmer II exam using this effective exam preparation guide from Oracle Press. Written by a team of experts, including two developers of the original exam, OCP Java SE 8 Programmer II Exam Guide (Exam 1Z0-809) offers comprehensive coverage of every subject on the test and lays out essential Java programming skills. Throughout, step-by-step exercises; self-tests; and “Exam Watch,” “Inside the Exam,” and “On the Job” sections highlight salient points and aid in learning. In all, the book and accompanying digital content feature more than 350 practice questions that mirror those on the live test in tone, format, and content. Clearly explains every topic on Exam 1Z0-809, including: •Declarations, access control, and enums•Object orientation•Assertions and exceptions•Dates, times, locales, and resource bundles•I\/O and NIO•Generics and collections•Inner classes•Lambda expressions and functional interfaces•Streams•Threads•Concurrency•JDBC Electronic content includes: •170 practice exam questions•Fully customizable test engine•Secured book PDF For questions regarding content or to report errata, e-mail hep_customer-service@mheducation.com","language":"en","currency":"USD","id":"1260117375","title":"OCP Java SE 8 Programmer II Exam Guide (Exam 1Z0-809)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j-NVDwAAQBAJ&source=gbs_api","authors":["Kathy Sierra","Bert Bates","Elisabeth Robson"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hRArDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Learn to speak the Java language like the pros Are you new to programming and have decided that Java is your language of choice? Are you a wanna-be programmer looking to learn the hottest lingo around? Look no further! Beginning Programming with Java For Dummies, 5th Edition is the easy-to-follow guide you'll want to keep in your back pocket as you work your way toward Java mastery! In plain English, it quickly and easily shows you what goes into creating a program, how to put the pieces together, ways to deal with standard programming challenges, and so much more. Whether you're just tooling around or embarking on a career, this is the ideal resource you'll turn to again and again as you perfect your understanding of the nuances of this popular programming language. Packed with tons of step-by-step instruction, this is the only guide you need to start programming with Java like a pro. Updated for Java 9, learn the language with samples and the Java toolkit Familiarize yourself with decisions, conditions, statements, and information overload Differentiate between loops and arrays, objects and classes, methods, and variables Find links to additional resources Once you discover the joys of Java programming, you might just find you're hooked. Sound like fun? Here's the place to start.","language":"en","currency":"USD","id":"1119235561","title":"Beginning Programming with Java For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hRArDwAAQBAJ&source=gbs_api","authors":["Barry A. Burd"]},{"pageCount":982,"thumbnail":"http:\/\/books.google.com\/books\/content?id=01NxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Practical Spring and Spring Boot solutions for building effective applications","description":"An end-to-end software development guide for the Java eco-system using the most advanced frameworks: Spring and Spring Boot. Learn the complete workflow by building projects and solving problems. About This Book Learn reactive programming by implementing a reactive application with Spring WebFlux Create a robust and scalable messaging application with Spring messaging support Get up-to-date with the defining characteristics of Spring Boot 2.0 in Spring Framework 5 Learn about developer tools, AMQP messaging, WebSockets, security, MongoDB data access, REST, and more This collection of effective recipes serves as guidelines for Spring Boot application development Who This Book Is For Java developers wanting to build production-grade applications using the newest popular Spring tools for a rich end-to-end application development experience. What You Will Learn Get to know the Spring Boot and understand how it makes creating robust applications extremely simple Understand how Spring Data helps us add persistence in MongoDB and SQL databases Implement a websocket to add interactive behaviors in your applications Create powerful, production-grade applications and services with minimal fuss Use custom metrics to track the number of messages published and consumed Build anything from lightweight unit tests to fully running embedded web container integration tests Learn effective testing techniques by integrating Cucumber and Spock Use Hashicorp Consul and Netflix Eureka for dynamic Service Discovery In Detail Spring Framework has become the most popular framework for Java development. It not only simplifies software development but also improves developer productivity. This book covers effective ways to develop robust applications in Java using Spring. The course is up made of three modules, each one having a take-away relating to building end-to-end java applications. The first module takes the approach of learning Spring frameworks by building applications.You will learn to build APIs and integrate them with popular fraemworks suh as AngularJS, Spring WebFlux, and Spring Data. You will also learn to build microservices using Spring's support for Kotlin. You will learn about the Reactive paradigm in the Spring architecture using Project Reactor. In the second module, after getting hands-on with Spring, you will learn about the most popular tool in the Spring ecosystem-Spring Boot. You will learn to build applications with Spring Boot, bundle them, and deploy them on the cloud. After learning to build applications with Spring Boot, you will be able to use various tests that are an important part of application development. We also cover the important developer tools such as AMQP messaging, websockets, security, and more. This will give you a good functional understanding of scalable development in the Spring ecosystem with Spring Boot. In the third and final module, you will tackle the most important challenges in Java application development with Spring Boot using practical recipes. Including recipes for testing, deployment, monitoring, and securing your applications. This module will also address the functional and technical requirements for building enterprise applications. By the end of the course you will be comfortable with using Spring and Spring Boot to develop Java applications and will have mastered the intricacies of production-grade applications. Style and approach A simple step-by-step guide with practical examples to help you develop and deploy Spring and Spring Boot applications in the real-world.","language":"en","currency":"USD","id":"1789539137","title":"Developing Java Applications with Spring and Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=01NxDwAAQBAJ&source=gbs_api","authors":["Claudio Eduardo de Oliveira","Greg L. Turnquist","Alex Antonov"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i8m0DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"See all the things coding can accomplish The demand for people with coding know-how exceeds the number of people who understand the languages that power technology. Coding All-in-One For Dummies gives you an ideal place to start when you're ready to add this valuable asset to your professional repertoire. Whether you need to learn how coding works to build a web page or an application or see how coding drives the data revolution, this resource introduces the languages and processes you'll need to know. Peek inside to quickly learn the basics of simple web languages, then move on to start thinking like a professional coder and using languages that power big applications. Take a look inside for the steps to get started with updating a website, creating the next great mobile app, or exploring the world of data science. Whether you're looking for a complete beginner's guide or a trusted resource for when you encounter problems with coding, there's something for you! Create code for the web Get the tools to create a mobile app Discover languages that power data science See the future of coding with machine learning tools With the demand for skilled coders at an all-time high, Coding All-in-One For Dummies is here to propel coding newbies to the ranks of professional programmers.","language":"en","currency":"USD","id":"1119363055","title":"Coding All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i8m0DgAAQBAJ&source=gbs_api","authors":["Nikhil Abraham"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ik0qCTVzl44C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Code of Conduct for Professional Programmers","description":"Programmers who endure and succeed amidst swirling uncertainty and nonstop pressure share a common attribute: They care deeply about the practice of creating software. They treat it as a craft. They are professionals. In The Clean Coder: A Code of Conduct for Professional Programmers, legendary software expert Robert C. Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice–about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers will learn What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding, and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time, and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”–and how to say it When to say “Yes”–and what yes really means Great software is something to marvel at: powerful, elegant, functional, a pleasure to work with as both a developer and as a user. Great software isn’t written by machines. It is written by professionals with an unshakable commitment to craftsmanship. The Clean Coder will help you become one of them–and earn the pride and fulfillment that they alone possess.","language":"en","currency":"USD","id":"0132542889","title":"The Clean Coder","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ik0qCTVzl44C&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":128,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ql6Q2-vRpn8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":"Regular Expressions for Perl, Ruby, PHP, Python, C, Java and .NET","description":"This handy little book offers programmers a complete overview of the syntax and semantics of regular expressions that are at the heart of every text-processing application. Ideal as a quick reference, Regular Expression Pocket Reference covers the regular expression APIs for Perl 5.8, Ruby (including some upcoming 1.9 features), Java, PHP, .NET and C#, Python, vi, JavaScript, and the PCRE regular expression libraries. This concise and easy-to-use reference puts a very powerful tool for manipulating text and data right at your fingertips. Composed of a mixture of symbols and text, regular expressions can be an outlet for creativity, for brilliant programming, and for the elegant solution. Regular Expression Pocket Reference offers an introduction to regular expressions, pattern matching, metacharacters, modes and constructs, and then provides separate sections for each of the language APIs, with complete regex listings including: Supported metacharacters for each language API Regular expression classes and interfaces for Ruby, Java, .NET, and C# Regular expression operators for Perl 5.8 Regular expression module objects and functions for Python Pattern-matching functions for PHP and the vi editor Pattern-matching methods and objects for JavaScript Unicode Support for each of the languages With plenty of examples and other resources, Regular Expression Pocket Reference summarizes the complex rules for performing this critical text-processing function, and presents this often-confusing topic in a friendly and well-organized format. This guide makes an ideal on-the-job companion.","language":"en","currency":"USD","id":"1449338933","title":"Regular Expression Pocket Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ql6Q2-vRpn8C&source=gbs_api","authors":["Tony Stubblebine"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZtTXgX9tAMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Beginning Android 4 Games Development offers everything you need to join the ranks of successful Android game developers. You'll start with game design fundamentals and programming basics, and then progress toward creating your own basic game engine and playable game that works on Android 4.0 and earlier devices. This will give you everything you need to branch out and write your own Android games. The potential user base and the wide array of available high-performance devices makes Android an attractive target for aspiring game developers. Do you have an awesome idea for the next break-through mobile gaming title? Beginning Android 4 Games Development will help you kick-start your project. The book will guide you through the process of making several example games for the Android platform, and involves a wide range of topics: The fundamentals of Android game development targeting Android 1.5-4.0+ devices The Android platform basics to apply those fundamentals in the context of making a game The design of 2D and 3D games and their successful implementation on the Android platform","language":"en","currency":"USD","id":"1430239883","title":"Beginning Android 4 Games Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZtTXgX9tAMkC&source=gbs_api","authors":["Mario Zechner","Robert Green"]},{"pageCount":774,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Zh9sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Learn Java and Android from scratch by building six exciting games, 2nd Edition","description":"Get ready for a fun-filled experience of learning Java by developing games for the Android platform Key Features Learn Java, Android, and object-oriented programming from scratch Build games including Sub Hunter, Retro Pong, Bullet Hell, Classic Snake, and a 2D Scrolling Shooter Create and design your own games, such as an open-world platform game Book Description Android is one of the most popular mobile operating systems presently. It uses the most popular programming language, Java, as the primary language for building apps of all types. However, this book is unlike other Android books in that it doesn’t assume that you already have Java proficiency. This new and expanded second edition of Learning Java by Building Android Games shows you how to start building Android games from scratch. The difficulty level will grow steadily as you explore key Java topics, such as variables, loops, methods, object oriented programming, and design patterns, including code and examples that are written for Java 9 and Android P. At each stage, you will put what you’ve learned into practice by developing a game. You will build games such as Minesweeper, Retro Pong, Bullet Hell, and Classic Snake and Scrolling Shooter games. In the later chapters, you will create a time-trial, open-world platform game. By the end of the book, you will not only have grasped Java and Android but will also have developed six cool games for the Android platform. What you will learn Set up a game development environment in Android Studio Implement screen locking, screen rotation, pixel graphics, and play sound effects Respond to a player’s touch, and program intelligent enemies who challenge the player in different ways Learn game development concepts, such as collision detection, animating sprite sheets, simple tracking and following, AI, parallax backgrounds, and particle explosions Animate objects at 60 frames per second (FPS) and manage multiple independent objects using Object-Oriented Programming (OOP) Understand the essentials of game programming, such as design patterns, object-oriented programming, Singleton, strategy, and entity-component patterns Learn how to use the Android API, including Activity lifecycle, detecting version number, SoundPool API, Paint, Canvas, and Bitmap classes Build a side-scrolling shooter and an open world 2D platformer using advanced OOP concepts and programming patterns Who this book is for Learning Java by Building Android Games is for you if you are completely new to Java, Android, or game programming and want to make Android games. This book also acts as a refresher for those who already have experience of using Java on Android or any other platform without game development experience.","language":"en","currency":"USD","id":"1788836723","title":"Learning Java by Building Android Games","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Zh9sDwAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ECe7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"A Build Tool for Today's Java Developers","description":"Gain an understanding of Maven’s dependency management and use it to organize basic and multi-module Maven projects. This short book is your quick-start tutorial for learning to use Maven. It includes inconsistently immutable collections, better array construction, and more from the latest Maven version 3.6. This second edition covers the newest in today's most popular build tool for Java development and programming. You'll learn all about Maven and how to set it up. Firstly, you’ll cover the Maven life cycle and how to effectively leverage it. Also, you'll see the basics of site plugins, generating Javadocs, test coverage\/FindBugs reports, and version\/release notes. Furthermore, you'll take advantage of Maven's archetypes to bootstrap new projects easily. Finally, you will learn how to integrate the Nexus repository manager with Maven release phases. What You Will Learn Set up your basic project in Maven Create more advanced projects Apply the Maven life cycle to your build Work with Maven archetypes and manage Maven releases Integrate with Jenkins, Eclipse, and other IDEs Carry out debugging and password encryption Who This Book Is For Those new to Maven or those who are familiar with Maven, but maybe not with the latest Maven 3.6 release.","language":"en","currency":"USD","id":"1484254104","title":"Introducing Maven","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ECe7DwAAQBAJ&source=gbs_api","authors":["Balaji Varanasi"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A-dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Become an advanced practitioner with this progressive set of master classes on application-oriented machine learning About This Book Comprehensive coverage of key topics in machine learning with an emphasis on both the theoretical and practical aspects More than 15 open source Java tools in a wide range of techniques, with code and practical usage. More than 10 real-world case studies in machine learning highlighting techniques ranging from data ingestion up to analyzing the results of experiments, all preparing the user for the practical, real-world use of tools and data analysis. Who This Book Is For This book will appeal to anyone with a serious interest in topics in Data Science or those already working in related areas: ideally, intermediate-level data analysts and data scientists with experience in Java. Preferably, you will have experience with the fundamentals of machine learning and now have a desire to explore the area further, are up to grappling with the mathematical complexities of its algorithms, and you wish to learn the complete ins and outs of practical machine learning. What You Will Learn Master key Java machine learning libraries, and what kind of problem each can solve, with theory and practical guidance. Explore powerful techniques in each major category of machine learning such as classification, clustering, anomaly detection, graph modeling, and text mining. Apply machine learning to real-world data with methodologies, processes, applications, and analysis. Techniques and experiments developed around the latest specializations in machine learning, such as deep learning, stream data mining, and active and semi-supervised learning. Build high-performing, real-time, adaptive predictive models for batch- and stream-based big data learning using the latest tools and methodologies. Get a deeper understanding of technologies leading towards a more powerful AI applicable in various domains such as Security, Financial Crime, Internet of Things, social networking, and so on. In Detail Java is one of the main languages used by practicing data scientists; much of the Hadoop ecosystem is Java-based, and it is certainly the language that most production systems in Data Science are written in. If you know Java, Mastering Machine Learning with Java is your next step on the path to becoming an advanced practitioner in Data Science. This book aims to introduce you to an array of advanced techniques in machine learning, including classification, clustering, anomaly detection, stream learning, active learning, semi-supervised learning, probabilistic graph modeling, text mining, deep learning, and big data batch and stream machine learning. Accompanying each chapter are illustrative examples and real-world case studies that show how to apply the newly learned techniques using sound methodologies and the best Java-based tools available today. On completing this book, you will have an understanding of the tools and techniques for building powerful machine learning models to solve data science problems in just about any domain. Style and approach A practical guide to help you explore machine learning—and an array of Java-based tools and frameworks—with the help of practical examples and real-world use cases.","language":"en","currency":"USD","id":"1785888552","title":"Mastering Java Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A-dDDwAAQBAJ&source=gbs_api","authors":["Dr. Uday Kamath","Krishna Choppella"]},{"pageCount":600,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6ndlDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32,"subtitle":null,"description":"Test your knowledge and prepare for the OCA\/OCP exams OCA\/OCP Java SE 8 Programmer Practice Tests complements the Sybex OCA: Oracle Certified Associate Java SE 8 Programmer I Certification Study Guide and the OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide for exams 1Z0-808 and 1ZO-809 by providing last minute review of 100% of exam objectives. Get the advantage of over 1,000 expert crafted questions that not only provide the answer, but also give detailed explanations. You will have access to unique practice questions that cover all 21 objective domains in the OCA\/OCP exams in the format you desire--test questions can also be accessed via the Sybex interactive learning environment. Two additional practice exams will ensure that you are ready for exam day. Whether you have studied with Sybex study guides for your OCA\/OCP or have used another brand, this is your chance to test your skills. Access to all practice questions online with the Sybex interactive learning environment Over 1,000 unique practice questions and 2 practice exams include expert explanations Covers 100% of all 21 OCA\/OCP objective domains for Exams 1Z0-809 and 1Z0-809 Studying the objectives are one thing, but diving deeper and uncovering areas where further attention is needed can increase your chance of exam day success. Full coverage of all domains shows you what to expect on exam day, and accompanying explanations help you pinpoint which objectives deserve another look.","language":"en","currency":"USD","id":"1119363365","title":"OCA \/ OCP Java SE 8 Programmer Practice Tests","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6ndlDgAAQBAJ&source=gbs_api","authors":["Scott Selikoff","Jeanne Boyarsky"]},{"pageCount":1104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hNiDt7On8HwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"The Spring framework is growing. It has always been about choice. Java EE focused on a few technologies, largely to the detriment of alternative, better solutions. When the Spring framework debuted, few would have agreed that Java EE represented the best-in-breed architectures of the day. Spring debuted to great fanfare, because it sought to simplify Java EE. Each release since marks the introduction of new features designed to both simplify and enable solutions. With version 2.0 and later, the Spring framework started targeting multiple platforms. The framework provided services on top of existing platforms, as always, but was decoupled from the underlying platform wherever possible. Java EE is a still a major reference point, but it’s not the only target. OSGi (a promising technology for modular architectures) has been a big part of the SpringSource strategy here. Additionally, the Spring framework runs on Google App Engine. With the introduction of annotation-centric frameworks and XML schemas, SpringSource has built frameworks that effectively model the domain of a specific problem, in effect creating domain-specific languages (DSLs). Frameworks built on top of the Spring framework have emerged supporting application integration, batch processing, Flex and Flash integration, GWT, OSGi, and much more.","language":"en","currency":"USD","id":"1430225009","title":"Spring Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hNiDt7On8HwC&source=gbs_api","authors":["Gary Mak","Daniel Rubio","Josh Long"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nLgrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"A Hands-On Introduction to Programming","description":"Java is the world’s most popular programming language, but it’s known for having a steep learning curve. Learn Java the Easy Way takes the chore out of learning Java with hands-on projects that will get you building real, functioning apps right away. You’ll start by familiarizing yourself with JShell, Java’s interactive command line shell that allows programmers to run single lines of code and get immediate feedback. Then, you’ll create a guessing game, a secret message encoder, and a multitouch bubble-drawing app for both desktop and mobile devices using Eclipse, an industry-standard IDE, and Android Studio, the development environment for making Android apps. As you build these apps, you’ll learn how to: -Perform calculations, manipulate text strings, and generate random colors -Use conditions, loops, and methods to make your programs responsive and concise -Create functions to reuse code and save time -Build graphical user interface (GUI) elements, including buttons, menus, pop-ups, and sliders -Take advantage of Eclipse and Android Studio features to debug your code and find, fix, and prevent common mistakes If you’ve been thinking about learning Java, Learn Java the Easy Way will bring you up to speed in no time.","language":"en","currency":"USD","id":"1593278462","title":"Learn Java the Easy Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nLgrDwAAQBAJ&source=gbs_api","authors":["Bryson Payne"]},{"pageCount":152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HsIrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Cloud Deployments Made Easy","description":"For many organizations, a big part of DevOps’ appeal is software automation using infrastructure-as-code techniques. This book presents developers, architects, and infra-ops engineers with a more practical option. You’ll learn how a container-centric approach from OpenShift, Red Hat’s cloud-based PaaS, can help your team deliver quality software through a self-service view of IT infrastructure. Three OpenShift experts at Red Hat explain how to configure Docker application containers and the Kubernetes cluster manager with OpenShift’s developer- and operational-centric tools. Discover how this infrastructure-agnostic container management platform can help companies navigate the murky area where infrastructure-as-code ends and application automation begins. Get an application-centric view of automation—and understand why it’s important Learn patterns and practical examples for managing continuous deployments such as rolling, A\/B, blue-green, and canary Implement continuous integration pipelines with OpenShift’s Jenkins capability Explore mechanisms for separating and managing configuration from static runtime software Learn how to use and customize OpenShift’s source-to-image capability Delve into management and operational considerations when working with OpenShift-based application workloads Install a self-contained local version of the OpenShift environment on your computer","language":"en","currency":"USD","id":"1491976616","title":"DevOps with OpenShift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HsIrDwAAQBAJ&source=gbs_api","authors":["Stefano Picozzi","Mike Hepburn","Noel O'Connor"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vEN-ckcdtCwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"The Open Source Perspective","description":"Page 26: How can I avoid off-by-one errors? Page 143: Are Trojan Horse attacks for real? Page 158: Where should I look when my application can't handle its workload? Page 256: How can I detect memory leaks? Page 309: How do I target my application to international markets? Page 394: How should I name my code's identifiers? Page 441: How can I find and improve the code coverage of my tests? Diomidis Spinellis' first book, Code Reading, showed programmers how to understand and modify key functional properties of software. Code Quality focuses on non-functional properties, demonstrating how to meet such critical requirements as reliability, security, portability, and maintainability, as well as efficiency in time and space. Spinellis draws on hundreds of examples from open source projects--such as the Apache web and application servers, the BSD Unix systems, and the HSQLDB Java database--to illustrate concepts and techniques that every professional software developer will be able to appreciate and apply immediately. Complete files for the open source code illustrated in this book are available online at: http:\/\/www.spinellis.gr\/codequality\/","language":"en","currency":"USD","id":"9780768685121","title":"Code Quality","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vEN-ckcdtCwC&source=gbs_api","authors":["Diomidis Spinellis"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q7y4BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a Java programmer who wants to learn about the fundamental tasks underlying natural language processing, this book is for you. You will be able to identify and use NLP tasks for many common problems, and integrate them in your applications to solve more difficult problems. Readers should be familiar\/experienced with Java software development.","language":"en","currency":"USD","id":"1784398942","title":"Natural Language Processing with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q7y4BwAAQBAJ&source=gbs_api","authors":["Richard M Reese"]},{"pageCount":752,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZCchAeprwvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Fundamentals, Data Structure, Sorting, Searching","description":"Robert Sedgewick has thoroughly rewritten and substantially expanded and updated his popular work to provide current and comprehensive coverage of important algorithms and data structures. Christopher Van Wyk and Sedgewick have developed new C++ implementations that both express the methods in a concise and direct manner, and also provide programmers with the practical means to test them on real applications. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 250,000 programmers! This particular book, Parts 1n4, represents the essential first half of Sedgewick's complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. Although the substance of the book applies to programming in any language, the implementations by Van Wyk and Sedgewick also exploit the natural match between C++ classes and ADT implementations. Highlights Expanded coverage of arrays, linked lists, strings, trees, and other basic data structures Greater emphasis on abstract data types (ADTs), modular programming, object-oriented programming, and C++ classes than in previous editions Over 100 algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT (searching) implementations New implementations of binomial queues, multiway radix sorting, randomized BSTs, splay trees, skip lists, multiway tries, B trees, extendible hashing, and much more Increased quantitative information about the algorithms, giving you a basis for comparing them Over 1000 new exercises to help you learn the properties of algorithms Whether you are learning the algorithms for the first time or wish to have up-to-date reference material that incorporates new programming styles with classic and new algorithms, you will find a wealth of useful information in this book.","language":"en","currency":"USD","id":"0768685036","title":"Algorithms in C++, Parts 1-4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZCchAeprwvYC&source=gbs_api","authors":["Robert Sedgewick"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=48t1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Write clear, readable, and reliable tests with Selenium WebDriver 3","description":"Get writing tests and learn to design your own testing framework with Selenium WebDriver API Key Features Learn Selenium from the ground up Design your own testing framework Create reusable functionality in your framework Book Description Selenium WebDriver is a platform-independent API for automating the testing of both browser and mobile applications. It is also a core technology in many other browser automation tools, APIs, and frameworks. This book will guide you through the WebDriver APIs that are used in automation tests. Chapter by chapter, we will construct the building blocks of a page object model framework as you learn about the required Java and Selenium methods and terminology. The book starts with an introduction to the same-origin policy, cross-site scripting dangers, and the Document Object Model (DOM). Moving ahead, we'll learn about XPath, which allows us to select items on a page, and how to design a customized XPath. After that, we will be creating singleton patterns and drivers. Then you will learn about synchronization and handling pop-up windows. You will see how to create a factory for browsers and understand command design patterns applicable to this area. At the end of the book, we tie all this together by creating a framework and implementing multi-browser testing with Selenium Grid. What you will learn Understand what an XPath is and how to design a customized XPath Learn how to create a Maven project and build Create a Singleton driver Get to grips with Jenkins integration Create a factory for browsers Implement multi-browser testing with Selenium Grid Create a sample pop-up window and JavaScript alert Report using Extent Reports Who this book is for This book is for software testers or developers.","language":"en","currency":"USD","id":"1789611342","title":"Selenium WebDriver Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=48t1DwAAQBAJ&source=gbs_api","authors":["Pinakin Chaubal"]},{"pageCount":1027,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dIvgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Optimize Java Persistence Performance in Spring Boot Applications","description":"This book is a collection of developer code recipes and best practices for persisting data using Spring, particularly Spring Boot. The book is structured around practical recipes, where each recipe discusses a performance case or performance-related case, and almost every recipe has one or more applications. Mainly, when we try to accomplish something (e.g., read some data from the database), there are several approaches to do it, and, in order to choose the best way, you have to know the implied trades-off from a performance perspective. You’ll see that in the end, all these penalties slow down the application. Besides presenting the arguments that favor a certain choice, the application is written in Spring Boot style which is quite different than plain Hibernate. Persistence is an important set of techniques and technologies for accessing and using data, and this book demonstrates that data is mobile regardless of specific applications and contexts. In Java development, persistence is a key factor in enterprise, ecommerce, cloud and other transaction-oriented applications. After reading and using this book, you'll have the fundamentals to apply these persistence solutions into your own mission-critical enterprise Java applications that you build using Spring. What You Will Learn Shape *-to-many associations for best performances Effectively exploit Spring Projections (DTO) Learn best practices for batching inserts, updates and deletes Effectively fetch parent and association in a single SELECT Learn how to inspect Persistent Context content Dissect pagination techniques (offset and keyset) Handle queries, locking, schemas, Hibernate types, and more Who This Book Is For Any Spring and Spring Boot developer that wants to squeeze the persistence layer performances.","language":"en","currency":"USD","id":"1484256263","title":"Spring Boot Persistence Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dIvgDwAAQBAJ&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":357,"thumbnail":"http:\/\/books.google.com\/books\/content?id=v_oIIyw1vSIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Create scalable, reusable high-quality JavaScript applications and libraries","language":"en","currency":"USD","id":"184719415X","title":"Object-Oriented JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=v_oIIyw1vSIC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UHobxmgB714C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Mastering the JavaTM Persistence API","description":"Pro JPA 2 introduces, explains, and demonstrates how to use the Java Persistence API (JPA). JPA provides Java developers with both the knowledge and insight needed to write Java applications that access relational databases through JPA. Authors Mike Keith and Merrick Schincariol take a hands–on approach to teaching by giving examples to illustrate each concept of the API and showing how it is used in practice. All of the examples use a common model from an overriding sample application, giving readers a context from which to start and helping them to understand the examples within an already familiar domain. After completing the book, you will have a full understanding and be able to successfully code applications using JPA. The book also serves as a reference guide during initial and later JPA application experiences. Hands-on examples for all the aspects of the JPA specification, based on the reference implementation of this specification A special section on migration to JPA Expert insight about various aspects of the API and when they are useful Portability hints to provide increased awareness of the potential for non–portable JPA code","language":"en","currency":"USD","id":"1430219572","title":"Pro JPA 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UHobxmgB714C&source=gbs_api","authors":["Mike Keith","Merrick Schincariol","Jeremy Keith"]},{"pageCount":530,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RtHYAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"This book is Part I of the fourth edition of Robert Sedgewick and Kevin Wayne’s Algorithms , the leading textbook on algorithms today, widely used in colleges and universities worldwide. Part I contains Chapters 1 through 3 of the book. The fourth edition of Algorithms surveys the most important computer algorithms currently in use and provides a full treatment of data structures and algorithms for sorting, searching, graph processing, and string processing -- including fifty algorithms every programmer should know. In this edition, new Java implementations are written in an accessible modular programming style, where all of the code is exposed to the reader and ready to use. The algorithms in this book represent a body of knowledge developed over the last 50 years that has become indispensable, not just for professional programmers and computer science students but for any student with interests in science, mathematics, and engineering, not to mention students who use computation in the liberal arts. The companion web site, algs4.cs.princeton.edu contains An online synopsis Full Java implementations Test data Exercises and answers Dynamic visualizations Lecture slides Programming assignments with checklists Links to related material The MOOC related to this book is accessible via the \"Online Course\" link at algs4.cs.princeton.edu. The course offers more than 100 video lecture segments that are integrated with the text, extensive online assessments, and the large-scale discussion forums that have proven so valuable. Offered each fall and spring, this course regularly attracts tens of thousands of registrants. Robert Sedgewick and Kevin Wayne are developing a modern approach to disseminating knowledge that fully embraces technology, enabling people all around the world to discover new ways of learning and teaching. By integrating their textbook, online content, and MOOC, all at the state of the art, they have built a unique resource that greatly expands the breadth and depth of the educational experience.","language":"en","currency":"USD","id":"0133799107","title":"Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RtHYAgAAQBAJ&source=gbs_api","authors":["Robert Sedgewick","Kevin Wayne"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rBRMDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Develop the next killer Android App using Java programming! Android is everywhere! It runs more than half the smartphones in the U.S.—and Java makes it go. If you want to cash in on its popularity by learning to build Android apps with Java, all the easy-to-follow guidance you need to get started is at your fingertips. Inside, you'll learn the basics of Java and grasp how it works with Android; then, you'll go on to create your first real, working application. How cool is that? The demand for Android apps isn't showing any signs of slowing, but if you're a mobile developer who wants to get in on the action, it's vital that you get the necessary Java background to be a success. With the help of Java Programming for Android Developers For Dummies, you'll quickly and painlessly discover the ins and outs of using Java to create groundbreaking Android apps—no prior knowledge or experience required! Get the know-how to create an Android program from the ground up Make sense of basic Java development concepts and techniques Develop the skills to handle programming challenges Find out how to debug your app Don't sit back and watch other developers release apps that bring in the bucks! Everything you need to create that next killer Android app is just a page away!","language":"en","currency":"USD","id":"1119301092","title":"Java Programming for Android Developers For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rBRMDQAAQBAJ&source=gbs_api","authors":["Barry A. Burd"]},{"pageCount":333,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7sU8TEyyHCsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"The Best Industrial Practice in Product Line Engineering","description":"Software product lines represent perhaps the most exciting paradigm shift in software development since the advent of high-level programming languages. Nowhere else in software engineering have we seen such breathtaking improvements in cost, quality, time to market, and developer productivity, often registering in the order-of-magnitude range. Here, the authors combine academic research results with real-world industrial experiences, thus presenting a broad view on product line engineering so that both managers and technical specialists will benefit from exposure to this work. They capture the wealth of knowledge that eight companies have gathered during the introduction of the software product line engineering approach in their daily practice.","language":"en","currency":"USD","id":"3540714375","title":"Software Product Lines in Action","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7sU8TEyyHCsC&source=gbs_api","authors":["Frank J. van der Linden","Klaus Schmid","Eelco Rommes"]},{"pageCount":960,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LpVCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.41,"subtitle":null,"description":"Widely considered one of the best practical guides to programming, Steve McConnell’s original CODE COMPLETE has been helping developers write better software for more than a decade. Now this classic book has been fully updated and revised with leading-edge practices—and hundreds of new code samples—illustrating the art and science of software construction. Capturing the body of knowledge available from research, academia, and everyday commercial practice, McConnell synthesizes the most effective techniques and must-know principles into clear, pragmatic guidance. No matter what your experience level, development environment, or project size, this book will inform and stimulate your thinking—and help you build the highest quality code. Discover the timeless techniques and strategies that help you: Design for minimum complexity and maximum creativity Reap the benefits of collaborative development Apply defensive programming techniques to reduce and flush out errors Exploit opportunities to refactor—or evolve—code, and do it safely Use construction practices that are right-weight for your project Debug problems quickly and effectively Resolve critical construction issues early and correctly Build quality into the beginning, middle, and end of your project","language":"en","currency":"USD","id":"0735636974","title":"Code Complete","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LpVCAwAAQBAJ&source=gbs_api","authors":["Steve McConnell"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3RhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn the fundamentals of programming with Java","description":"Java Programming for Beginners is an introduction to Java programming, taking you through the Java syntax and the fundamentals of object-oriented programming. About This Book Learn the basics of Java programming in a step-by-step manner Simple, yet thorough steps that beginners can follow Teaches you transferable skills, such as flow control and object-oriented programming Who This Book Is For This book is for anyone wanting to start learning the Java language, whether you're a student, casual learner, or existing programmer looking to add a new language to your skillset. No previous experience of Java or programming in general is required. What You Will Learn Learn the core Java language for both Java 8 and Java 9 Set up your Java programming environment in the most efficient way Get to know the basic syntax of Java Understand object-oriented programming and the benefits that it can bring Familiarize yourself with the workings of some of Java's core classes Design and develop a basic GUI Use industry-standard XML for passing data between applications In Detail Java is an object-oriented programming language, and is one of the most widely accepted languages because of its design and programming features, particularly in its promise that you can write a program once and run it anywhere. Java Programming for Beginners is an excellent introduction to the world of Java programming, taking you through the basics of Java syntax and the complexities of object-oriented programming. You'll gain a full understanding of Java SE programming and will be able to write Java programs with graphical user interfaces that run on PC, Mac, or Linux machines. This book is full of informative and entertaining content, challenging exercises, and dozens of code examples you can run and learn from. By reading this book, you'll move from understanding the data types in Java, through loops and conditionals, and on to functions, classes, and file handling. The book finishes with a look at GUI development and training on how to work with XML. The book takes an efficient route through the Java landscape, covering all of the core topics that a Java developer needs. Whether you're an absolute beginner to programming, or a seasoned programmer approaching an object-oriented language for the first time, Java Programming for Beginners delivers the focused training you need to become a Java developer. Style and approach This book takes a very hands-on approach, carefully building on lessons learned with snippets and tutorials to build real projects.","language":"en","currency":"USD","id":"1788299043","title":"Java Programming for Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3RhKDwAAQBAJ&source=gbs_api","authors":["Mark Lassoff"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lC59DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build your very own Blockchain and decentralized network with JavaScript and Node.js","description":"Explore the essentials of blockchain technology with JavaScript to develop highly secure bitcoin-like applications Key Features Develop bitcoin and blockchain-based cryptocurrencies using JavaScript Create secure and high-performant blockchain networks Build custom APIs and decentralized networks to host blockchain applications Book Description Learn Blockchain Programming with JavaScript begins by giving you a clear understanding of what blockchain technology is. You’ll then set up an environment to build your very own blockchain and you’ll add various functionalities to it. By adding functionalities to your blockchain such as the ability to mine new blocks, create transactions, and secure your blockchain through a proof-of-work you’ll gain an in-depth understanding of how blockchain technology functions. As you make your way through the chapters, you’ll learn how to build an API server to interact with your blockchain and how to host your blockchain on a decentralized network. You’ll also build a consensus algorithm and use it to verify data and keep the entire blockchain network synchronized. In the concluding chapters, you’ll finish building your blockchain prototype and gain a thorough understanding of why blockchain technology is so secure and valuable. By the end of this book, you'll understand how decentralized blockchain networks function and why decentralization is such an important feature for securing a blockchain. What you will learn Gain an in-depth understanding of blockchain and the environment setup Create your very own decentralized blockchain network from scratch Build and test the various endpoints necessary to create a decentralized network Learn about proof-of-work and the hashing algorithm used to secure data Mine new blocks, create new transactions, and store the transactions in blocks Explore the consensus algorithm and use it to synchronize the blockchain network Who this book is for Learn Blockchain Programming with JavaScript is for JavaScript developers who wish to learn about blockchain programming or build their own blockchain using JavaScript frameworks.","language":"en","currency":"USD","id":"1789614848","title":"Learn Blockchain Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lC59DwAAQBAJ&source=gbs_api","authors":["Eric Traub"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pR0-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Test Driven Development with JUnit 5","description":"Explore the new way of building and maintaining test cases with Java test driven development (TDD) using JUnit 5. This book doesn't just talk about the new concepts, it shows you ways of applying them in TDD and Java 8 to continuously deliver code that excels in all metrics. Unit testing and test driven development have now become part of every developer's skill set. For Java developers, the most popular testing tool has been JUnit, and JUnit 5 is built using the latest features of Java. With Java Unit Testing with JUnit 5, you'll master these new features, including method parameters, extensions, assertions and assumptions, and dynamic tests. You'll also see how to write clean tests with less code. This book is a departure from using older practices and presents new ways of performing tests, building assertions, and injecting dependencies. What You Will Learn Write tests the JUnit 5 way Run your tests from within your IDE Integrate tests with your build and static analysis tools Migrate from JUnit 4 to JUnit 5 Who This Book Is For Java developers both with and without any prior unit testing experience.","language":"en","currency":"USD","id":"1484230159","title":"Java Unit Testing with JUnit 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pR0-DwAAQBAJ&source=gbs_api","authors":["Shekhar Gulati","Rahul Sharma"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":668,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QFqxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build and deploy Java microservices using Spring Cloud, Istio, and Kubernetes","description":"Apply microservices patterns to build resilient and scalable distributed systems Key Features Understand the challenges of building large-scale microservice landscapes Build cloud-native production-ready microservices with this comprehensive guide Discover how to get the best out of Spring Cloud, Kubernetes, and Istio when used together Book Description Microservices architecture allows developers to build and maintain applications with ease, and enterprises are rapidly adopting it to build software using Spring Boot as their default framework. With this book, you’ll learn how to efficiently build and deploy microservices using Spring Boot. This microservices book will take you through tried and tested approaches to building distributed systems and implementing microservices architecture in your organization. Starting with a set of simple cooperating microservices developed using Spring Boot, you’ll learn how you can add functionalities such as persistence, make your microservices reactive, and describe their APIs using Swagger\/OpenAPI. As you advance, you’ll understand how to add different services from Spring Cloud to your microservice system. The book also demonstrates how to deploy your microservices using Kubernetes and manage them with Istio for improved security and traffic management. Finally, you’ll explore centralized log management using the EFK stack and monitor microservices using Prometheus and Grafana. By the end of this book, you’ll be able to build microservices that are scalable and robust using Spring Boot and Spring Cloud. What you will learn Build reactive microservices using Spring Boot Develop resilient and scalable microservices using Spring Cloud Use OAuth 2.0\/OIDC and Spring Security to protect public APIs Implement Docker to bridge the gap between development, testing, and production Deploy and manage microservices using Kubernetes Apply Istio for improved security, observability, and traffic management Who this book is for This book is for Java and Spring developers and architects who want to learn how to break up their existing monoliths into microservices and deploy them either on-premises or in the cloud using Kubernetes as a container orchestrator and Istio as a service Mesh. No familiarity with microservices architecture is required to get started with this book.","language":"en","currency":"USD","id":"1789613523","title":"Hands-On Microservices with Spring Boot and Spring Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QFqxDwAAQBAJ&source=gbs_api","authors":["Magnus Larsson"]},{"pageCount":936,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vYH2AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"An Introduction to Problem Solving and Programming","description":"Note: You are purchasing a standalone product; MyProgrammingLab does not come packaged with this content. If you would like to purchase both the physical text and MyProgrammingLab search for ISBN-10: 0133862119\/ISBN-13: 9780133862119. That package includes ISBN-10: 0133766268\/ISBN-13: 9780133766264 and ISBN-10: 0133841030 \/ISBN-13: 9780133841039. MyProgrammingLab is not a self-paced technology and should only be purchased when required by an instructor. Java: An Introduction to Problem Solving and Programming, 7e, is ideal for introductory Computer Science courses using Java, and other introductory programming courses in departments of Computer Science, Computer Engineering, CIS, MIS, IT, and Business. It also serves as a useful Java fundamentals reference for programmers. Students are introduced to object-oriented programming and important concepts such as design, testing and debugging, programming style, interfaces inheritance, and exception handling. The Java coverage is a concise, accessible introduction that covers key language features. Objects are covered thoroughly and early in the text, with an emphasis on application programs over applets. MyProgrammingLab for Java is a total learning package. MyProgrammingLab is an online homework, tutorial, and assessment program that truly engages students in learning. It helps students better prepare for class, quizzes, and exams–resulting in better performance in the course–and provides educators a dynamic set of tools for gauging individual and class progress. Teaching and Learning Experience This program presents a better teaching and learning experience—for you and your students. Personalized Learning with MyProgrammingLab: Through the power of practice and immediate personalized feedback, MyProgrammingLab helps students fully grasp the logic, semantics, and syntax of programming. A Concise, Accessible Introduction to Java: Key Java language features are covered in an accessible manner that resonates with introductory programmers. Tried-and-true Pedagogy: Numerous case studies, programming examples, and programming tips are used to help teach problem-solving and programming techniques. Flexible Coverage that Fits your Course: Flexibility charts and optional graphics sections allow instructors to order chapters and sections based on their course needs. Instructor and Student Resources that Enhance Learning: Resources are available to expand on the topics presented in the text.","language":"en","currency":null,"id":"0133834611","title":"Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vYH2AgAAQBAJ&source=gbs_api","authors":["Walter Savitch"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kStHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Learner's Guide to Coding and Computational Thinking","description":"What will you learn from this book? It’s no secret the world around you is becoming more connected, more configurable, more programmable, more computational. You can remain a passive participant, or you can learn to code. With Head First Learn to Code you’ll learn how to think computationally and how to write code to make your computer, mobile device, or anything with a CPU do things for you. Using the Python programming language, you’ll learn step by step the core concepts of programming as well as many fundamental topics from computer science, such as data structures, storage, abstraction, recursion, and modularity. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Learn to Code uses a visually rich format to engage your mind, rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multi-sensory learning experience is designed for the way your brain really works.","language":"en","currency":"USD","id":"1491958812","title":"Head First Learn to Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kStHDwAAQBAJ&source=gbs_api","authors":["Eric Freeman"]}]