[{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ncqHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"A Brain-Friendly Guide","description":"What will you learn from this book? Head First Kotlin is a complete introduction to coding in Kotlin. This hands-on book helps you learn the Kotlin language with a unique method that goes beyond syntax and how-to manuals and teaches you how to think like a great Kotlin developer. You’ll learn everything from language fundamentals to collections, generics, lambdas, and higher-order functions. Along the way, you’ll get to play with both object-oriented and functional programming. If you want to really understand Kotlin, this is the book for you. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Kotlin uses a visually rich format to engage your mind rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multisensory learning experience is designed for the way your brain really works.","language":"en","currency":"USD","id":"1491996641","title":"Head First Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ncqHDwAAQBAJ&source=gbs_api","authors":["Dawn Griffiths","David Griffiths"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MVDNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"A Comprehensive Guide to Modern Multi-Paradigm Language","description":"Master the concise and expressive power of a pragmatic, multi-paradigm language for JVM, Android and beyond DESCRIPTION The purpose of this book is to guide a reader through the capabilities of Kotlin language and give examples of how to use it for the development of various applications, be it desktop, mobile or Web. Although our primary focus is on JVM and Android, the knowledge we’re sharing here, to various extents, applies to other Kotlin-supported platforms such as JavaScript, native and even multi-platform applications. The book starts with an introduction to the language and its ecosystem, which will give you an understanding of the key ideas behind the Kotlin design, introduce you to the Kotlin tooling and present you the basic language syntax and constructs. In the next chapters, we get to know the multi-paradigm nature of Kotlin which allows us to create powerful abstractions by combining various aspects of functional and object-oriented programming. We’ll talk about using common Kotlin APIs, such as the standard library, reflection, and coroutine-based concurrency as well as the means for creating your own flexible APIs based on domain-specific languages. In the concluding chapters, we give examples of using Kotlin for more specialized tasks, such as testing, building Android applications, Web development and creating microservices. KEY FEATURES ● Language fundamentals ● Object-oriented and functional programming with Kotlin ● Kotlin standard library ● Building domain-specific languages ● Using Kotlin for Web development ● Kotlin for Android platform ● Coroutine-based concurrency WHAT WILL YOU LEARN By the end of the book you’ll obtain a thorough knowledge of all the basic aspects of Kotlin programming. You’ll be able to create a flexible and reusable code by taking advantage of object-oriented and functional features, use Kotlin standard library, compose your own domain-specific languages, write asynchronous code using Kotlin coroutines library as well. You’ll also have a basic understanding of using Kotlin for writing test code, web applications and Android development. This knowledge will also give you a solid foundation for deeper learning of related development platforms, tools, and frameworks. WHO IS THIS BOOK FOR The book is primarily aimed at developers who are familiar with Java and JVM and are willing to get a firm understanding of Kotlin while having little to no experience in that language. Discussion of various language features will be accompanied, if deemed necessary, by comparisons with their Java’s analogs, which should simplify the Java-to-Kotlin transition. Most of the material, however, is rather Java-agnostic and should be beneficial even without prior knowledge of Java. In general, experience in object-oriented or functional paradigm is a plus, but not required. Table of Contents 1. Kotlin: Powerful and Pragmatic 2. Language Fundamentals 3. Defining Functions 4. Working with Classes and Objects 5. Leveraging Advanced Functions and Functional Programming 6. Using Special-Case Classes 7. Understanding Class Hierarchies 8. Exploring Collections and I\/O 9. Generics 10. Annotations and Reflection 11. Domain-Specific Languages 12. Java Interoperability 13. Concurrency 14. Testing with Kotlin 15. Android Applications 16. Web Development with Ktor 17. Building Microservices","language":"en","currency":"USD","id":"9389328586","title":"Kotlin In-Depth [Vol-I]","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MVDNDwAAQBAJ&source=gbs_api","authors":["Aleksei Sedunov"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYLVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.99,"subtitle":"Developing Android 10 (Q) Apps Using Android Studio 3.6, Kotlin and Android Jetpack","description":"Fully updated for Android Studio 3.6, Android 10 (Q), Android Jetpack and the modern architectural guidelines and components, the goal of this book is to teach the skills necessary to develop Android-based applications using the Kotlin programming language. Beginning with the basics, this book provides an outline of the steps necessary to set up an Android development and testing environment followed by an introduction to programming in Kotlin including data types, flow control, functions, lambdas, coroutines and object-oriented programming. An overview of Android Studio is included covering areas such as tool windows, the code editor and the Layout Editor tool. An introduction to the architecture of Android is followed by an in-depth look at the design of Android applications and user interfaces using the Android Studio environment. Chapters are also included covering the Android Architecture Components including view models, lifecycle management, Room databases, app navigation, live data and data binding. More advanced topics such as intents are also covered, as are touch screen handling, gesture recognition and the playback and recording of audio. This edition of the book also covers printing, transitions, cloud-based file storage and foldable device support. The concepts of material design are also covered in detail, including the use of floating action buttons, Snackbars, tabbed interfaces, card views, navigation drawers and collapsing toolbars. In addition to covering general Android development techniques, the book also includes Google Play specific topics such as implementing maps using the Google Maps Android API, and submitting apps to the Google Play Developer Console. Other key features of Android Studio 3.6 and Android 10 are also covered in detail including the Layout Editor, the ConstraintLayout and ConstraintSet classes, constraint chains and barriers, view binding, direct reply notifications and multi-window support. Chapters also cover advanced features of Android Studio such as App Links, Dynamic Feature Modules, the Android Studio Profiler and Gradle build configuration. Assuming you already have some programming experience, are ready to download Android Studio and the Android SDK, have access to a Windows, Mac or Linux system and ideas for some apps to develop, you are ready to get started.","language":"en","currency":"USD","id":"195144213X","title":"Android Studio 3.6 Development Essentials - Kotlin Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYLVDwAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x08oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Familiarize yourself with all of Kotlin's features with this in-depth guide About This Book Get a thorough introduction to Kotlin Learn to use Java code alongside Kotlin without any hiccups Get a complete overview of null safety, Generics, and many more interesting features Who This Book Is For The book is for existing Java developers who want to learn more about an alternative JVM language. If you want to see what Kotlin has to offer, this book is ideal for you. What You Will Learn Use new features to write structured and readable object-oriented code Find out how to use lambdas and higher order functions to write clean, reusable, and simple code Write unit tests and integrate Kotlin tests with Java code in a transitioning code base Write real-world production code in Kotlin in the style of microservices Leverage Kotlin's extensions to the Java collections library Use destructuring expressions and find out how to write your own Write code that avoids null pointer errors and see how Java-nullable code can integrate with features in a Kotlin codebase Discover how to write functions in Kotlin, see the new features available, and extend existing libraries Learn to write an algebraic data types and figure out when they should be used In Detail Kotlin has been making waves ever since it was open sourced by JetBrains in 2011; it has been praised by developers across the world and is already being adopted by companies. This book provides a detailed introduction to Kotlin that shows you all its features and will enable you to write Kotlin code to production. We start with the basics: get you familiar with running Kotlin code, setting up, tools, and instructions that you can use to write basic programs. Next, we cover object oriented code: functions, lambdas, and properties – all while using Kotlin's new features. Then, we move on to null safety aspects and type parameterization. We show you how to destructure expressions and even write your own. We also take you through important topics like testing, concurrency, microservices, and a whole lot more. By the end of this book you will be able to compose different services and build your own applications. Style and approach An easy to follow guide that covers the full set of features in Kotlin programming.","language":"en","currency":"USD","id":"1787122654","title":"Programming Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x08oDwAAQBAJ&source=gbs_api","authors":["Stephen Samuel","Stefan Bocutiu"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_Dq-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Problem-Focused Approach","description":"Use Kotlin to build Android apps, web applications, and more—while you learn the nuances of this popular language. With this unique cookbook, developers will learn how to apply thisJava-based language to their own projects. Both experienced programmers and those new to Kotlin will benefit from the practical recipes in this book. Author Ken Kousen (Modern Java Recipes) shows you how to solve problems with Kotlin by concentrating on your own use cases rather than on basic syntax. You provide the contextand this book supplies the answers. Already big in Android development, Kotlin can be used anywhere Java is applied, as well as for iOS development, native applications, JavaScriptgeneration, and more. Jump in and build meaningful projects with Kotlin today. Apply functional programming concepts, including lambdas, sequences, and concurrency See how to use delegates, late initialization, and scope functions Explore Java interoperability and access Java libraries using Kotlin Add your own extension functions Use helpful libraries such as JUnit 5 Get practical advice for working with specific frameworks, like Android and Spring","language":"en","currency":"USD","id":"1492046639","title":"Kotlin Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_Dq-DwAAQBAJ&source=gbs_api","authors":["Ken Kousen"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ol9qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.49,"subtitle":"The Big Nerd Ranch Guide","description":"Kotlin is a statically typed programming language designed to interoperate with Java and fully supported by Google on the Android operating system. Based on Big Nerd Ranch’s popular Kotlin Essentials course, this guide shows you how to work effectively with the Kotlin programming language through hands-on examples and clear explanations of key Kotlin concepts and foundational APIs. Written for Kotlin 1.2, this book will also introduce you to JetBrains’ IntelliJ IDEA development environment. Whether you are an experienced Android developer looking for modern features beyond what Java offers or a new developer ready to learn your first programming language, the authors will guide you from first principles to advanced usage of Kotlin. By the end of this book, you will be empowered to create reliable, concise applications in Kotlin.","language":"en","currency":"USD","id":"013516236X","title":"Kotlin Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ol9qDwAAQBAJ&source=gbs_api","authors":["Josh Skeen","David Greenhalgh"]},{"pageCount":698,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CzCWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.22,"subtitle":"Build Android apps starting from zero programming experience with the new Kotlin programming language","description":"Build smart looking Kotlin apps with UI and functionality for the Android platform Key Features Start your Android programming career, or just have fun publishing apps on Google Play marketplace The first-principle introduction to Kotlin through Android, to start building easy-to-use apps Learn by example and build four real-world apps and dozens of mini-apps Book Description Android is the most popular mobile operating system in the world and Kotlin has been declared by Google as a first-class programming language to build Android apps. With the imminent arrival of the most anticipated Android update, Android 10 (Q), this book gets you started building apps compatible with the latest version of Android. It adopts a project-style approach, where we focus on teaching the fundamentals of Android app development and the essentials of Kotlin by building three real-world apps and more than a dozen mini-apps. The book begins by giving you a strong grasp of how Kotlin and Android work together before gradually moving onto exploring the various Android APIs for building stunning apps for Android with ease. You will learn to make your apps more presentable using different layouts. You will dive deep into Kotlin programming concepts such as variables, functions, data structures, Object-Oriented code, and how to connect your Kotlin code to the UI. You will learn to add multilingual text so that your app is accessible to millions of more potential users. You will learn how animation, graphics, and sound effects work and are implemented in your Android app. By the end of the book, you will have sound knowledge about significant Kotlin programming concepts and start building your own fully featured Android apps. What you will learn Learn how Kotlin and Android work together Build a graphical drawing app using Object-Oriented Programming (OOP) principles Build beautiful, practical layouts using ScrollView, RecyclerView, NavigationView, ViewPager and CardView Write Kotlin code to manage an apps' data using different strategies including JSON and the built-in Android SQLite database Add user interaction, data captures, sound, and animation to your apps Implement dialog boxes to capture input from the user Build a simple database app that sorts and stores the user's data Who this book is for This book is for people who are new to Kotlin, Android and want to develop Android apps.It also acts as a refresher for those who have some experience in programming with Android and Kotlin.","language":"en","currency":"USD","id":"1789800889","title":"Android Programming with Kotlin for Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CzCWDwAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Xje2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Learn advanced Kotlin programming techniques to build apps for Android, iOS, and the web","description":"Explore popular language features, Java to Kotlin interoperability, advanced topics, and practical applications by building a variety of sample projects Key Features Understand and leverage the syntax, tools, and patterns by writing code in Kotlin Explore practical topics such as Java interop, concurrency with coroutines, and functional programming Discover how to use Kotlin for build targets like Android, iOS, JavaScript, and backend service Book Description Using Kotlin without taking advantage of its power and interoperability is like owning a sports car and never taking it out of the garage. While documentation and introductory resources can help you learn the basics of Kotlin, the fact that it’s a new language means that there are limited learning resources and code bases available in comparison to Java and other established languages. This Kotlin book will show you how to leverage software designs and concepts that have made Java the most dominant enterprise programming language. You’ll understand how Kotlin is a modern approach to object-oriented programming (OOP). This book will take you through the vast array of features that Kotlin provides over other languages. These features include seamless interoperability with Java, efficient syntax, built-in functional programming constructs, and support for creating your own DSL. Finally, you will gain an understanding of implementing practical design patterns and best practices to help you master the Kotlin language. By the end of the book, you'll have obtained an advanced understanding of Kotlin in order to be able to build production-grade applications. What you will learn Model data using interfaces, classes, and data classes Grapple with practical interoperability challenges and solutions with Java Build parallel apps using concurrency solutions such as coroutines Explore functional, reactive, and imperative programming to build flexible apps Discover how to build your own domain-specific language Embrace functional programming using the standard library and Arrow Delve into the use of Kotlin for frontend JavaScript development Build server-side services using Kotlin and Ktor Who this book is for If you’re a Kotlin developer looking to further their skills or a professional Java developer looking for better or professional resources in order to make a switch to Kotlin, this book is for you. Familiarity with Kotlin programming will assist with understanding key concepts covered in the book.","language":"en","currency":"USD","id":"1838552367","title":"Mastering Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Xje2DwAAQBAJ&source=gbs_api","authors":["Nate Ebel"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to make Android development much faster using a variety of Kotlin features, from basics to advanced, to write better quality code. About This Book Leverage specific features of Kotlin to ease Android application development Write code based on both object oriented and functional programming to build robust applications Filled with various practical examples so you can easily apply your knowledge to real world scenarios Identify the improved way of dealing with common Java patterns Who This Book Is For This book is for developers who have a basic understanding of Java language and have 6-12 months of experience with Android development and developers who feel comfortable with OOP concepts. What You Will Learn Run a Kotlin application and understand the integration with Android Studio Incorporate Kotlin into new\/existing Android Java based project Learn about Kotlin type system to deal with null safety and immutability Define various types of classes and deal with properties Define collections and transform them in functional way Define extensions, new behaviours to existing libraries and Android framework classes Use generic type variance modifiers to define subtyping relationship between generic types Build a sample application In Detail Nowadays, improved application development does not just mean building better performing applications. It has become crucial to find improved ways of writing code. Kotlin is a language that helps developers build amazing Android applications easily and effectively. This book discusses Kotlin features in context of Android development. It demonstrates how common examples that are typical for Android development, can be simplified using Kotlin. It also shows all the benefits, improvements and new possibilities provided by this language. The book is divided in three modules that show the power of Kotlin and teach you how to use it properly. Each module present features in different levels of advancement. The first module covers Kotlin basics. This module will lay a firm foundation for the rest of the chapters so you are able to read and understand most of the Kotlin code. The next module dives deeper into the building blocks of Kotlin, such as functions, classes, and function types. You will learn how Kotlin brings many improvements to the table by improving common Java concepts and decreasing code verbosity. The last module presents features that are not present in Java. You will learn how certain tasks can be achieved in simpler ways thanks to Kotlin. Through the book, you will learn how to use Kotlin for Android development. You will get to know and understand most important Kotlin features, and how they can be used. You will be ready to start your own adventure with Android development with Kotlin.","language":"en","currency":"USD","id":"1787128989","title":"Android Development with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PJZGDwAAQBAJ&source=gbs_api","authors":["Marcin Moskala","Igor Wojda"]},{"pageCount":514,"thumbnail":"http:\/\/books.google.com\/books\/content?id=la6aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A comprehensive guide to OOP, functions, concurrency, and coroutines in Kotlin 1.3, 2nd Edition","description":"Delve into the world of Kotlin and learn to build powerful Android and web applications Key Features Learn the fundamentals of Kotlin to write high-quality code Test and debug your applications with the different unit testing frameworks in Kotlin Explore Kotlin's interesting features such as null safety, reflection, and annotations Book Description Kotlin is a general-purpose programming language used for developing cross-platform applications. Complete with a comprehensive introduction and projects covering the full set of Kotlin programming features, this book will take you through the fundamentals of Kotlin and get you up to speed in no time. Learn Kotlin Programming covers the installation, tools, and how to write basic programs in Kotlin. You'll learn how to implement object-oriented programming in Kotlin and easily reuse your program or parts of it. The book explains DSL construction, serialization, null safety aspects, and type parameterization to help you build robust apps. You'll learn how to destructure expressions and write your own. You'll then get to grips with building scalable apps by exploring advanced topics such as testing, concurrency, microservices, coroutines, and Kotlin DSL builders. Furthermore, you'll be introduced to the kotlinx.serialization framework, which is used to persist objects in JSON, Protobuf, and other formats. By the end of this book, you'll be well versed with all the new features in Kotlin and will be able to build robust applications skillfully. What you will learn Explore the latest Kotlin features in order to write structured and readable object-oriented code Get to grips with using lambdas and higher-order functions Write unit tests and integrate Kotlin with Java code Create real-world apps in Kotlin in the microservices style Use Kotlin extensions with the Java collections library Uncover destructuring expressions and find out how to write your own Understand how Java-nullable code can be integrated with Kotlin features Who this book is for If you’re a beginner or intermediate programmer who wants to learn Kotlin to build applications, this book is for you. You’ll also find this book useful if you’re a Java developer interested in switching to Kotlin.","language":"en","currency":"USD","id":"178980874X","title":"Learn Kotlin Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=la6aDwAAQBAJ&source=gbs_api","authors":["Stephen Samuel","Stefan Bocutiu"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AAANEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27,"subtitle":"Building Mobile and Server-Side Applications with Kotlin","description":"Learn to program with Kotlin, one of the fastest-growing programming languages available today Programming Kotlin Applications: Building Mobile and Server-Side Applications with Kotlin drops readers into the fast lane for learning to develop with the Kotlin programming language. Authored by accomplished cloud consultant and technology professional Brett McLaughlin, Programming Kotlin Applications provides readers with the pragmatic and practical advice they need to build their very first Kotlin applications. Designed to give readers a thorough understanding of Kotlin that goes beyond mere mobile programming, this book will help you: Learn how to develop your first Kotlin project Understand how Kotlin securely protects and stores information Advocate for using Kotlin in your own professional and personal environments Understand Kotlin's goals and how to use it as its best Know when to avoid using Kotlin Programming Kotlin Applications is written in a highly approachable and accessible way without the fluff and unrealistic samples that characterize some of its competitor guides. Perfect for developers familiar with another object-oriented programming language like Java or Ruby, or for people who want to advance their skillset in the Kotlin environment, this book is an indispensable addition to any programmer’s library.","language":"en","currency":"USD","id":"111969616X","title":"Programming Kotlin Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AAANEAAAQBAJ&source=gbs_api","authors":["Brett McLaughlin"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kEFPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Deep dive into the world of Android to create robust applications with Kotlin","description":"Master Android development using a variety of Kotlin features About This Book Leverage specific features of Kotlin to ease Android application development An illustrative guide that will help you write code based Kotlin language to build robust Android applications Filled with various practical examples build amazing Android project using Kotlin so you can easily apply your knowledge to real world scenarios Who This Book Is For The book is for developers who want to build amazing Android applications in an easy and effective way. Basic knowledge of Kotlin is assumed, but you do not need any familiarity with Android development. What You Will Learn Understand the basics of Android development with Kotlin Get to know the key concepts in Android development See how to create modern mobile applications for the Android platform Adjust your application's look and feel Know how to persist and share application database Work with Services and other concurrency mechanisms Write effective tests Migrate an existing Java-based project to Kotlin In Detail Kotlin is a programming language intended to be a better Java, and it's designed to be usable and readable across large teams with different levels of knowledge. As a language, it helps developers build amazing Android applications in an easy and effective way. This book begins by giving you a strong grasp of Kotlin's features in the context of Android development and its APIs. Moving on, you'll take steps toward building stunning applications for Android. The book will show you how to set up the environment, and the difficulty level will grow steadily with the applications covered in the upcoming chapters. Later on, the book will introduce you to the Android Studio IDE, which plays an integral role in Android development. We'll use Kotlin's basic programming concepts such as functions, lambdas, properties, object-oriented code, safety aspects, type parameterization, testing, and concurrency, which will guide you through writing Kotlin code into production. We'll also show you how to integrate Kotlin into any existing Android project. Style and approach In this book, you'll master Android development using Kotlin through real application examples. We'll introduce you to basic Android concepts and offer guidance from the first steps to the final project. In each chapter, we'll develop one important application functionality as a development milestone. As we progress, you'll become more experienced in Android and our application will progress toward a real-world product. Finally, when we complete the application's development, we'll write proper tests to ensure it's production ready.","language":"en","currency":"USD","id":"178847466X","title":"Mastering Android Development with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kEFPDwAAQBAJ&source=gbs_api","authors":["Milos Vasic"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_uhODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Extend your OOP skills and implement Functional techniques in Kotlin and Arrow","description":"Learn how to apply Functional Programming with Kotlin to real-life projects with popular libraries like Arrow. Key Features Focus on the functional aspects of Kotlin and identify the advantages that functional programming brings to the table and the associated coding benefits. Implement common functional programming design patterns and techniques. Learn to combine OOP and Reactive Programming with Functional Programming and how RxKotlin and funkTionale can help you implementing Functional Programming in Kotlin Book Description Functional programming makes your application faster, improves performance, and increases your productivity. Kotlin supports many of the popular and advanced functional features of functional languages. This book will cover the A-Z of functional programming in Kotlin. This book bridges the language gap for Kotlin developers by showing you how to create and consume functional constructs in Kotlin. We also bridge the domain gap by showing how functional constructs can be applied in business scenarios. We’ll take you through lambdas, pattern matching, immutability, and help you develop a deep understanding of the concepts and practices of functional programming. If you want learn to address problems using Recursion, Koltin has support for it as well. You’ll also learn how to use the funKtionale library to perform currying and lazy programming and more. Finally, you’ll learn functional design patterns and techniques that will make you a better programmer.By the end of the book, you will be more confident in your functional programming skills and will be able to apply them while programming in Kotlin. What you will learn Learn the Concepts of Functional Programming with Kotlin Discover the Coroutines in Kotlin Uncover Using funkTionale plugin Learn Monads, Functiors and Applicatives Combine Functional Programming with OOP and Reactive Programming Uncover Using Monads with funkTionale Discover Stream Processing Who this book is for Kotlin developers who have no functional programming experience, will benefit from this book.","language":"en","currency":"USD","id":"1788397363","title":"Functional Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_uhODwAAQBAJ&source=gbs_api","authors":["Mario Arias","Rivu Chakraborty"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZMxPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design and build non-blocking, asynchronous Kotlin applications with RXKotlin, Reactor-Kotlin, Android, and Spring","description":"Learn how to implement Reactive Programming paradigms with Kotlin, and apply them to web programming with Spring Framework 5.0 and in Android Application Development. About This Book Learn how to solve blocking user experience with Reactive Programming and get deep insights into RxKotlin Integrate Reactive Kotlin with Spring and build fantastic Android Apps with RxKotlin and RxAndroid Build reactive architectures that reduce complexity throughout the development process and make your apps(web and Android) scalable Who This Book Is For This book is for Kotlin developers who would like to build fault-tolerant, scalable, and distributed systems. A basic knowledge of Kotlin is required, but no prior knowledge of reactive programming. What You Will Learn Learn about reactive programming paradigms and how reactive programming can improve your existing projects Gain in-depth knowledge in RxKotlin 2.0 and the ReactiveX Framework Use RxKotlin with Android Create your own custom operators in RxKotlin Use Spring Framework 5.0 with Kotlin Use the reactor-kotlin extension Build Rest APIs with Spring,Hibernate, and RxKotlin Use testSubscriber to test RxKotlin applications Use backpressure management and Flowables In Detail In today's app-driven era, when programs are asynchronous, and responsiveness is so vital, reactive programming can help you write code that's more reliable, easier to scale, and better-performing. Reactive programming is revolutionary. With this practical book, Kotlin developers will first learn how to view problems in the reactive way, and then build programs that leverage the best features of this exciting new programming paradigm. You will begin with the general concepts of Reactive programming and then gradually move on to working with asynchronous data streams. You will dive into advanced techniques such as manipulating time in data-flow, customizing operators and provider and how to Use the concurrency model to control asynchronicity of code and process event handlers effectively. You will then be introduced to functional reactive programming and will learn to apply FRP in practical use cases in Kotlin. This book will also take you one step forward by introducing you to spring 5 and spring boot 2 using Kotlin. By the end of the book, you will be able to build real-world applications with reactive user interfaces as well as you'll learn to implement reactive programming paradigms in Android. Style and Approach Loaded with numerous code examples and real-life projects, this book helps you delve into Reactive Programming with Kotlin, and apply it to real-world Spring-web and Android projects, thus making all your apps reactive.","language":"en","currency":"USD","id":"1788470257","title":"Reactive Programming in Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZMxPDwAAQBAJ&source=gbs_api","authors":["Rivu Chakraborty"]},{"pageCount":402,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X1bjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Build Your First Android App In No Time","description":"Unleash the Power of Kotlin for Android App Development DESCRIPTION This book aims to provide the knowledge around the fundamental concept of Kotlin languages, and it’s an application in Android application development. It covers basic to advanced concepts with practical examples. Each chapter in this book is a step by step journey towards the learning Kotlin and excel in various topics and concepts. It covers topics like data types, various functions, including lambdas and higher-order functions. It also covers advanced topics like Generics, Collections, DSL, Coroutine, etc. Most importantly, such concepts are explained with practical usage of it in Android application. You will get to know what is the best possible way to use these concepts while you develop an Android application. In this book, along with Kotlin, an attempt has been made where few Android-specific topics are also explained. For example, the application is using Architecture components, including ViewModel, LiveData, NavigationComponent, and also it uses Flow, which is a hot topic in Kotlin. While we learn this concept, along with that, we also develop a sample application where we can apply our learning and, in the end, have some tangible and measurable output. Readers with little previous knowledge of Android application development can easily follow this book. Most of the chapters are code-heavy and focuses on practical usage of Kotlin’s features. Each chapter has code on the GitHub. You can check out this code and try it out. Or you can develop in parallel and cherry-pick things from the sample code base as and when you need it. Few chapters also follow the quiz at the end, and you can self assess yourself by going through that quiz. In total there are ten chapters. KEY FEATURES The book has theories explained elaborately along with Kotlin code and corresponding output to support the theoretical explanations. The Kotlin codes are provided with step-by-step comments to explain each instruction of the code. The book is quite well balanced with programs and illustrative real-case problems. The book is not just explaining theoretical concepts of the language. Still, it explains how the full-fledged application can be developed using some latest tools and technologies and create an excellent Android application using Kotlin. Few of the chapter offers the quiz at the end of it. And you can revise the concepts quickly. A rich sample application is created to demonstrate Kotlin’s capability in various parts of the application. Quite the latest concepts are discussed in depth. For example, Flow, NavigationComponent, Coroutine, ViewModel, and LiveData. WHAT WILL YOU LEARN Know the basics and many advanced concepts of Android. Able to code in Kotlin for your Android application. You will know how architecture components can be used in Android application with Kotlin. Writing tests that use coroutine, Flow, LiveData, and ViewModel. What measures you need to take before you put an application in production. How agile practices can be applied before and after the application development is started. WHO THIS BOOK IS FOR The book is for readers with basic programming and android application development skills. The book is for any engineering graduates that wish to use Kotlin as a programming language for their Android application or wish to build a career in this direction. This book can also be useful for those who want to learn how testing aspects work for Android applications. The use cases and programs discussed in the book are self-explanatory and detailed with practical examples wherever necessary. This is why the book can be read by anyone who has an interest in Kotlin and Android and how applications are developed with the industry level standard maintained. TABLE OF CONTENTS 1. Getting started with Kotlin for Android 2. Kotlin Fundamentals 3. Go to the Depth of Kotlin 4. Design Patterns in Kotlin 5. Analyzing and Architecting a Meal Recipe App 6. Making Network Calls Using Coroutines 7. Kotlin-ize remaining of your app 8. Testing the Kotlin Code 9. Make Your App Production Ready 10. Kotlin Everywhere","language":"en","currency":"USD","id":"9389423503","title":"Android Application Development with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X1bjDwAAQBAJ&source=gbs_api","authors":["Hardik Trivedi"]},{"pageCount":822,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0BAFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":null,"description":"Fully updated for Android Studio 4.1, Android 11 (R), Android Jetpack and the modern architectural guidelines and components, the goal of this book is to teach the skills necessary to develop Android-based applications using the Kotlin programming language. Beginning with the basics, this book provides an outline of the steps necessary to set up an Android development and testing environment followed by an introduction to programming in Kotlin including data types, flow control, functions, lambdas, coroutines and object-oriented programming. An overview of Android Studio is included covering areas such as tool windows, the code editor and the Layout Editor tool. An introduction to the architecture of Android is followed by an in-depth look at the design of Android applications and user interfaces using the Android Studio environment. Chapters are also included covering the Android Architecture Components including view models, lifecycle management, Room databases, app navigation, live data and data binding. More advanced topics such as intents are also covered, as are touch screen handling, gesture recognition and the playback and recording of audio. This edition of the book also covers printing, transitions, cloud-based file storage and foldable device support. The concepts of material design are also covered in detail, including the use of floating action buttons, Snackbars, tabbed interfaces, card views, navigation drawers and collapsing toolbars. Other key features of Android Studio 4.1 and the Android 11 SDK are also covered in detail including the Layout Editor, the ConstraintLayout and ConstraintSet classes, MotionLayout animation, constraint chains and barriers, view binding, direct reply notifications and multi-window support. Chapters also cover advanced features of Android Studio such as App Links, Dynamic Feature Modules, the Android Studio Profiler and Gradle build configuration. Assuming you already have some programming experience, are ready to download Android Studio and the Android SDK, have access to a Windows, Mac or Linux system and ideas for some apps to develop, you are ready to get started.","language":"en","currency":"USD","id":"1951442245","title":"Android Studio 4.1 Development Essentials - Kotlin Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0BAFEAAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8_1sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"Developing Modern Mobile Apps","description":"Develop Android apps with Kotlin to create more elegant programs than the Java equivalent. This book covers the various aspects of a modern Android app that professionals are expected to encounter. There are chapters dealing with all the important aspects of the Android platform, including GUI design, file- and data-handling, coping with phone calls, multimedia apps, interaction with location and mapping services, monetizing apps, and much more. Pro Android with Kotlin is an invaluable source for developers wanting to build real-world state-of-the-art apps for modern Android devices. What You Will Learn Integrate activities, such as intents, services, toasts and more, into your Android apps Build UIs in Android using layouts, widgets, lists, menus, and action bars Deal with data in your Android apps using data persistence and cloud access Design for different Android devices Create multimedia apps in Android Secure, deploy, and monetize your Android apps Who This Book Is For Professional Android app developers.","language":"en","currency":"USD","id":"1484238206","title":"Pro Android with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8_1sDwAAQBAJ&source=gbs_api","authors":["Peter Späth"]},{"pageCount":469,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oox5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Efficient Android App Development","description":"Build Android apps using the popular and efficient Android Studio 3 suite of tools, an integrated development environment (IDE) with which Android developers can now use the Kotlin programming language. With this book, you’ll learn the latest and most productive tools in the Android tools ecosystem, ensuring quick Android app development and minimal effort on your part. Along the way, you’ll use Android Studio to develop apps tier by tier through practical examples. These examples cover core Android topics such as Activities, Intents, BroadcastReceivers, Services and AsyncTask. Then, you’ll learn how to publish your apps and sell them online and in the Google Play store. What You’ll Learn Use Android Studio 3 to quickly and confidently build your first Android apps Build an Android user interface using activities and layouts, event handling, images, menus and the action bar Incorporate new elements including fragments Learn how data is persisted Use Kotlin to build apps Who This Book Is For Those who may be new to Android Studio 3 or Android Studio in general. You may or may not be new to Android development in general. Some prior experience with Java is also recommended.","language":"en","currency":"USD","id":"1484239075","title":"Learn Android Studio 3 with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oox5DwAAQBAJ&source=gbs_api","authors":["Ted Hagos"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WX5_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Write More Robust and Maintainable Android Apps with Kotlin “Peter Sommerhoff takes a practical approach to teaching Kotlin by providing a larger set of code listings that demonstrate language features and by guiding readers through the development of two Android apps step by step. . . . Peter finds a good balance between what is essential and what can be left to readers, so this book is an efficient yet comprehensible source for starting programming with Kotlin.” –Bernhard Rumpe, Professor of Software Engineering, RWTH Aachen University The Kotlin language brings state-of-the-art programming techniques and constructs to Android development. Kotlin for Android App Development will help you rapidly understand Kotlin’s principles and techniques, apply Kotlin in production app development, integrate Kotlin with existing Java code, and plan a migration to Kotlin, if you choose. If you have at least basic programming experience (with any language), Peter Sommerhoff’s well-crafted overview and examples will help you get quickly up-to-speed with the Kotlin language, its constructs, and its advanced functional and object-oriented capabilities. Once you’ve mastered these foundations, Sommerhoff walks you through two complete app development projects, introducing best practices and emerging patterns for writing code that’s robust, concise, readable, and highly performant. Understand Kotlin’s goals, principles, advantages, design, and constructs Take full advantage of functional programming in the Kotlin environment Write more concise and reusable code using Kotlin’s object-oriented features Interoperate with existing Java code, and plan a migration to Kotlin Use coroutines to efficiently handle concurrency Capture data via third-party APIs, map it to internal data representations, and present it to users Master best practices for architecting Kotlin Android apps Improve productivity and readability by creating simple domain-specific languages in Kotlin","language":"en","currency":"USD","id":"0134854225","title":"Kotlin for Android App Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WX5_DwAAQBAJ&source=gbs_api","authors":["Peter Sommerhoff"]},{"pageCount":227,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aMxPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A practical guide to building industry-grade web, mobile, and desktop applications in Kotlin using frameworks such as Spring Boot and Node.js","description":"Get to know the building blocks of Kotlin and best practices when using quality world-class applications About This Book Learn to build exciting and scalable Android and web applications (both the server-side and client-side parts) with your Kotlin skills Dive into the great ecosystem of Kotlin frameworks and libraries through projects that you'll build using this book This project-based guide contains clear instructions to help you extend your applications across a wide domain Who This Book Is For This practical guide is for programmers who are already familiar with Kotlin. If you are familiar with Kotlin and want to put your knowledge to work, then this is the book for you. Kotlin programming knowledge is a must. What You Will Learn See how Kotlin's power and versatility make it a great choice to create applications across various platforms, and how it delivers business and technology benefits Write a robust web applications using Kotlin with Spring Boot Write Android applications with ease using Kotlin Write rich desktop applications in Kotlin Learn how Kotlin can generate Javascript and how this can be used on client side and server side development Understand how native applications can be written with Kotlin\/Native Learn the practical aspects of programming in each of the applications In Detail Kotlin is a powerful language that has applications in a wide variety of fields. It is a concise, safe, interoperable, and tool-friendly language. The Android team has also announced first-class support for Kotlin, which is an added boost to the language. Kotlin's growth is fueled through carefully designed business and technology benefits. The collection of projects demonstrates the versatility of the language and enables you to build standalone applications on your own. You'll build comprehensive applications using the various features of Kotlin. Scale, performance, and high availability lie at the heart of the projects, and the lessons learned throughout this book. You'll learn how to build a social media aggregator app that will help you efficiently track various feeds, develop a geospatial webservice with Kotlin and Spring Boot, build responsive web applications with Kotlin, build a REST API for a news feed reader, and build a server-side chat application with Kotlin. It also covers the various libraries and frameworks used in the projects. Through the course of building applications, you'll not only get to grips with the various features of Kotlin, but you'll also discover how to design and prototype professional-grade applications. Style and approach Each chapter is independent and focuses on a unique technology, where Kotlin is used to build an example application. Together the chapters cover a full spectrum.","language":"en","currency":"USD","id":"1788470427","title":"Kotlin Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aMxPDwAAQBAJ&source=gbs_api","authors":["Ashish Belagali","Hardik Trivedi","Akshay Chordiya"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=buh1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build robust software with reusable code using OOP principles and design patterns in Kotlin","description":"Learn everything you need to know about object-oriented programming with the latest features of Kotlin 1.3 Key Features A practical guide to understand objects and classes in Kotlin Learn to write asynchronous, non-blocking codes with Kotlin coroutines Explore Encapsulation, Inheritance, Polymorphism, and Abstraction in Kotlin Book Description Kotlin is an object-oriented programming language. The book is based on the latest version of Kotlin. The book provides you with a thorough understanding of programming concepts, object-oriented programming techniques, and design patterns. It includes numerous examples, explanation of concepts and keynotes. Where possible, examples and programming exercises are included. The main purpose of the book is to provide a comprehensive coverage of Kotlin features such as classes, data classes, and inheritance. It also provides a good understanding of design pattern and how Kotlin syntax works with object-oriented techniques. You will also gain familiarity with syntax in this book by writing labeled for loop and when as an expression. An introduction to the advanced concepts such as sealed classes and package level functions and coroutines is provided and we will also learn how these concepts can make the software development easy. Supported libraries for serialization, regular expression and testing are also covered in this book. By the end of the book, you would have learnt building robust and maintainable software with object oriented design patterns in Kotlin. What you will learn Get an overview of the Kotlin programming language Discover Object-oriented programming techniques in Kotlin Understand Object-oriented design patterns Uncover multithreading by Kotlin way Understand about arrays and collections Understand the importance of object-oriented design patterns Understand about exception handling and testing in OOP with Kotlin Who this book is for This book is for programmers and developers who wish to learn Object-oriented programming principles and apply them to build robust and scalable applications. Basic knowledge in Kotlin programming is assumed","language":"en","currency":"USD","id":"1789619645","title":"Hands-On Object-Oriented Programming with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=buh1DwAAQBAJ&source=gbs_api","authors":["Abid Khan","Igor Kucherenko"]},{"pageCount":213,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3OW3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Use of Lambdas and higher-order functions to write more concise, clean, reusable, and simple code","description":"Basic guide to develop an App in Android by using Kotlin DESCRIPTION “Kotlin at a Glance\" is a book that gives an in-depth knowledge about Kotlin. This book mainly focused on Kotlin programming language and its comparison to Java. By reading this book, the readers can make themselves familiar with the language’s most important features and aspects. With a complete overview of OOPs, null safety, generics, and many other interesting features, this book is a perfect choice for fresher and experienced Java developers who want to learn more about this alternative JVM language. For reading this book, there’s no need for any prior Kotlin knowledge, as the basics are explained in the book. Moreover, the required functional programming concepts are also described. The readers of this book will also learn to develop an app in android using Kotlin. Moreover, this book is for everyone who is on their way of becoming a developer. KEY FEATURES Comprehensive coverage of all the concepts of Kotlin Simple language, crystal clear approach, user friendly book Concepts are duly supported by several examples and self-explanatory analogies. WHAT WILL YOU LEARN Introduction to OOP, Java, Kotlin Kotlin Architecture, Token, Input, Operator, Array, Function String Operations, Conditional Statements, Jumping Statement Looping \/ Control Flow \/ Iteration Null Safety, Kotlin Lambda Functions and Exception Handling Constructor, Inheritance, Abstract Keyword, Polymorphism Collection, Coroutines, Generics Regex, Interoperability with Java, Android WHO THIS BOOK IS FOR This book will prove to be a “must have” for beginners as well as experienced professionals as it is a stepping stone for learning the technology. Table of Contents 1. OOP in Brief 2. An Introduction to Java 3. An Introduction to Kotlin 4. Kotlin Architecture 5. Kotlin Token 6. Kotlin Input 7. Kotlin Operator 8. String Operations 9. Conditional Statements 10. Jumping Statement 11. Looping \/ Control Flow \/ Iteration 12. Kotlin Array 13. Null Safety 14. Kotlin Function 15. Function Scope 16. Kotlin Lambda Functions and Exception Handling 17. Kotlin OOPs 18. Constructor 19. Inheritance 20. Abstract Keyword 21. Polymorphism 22. Collection 23. Coroutines 24. Generics 25. Regex 26. Interoperability with Java 27. Kotlin for Android 28. Extras 29. Interoperability with JavaScript 30. Glossary","language":"en","currency":"USD","id":"9388511492","title":"Kotlin at a Glance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3OW3DwAAQBAJ&source=gbs_api","authors":["Swati Saxena"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jOpgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable applications using traditional, reactive, and concurrent design patterns in Kotlin","description":"Make the most of Kotlin by leveraging design patterns and best practices to build scalable and high performing apps Key Features Understand traditional GOF design patterns to apply generic solutions Shift from OOP to FP; covering reactive and concurrent patterns in a step-by-step manner Choose the best microservices architecture and MVC for your development environment Book Description Design patterns enable you as a developer to speed up the development process by providing you with proven development paradigms. Reusing design patterns helps prevent complex issues that can cause major problems, improves your code base, promotes code reuse, and makes an architecture more robust. The mission of this book is to ease the adoption of design patterns in Kotlin and provide good practices for programmers. The book begins by showing you the practical aspects of smarter coding in Kotlin, explaining the basic Kotlin syntax and the impact of design patterns. From there, the book provides an in-depth explanation of the classical design patterns of creational, structural, and behavioral families, before heading into functional programming. It then takes you through reactive and concurrent patterns, teaching you about using streams, threads, and coroutines to write better code along the way By the end of the book, you will be able to efficiently address common problems faced while developing applications and be comfortable working on scalable and maintainable projects of any size. What you will learn Get to grips with Kotlin principles, including its strengths and weaknesses Understand classical design patterns in Kotlin Explore functional programming using built-in features of Kotlin Solve real-world problems using reactive and concurrent design patterns Use threads and coroutines to simplify concurrent code flow Understand antipatterns to write clean Kotlin code, avoiding common pitfalls Learn about the design considerations necessary while choosing between architectures Who this book is for This book is for developers who would like to master design patterns with Kotlin to build efficient and scalable applications. Basic Java or Kotlin programming knowledge is assumed","language":"en","currency":"USD","id":"1788999592","title":"Hands-On Design Patterns with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jOpgDwAAQBAJ&source=gbs_api","authors":["Alexey Soshin"]},{"pageCount":794,"thumbnail":"http:\/\/books.google.com\/books\/content?id=drYgEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A hands-on guide to developing, testing, and publishing your first apps with Android","description":"This book will equip you to create high-quality, visually appealing Android 11 apps from scratch with Kotlin. You’ll discover a wide range of real-world development challenges faced by developers and explore various techniques to overcome them.","language":"en","currency":"USD","id":"1838988297","title":"How to Build Android Apps with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=drYgEAAAQBAJ&source=gbs_api","authors":["Alex Forrester","Eran Boudjnah","Alexandru Dumbravan","Jomar Tigcal"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OrZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build real-world Android and web applications the Kotlin way","description":"Enhance your Kotlin programming skills by building 3 real-world applications Key Features Build three full-fledged, engaging applications from scratch and learn to deploy them Enhance your app development and programming activities with Kotlin’s powerful and intuitive tools and utilities. Experience the gentle learning curve, expressiveness, and intuitiveness of Kotlin, as you develop your own applications Book Description Kotlin greatly reduces the verbosity of source code. With Google having announced their support for Kotlin as a first-class language for writing Android apps, now's the time learn how to create apps from scratch with Kotlin Kotlin Programming By Example takes you through the building blocks of Kotlin, such as functions and classes. You’ll explore various features of Kotlin by building three applications of varying complexity. For a quick start to Android development, we look at building a classic game, Tetris, and elaborate on object-oriented programming in Kotlin. Our next application will be a messenger app, a level up in terms of complexity. Before moving onto the third app, we take a look at data persistent methods, helping us learn about the storage and retrieval of useful applications. Our final app is a place reviewer: a web application that will make use of the Google Maps API and Place Picker. By the end of this book, you will have gained experience of of creating and deploying Android applications using Kotlin. What you will learn Learn the building blocks of the Kotlin programming language Develop powerful RESTful microservices for Android applications Create reactive Android applications efficiently Implement an MVC architecture pattern and dependency management using Kotlin Centralize, transform, and stash data with Logstash Secure applications using Spring Security Deploy Kotlin microservices to AWS and Android applications to the Play Store Who this book is for This book is for those who are new to Kotlin or are familiar with the basics, having dabbled with Java until now. Basic programming knowledge is mandatory.","language":"en","currency":"USD","id":"1788479785","title":"Kotlin Programming By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OrZTDwAAQBAJ&source=gbs_api","authors":["Iyanu Adelekan"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AvuKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Level up your programming skills by understanding how Kotlin's data structure works","description":"Understand and solve complex computational problems and write efficient code with Kotlin Key Features Learn about important data structures such as lists, arrays, queues, and stacks Design custom algorithms for real-life implementations Identify suitable tools for different scenarios and deliver immediate results Book Description Data structures and algorithms are more than just theoretical concepts. They help you become familiar with computational methods for solving problems and writing logical code. Equipped with this knowledge, you can write efficient programs that run faster and use less memory. Hands-On Data Structures and Algorithms with Kotlin book starts with the basics of algorithms and data structures, helping you get to grips with the fundamentals and measure complexity. You'll then move on to exploring the basics of functional programming while getting used to thinking recursively. Packed with plenty of examples along the way, this book will help you grasp each concept easily. In addition to this, you'll get a clear understanding of how the data structures in Kotlin's collection framework work internally. By the end of this book, you will be able to apply the theory of data structures and algorithms to work out real-world problems. What you will learn Understand the basic principles of algorithms and data structures Explore general-purpose data structures with arrays and linked lists Get to grips with the basics of stacks, queues, and double-ended queues Understand functional programming and related data structures Use performant searching and efficient sorting Uncover how Kotlin's collection framework functions Become adept at implementing different types of maps Who this book is for If you're a Kotlin developer who wants to learn the intricacies of implementing data structures and algorithms for scalable application development, this book is for you.","language":"en","currency":"USD","id":"1788998812","title":"Hands-On Data Structures and Algorithms with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AvuKDwAAQBAJ&source=gbs_api","authors":["Chandra Sekhar Nayak","Rivu Chakraborty"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cvFsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Core features to get you ready for developing applications","description":"Get started with Kotlin programming for building real world applications Key Features Start programming with Kotlin Explore Kotlin language syntax, standard libraries and Java Interoperability Builds an example application with what you learn Book Description Kotlin is a general purpose, object-oriented language that primarily targets the JVM and Android. Intended as a better alternative to Java, its main goals are high interoperability with Java and increased developer productivity. Kotlin is still a new language and this book will help you to learn the core Kotlin features and get you ready for developing applications with Kotlin. This book covers Kotlin features in detail and explains them with practical code examples.You will learn how to set up the environment and take your frst steps with Kotlin and its syntax. We will cover the basics of the language, including functions, variables, and basic data types. With the basics covered, the next chapters show how functions are first-class citizens in Kotlin and deal with the object-oriented side of Kotlin. You will move on to more advanced features of Kotlin. You will explore Kotlin's Standard Library and learn how to work with the Collections API. The book finishes by putting Kotlin in to practice, showing how to build a desktop app. By the end of this book, you will be confident enough to use Kotlin for your next project. What you will learn Programming in Kotlin language syntax, basic types, control ?ow, classes, and OOP Writing functions and functional programming in Kotlin Defning and importing from packages in Kotlin Running Kotlin on JVMs and Android runtimes Working with the Kotlin Standard Library and advanced features of Kotlin programming Setting up a Kotlin development environment with JetBrains tools Building real-world applications with Kotlin Who this book is for This book is intended for anybody who wants to learn the most important Kotlin features. No experience of Kotlin is expected.","language":"en","currency":"USD","id":"1789342597","title":"Kotlin Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cvFsDwAAQBAJ&source=gbs_api","authors":["Marko Devcic"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fO1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Master the powerful Kotlin standard library through practical code examples","description":"Build optimized applications in Kotlin by learning how to make use of the standard library features the smart way Key Features Get the most out of the Kotlin library to develop high-quality portable applications Explore the powerful support for data processing and I\/O operations Discover ways to enhance your Android application development Book Description Given the verbosity of Java, developers have turned to Kotlin for effective software development. The Kotlin standard library provides vital tools that make day-to-day Kotlin programming easier. This library features the core attributes of the language, such as algorithmic problems, design patterns, data processing, and working with files and data streams. The recipes in this book offer coding solutions that can be readily executed. The book covers various topics related to data processing, I\/O operations, and collections transformation. We'll walk through effective design patterns in Kotlin and you'll understand how coroutines add new features to JavaScript. As you make your way through the chapters, you'll learn how to implement clean, reusable functions and scalable interfaces containing default implementations. In the concluding chapters, we'll provide recipes on functional programming concepts, such as lambdas, monads, functors, and Kotlin scoping functions. By the end of the book, you'll be able to address a range of problems that Kotlin developers face by implementing easy-to-follow solutions. What you will learn Work with ranges, progressions, and sequences in use cases Add new functionalities to current classes with Kotlin extensions Understand elements such as lambdas, closures, and monads Build a REST API consumer with Retrofit and a coroutine adapter Discover useful tips and solutions for making your Android projects Explore the benefits of standard library features Who this book is for This book is for software developers who are familiar with Kotlin’s basics and want to discover more advanced features and concepts, especially those provided by the Kotlin standard library. It’s also ideal for experienced software developers who are familiar with the functional programming paradigm and other programming languages who want to switch to Kotlin. It will also help Java developers switch to Kotlin and integrate it into existing Java Virtual Machine (JVM) projects.","language":"en","currency":"USD","id":"178883464X","title":"Kotlin Standard Library Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fO1mDwAAQBAJ&source=gbs_api","authors":["Samuel Urbanowicz"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ztRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Explore more than 100 recipes that show how to build robust mobile and web applications with Kotlin, Spring Boot, and Android","description":"Discover Android programming and web development by understanding the concepts of Kotlin Programming Key Features Practical solutions to your common programming problems with Kotlin 1.1 Leverage the functional power of Kotlin to ease your Android application development Learn to use Java code in conjunction with Kotlin Book Description The Android team has announced first-class support for Kotlin 1.1. This acts as an added boost to the language and more and more developers are now looking at Kotlin for their application development. This recipe-based book will be your guide to learning the Kotlin programming language. The recipes in this book build from simple language concepts to more complex applications of the language. After the fundamentals of the language, you will learn how to apply the object-oriented programming features of Kotlin 1.1. Programming with Lambdas will show you how to use the functional power of Kotlin. This book has recipes that will get you started with Android programming with Kotlin 1.1, providing quick solutions to common problems encountered during Android app development. You will also be taken through recipes that will teach you microservice and concurrent programming with Kotlin. Going forward, you will learn to test and secure your applications with Kotlin. Finally, this book supplies recipes that will help you migrate your Java code to Kotlin and will help ensure that it's interoperable with Java. What you will learn Understand the basics and object-oriented concepts of Kotlin Programming Explore the full potential of collection frameworks in Kotlin Work with SQLite databases in Android, make network calls, and fetch data over a network Use Kotlin's Anko library for efficient and quick Android development Uncover some of the best features of Kotlin: Lambdas and Delegates Set up web service development environments, write servlets, and build RESTful services with Kotlin Learn how to write unit tests, integration tests, and instrumentation\/acceptance tests. Who this book is for This book will appeal to Kotlin developers keen to find solutions for their common programming problems. Java programming knowledge would be an added advantage.","language":"en","currency":"USD","id":"1788475216","title":"Kotlin Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ztRJDwAAQBAJ&source=gbs_api","authors":["Rashi Karanpuria","Aanand Shekhar Roy"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nOpgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Overcome performance difficulties in Kotlin with a range of exciting techniques and solutions","description":"Find out how to write Kotlin code without overhead and how to use different profiling tools and bytecode viewer to inspect expressions of Kotlin language. Key Features Apply modern Kotlin features to speed up processing and implement highly efficient and reliable codes. Learn memory optimization, concurrency, multi-threading, scaling, and caching techniques to achieve high performance. Learn how to prevent unnecessary overhead and use profiling tools to detect performance issues. Book Description The ease with which we write applications has been increasing, but with it comes the need to address their performance. A balancing act between easily implementing complex applications and keeping their performance optimal is a present-day requirement In this book, we explore how to achieve this crucial balance, while developing and deploying applications with Kotlin. The book starts by analyzing various Kotlin specifcations to identify those that have a potentially adverse effect on performance. Then, we move on to monitor techniques that enable us to identify performance bottlenecks and optimize performance metrics. Next, we look at techniques that help to us achieve high performance: memory optimization, concurrency, multi threading, scaling, and caching. We also look at fault tolerance solutions and the importance of logging. We'll also cover best practices of Kotlin programming that will help you to improve the quality of your code base. By the end of the book, you will have gained some insight into various techniques and solutions that will help to create high-performance applications in the Kotlin environment What you will learn Understand the importance of high performance Learn performance metrics Learn popular design patterns currently being used in Kotlin Understand how to apply modern Kotlin features to data processing Learn how to use profling tools Discover how to read bytecode Learn to perform memory optimizations Uncover approaches to the multithreading environment Who this book is for This book is for Kotlin developers who would like to build reliable and high-performance applications. Prior Kotlin programming knowledge is assumed.","language":"en","currency":"USD","id":"1788998359","title":"Mastering High Performance with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nOpgDwAAQBAJ&source=gbs_api","authors":["Igor Kucherenko"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tNRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build reactive and cloud-native microservices with Kotlin using Spring 5 and Spring Boot 2.0","description":"Build smart, efficient, and fast enterprise-grade web implementation of the microservices architecture that can be easily scaled. Key Features Write easy-to-maintain lean and clean code with Kotlin for developing better microservices Scale your Microserivces in your own cloud with Docker and Docker Swarm Explore Spring 5 functional reactive web programming with Spring WebFlux Book Description With Google's inclusion of first-class support for Kotlin in their Android ecosystem, Kotlin's future as a mainstream language is assured. Microservices help design scalable, easy-to-maintain web applications; Kotlin allows us to take advantage of modern idioms to simplify our development and create high-quality services. With 100% interoperability with the JVM, Kotlin makes working with existing Java code easier. Well-known Java systems such as Spring, Jackson, and Reactor have included Kotlin modules to exploit its language features. This book guides the reader in designing and implementing services, and producing production-ready, testable, lean code that's shorter and simpler than a traditional Java implementation. Reap the benefits of using the reactive paradigm and take advantage of non-blocking techniques to take your services to the next level in terms of industry standards. You will consume NoSQL databases reactively to allow you to create high-throughput microservices. Create cloud-native microservices that can run on a wide range of cloud providers, and monitor them. You will create Docker containers for your microservices and scale them. Finally, you will deploy your microservices in OpenShift Online. What you will learn Understand microservice architectures and principles Build microservices in Kotlin using Spring Boot 2.0 and Spring Framework 5.0 Create reactive microservices that perform non-blocking operations with Spring WebFlux Use Spring Data to get data reactively from MongoDB Test effectively with JUnit and Kotlin Create cloud-native microservices with Spring Cloud Build and publish Docker images of your microservices Scaling microservices with Docker Swarm Monitor microservices with JMX Deploy microservices in OpenShift Online Who this book is for If you are a Kotlin developer with a basic knowledge of microservice architectures and now want to effectively implement these services on enterprise-level web applications, then this book is for you","language":"en","currency":"USD","id":"1788473493","title":"Hands-On Microservices with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tNRJDwAAQBAJ&source=gbs_api","authors":["Juan Antonio Medina Iglesias"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=odUHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.73,"subtitle":null,"description":"Книга посвящена разработке мобильных приложений для Android на языке Kotlin. Рассматриваются основные элементы языка, такие как функции и классы, приемы объектно-ориентированного программирования. Рассказывается о разработке микросервисов RESTful для приложений Android, о методах реализации шаблона архитектуры MVC. Описаны способы централизации, преобразования и хранения данных с применением Logstash, защиты приложений с использованием Spring Security. Изучается управление зависимостями с помощью Kotlin. Уделено внимание развертыванию микроcервисов Kotlin для AWS и приложений Android в Play Store. Файлы для книги можно скачать по ссылке ftp:\/\/ftp.bhv.ru\/9785977566735.zip","language":"ru","currency":"USD","id":"5977566735","title":"Kotlin: программирование на примерах","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=odUHEAAAQBAJ&source=gbs_api","authors":["Аделекан Ияну"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sQh-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, test, and troubleshoot enterprise applications and microservices with Kotlin and Java EE","description":"Build Java Enterprise Applications and learn how Kotlin makes it easier to code them using components like JSF 2.3, Enterprise JavaBeans (EJB) 3.2, Contexts and Dependency Injection (CDI) 2.0, the Java API for WebSockets, JAX-RS 2.1, Servlet 4.0. Key Features An in-depth guide updated with all the latest features of Kotlin 1.2 and Java EE 8 Build microservices in Java EE with the help of Kotlin use cases Explore coroutines, garbage collection, multithreading, memory management and more Book Description Kotlin was developed with a view to solving programmers’ difficulties and operational challenges. This book guides you in making Kotlin and Java EE work in unison to build enterprise-grade applications. Together, they can be used to create services of any size with just a few lines of code and let you focus on the business logic. Kotlin for Enterprise Applications using Java EE begins with a brief tour of Kotlin and helps you understand what makes it a popular and reasonable choice of programming language for application development, followed by its incorporation in the Java EE platform. We will then learn how to build applications using the Java Persistence API (JPA) and Enterprise JavaBeans (EJB), as well as develop RESTful web services and MicroServices. As we work our way through the chapters, we’ll use various performance improvement and monitoring tools for your application and see how they optimize real-world applications. At each step along the way, we will see how easy it is to develop enterprise applications in Kotlin. By the end of this book, we will have learned design patterns and how to implement them using Kotlin. What you will learn Understand Kotlin syntax and appreciate why it’s gaining in popularity Explore the Java EE ecosystem and the APIs in Java EE Implement applications using Kotlin Overcome the challenges of developing the Java EE system using Kotlin Gain insights into Java Message Services (JMS) Build RESTful MicroServices and secure applications Optimize applications with performance and monitoring tools Understand design patterns and implement them Who this book is for Kotlin for Enterprise Applications using Java EE is for Java EE developers who want to build their enterprise project or application with Kotlin or migrate from Java to Kotlin. Basic knowledge of programming is necessary to understand the key concepts covered in this book.","language":"en","currency":"USD","id":"1788994396","title":"Kotlin for Enterprise Applications using Java EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sQh-DwAAQBAJ&source=gbs_api","authors":["Raghavendra Rao K"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XO1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build highly efficient and robust applications","description":"Take advantage of Kotlin's concurrency primitives to write efficient multithreaded applications Key Features Learn Kotlin’s unique approach to multithreading Work through practical examples that will help you write concurrent non-blocking code Improve the overall execution speed in multiprocessor and multicore systems Book Description The primary requirements of modern-day applications are scalability, speed, and making the most use of hardware. Kotlin meets these requirements with its immense support for concurrency. Many concurrent primitives of Kotlin, such as channels and suspending functions, are designed to be non-blocking and efficient. This allows for new approaches to concurrency and creates unique challenges for the design and implementation of concurrent code. Learning Concurrency in Kotlin addresses those challenges with real-life examples and exercises that take advantage of Kotlin's primitives. Beginning with an introduction to Kotlin's coroutines, you will learn how to write concurrent code and understand the fundamental concepts needed to be able to write multithreaded software in Kotlin. You'll explore how to communicate between and synchronize your threads and coroutines to write asynchronous applications that are collaborative. You'll also learn how to handle errors and exceptions, as well as how to leverage multi-core processing. In addition to this, you’ll delve into how coroutines work internally, allowing you to see the bigger picture. Throughout the book you'll build an Android application – an RSS reader – designed and implemented according to the different topics covered in the book What you will learn Understand Kotlin’s approach to concurrency Implement sequential and asynchronous suspending functions Create suspending data sources that are resumed on demand Explore the best practices for error handling Use channels to communicate between coroutines Uncover how coroutines work under the hood Who this book is for If you’re a Kotlin or Android developer interested in learning how to program concurrently to enhance the performance of your applications, this is the book for you.","language":"en","currency":"USD","id":"1788626729","title":"Learning Concurrency in Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XO1mDwAAQBAJ&source=gbs_api","authors":["Miguel Angel Castiblanco Torres"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sQh-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, test, and troubleshoot enterprise applications and microservices with Kotlin and Java EE","description":"Build Java Enterprise Applications and learn how Kotlin makes it easier to code them using components like JSF 2.3, Enterprise JavaBeans (EJB) 3.2, Contexts and Dependency Injection (CDI) 2.0, the Java API for WebSockets, JAX-RS 2.1, Servlet 4.0. Key Features An in-depth guide updated with all the latest features of Kotlin 1.2 and Java EE 8 Build microservices in Java EE with the help of Kotlin use cases Explore coroutines, garbage collection, multithreading, memory management and more Book Description Kotlin was developed with a view to solving programmers’ difficulties and operational challenges. This book guides you in making Kotlin and Java EE work in unison to build enterprise-grade applications. Together, they can be used to create services of any size with just a few lines of code and let you focus on the business logic. Kotlin for Enterprise Applications using Java EE begins with a brief tour of Kotlin and helps you understand what makes it a popular and reasonable choice of programming language for application development, followed by its incorporation in the Java EE platform. We will then learn how to build applications using the Java Persistence API (JPA) and Enterprise JavaBeans (EJB), as well as develop RESTful web services and MicroServices. As we work our way through the chapters, we’ll use various performance improvement and monitoring tools for your application and see how they optimize real-world applications. At each step along the way, we will see how easy it is to develop enterprise applications in Kotlin. By the end of this book, we will have learned design patterns and how to implement them using Kotlin. What you will learn Understand Kotlin syntax and appreciate why it’s gaining in popularity Explore the Java EE ecosystem and the APIs in Java EE Implement applications using Kotlin Overcome the challenges of developing the Java EE system using Kotlin Gain insights into Java Message Services (JMS) Build RESTful MicroServices and secure applications Optimize applications with performance and monitoring tools Understand design patterns and implement them Who this book is for Kotlin for Enterprise Applications using Java EE is for Java EE developers who want to build their enterprise project or application with Kotlin or migrate from Java to Kotlin. Basic knowledge of programming is necessary to understand the key concepts covered in this book.","language":"en","currency":"USD","id":"1788994396","title":"Kotlin for Enterprise Applications using Java EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sQh-DwAAQBAJ&source=gbs_api","authors":["Raghavendra Rao K"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jyj7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书从Kotlin语言的基础语法讲起，逐步深入到Kotlin进阶实战，并在最后配合项目实战案例，重点介绍了使用Kotlin+Spring Boot进行服务端开发和使用Kotlin进行Android应用程序开发的内容，让读者不但可以系统地学习Kotlin编程的相关知识，而且还能对Kotlin应用开发有更为深入的理解。 本书分为14章，涵盖的主要内容有Kotlin简介，Kotlin语法基础，类型系统与可空类型，类与面向对象编程，函数与函数式编程，扩展函数与属性，集合类，泛型，文件I\/O操作、正则表达式与多线程，使用Kotlin创建DSL，运算符重载与约定，元编程、注解与反射，Kotlin集成Spring Boot服务端开发，使用Kotlin进行Android开发。 本书内容通俗易懂，案例丰富，实用性强，特别适合Kotlin语言的入门读者和进阶读者阅读，也适合Android程序员、Java程序员等其他编程爱好者阅读，还适合作为相关培训机构的教材。","language":"zh-CN","currency":"USD","id":"7302508720","title":"Kotlin从入门到进阶实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jyj7DwAAQBAJ&source=gbs_api","authors":["陈光金编著"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书是一部讲解Kotlin语言的入门书籍，从Kotlin语言的基本语法一直讲到如何将其运用于Android开发。由浅入深、从理论到实战，帮助读者快速掌握Kotlin开发技巧。 全书共有10章内容，可分为三大部分：第一部分即第1章，主要介绍Kotlin语言的开发环境搭建；第二部分包含第2～5章，主要介绍Kotlin的基本语法知识，包括Kotlin的变量声明、控制语句、函数定义、类与对象等；第三部分包含第6～10章，主要介绍如何使用Kotlin进行实际的App开发工作，包括利用Kotlin操作简单控件、复杂控件、数据存储、自定义控件、网络通信等。为增强学习Kotlin语言的趣味，本书在讲解Kotlin的用法时，特别注意结合生活中的具体案例，并加以示范和运用。尤其是后面讲到利用Kotlin开发App的时候，精心设计了数个电商App的实战模块，例如电商App的登录模块、频道模块、购物车模块、团购模块、升级模块等。通过这些实战小项目，读者可迅速将Kotlin应用于App开发工作中。 本书适用于Android开发的广大从业者、Kotlin语言的业余爱好者，也可用作大中专院校与培训机构的Kotlin课程教材。","language":"zh-CN","currency":"USD","id":"7302498148","title":"Kotlin从零到精通Android开发","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FSf7DwAAQBAJ&source=gbs_api","authors":["欧阳燊编著"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nyC_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.16,"subtitle":"Einstieg und Praxis","description":"Fundierte Einführung mit zahlreichen Beispielen aus der Praxis Kotlin für Android- und Webanwendungen Mit vielen Tipps für Java-Umsteiger Kotlin ist eine Programmiersprache, die sich in den letzten Jahren von einem reinen Java-Ersatz für Android zu einer vollwertigen Cross-Plattform-Sprache entwickelt hat. Dieses Buch richtet sich an Entwickler, die Kotlin als neue Programmiersprache kennenlernen und in einer Java-Umgebung wie Android einsetzen wollen, oder die sich für Multiplattform-Techniken interessieren. Dabei konzentriert sich der Autor auf die Grundlagen der Sprache und erläutert umfassend ihre Strukturen, Befehle und Sprachfeatures. Anhand zahlreicher Beispiele lernen Sie, wie Sie Kotlin in einer Produktivumgebung effektiv einsetzen können. Da Kotlin funktionale Programmierung ermöglicht und sich an diesem Konzept orientiert, erläutert der Autor außerdem, was Sie wissen müssen, um funktionalen und objektorientierten Stil zu kombinieren. Darüber hinaus erhalten Sie einen Ausblick auf weiterführende Themen und Konzepte wie automatische Tests, die Organisation von größeren Projekten durch Architekturmuster und die Nebenläufigkeit mit Kotlin-Coroutines. Auch die Anwendung von Kotlin für Android wird vorgestellt und gezeigt, wie die neue Sprache konkret hilft, moderne Architekturen umzusetzen. Zum Abschluss geht der Autor auf die Entwicklung von Cross-Plattform- sowie JavaScript-Anwendungen mit Kotlin ein. Mit diesem Buch erhalten Sie einen umfassenden Einstieg in Kotlin. Es enthält viele Informationen für Entwickler, die sich das erste Mal mit einer statisch typisierten Sprache beschäftigen und für diejenigen, die von der Android-Entwicklung mit Java kommen und auf Kotlin umsteigen und bisherigen Code ergänzen oder ersetzen wollen.","language":"de","currency":"USD","id":"3958458556","title":"Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nyC_DwAAQBAJ&source=gbs_api","authors":["Karl Szwillus"]},{"pageCount":1064,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ChuMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":null,"description":"O Android é a plataforma do Google para dispositivos móveis que se tornou líder absoluta no mercado mundial, e a quantidade de recursos disponibilizada para os desenvolvedores permite criar uma envolvente e estimulante interação do usuário com o dispositivo. Dominando o Android com Kotlin apresenta por meio de exemplos práticos, desde conceitos mais básicos até as mais avançadas técnicas de desenvolvimento de aplicativos para a plataforma mobile do Google. NESTA OBRA VOCÊ APRENDERÁ A: Criar aplicativos compatíveis com smartphones e tablets utilizando a linguagem Kotlin. Definir layouts responsivos utilizando componentes do Material Design. Implementar diferentes formas de navegação entre telas. Persistir dados locais no cartão de memória do aparelho e em banco de dados SQLite. Implementar a comunicação com web services para enviar e receber dados. Utilizar serviços do Google como: Maps, YouTube e AdMob. Acessar serviços do Firebase como: Cloud Messaging, Authentication, Cloud Firestore, Cloud Storage e Crashlytics. Interagir com serviços do sistema, mensagens de broadcast, notificações e widgets. Deixar sua aplicação mais interativa por meio de animações e recursos multimídia. Ao final o leitor estará pronto para projetar e construir aplicativos profissionais e publicá-los no Google Play.","language":"pt","currency":"USD","id":"8575227270","title":"Dominando o Android com Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ChuMDwAAQBAJ&source=gbs_api","authors":["Nelson Glauber"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W8vTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Build concurrent applications using reactive programming with the latest features of RxJava 3, 2nd Edition","description":"Updated with the latest Maven coordinates, Java programming features, and API changes, this book is your guide to solving problems in writing asynchronous and event-based programs Key Features Explore a variety of tools and techniques used to solve problems in implementing concurrency and parallelization Learn about core operators in RxJava that enable you to express your code logic productively Apply RxJava with Kotlin to create responsive Android apps with better user experience Book Description RxJava is not just a popular library for building asynchronous and event-based applications; it also enables you to create a cleaner and more readable code base. In this book, you’ll cover the core fundamentals of reactive programming and learn how to design and implement reactive libraries and applications. Learning RxJava will help you understand how reactive programming works and guide you in writing your first example in reactive code. You’ll get to grips with the workings of Observable and Subscriber, and see how they are used in different contexts using real-world use cases. The book will also take you through multicasting and caching to help prevent redundant work with multiple Observers. You’ll then learn how to create your own RxJava operators by reusing reactive logic. As you advance, you’ll explore effective tools and libraries to test and debug RxJava code. Finally, you’ll delve into RxAndroid extensions and use Kotlin features to streamline your Android apps. By the end of this book, you'll become proficient in writing reactive code in Java and Kotlin to build concurrent applications, including Android applications. What you will learn Discover different ways to create Observables, Observers, and Subscribers Multicast in order to push data to multiple destinations and cache and replay them Express RxJava idiomatically with the help of Kotlin features such as extension functions and data classes Become familiar with various operators available in RxJava to perform common transformations and tasks Explore RxJava’s reactive types, including Flowable, Single, Maybe, and Completable Demystify Observables and how they express data and events as sequences Who this book is for This book is for Java developers who want to leverage reactive programming to develop more resilient and concurrent applications. If you're an RxJava user looking to get to grips with the latest features and updates in RxJava 3, this book is for you. Fundamental knowledge of core Java features and object-oriented programming will assist you in understanding the key concepts covered in this book.","language":"en","currency":"USD","id":"1789952212","title":"Learning RxJava","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W8vTDwAAQBAJ&source=gbs_api","authors":["Nick Samoylov","Thomas Nield"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ng_uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.63,"subtitle":null,"description":"DAFTAR ISI Membuat Aplikasi dengan Mapbox pada Kotlin KATA PENGANTAR DAFTAR ISI Pengenalan Mapbox Show User Current Location Add Marker On Map Custom Marker Icon Draw Polygon Map Using GeoJSON Navigation UI SDK (Direction) Distance &amp; Duration Between 2 Point Make REST API Server using Codeigniter Show Marker From API Using Retrofit Location Picker Origin to Destination Navigation Simulate Daftar Pustaka","language":"id","currency":"USD","id":"6237181547","title":"Membuat Aplikasi dengan Mapbox pada Kotlin - Udacoding","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ng_uDwAAQBAJ&source=gbs_api","authors":["Muhammad Rafi Ulwa Pratama"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7Hc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Explore the Java Virtual Machine with modern programming languages About This Book This guide provides in-depth coverage of the Java Virtual Machine and its features Filled with practical examples, this book will help you understand the core concepts of Java, Scala, Clojure, Kotlin, and Groovy Work with various programming paradigms and gain knowledge about imperative, object-oriented and functional programming Who This Book Is For This book is meant for programmers who are interested in the Java Virtual Machine (JVM) and want to learn more about the most popular programming languages that can be used for JVM development. Basic practical knowledge of a modern programming language that supports object-oriented programming (JavaScript, Python, C#, VB.NET, and C++) is assumed. What You Will Learn Gain practical information about the Java Virtual Machine Understand the popular JVM languages and the Java Class Library Get to know about various programming paradigms such as imperative, object-oriented, and functional Work with common JVM tools such as Eclipse IDE, Gradle, and Maven Explore frameworks such as SparkJava, Vert.x, Akka and JavaFX Boost your knowledge about dialects of other well-known programming languages that run on the JVM, including JavaScript, Python, and Ruby In Detail Anyone who knows software development knows about the Java Virtual Machine. The Java Virtual Machine is responsible for interpreting Java byte code and translating it into actions. In the beginning, Java was the only programming language used for the JVM. But increasing complexity of the language and the remarkable performance of the JVM created an opening for a new generation of programming languages. If you want to build a strong foundation with the Java Virtual Machine and get started with popular modern programming languages, then this book is for you. The book will begin with a general introduction of the JVM and its features, which are common to the JVM languages, helping you get abreast with its concepts. It will then dive into explaining languages such as Java, Scala, Clojure, Kotlin, and Groovy and will show how to work with each language, their features, use cases, and pros and cons. By writing example projects in those languages and focusing on each language's strong points, it will help you find the programming language that is most appropriate for your particular needs. By the end of the book, you will have written multiple programs that run on the Java Virtual Machine and know about the differences between the various languages. Style and approach This practical, example-filled guide will help you get started with the JVM and some of its most popular languages.","language":"en","currency":"USD","id":"1787126587","title":"Introduction to JVM Languages","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7Hc5DwAAQBAJ&source=gbs_api","authors":["Vincent van der Leun"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qaw2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.99,"subtitle":null,"description":"Os desenvolvedores querem que seu trabalho seja feito – e quanto menos complicações houver, melhor. Programar com Kotlin significa ter menos complicações. A linguagem de programação Kotlin oferece uma sintaxe expressiva, um sistema de tipos robusto e intuitivo e o suporte de um ótimo conjunto de ferramentas, juntamente com uma interoperabilidade natural com códigos, bibliotecas e frameworks Java. A linguagem Kotlin pode ser compilada para bytecode Java, portanto você pode usá-la em todos os lugares em que Java é utilizada, inclusive no Android. Com um compilador eficiente e uma pequena biblioteca-padrão, Kotlin praticamente não impõe nenhum overhead em tempo de execução. Kotlin em ação ensina você a usar a linguagem Kotlin em aplicações com qualidade compatível para ambientes de produção. Escrito para desenvolvedores com experiência em Java, este livro repleto de exemplos vai além da maioria dos livros sobre linguagens de programação, incluindo tópicos interessantes como construção de DSLs com sintaxe de linguagem natural. Os autores são desenvolvedores do núcleo de Kotlin, portanto você poderá estar certo de que mesmo os detalhes mais intrincados serão apresentados com extrema precisão. O que o livro contém: - programação funcional na JVM; - como escrever um código claro e idiomático; - como combinar Kotlin e Java; - linguagens de domínio específico.","language":"pt","currency":"USD","id":"8575226150","title":"Kotlin em ação","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qaw2DwAAQBAJ&source=gbs_api","authors":["Dmitry Jemerov","Svetlana Isakova"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=elwnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"GUI Design for Android Apps is the perfect—and concise—introduction for mobile app developers and designers. Through easy-to-follow tutorials, code samples, and case studies, the book shows the must-know principles for user-interface design for Android apps running on the Intel platform, including smartphones, tablets and embedded devices. This book is jointly developed for individual learning by Intel Software College and China Shanghai JiaoTong University, and is excerpted from Android Application Development for the Intel® Platform.","language":"en","currency":"USD","id":"1484203828","title":"GUI Design for Android Apps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=elwnCgAAQBAJ&source=gbs_api","authors":["Ryan Cohen","Tao Wang"]},{"pageCount":433,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZcFHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"From Beginner to Professional","description":"Learn to design and create video games using the Java programming language and the LibGDX software library. Working through the examples in this book, you will create 12 game prototypes in a variety of popular genres, from collection-based and shoot-em-up arcade games to side-scrolling platformers and sword-fighting adventure games. With the flexibility provided by LibGDX, specialized genres such as card games, rhythm games, and visual novels are also covered in this book. Major updates in this edition include chapters covering advanced topics such as alternative sources of user input, procedural content generation, and advanced graphics. Appendices containing examples for game design documentation and a complete JavaDoc style listing of the extension classes developed in the book have also been added. What You Will Learn Create 12 complete video game projects Master advanced Java programming concepts, including data structures, encapsulation, inheritance, and algorithms, in the context of game development Gain practical experience with game design topics, including user interface design, gameplay balancing, and randomized content Integrate third-party components into projects, such as particle effects, tilemaps, and gamepad controllers Who This Book Is For The target audience has a desire to make video games, and an introductory level knowledge of basic Java programming. In particular, the reader need only be familiar with: variables, conditional statements, loops, and be able to write methods to accomplish simple tasks and classes to store related data.","language":"en","currency":"USD","id":"1484233247","title":"Java Game Development with LibGDX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZcFHDwAAQBAJ&source=gbs_api","authors":["Lee Stemkoski"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I-OsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.15,"subtitle":"Membuat Aplikasi Android dengan Kotlin cocok untuk Pemula - UDACODING","description":"OverView Apa yang Membuat Kotlin Lebih Baik Dari Java…? Ringkas Aman Interoperable Tool-Friendly Hello World Kotlin Variable & Tipe Data Basic Type of data pada Kotlin Basic Type Numbers Characters Ranges Type Conversion Operators Arithmetic Operator Assignment Operator Decrement Operator Comparison & Equally Operator Logical Operator in Operator Index Access Operator Invoke Operator Comments Input Output Kotlin Output Perbedaan println() dan print(): Kotlin input if Expression Contoh : if dengan Multiple Expressions Susunan if..else..if Kotlin Nested if expression Kotlin Expressions o When Loop For Loop While Loop do..while Break Statement Continue Function Kotlin Standard Library Function User-defined Function Kotlin Recursion (Recursive Function) dan Tail Recursion Recursion Tail Recursion Lambda Exception Handling Null Safety Smart Cast Assertion(Tuntutan) Menghilangkan Null dari Iterable dan Array Null coalescing \/ Elvis Operator Nullable dan Non-Nullable Elvis Operator (?:) Safe Call Operator Collections Using list Using map Using set Reflection Referencing a class Inter-operating with Java reflection Referencing a function Getting values of all properties of a class Setting values of all properties of a class Kotlin OOP Classes dan Object Class How to define a class in Kotlin? Objects Constructor Primary Constructor Secondary Constructor Getter Setter Inheritance Important Notes: Kotlin Inheritance Overriding Member Functions and Properties Calling Members of Base Class from Derived Class Visibility Modifier Visibility Modifiers Inside Package Visibility modifier di dalam class dan interface Mengubah Visibility dari sebuah construtor Abstract Classes Interfaces Mendefinisikan interface? Mengimplementasikan interface Cara Kerja Mengimplementasikan dua atau lebih interface dalam satu Class. Menyelesaikan conflicts overriding (Multiple Interface) Kotlin Nested and Inner Class Kotlin Nested Class Kotlin Inner Class Data Class Copying toString() method hashCode() and equals() Destructuring Declarations Sealed Class Example: Sealed Class Difference Between Enum and Sealed Class Object Singleton Object Declarations Kotlin object Expressions Object Companion Generics Extension Function Operator Overloading Getting Started With Android Studio Using Kotlin Mengenal Android Studio. Menginstall Android Studio Mengenal SDK (Software Development Kit) Creating Our First Android App Using Kotlin Running Aplikasi in AVD Project Structure Meng-Explor Structure App Android Lebih Dalam Activity, User Interface dan Views Activity Activity Lifecycle onCreate() onStart() onResume() onPause() onStop() onDestroy() onRestart() XML File Linear Layout Relative Layout View & Widget View User Interface Design Layout dan meng-Handle Event Navigating Between Activities Using Implicit Intent Mengimplementasikan List dan Classes Recycler View Card View Mengimplementasikan RecyclerView Untuk itu kita perlu : Menambahkan Dependency : com.android.support:design:24.2.0 Menambahkan XML layout : Menyiapkan Data Model Membuat Class Custom Adapter Menghubungkan Custom Adapter dengan RecyclerView Set Layout untuk RecyclerView Leverage The Power Of Kotlin Code Cleanup Extension Function Default Parameters Finishing Touch String Localisation Update App Launcher Icon Styling App : Color Styling App : Theme Developer Account Build & Release Aplikasi. Upload Aplikasi Ke Playstore.","language":"id","currency":"USD","id":"6025357919","title":"Kotlin Zero to Hero","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I-OsDwAAQBAJ&source=gbs_api","authors":["Muhammad Ihsan Aljundi","Muhammad Azriel Akbar"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wg1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":"Crie aplicativos de maneira fácil e divertida","description":"A linguagem Kotlin vem ganhando cada vez mais destaque no cenário do desenvolvimento de aplicativos. Projetada para ter uma interoperabilidade total com código Java, Kotlin tem sido a primeira escolha na criação de aplicativos Android, sendo multiparadigma e multiplataforma. Trata-se de uma linguagem moderna, concisa e poderosa, oferecendo segurança, clareza e suporte a ferramentas de alta produtividade. Neste livro, Kassiano Resende apresenta a linguagem Kotlin tanto para quem já conhece Java ou não, com uma didática prática e divertida. Você verá todos os passos necessários para construir e publicar na Play Store aplicações mobile em Kotlin, no ambiente de desenvolvimento Android Studio. O escopo das aplicações apresentadas no livro vai além das funcionalidades da linguagem, com a utilização de banco de dados, acesso a APIs REST e funcionalidades dos smartphones, como notificações, acesso à galeria de imagens, câmera e localização através de GPS. Este livro é indicado a todos os desenvolvedores que querem começar a utilizar a linguagem Kotlin para criar aplicativos Android. A abordagem utilizada abrange desde o leitor iniciante no mundo de desenvolvimento até os mais experientes que queiram conhecer a linguagem Kotlin. É um pré-requisito para o completo entendimento do conteúdo aqui abordado conhecer lógica de programação e suas estruturas básicas em qualquer linguagem. Não é um pré-requisito saber conceitos de Orientação a Objetos nem a linguagem Java, mas se você já possuir esse conhecimento será de grande valia.","language":"pt","currency":"USD","id":"8594188765","title":"Kotlin com Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wg1mDwAAQBAJ&source=gbs_api","authors":["Kassiano Resende"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O6w2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.99,"subtitle":"Conheça todos os recursos de Kotlin com este guia detalhado","description":"Kotlin tem causado sensação desde que foi disponibilizado como código aberto pela JetBrains em 2011. A linguagem foi elogiada por desenvolvedores no mundo todo e já está sendo adotada pelas empresas. Este livro apresenta uma introdução detalhada a Kotlin, mostrando todos os seus recursos, e possibilitará que você escreva código Kotlin para ambientes de produção. Começaremos pelo básico: deixaremos você se familiarizar com a execução de código Kotlin, configurar ferramentas e apresentar instruções que poderão ser usadas para escrever programas básicos. Em seguida, discutiremos códigos orientados a objetos – funções, lambdas e propriedades –, tudo isso enquanto utilizamos os novos recursos de Kotlin. Então, prosseguiremos discutindo aspectos sobre null safety (segurança de nulos) e parametrização de tipos. Mostraremos como desestruturar expressões e até mesmo escrever suas próprias expressões. Também abordaremos tópicos importantes, como testes, concorrência, microsserviços e muito mais. No final deste livro, você será capaz de compor diferentes serviços e construir suas próprias aplicações. Você aprenderá a: - utilizar novos recursos para escrever código orientado a objetos estruturado e legível; - usar lambdas e funções de alta ordem para escrever um código limpo, reutilizável e simples; - escrever testes de unidade e integrar testes de Kotlin com código Java em uma base de código em transição; - escrever código de produção para o mundo real em Kotlin no estilo de microsserviços; - tirar proveito das extensões de Kotlin para usar a biblioteca de coleções de Java; - escrever código que evite erros de ponteiros nulos e ver como um código Java nullable pode ser integrado aos recursos de uma base de código Kotlin; - escrever funções em Kotlin, conhecer novos recursos disponíveis e estender as bibliotecas existentes.","language":"pt","currency":"USD","id":"8575226169","title":"Programando com Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O6w2DwAAQBAJ&source=gbs_api","authors":["Stephen Samuel","Stefan Bocutiu"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7TECEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":null,"description":"Kotlin est un langage de programmation orienté objet conçu principalement par une équipe de programmeurs chez JetBrains basée en Russie (son nom vient de l'île de Kotline, près de St. Petersbourg). Google a annoncé en 2017 que Kotlin devenait le second langage de programmation officiellement pris en charge par Android, après Java. Le 8 mai 2019 Kotlin est devenu le langage de programmation voulu et recommandé par Google pour le développement des applications Android. Ce livre est un outil d'apprentissage généraliste pour acquérir un socle de connaissances. Il est \"agnostique\" dans le sens où il ne se limite pas à l'univers Android, mais permet également d'apprendre à développer des applications qui tourneront sur MacOS ou Windows. Chaque chapitre possède une ou deux sections intitulées \"Pour les plus curieux\"\" qui vont un peu plus en profondeur. La plupart des chapitres se terminent par des \"challenges\" qui sont des exercices d'application.","language":"fr","currency":"USD","id":"210081897X","title":"Programmer avec Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7TECEAAAQBAJ&source=gbs_api","authors":["Josh Skeen","David Greenhalgh"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=drKtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.78,"subtitle":null,"description":"Kotlin — язык программирования со статической типизацией, который взяла на вооружение Google в ОС Android. Книга Джоша Скина и Дэвида Гринхола основана на популярном курсе Kotlin Essentials от Big Nerd Ranch. Яркие и полезные примеры, четкие объяснения ключевых концепций и основополагающих API не только знакомят с языком Kotlin, но и учат эффективно использовать его возможности, а так же позволяют освоить среду разработки IntelliJ IDEA от JetBrains. Не важно опытный вы разработчик, который хочет выйти за рамки Java, или изучаете первый язык программирования. Джош и Дэвид проведут вас от основных принципов к расширенному использованию Kotlin, чтобы вы могли создавать надежные и эффективные приложения.","language":"ru","currency":"USD","id":"5446112431","title":"Kotlin. Программирование для профессионалов","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=drKtDwAAQBAJ&source=gbs_api","authors":["Скин Джош","Гринхол Дэвид"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zTHKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.96,"subtitle":"Buku Kotlin Seri ke 3 Level High Intermediate - UDACODING","description":"DAFTAR ISI BAB 1 : Permulaan Project 6 1.1. Membuat Database 6 1.2. Membuat API 7 1.3. Struktur Folder 8 1.4. Menambahkan Dependency 9 1.5. Mengatur Permission 10 1.6. Mengatur Base URL Server 10 1.7. Konfigurasi Retrofit 11 1.8. Utils 12 1.9. BaseActivity 12 1.10. Resources 14 1.10.1. Colors 14 1.10.2. Dimens 15 1.10.3. Drawable 15 1.10.4. Icons 17 1.10.5. Menu 17 BAB 2 : Halaman Login 18 2.1. Membuat Model Response Login 19 2.2. Menambahkan API Login ke CatatanPenjualanService 22 2.3. Membuat Layout Login 23 2.4. LoginView 24 2.5. LoginPresenter 24 2.6. LoginActivity 25 BAB 3 : Membuat Halaman Register 28 3.1. Membuat Model Response Register 28 3.2. Menambahkan API Register ke CatatanPenjualanService 29 3.3. Membuat Layout Register 30 3.4. RegisterView 32 3.5. RegisterPresenter 32 3.6. RegisterActivity 33 BAB 4 : Membuat Halaman HomePage 35 4.1. Membuat Layout 35 4.2. Membuat MenuAdapter 37 4.3. MainActivity 38 4.4. Membuat Fungsi Logout 40 BAB 5 : Membuat Halaman Data Barang 41 5.1. Baca Daftar DataBarang 41 5.1.1. Membuat Model Response List Data Barang 41 5.1.2. Menambahkan API ke CatatanPenjualanService 43 5.1.3. Membuat Layout List Barang 43 5.1.4. Membuat DataBarangAdapter 45 5.1.5. DataBarangView 46 5.1.6. DataBarangPresenter 47 5.1.7. DataBarangActivity 48 5.2. Tambah Data Barang 50 5.2.1. Membuat Model Response Tambah Data Barang 50 5.2.2. Menambahkan API ke ServiceCatatanPenjualan 51 5.2.3. Membuat Layout AddBarangActivity 51 5.2.4. AddBarangView 53 5.2.5. AddBarangPresenter 53 5.2.6. AddBarangActivity 55 5.3. Edit Data Barang 57 5.3.1. Membuat Model Response Edit Barang 57 5.3.2. Menambahkan API ke ServiceCatatanPenjualan 57 5.3.3. Event Button Edit 58 5.3.4. Identifikasi Edit Barang 59 5.3.5. Fungsi Edit Barang 59 5.3.6. Mengubah AddBarangPresenter 60 5.4. Hapus Data Barang 61 5.4.1. Membuat Model Response Delete Barang 62 5.4.2. Menambahkan API ke ServiceCatatanPenjualan 62 5.4.3. DataBarangView 63 5.4.4. DataBarangPresenter 63 5.4.5. Fungsi Hapus Barang 63 BAB 6 : Penjualan Barang 65 6.1. Membuat Layout Penjualan Barang 65 6.2. Mendapatkan Keranjang yang Tersedia 71 6.2.1. Membuat Model Response Get Keranjang 71 6.2.2. Menambahkan ke CatatanPenjualanService 74 6.2.3. Membuat PenjualanAdapter 74 6.2.4. PenjualanView 76 6.2.5. PenjualanPresenter 76 6.2.5. PenjualanActivity 77 6.3. Membuat Pencarian Produk 79 6.3.1. Membuat Model Response Hasil Pencarian 79 6.3.2. Menambahkan ke CatatanPenjualanService 81 6.3.3. PenjualanView 81 6.3.4. PenjualanPresenter 81 6.3.5. PenjualanBarang Activity 82 6.4. Menambahkan Barang ke Keranjang 84 6.4.1. Testing Response Tambah ke Keranjang 84 6.4.2. Menambahkan ke CatatanPenjualanService 85 6.4.3. PenjualanView 85 6.4.4. PenjualanPresenter 85 6.4.5. PenjualanBarang Activity 86 6.5. Menghapus Item Barang dari Keranjang 87 6.5.1. Testing Response Hapus Item Keranjang 88 6.5.2. Menambahkan ke CatatanPenjualanService 88 6.5.3. PenjualanView 88 6.5.4. PenjualanPresenter 89 6.5.6. PenjualanBarang Activity 89 6.6. Menjual Barang-barang di Keranjang 90 6.6.1. Testing Response API Jual Barang 90 6.6.2. Menambahkan ke CatatanPenjualanService 91 6.6.3. PenjualanView 91 6.6.4. PenjualanPresenter 91 6.6.5. PenjualanBarang Activity 92 BAB 7 : Multi Keranjang 93 7.1. Menampilkan List Keranjang 94 7.1.1. Membuat Layout per Item 95 7.1.2. Membuat Adapter 96 7.1.3. Implementasi Adapter 97 7.2. Menambah Keranjang Baru 98 7.2.1. Test Response API Tambah Keranjang 98 7.2.2. Menambahkan ke CatatanPenjualanService 99 7.2.3. PenjualanView 99 7.2.4. PenjualanPresenter 99 7.2.5. PenjualanBarang Activity 100 8.2. Menghapus Keranjang 101 8.2.1. PenjualanBarang Activity 101 BAB 8 : Report History 102 8.1. Membuat Layout Report 102 8.2. Report History 103 8.2.1. Test Response API Get Report 103 8.2.2. Menambahkan ke CatatanPenjualanService 104 8.2.3. ReportView 104 8.2.4. ReportPresenter 104 8.2.5. ReportActivity 105 8.3. Membatalkan Penjualan 107 8.3.1. ReportView 107 8.3.2. ReportPresenter 107 8.3.4. ReportActivity 108 8.4. Detail Report 109 8.4.1. Membuat Layout Detail Report 110 8.4.2. Test API Detail Report 112 8.4.3. Membuat Model POJO Report Detail 113 8.4.4. Menambahkan di CatatanPenjualanService 114 8.4.5. ReportDetailAdapter 114 8.4.6. DetailReportPresenter 115 8.4.7. DetailReportFragment 116 8.4.8. ReportActivity 117 BAB 9 : Report Periode 118 9.1. Memodifikasi Layout MainActivity 119 9.1.1. Test Response API Report Periode 122 9.1.2. MainView 123 9.1.3. MainPresenter 123 9.1.4. MainActivity 127 BAB 10. Aplikasi Movie dengan Database MySQL dan Restful Api menggunakan Codeigniter 10.1. Membuat Database 130 10.2. Membuat Backend 131 10.2.1. fungsi loginUser 131 10.2.2. fungsi registerUser 132 10.3 Testing in Postman 133 10.3.1 Test Function Register 134 10.3.2 Test Function Login 136 10.4 Membuat Aplikasi Android Studio 137 10.4.1. Konfigurasi Backend 138 10.4.2. Splash Activity 140 10.4.3. Login 141 10.4.4. Register 150 10.4.5. Dashboard 156 10.4.5 Show Movie & Detail 159 10.4.6 Save to Favorite and Delete 174 10.4.7 Show Favorite & Detail 178 10.4.8. Profile 181 BAB 11. Aplikasi UDASIMRS 184 11. 1 DOKUMENTASI API 185 11. 2 LOGIN AND REGISTER PAGE 197 11.3 Login Page 209 11. 4 Dashboard 221 11. 5. EDIT PROFILE 231 11. 6 SPLASH SCREEN 244 11.7 JENGUK PASIEN 247 11. 8 JADWAL DOKTER 264 11.9 CEK KAMAR 271 11.10 E-Ticket 278 11.11 DONOR DARAH 295 10.1 Layout View 295 10.2 Logic 299 11.12 HEALHTY NEWS 307","language":"id","currency":"USD","id":"623718127X","title":"Fun Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zTHKDwAAQBAJ&source=gbs_api","authors":["Pesantren Udacoding Batch 1"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y4KGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build robust Android applications with Kotlin 1.3 and Spring 5","description":"A hands-on guide to Android programming with Spring MVC, Spring Boot, and Spring Security Key Features Build native Android applications with Spring for Android Explore Reactive programming, concurrency, and multithreading paradigms for building fast and efficient applications Write more expressive and robust code with Kotlin using its coroutines and other latest features Book Description As the new official language for Android, Kotlin is attracting new as well as existing Android developers. As most developers are still working with Java and want to switch to Kotlin, they find a combination of these two appealing. This book addresses this interest by bringing together Spring, a widely used Java SE framework for building enterprise-grade applications, and Kotlin. Learn Spring for Android Application Development will guide you in leveraging some of the powerful modules of the Spring Framework to build lightweight and robust Android apps using Kotlin. You will work with various modules, such as Spring AOP, Dependency Injection, and Inversion of Control, to develop applications with better dependency management. You’ll also explore other modules of the Spring Framework, such as Spring MVC, Spring Boot, and Spring Security. Each chapter has practice exercises at the end for you to assess your learning. By the end of the book, you will be fully equipped to develop Android applications with Spring technologies. What you will learn Get to grips with the basics of the Spring Framework Write web applications using the Spring Framework with Kotlin Develop Android apps with Kotlin Connect a RESTful web service with your app using Retrofilt Understand JDBC, JPA, MySQL for Spring and SQLite Room for Android Explore Spring Security fundamentals, Basic Authentication, and OAuth2 Delve into Concurrency and Reactive programming using Kotlin Develop testable applications with Spring and Android Who this book is for If you’re an aspiring Android developer or an existing developer who wants to learn how to use Spring to build robust Android applications in Kotlin, this book is for you. Though not necessary, basic knowledge of Spring will assist with understanding key concepts covered in this book.","language":"en","currency":"USD","id":"1789341914","title":"Learn Spring for Android Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y4KGDwAAQBAJ&source=gbs_api","authors":["S. M. Mohi Us Sunnat","Igor Kucherenko"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x0olDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.76,"subtitle":"Native Android-Apps mit Kotlin statt Java professionell entwickeln","description":"Seit der Google I\/O 2017 ist Kotlin neben Java die zweite offizielle Sprache zur Entwicklung von Android-Apps. Kotlin glänzt mit fortschrittlichen Sprachfeatures und einer einfachen, klaren Syntax, nutzt aber weiterhin Java-6-Bytecode für die JVM und ist so zu allen Android-Versionen kompatibel. In diesem E-Book lernen Sie die wesentlichen Features von Kotlin kennen und erfahren, wie man damit Android-Apps programmiert. Im Zuge eines dreiteiligen Tutorials erstellen Sie eine einfache Android-App mit Kotlin. Das Tutorial richtet sich an Personen, die bereits mit den Grundzügen der Entwicklung von Android-Apps vertraut sind. Autor Kai König arbeitet als Software Solutions Architect bei Ventego Creative Ltd. Sein Schwerpunkt liegt dabei auf Web- und Mobilplattformen. Er spricht regelmäßig auf internationalen Konferenzen. Inhalt: Kotlin – Neue Sprache für die Java Virtual Machine Tutorial, Teil 1: Einrichtung von Android Studio und Kotlin-Grundlagen Tutorial, Teil 2: Views, Umgang mit Daten und Unit-Tests mit Kotlin Tutorial, Teil 3: Anwendungsarchitektur, Anko-Framework und weitere Sprachfeatures in Android Die Artikel stammen aus iX, dem Magazin für professionelle IT von Heise Medien, Ausgaben 4\/2016, 9\/2016, 10\/2016 und 11\/2016.","language":"de","currency":"USD","id":"3957881684","title":"iX Thema: Einführung in die Android-Programmierung mit Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x0olDwAAQBAJ&source=gbs_api","authors":["iX-Redaktion"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HqWdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"使用Android Studio與Kotlin程式語言開發 × Step by Step實戰操作解說 × 快速掌握Android開發的要領 2017年Google官方指定Kotlin為開發Android App的一級開發語言，因此Kotlin程式語言是未來的重要趨勢。 本書是作者集結10年來教授Android課程的心得與精華，內容使用Android Studio與Kotlin程式語言開發，並精心設計16個章節，從零開始，一步一步帶領讀者學習Android中的佈局排版、監聽事件、生命週期與各式元件等必備知識，以實作的方式提供讀者最通盤性的認識，並掌握Android開發的要領。 拿起這本書，你將學到： ◎使用Kotlin打造你的第一個優質App。 ◎學會使用ConstrainLayout佈局元件。 ◎了解Android的生命週期。 ◎學會使用Firebase Cloud Messaging。 ◎透過HTTP通訊協定介接開放資料。 ◎元件的事件監聽與處理。 ◎快顯與對話框的使用。 ◎清單元件的ViewHolder複用。 ◎Google Map的處理與運用。 ◎Android的廣播機制。 ◎靈活運用SQLite。 ◎Git版本控制。 範例檔下載網址：https:\/\/github.com\/taipeitechmmslab\/MMSLAB-Android-Kotlin","language":"zh-TW","currency":"USD","id":"9864343750","title":"輕鬆學會Android Kotlin實作開發：精心設計16個Lab讓你快速上手","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HqWdDwAAQBAJ&source=gbs_api","authors":["黃士嘉、吳建儒"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.39,"subtitle":"Elements of Reusable Object-Oriented Software (Adobe Reader)","description":"Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.","language":"en","currency":"USD","id":"9780321700698","title":"Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6oHuKQe3TjQC&source=gbs_api","authors":["Erich Gamma","Richard Helm","Ralph Johnson","John Vlissides"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8GGNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.12,"subtitle":null,"description":"【本書の内容】 Kotlinは、Javaとの相互運用を可能にし、Android OSでGoogleがフルサポートする静的型プログラミング言語です。 この言語は、Javaだけでは十全ではない(Javaだけでは実装に手間がかかりすぎる)、軽量かつ豊かな表現形式や、他言語ではすでに実装されている最新の機能を盛り込んでいます。 本書はこの新しい開発言語・Kotlinを使った正しく、効果的な開発方法と、この言語がもっている主要な概念と基礎的なAPIを丹念に説明します。とくにJetBrainsのIntelliJ IDE開発環境についても紹介しています。 経験豊富なAndroid開発者でも、はじめてプログラミング言語を学ぶ新人開発者でも、Kotlinの最初の原則から高度な使い方まで導いてくれることでしょう。 【本書のポイント】 ・Kotlinはもちろん、開発環境のインストールから詳解 ・サンプルソースコードの変更点がひと目で分かる ・PCだけではなく、Androidアプリまで網羅 【読者が得られること】 ・Kotlinによるアプリケーション開発 ・IntelliJを使った開発方法 ・Javaとの相互運用方法 【対象読者】 ・プログラミング初学者 ・Androidアプリ開発者 ・JavaからKotlinに乗り換えたい開発者 ※本電子書籍は同名出版物を底本として作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)","language":"ja","currency":"USD","id":"4798160733","title":"Kotlinプログラミング","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8GGNDwAAQBAJ&source=gbs_api","authors":["Josh Skeen","David Greenhalgh"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g5AwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Simple Solutions to Difficult Problems in Java 8 and 9","description":"The introduction of functional programming concepts in Java SE 8 was a drastic change for this venerable object-oriented language. Lambda expressions, method references, and streams fundamentally changed the idioms of the language, and many developers have been trying to catch up ever since. This cookbook will help. With more than 70 detailed recipes, author Ken Kousen shows you how to use the newest features of Java to solve a wide range of problems. For developers comfortable with previous Java versions, this guide covers nearly all of Java SE 8, and includes a chapter focused on changes coming in Java 9. Need to understand how functional idioms will change the way you write code? This cookbook—chock full of use cases—is for you. Recipes cover: The basics of lambda expressions and method references Interfaces in the java.util.function package Stream operations for transforming and filtering data Comparators and Collectors for sorting and converting streaming data Combining lambdas, method references, and streams Creating instances and extract values from Java’s Optional type New I\/O capabilities that support functional streams The Date-Time API that replaces the legacy Date and Calendar classes Mechanisms for experimenting with concurrency and parallelism","language":"en","currency":"USD","id":"1491973129","title":"Modern Java Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g5AwDwAAQBAJ&source=gbs_api","authors":["Ken Kousen"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jOweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.47,"subtitle":null,"description":"Вот и настало время изучить Kotlin. В этом вам поможет уникальная методика Head First, выходящая за рамки синтаксиса и инструкций по решению конкретных задач. Хотите мыслить, как выдающиеся разработчики Kotlin? Эта книга даст вам все необходимое — от азов языка до продвинутых методов. А еще вы сможете попрактиковаться в объектно-ориентированном и функциональном программировании. Если вы действительно хотите понять, как устроен Kotlin, то эта книга для вас! Почему эта книга не похожа на другие? Подход Head First основан на новейших исследованиях в области когнитивистики и теории обучения. Визуальный формат позволяет вовлечь в обучение мозг читателя лучше, чем длинный текст, который вгоняет в сон. Зачем тратить время на борьбу с новыми концепциями? Head First задействует разные каналы получения информации и разрабатывался с учетом особенностей работы вашего мозга. «Четко, доступно, просто для понимания. Если вы только осваиваете Kotlin, эта книга станет отличным вводным пособием». — Кен Коусен (Ken Kousen) Сертифицированный преподаватель Kotlin «Head First Kotlin поможет вам быстро проникнуть в суть дела, заложить надежный фундамент и (снова) получать удовольствие от написания кода». — Инго Кроцки (Ingo Krotzky), изучающий Kotlin «Наконец-то! Kotlin для тех, кто не знает Java. Просто, лаконично и занимательно. Я давно ждал появления такой книги». — Доктор Мэтт Венэм (Dr. Matt Wenham), специалист по data science и программист Python","language":"ru","currency":"USD","id":"5446113357","title":"Head First. Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jOweEAAAQBAJ&source=gbs_api","authors":["Гриффитс Дон","Гриффитс Дэвид"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MYOqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Eine Einführung in die Kotlin-Programmierung","description":"Was lernen Sie in diesem Buch? Kotlin von Kopf bis Fuß ist eine praxisnahe Einführung in die Programmierung mit Kotlin, für die Sie keine Java-Vorkenntnisse benötigen. Das Buch vermittelt Ihnen zunächst die Grundlagen der Sprache und behandelt dann Collections, die generische Programmierung, Lambdas und Funktionen höherer Ordnung. Unterwegs haben Sie Gelegenheit, sowohl mit objektorientierter als auch mit funktionaler Programmierung zu experimentieren. Hierfür verwenden die Autoren eine einzigartige, visuell ansprechende Methode, die über das Lernen der Syntax und schlichte Anleitungen hinausgeht. Wenn Sie Kotlin wirklich verstehen wollen, ist dieses Buch genau das richtige für Sie. Warum ist dieses Buch so anders? In dieses Buch sind die neuesten Erkenntnisse der Kognitionsforschung und der Lerntheorie eingeflossen, um Ihnen das Lernen so einfach wie möglich zu machen. Statt einschläfernder Bleiwüsten verwendet dieses Buch eine Vielzahl von Abbildungen und Textstilen, die Ihr Gehirn auf Trab halten und Ihnen das Wissen direkt ins Hirn spielen – und zwar so, dass es sitzt.","language":"de","currency":"USD","id":"3960103093","title":"Kotlin von Kopf bis Fuß","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MYOqDwAAQBAJ&source=gbs_api","authors":["Dawn Griffiths","David Griffiths"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fB6s_Z6g0gIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"WORK EFFECT LEG CODE _p1","description":"Get more out of your legacy systems: more performance, functionality, reliability, and manageability Is your code easy to change? Can you get nearly instantaneous feedback when you do change it? Do you understand it? If the answer to any of these questions is no, you have legacy code, and it is draining time and money away from your development efforts. In this book, Michael Feathers offers start-to-finish strategies for working more effectively with large, untested legacy code bases. This book draws on material Michael created for his renowned Object Mentor seminars: techniques Michael has used in mentoring to help hundreds of developers, technical managers, and testers bring their legacy systems under control. The topics covered include Understanding the mechanics of software change: adding features, fixing bugs, improving design, optimizing performance Getting legacy code into a test harness Writing tests that protect you against introducing new problems Techniques that can be used with any language or platform—with examples in Java, C++, C, and C# Accurately identifying where code changes need to be made Coping with legacy systems that aren't object-oriented Handling applications that don't seem to have any structure This book also includes a catalog of twenty-four dependency-breaking techniques that help you work with program elements in isolation and make safer changes.","language":"en","currency":"USD","id":"0132931753","title":"Working Effectively with Legacy Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fB6s_Z6g0gIC&source=gbs_api","authors":["Michael Feathers"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HgGfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.32,"subtitle":null,"description":"「習うより慣れろ」でAndroidアプリを作ることからはじめよう! 作って学ぶAndroidアプリ開発入門の決定版がKotlin言語に対応 本書は、Android SDKとAndroid Studioを利用して、実際にアプリを作りながら、Androidアプリ開発の基礎知識や実践的なプログラミング方法を学ぶ書籍です。第4版までの「習うより慣れろ」「作って楽しい」というコンセプトはそのままに、Kotlin言語でAndroidアプリを作成します。 ハイ&ローゲームや名刺代わりに使えるアプリ、加速度センサーを使った和室専用侵入者検知アプリ、MediaPlayerによる音声再生を活用した盗難防止アラーム、方位センサーを使ったゲーム、血圧を記録するアプリ、地図を活用したメモアプリなど、特徴的で楽しい10のサンプルプログラムを作ります。 これらを作ることで、アクティビティやインテント、イベントリスナー、ConstraintLayout、UI部品(TextView\/Button\/ImageViewなど)の使い方といったAndroidアプリ開発で必要な基礎知識から、SurfaceViewによる描画、プリファレンスによる情報の記録、センサーやRealmデータベースの活用といった実践的なプログラミング方法まで習得できます。 「とにかくなにか作りたい」「アプリを作りたいけどなにからはじめればいいのかよくわからない」「アプリを作りながらプログラミングのコツをおぼえたい」という方におすすめの一冊です。 ※本電子書籍は同名出版物を底本として作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)","language":"ja","currency":"USD","id":"4798162892","title":"作ればわかる!Androidプログラミング Kotlin対応 10の実践サンプルで学ぶAndroidアプリ開発入門","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HgGfDwAAQBAJ&source=gbs_api","authors":["金宏 和實"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Create Expressive, Concise, and Scalable Applications","description":"Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. The first edition of this book was released as Programming Scala. Our industry is moving toward functional programming, but your object-oriented experience is still valuable. Scala combines the power of OO and functional programming, and Pragmatic Scala shows you how to work effectively with both. Updated to Scala 2.11, with in-depth coverage of new features such as Akka actors, parallel collections, and tail call optimization, this book will show you how to create stellar applications. This thorough introduction to Scala will get you coding in this powerful language right away. You'll start from the familiar ground of Java and, with easy-to-follow examples, you'll learn how to create highly concise and expressive applications with Scala. You'll find out when and how to mix both imperative and functional style, and how to use parallel collections and Akka actors to create high-performance concurrent applications that effectively use multicore processors. Scala has evolved since the first edition of this book, and Pragmatic Scala is a significant update. We've revised each chapter, and added three new chapters and six new sections to explore the new features in Scala. You'll learn how to: Safely manage concurrency with parallel collections and Akka actors Create expressive readable code with value classes and improved implicit conversions Create strings from data with no sweat using string interpolation Create domain-specific languages Optimize your recursions with tail call optimization Whether you're interested in creating concise, robust single-threaded applications or highly expressive, thread-safe concurrent programs, this book has you covered. What You Need: The Scala compiler (2.x) and the JDK are required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680504207","title":"Pragmatic Scala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ocmqBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"59 Specific Ways to Write Better Python","description":"“Each item in Slatkin’s Effective Python teaches a self-contained lesson with its own source code. This makes the book random-access: Items are easy to browse and study in whatever order the reader needs. I will be recommending Effective Python to students as an admirably compact source of mainstream advice on a very broad range of topics for the intermediate Python programmer.” —Brandon Rhodes, software engineer at Dropbox and chair of PyCon 2016-2017 It’s easy to start coding with Python, which is why the language is so popular. However, Python’s unique strengths, charms, and expressiveness can be hard to grasp, and there are hidden pitfalls that can easily trip you up. Effective Python will help you master a truly “Pythonic” approach to programming, harnessing Python’s full power to write exceptionally robust and well-performing code. Using the concise, scenario-driven style pioneered in Scott Meyers’ best-selling Effective C++, Brett Slatkin brings together 59 Python best practices, tips, and shortcuts, and explains them with realistic code examples. Drawing on years of experience building Python infrastructure at Google, Slatkin uncovers little-known quirks and idioms that powerfully impact code behavior and performance. You’ll learn the best way to accomplish key tasks, so you can write code that’s easier to understand, maintain, and improve. Key features include Actionable guidelines for all major areas of Python 3.x and 2.x development, with detailed explanations and examples Best practices for writing functions that clarify intention, promote reuse, and avoid bugs Coverage of how to accurately express behaviors with classes and objects Guidance on how to avoid pitfalls with metaclasses and dynamic attributes More efficient approaches to concurrency and parallelism Better techniques and idioms for using Python’s built-in modules Tools and best practices for collaborative development Solutions for debugging, testing, and optimization in order to improve quality and performance","language":"en","currency":"USD","id":"0134034406","title":"Effective Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ocmqBgAAQBAJ&source=gbs_api","authors":["Brett Slatkin"]},{"pageCount":309,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I9TBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Create Cross-Platform Mobile Apps","description":"Create iOS and Android apps with Flutter using just one codebase. App development on multiple platforms has historically been difficult and complex. This book breaks down complex concepts and tasks into easily digestible segments with examples, pictures, and hands-on labs with starters and solutions. In doing so, you'll develop a basic understanding of the Dart programming language; the entire Flutter development toolchain; the differences between stateful and stateless widgets; and a working knowledge of the architecture of apps. All the most important parts of app development with Flutter are covered in this book. Work with themes and styles. Develop custom widgets. Teach your app to respond to gestures like taps, swipes, and pinches. Design, create and control the layout of your app. Create tools to handle form data entry from users. And ultimately create killer multiscreen apps with navigation, menus, and tabs. Flutter is Google's new framework for creating mobile apps that run on iOS and Android phones both.You had to be a super-developer to write apps for iOS or Android alone. But writing for both? Forget about it! You had to be familiar with Swift, Java\/Kotlin, Xcode, Eclipse, and a bunch of other technologies simultaneously. Beginning App Development with Flutter simplifies the entire process. What You'll Learn Get the most out of great Flutter widgets Create custom widgets, both stateless and stateful Exercise expert control over your Flutter layouts Make your app respond to gestures like swiping, pinching and tapping Initiate async Ajax calls to RESTful APIs — including Google Firebase! Who This Book Is ForDevelopers who have coded in Java, C#, C++, or any similar language. It brings app development within the reach of younger developers, so STEM groups are likely to pick up the technology. Managers, product owners, and business analysts need to understand Flutter's capabilities.","language":"en","currency":"USD","id":"1484251814","title":"Beginning App Development with Flutter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I9TBDwAAQBAJ&source=gbs_api","authors":["Rap Payne"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.95,"subtitle":null,"description":"Another day without Test-Driven Development means more time wasted chasing bugs and watching your code deteriorate. You thought TDD was for someone else, but it's not! It's for you, the embedded C programmer. TDD helps you prevent defects and build software with a long useful life. This is the first book to teach the hows and whys of TDD for C programmers. TDD is a modern programming practice C developers need to know. It's a different way to program---unit tests are written in a tight feedback loop with the production code, assuring your code does what you think. You get valuable feedback every few minutes. You find mistakes before they become bugs. You get early warning of design problems. You get immediate notification of side effect defects. You get to spend more time adding valuable features to your product. James is one of the few experts in applying TDD to embedded C. With his 1.5 decades of training,coaching, and practicing TDD in C, C++, Java, and C# he will lead you from being a novice in TDD to using the techniques that few have mastered. This book is full of code written for embedded C programmers. You don't just see the end product, you see code and tests evolve. James leads you through the thought process and decisions made each step of the way. You'll learn techniques for test-driving code right nextto the hardware, and you'll learn design principles and how to apply them to C to keep your code clean and flexible. To run the examples in this book, you will need a C\/C++ development environment on your machine, and the GNU GCC tool chain or Microsoft Visual Studio for C++ (some project conversion may be needed).","language":"en","currency":"USD","id":"1680504886","title":"Test Driven Development for Embedded C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dA9QDwAAQBAJ&source=gbs_api","authors":["James W. Grenning"]},{"pageCount":648,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fZAwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry","description":"What separates the traditional enterprise from the likes of Amazon, Netflix, and Etsy? Those companies have refined the art of cloud native development to maintain their competitive edge and stay well ahead of the competition. This practical guide shows Java\/JVM developers how to build better software, faster, using Spring Boot, Spring Cloud, and Cloud Foundry. Many organizations have already waded into cloud computing, test-driven development, microservices, and continuous integration and delivery. Authors Josh Long and Kenny Bastani fully immerse you in the tools and methodologies that will help you transform your legacy application into one that is genuinely cloud native. In four sections, this book takes you through: The Basics: learn the motivations behind cloud native thinking; configure and test a Spring Boot application; and move your legacy application to the cloud Web Services: build HTTP and RESTful services with Spring; route requests in your distributed system; and build edge services closer to the data Data Integration: manage your data with Spring Data, and integrate distributed services with Spring’s support for event-driven, messaging-centric architectures Production: make your system observable; use service brokers to connect stateful services; and understand the big ideas behind continuous delivery","language":"en","currency":"USD","id":"144937459X","title":"Cloud Native Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fZAwDwAAQBAJ&source=gbs_api","authors":["Josh Long","Kenny Bastani"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_g5QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Harnessing the Power Of Java 8 Lambda Expressions","description":"Intermediate level, for programmers fairly familiar with Java, but new to the functional style of programming and lambda expressions. Get ready to program in a whole new way. Functional Programming in Java will help you quickly get on top of the new, essential Java 8 language features and the functional style that will change and improve your code. This short, targeted book will help you make the paradigm shift from the old imperative way to a less error-prone, more elegant, and concise coding style that's also a breeze to parallelize. You'll explore the syntax and semantics of lambda expressions, method and constructor references, and functional interfaces. You'll design and write applications better using the new standards in Java 8 and the JDK. Lambda expressions are lightweight, highly concise anonymous methods backed by functional interfaces in Java 8. You can use them to leap forward into a whole new world of programming in Java. With functional programming capabilities, which have been around for decades in other languages, you can now write elegant, concise, less error-prone code using standard Java. This book will guide you though the paradigm change, offer the essential details about the new features, and show you how to transition from your old way of coding to an improved style. In this book you'll see popular design patterns, such as decorator, builder, and strategy, come to life to solve common design problems, but with little ceremony and effort. With these new capabilities in hand, Functional Programming in Java will help you pick up techniques to implement designs that were beyond easy reach in earlier versions of Java. You'll see how you can reap the benefits of tail call optimization, memoization, and effortless parallelization techniques. Java 8 will change the way you write applications. If you're eager to take advantage of the new features in the language, this is the book for you. What you need: Java 8 with support for lambda expressions and the JDK is required to make use of the concepts and the examples in this book.","language":"en","currency":"USD","id":"1680503545","title":"Functional Programming in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_g5QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OgxlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Master ES6, ES7, and ES8","description":"JavaScript is no longer to be feared or loathed - the world's most popular and ubiquitous language has evolved into a respectable language. Whether you're writing frontend applications or server side code, the phenomenal features from ES6 and beyond - like the rest operator, generators, destructuring, object literals, arrow functions, modern classes, promises, async, and metaprogramming capabilities - will get you excited and eager to program with JavaScript. You've found the right book to get started quickly and dive deep into the essence of modern JavaScript. Learn practical tips to apply the elegant parts of the language and the gotchas to avoid. JavaScript is a black swan that no one, including the author of the language, thought would become a popular and ubiquitous language. Not long ago, it was the most hated and feared language you could use to program the web. JavaScript ES6 and beyond has gone through a significant makeover. Troublesome features have been replaced with better, elegant, more reliable alternatives. This book includes many practical examples and exercises to help you learn in depth. It will not bore you with idiosyncrasies and arcane details intended for bad interview questions. Instead, it takes you into key features that you can readily use in your day-to-day projects. Whether you program the frontend or the server side, you can now write concise, elegant, and expressive JavaScript with newer features like default parameters, template literals, rest and spread operators, destructuring, arrow functions, and generators. Take it up a notch with features like infinite series, promises, async, and metaprogramming to create flexible, powerful, and extensible libraries. While the evolved features of the language will draw you in, the hundreds of examples in this book will pin the concepts down, for you to use on your projects. Take command of modern JavaScript and unlock your potential to create powerful applications. What You Need: To try out the examples in the book you will need a computer with Node.js, a text editor, and a browser like Chrome installed in it.","language":"en","currency":"USD","id":"1680506188","title":"Rediscovering JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OgxlDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=au1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build production-grade reactive applications and microservices with Spring Boot","description":"Develop diverse real-life projects including most aspects of Spring Boot Key Features Run production-grade based applications using the Spring WebFlux framework Learn to develop high performance, asynchronous applications with Spring Boot Create robust microservice-based applications with Kotlin using Spring Boot Book Description Spring is one of the best tools available on the market for developing web, enterprise, and cloud-ready software. The goal of Spring Boot is to provide a set of tools for quickly building Spring applications that are easy to configure, and that make it easy to create and run production-grade Spring-based applications. Spring Boot 2.0 Projects will get you acquainted with important features of the latest version of this application-building tool and will cover basic, as well as advanced topics. The book starts off by teaching you how to create a web application using Spring Boot, followed by creating a Spring Boot-based simple blog management system that uses Elasticsearch as the data store. As you make your way through the chapters, you’ll build a RESTful web services application using Kotlin and the Spring WebFlux framework. Spring WebFlux is a new framework that helps in creating a reactive application in a functional way. Toward the end of the book, you will build a taxi-hailing API with reactive microservices using Spring Boot and a Twitter clone with a Spring Boot backend. Finally, you’ll learn how to build an asynchronous email formatter. What you will learn Learn the fundamental features of Spring Boot 2.0 Customize Spring Boot 2.0 applications Build a basic web application Use Redis to build a taxi-hailing API Create a simple blog management system and a Twitter clone Develop a reactive RESTful web service with Kotlin using Spring Boot Who this book is for This book is for competent Spring developers who wish to understand how to develop complex yet scalable applications with Spring Boot. You must have a good knowledge of Java programming and be familiar with the basics of Spring.","language":"en","currency":"USD","id":"1789134226","title":"Spring Boot 2.0 Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=au1mDwAAQBAJ&source=gbs_api","authors":["Mohamed Shazin Sadakath"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8YLoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Mitigate exploits, malware, phishing, and other social engineering attacks","description":"After scrutinizing numerous cybersecurity strategies, Microsoft’s former Global Chief Security Advisor provides unique insights on the evolution of the threat landscape and how enterprises can address modern cybersecurity challenges. Key Features Protect your organization from cybersecurity threats with field-tested strategies by the former most senior security advisor at Microsoft Discover the most common ways enterprises initially get compromised Measure the effectiveness of your organization’s current cybersecurity program against cyber attacks Book Description Cybersecurity Threats, Malware Trends, and Strategies shares numerous insights about the threats that both public and private sector organizations face and the cybersecurity strategies that can mitigate them. The book provides an unprecedented long-term view of the global threat landscape by examining the twenty-year trend in vulnerability disclosures and exploitation, nearly a decade of regional differences in malware infections, the socio-economic factors that underpin them, and how global malware has evolved. This will give you further perspectives into malware protection for your organization. It also examines internet-based threats that CISOs should be aware of. The book will provide you with an evaluation of the various cybersecurity strategies that have ultimately failed over the past twenty years, along with one or two that have actually worked. It will help executives and security and compliance professionals understand how cloud computing is a game changer for them. By the end of this book, you will know how to measure the effectiveness of your organization’s cybersecurity strategy and the efficacy of the vendors you employ to help you protect your organization and yourself. What you will learn Discover cybersecurity strategies and the ingredients critical to their success Improve vulnerability management by reducing risks and costs for your organization Learn how malware and other threats have evolved over the past decade Mitigate internet-based threats, phishing attacks, and malware distribution sites Weigh the pros and cons of popular cybersecurity strategies of the past two decades Implement and then measure the outcome of a cybersecurity strategy Learn how the cloud provides better security capabilities than on-premises IT environments Who this book is for This book is for senior management at commercial sector and public sector organizations, including Chief Information Security Officers (CISOs) and other senior managers of cybersecurity groups, Chief Information Officers (CIOs), Chief Technology Officers (CTOs) and senior IT managers who want to explore the entire spectrum of cybersecurity, from threat hunting and security risk management to malware analysis. Governance, risk, and compliance professionals will also benefit. Cybersecurity experts that pride themselves on their knowledge of the threat landscape will come to use this book as a reference.","language":"en","currency":"USD","id":"1800205899","title":"Cybersecurity Threats, Malware Trends, and Strategies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8YLoDwAAQBAJ&source=gbs_api","authors":["Tim Rains"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fhKLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Writing Automated UI Tests","description":"Write Android user interface (UI) tests using Google Espresso for Android. You’ll cover all the major topics of writing functional UI automated tests using the Espresso testing framework, including different ways of running automated tests, architecting test projects in an easy and maintainable way, and using tools which help to implement automated tests with less effort. Android Espresso Revealed explains the basics of using Espresso to write automated UI tests, and how to customize the framework for advanced functionality. The author provides examples in both Java and Kotlin, and includes dealing with network operations in UI tests, testing application accessibility, implementing supervised monkey tests, and more. What You Will Learn Write Espresso tests with both Kotlin and Java including test project migration from Java to Kotlin Test web views inside the application under test Use Espresso to set up test devices or emulators to minimize test flakiness and run tests in Firebase Test Lab Verify and stub intents with Espresso-Intents Move test projects to AndroidX Test notifications or operate on third-party apps during Espresso test execution Apply different test architecture approaches to the test project to reduce maintenance effort Implement supervised monkey tests using Espresso and UIAutomator Who This Book Is ForEngineers with experience of Android test automation will benefit from this book","language":"en","currency":"USD","id":"1484243153","title":"Android Espresso Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fhKLDwAAQBAJ&source=gbs_api","authors":["Denys Zelenchuk"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=prtSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.99,"subtitle":null,"description":"Drowning in unnecessary complexity, unmanaged state, and tangles of spaghetti code? In the best tradition of Lisp, Clojure gets out of your way so you can focus on expressing simple solutions to hard problems. Clojure cuts through complexity by providing a set of composable tools--immutable data, functions, macros, and the interactive REPL. Written by members of the Clojure core team, this book is the essential, definitive guide to Clojure. This new edition includes information on all the newest features of Clojure, such as transducers and specs. Clojure joins the flexibility and agility of Lisp with the reach, stability, and performance of Java. Combine Clojure's tools for maximum effectiveness as you work with immutable data, functional programming, and safe concurrency to write programs that solve real-world problems. Start by reading and understanding Clojure syntax and see how Clojure is evaluated. From there, find out about the sequence abstraction, which combines immutable collections with functional programming to create truly reusable data transformation code. Clojure is a functional language; learn how to write programs in a functional style, and when and how to use recursion to your advantage. Discover Clojure's unique approach to state and identity, techniques for polymorphism and open systems using multimethods and protocols, and how to leverage Clojure's metaprogramming capabilities via macros. Finally, put all the pieces together in a real program. New to this edition is coverage of Clojure's spec library, one of the most interesting new features of Clojure for describing both data and functions. You can use Clojure spec to validate data, destructure data, explain invalid data, and generate large numbers of tests to verify the correctness of your code. With this book, you'll learn how to think in Clojure, and how to take advantage of its combined strengths to build powerful programs quickly. What You Need: Java 6 or higher Clojure 1.9","language":"en","currency":"USD","id":"1680505726","title":"Programming Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=prtSDwAAQBAJ&source=gbs_api","authors":["Alex Miller","Stuart Halloway","Aaron Bedra"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gM3UDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.98,"subtitle":null,"description":"《Kotlin程序员面试算法宝典》是一本讲解程序员面试笔试算法的书籍。在写法上，除了讲解如何解答算法问题以外，还引入了例子辅以说明，以便读者能够更加容易地理解。《Kotlin程序员面试算法宝典》将程序员面试笔试过程中的各类算法类真题一网打尽。在题目的广度上，通过各种渠道，搜集了近3年来几乎所有IT企业面试笔试算法高频题目，所选择题目均为企业招聘使用题目；在题目的深度上，本书由浅入深、庖丁解牛式地分析每一个题目，并提炼归纳，同时，引入例子与源代码、时间复杂度与空间复杂度的分析，这些内容是其他同类书籍所没有的。本书结构合理，条理清晰，根据真题所属知识点进行分类，对于读者进行学习与检索意义重大。《Kotlin程序员面试算法宝典》是一本计算机相关专业毕业生面试笔试的求职用书，也可以作为本科生、研究生学习数据结构与算法的辅导书籍，同时也适合期望在计算机软硬件行业大显身手的计算机爱好者阅读。","language":"zh-CN","currency":"USD","id":"7111612124","title":"Kotlin程序员面试算法宝典","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gM3UDwAAQBAJ&source=gbs_api","authors":["孙伟","楚秦"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nad3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.99,"subtitle":"Inklusive Android 8 und Android Studio 3.0","description":"Diese Befehlsreferenz ist ein nützlicher und zuverlässiger Begleiter für alle Systemadministratoren, die Aufgaben nicht ausschließlich über die Menüstruktur der GUI, sondern schnell und effektiv in der Eingabeaufforderung ausführen möchten. Befehle der Eingabeaufforderung Das Buch beschreibt die meisten Befehle der Eingabeaufforderung für die gängigen Windows-Betriebssysteme einschließlich Windows Server 2016 und Windows 10 mit ihren jeweiligen Optionen in komprimierter Form. Die Befehle sind thematisch gruppiert, ein ausführlicher Index hilft beim schnellen Auffinden. PowerShell-Alternativen Da Microsoft der Windows PowerShell eine immer größere Bedeutung beimisst, sind bei den Befehlen der Eingabeaufforderung häufig auch alternative Lösungsansätze mit PowerShell aufgeführt. Das Buch bietet Ihnen damit Hilfestellungen und Anregungen für den Übergang von der klassischen Eingabeaufforderung zur Systemadministration mit Windows PowerShell. Kompakt, nützlich und auf den Punkt gebracht: Diese Taschenreferenz ist auch in der 6. Auflage ein unverzichtbares Nachschlagewerk für alle Windows-Administratoren.","language":"de","currency":"USD","id":"3960102054","title":"Android mit Kotlin – kurz & gut","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nad3DwAAQBAJ&source=gbs_api","authors":["Jörg Staudemeyer"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=udgtAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Scala is a modern programming language for the Java Virtual Machine (JVM) that combines the best features of object-oriented and functional programming languages. Using Scala, you can write programs more concisely than in Java, as well as leverage the full power of concurrency. Since Scala runs on the JVM, it can access any Java library and is interoperable with Java frameworks. Scala for the Impatient concisely shows developers what Scala can do and how to do it. In this book, Cay Horstmann, the principal author of the international best-selling Core Java™, offers a rapid, code-based introduction that’s completely practical. Horstmann introduces Scala concepts and techniques in “blog-sized” chunks that you can quickly master and apply. Hands-on activities guide you through well-defined stages of competency, from basic to expert. Coverage includes Getting started quickly with Scala’s interpreter, syntax, tools, and unique idioms Mastering core language features: functions, arrays, maps, tuples, packages, imports, exception handling, and more Becoming familiar with object-oriented programming in Scala: classes, inheritance, and traits Using Scala for real-world programming tasks: working with files, regular expressions, and XML Working with higher-order functions and the powerful Scala collections library Leveraging Scala’s powerful pattern matching and case classes Creating concurrent programs with Scala actors Implementing domain-specific languages Understanding the Scala type system Applying advanced “power tools” such as annotations, implicits, and delimited continuations Scala is rapidly reaching a tipping point that will reshape the experience of programming. This book will help object-oriented programmers build on their existing skills, allowing them to immediately construct useful applications as they gradually master advanced programming techniques.","language":"en","currency":"USD","id":"0132761807","title":"Scala for the Impatient","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=udgtAAAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3bMJAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Brief Guide to the Systems Modeling Language","description":"The Systems Modeling Language (SysML) extends UML with powerful systems engineering capabilities for modeling a wider spectrum of systems and capturing all aspects of a system’s design. SysML Distilled is the first clear, concise guide for everyone who wants to start creating effective SysML models. (Drawing on his pioneering experience at Lockheed Martin and NASA, Lenny Delligatti illuminates SysML’s core components and provides practical advice to help you create good models and good designs. Delligatti begins with an easy-to-understand overview of Model-Based Systems Engineering (MBSE) and an explanation of how SysML enables effective system specification, analysis, design, optimization, verification, and validation. Next, he shows how to use all nine types of SysML diagrams, even if you have no previous experience with modeling languages. A case study running through the text demonstrates the use of SysML in modeling a complex, real-world sociotechnical system. Modeled after Martin Fowler’s classic UML Distilled, Delligatti’s indispensable guide quickly teaches you what you need to know to get started and helps you deepen your knowledge incrementally as the need arises. Like SysML itself, the book is method independent and is designed to support whatever processes, procedures, and tools you already use. Coverage Includes Why SysML was created and the business case for using it Quickly putting SysML to practical use What to know before you start a SysML modeling project Essential concepts that apply to all SysML diagrams SysML diagram elements and relationships Diagramming block definitions, internal structures, use cases, activities, interactions, state machines, constraints, requirements, and packages Using allocations to define mappings among elements across a model SysML notation tables, version changes, and sources for more information","language":"en","currency":"USD","id":"0133430332","title":"SysML Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3bMJAgAAQBAJ&source=gbs_api","authors":["Lenny Delligatti"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3iZyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build cloud-ready, reactive systems with Spring 5 and Project Reactor","description":"Explore the reactive system and create efficient microservices with Spring Boot 2.1 and Spring Cloud Key Features Understand the kind of system modern businesses require with Spring Gain deeper insights into reactive programming with Reactor and Spring Cloud Get in-depth knowledge on asynchronous and nonblocking communication with Spring 5 WebFlux Book Description These days, businesses need a new type of system that can remain responsive at all times. This is achievable with reactive programming; however, the development of these kinds of systems is a complex task, requiring a deep understanding of the domain. In order to develop highly responsive systems, the developers of the Spring Framework came up with Project Reactor. Hands-On Reactive Programming in Spring 5 begins with the fundamentals of Spring Reactive programming. You’ll explore the endless possibilities of building efficient reactive systems with the Spring 5 Framework along with other tools such as WebFlux and Spring Boot. Further on, you’ll study reactive programming techniques and apply them to databases and cross-server communication. You will advance your skills in scaling up Spring Cloud Streams and run independent, high-performant reactive microservices. By the end of the book, you will be able to put your skills to use and get on board with the reactive revolution in Spring 5.1! What you will learn Discover the difference between a reactive system and reactive programming Explore the benefits of a reactive system and understand its applications Get to grips with using reactive programming in Spring 5 Gain an understanding of Project Reactor Build a reactive system using Spring 5 and Project Reactor Create a highly efficient reactive microservice with Spring Cloud Test, monitor, and release reactive applications Who this book is for This book is for Java developers who use Spring to develop their applications and want to build robust and reactive applications that can scale in the cloud. Basic knowledge of distributed systems and asynchronous programming will help you understand the concepts covered in this book.","language":"en","currency":"USD","id":"1787287297","title":"Hands-On Reactive Programming in Spring 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3iZyDwAAQBAJ&source=gbs_api","authors":["Oleh Dokuka","Igor Lozynskyi"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=slwLAqkT_Y0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Rails™ 3 Way is a comprehensive resource that digs into the new features in Rails 3 and perhaps more importantly, the rationale behind them. —Yehuda Katz, Rails Core The Bible for Ruby on Rails Application Development Ruby on Rails strips complexity from the development process, enabling professional developers to focus on what matters most: delivering business value via clean and maintainable code. The Rails™ 3 Way is the only comprehensive, authoritative guide to delivering production-quality code with Rails 3. Pioneering Rails expert Obie Fernandez and a team of leading experts illuminate the entire Rails 3 API, along with the idioms, design approaches, and libraries that make developing applications with Rails so powerful. Drawing on their unsurpassed experience and track record, they address the real challenges development teams face, showing how to use Rails 3 to maximize your productivity. Using numerous detailed code examples, the author systematically covers Rails 3 key capabilities and subsystems, making this book a reference that you will turn to again and again. He presents advanced Rails programming techniques that have been proven effective in day-to-day usage on dozens of production Rails systems and offers important insights into behavior-driven development and production considerations such as scalability. Dive deep into the Rails 3 codebase and discover why Rails is designed the way it is—and how to make it do what you want it to do. This book will help you Learn what’s new in Rails 3 Increase your productivity as a web application developer Realize the overall joy in programming with Rails Leverage Rails’ powerful capabilities for building REST-compliant APIs Drive implementation and protect long-term maintainability using RSpec Design and manipulate your domain layer using Active Record Understand and program complex program flows using Action Controller Master sophisticated URL routing concepts Use Ajax techniques via Rails 3 support for unobtrusive JavaScript Learn to extend Rails with popular gems and plugins, and how to write your own Extend Rails with the best third-party plug-ins and write your own Integrate email services into your applications with Action Mailer Improve application responsiveness with background processing Create your own non-Active Record domain classes using Active Model Master Rails’ utility classes and extensions in Active Support","language":"en","currency":"USD","id":"9780132480314","title":"The Rails 3 Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=slwLAqkT_Y0C&source=gbs_api","authors":["Obed (Obie) Fernandez"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LhOlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.39,"subtitle":"your journey to mastery, 20th Anniversary Edition","description":"“One of the most significant books in my life.” –Obie Fernandez, Author, The Rails Way “Twenty years ago, the first edition of The Pragmatic Programmer completely changed the trajectory of my career. This new edition could do the same for yours.” –Mike Cohn, Author of Succeeding with Agile, Agile Estimating and Planning, and User Stories Applied “. . . filled with practical advice, both technical and professional, that will serve you and your projects well for years to come.” –Andrea Goulet, CEO, Corgibytes, Founder, LegacyCode.Rocks “. . . lightning does strike twice, and this book is proof.” –VM (Vicky) Brasseur, Director of Open Source Strategy, Juniper Networks The Pragmatic Programmer is one of those rare tech books you’ll read, re-read, and read again over the years. Whether you’re new to the field or an experienced practitioner, you’ll come away with fresh insights each and every time. Dave Thomas and Andy Hunt wrote the first edition of this influential book in 1999 to help their clients create better software and rediscover the joy of coding. These lessons have helped a generation of programmers examine the very essence of software development, independent of any particular language, framework, or methodology, and the Pragmatic philosophy has spawned hundreds of books, screencasts, and audio books, as well as thousands of careers and success stories. Now, twenty years later, this new edition re-examines what it means to be a modern programmer. Topics range from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you’ll learn how to: Fight software rot Learn continuously Avoid the trap of duplicating knowledge Write flexible, dynamic, and adaptable code Harness the power of basic tools Avoid programming by coincidence Learn real requirements Solve the underlying problems of concurrent code Guard against security vulnerabilities Build teams of Pragmatic Programmers Take responsibility for your work and career Test ruthlessly and effectively, including property-based testing Implement the Pragmatic Starter Kit Delight your users Written as a series of self-contained sections and filled with classic and fresh anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best approaches and major pitfalls of many different aspects of software development. Whether you’re a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you’ll quickly see improvements in personal productivity, accuracy, and job satisfaction. You’ll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You’ll become a Pragmatic Programmer. Register your book for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for details.","language":"en","currency":"USD","id":"0135956919","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LhOlDwAAQBAJ&source=gbs_api","authors":["David Thomas","Andrew Hunt"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LhOlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.39,"subtitle":"your journey to mastery, 20th Anniversary Edition","description":"“One of the most significant books in my life.” –Obie Fernandez, Author, The Rails Way “Twenty years ago, the first edition of The Pragmatic Programmer completely changed the trajectory of my career. This new edition could do the same for yours.” –Mike Cohn, Author of Succeeding with Agile, Agile Estimating and Planning, and User Stories Applied “. . . filled with practical advice, both technical and professional, that will serve you and your projects well for years to come.” –Andrea Goulet, CEO, Corgibytes, Founder, LegacyCode.Rocks “. . . lightning does strike twice, and this book is proof.” –VM (Vicky) Brasseur, Director of Open Source Strategy, Juniper Networks The Pragmatic Programmer is one of those rare tech books you’ll read, re-read, and read again over the years. Whether you’re new to the field or an experienced practitioner, you’ll come away with fresh insights each and every time. Dave Thomas and Andy Hunt wrote the first edition of this influential book in 1999 to help their clients create better software and rediscover the joy of coding. These lessons have helped a generation of programmers examine the very essence of software development, independent of any particular language, framework, or methodology, and the Pragmatic philosophy has spawned hundreds of books, screencasts, and audio books, as well as thousands of careers and success stories. Now, twenty years later, this new edition re-examines what it means to be a modern programmer. Topics range from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you’ll learn how to: Fight software rot Learn continuously Avoid the trap of duplicating knowledge Write flexible, dynamic, and adaptable code Harness the power of basic tools Avoid programming by coincidence Learn real requirements Solve the underlying problems of concurrent code Guard against security vulnerabilities Build teams of Pragmatic Programmers Take responsibility for your work and career Test ruthlessly and effectively, including property-based testing Implement the Pragmatic Starter Kit Delight your users Written as a series of self-contained sections and filled with classic and fresh anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best approaches and major pitfalls of many different aspects of software development. Whether you’re a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you’ll quickly see improvements in personal productivity, accuracy, and job satisfaction. You’ll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You’ll become a Pragmatic Programmer. Register your book for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for details.","language":"en","currency":"USD","id":"0135956919","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LhOlDwAAQBAJ&source=gbs_api","authors":["David Thomas","Andrew Hunt"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AwpnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Your stepping stone to penetration testing","description":"Learn how to hack systems like black hat hackers and secure them like security experts Key Features Understand how computer systems work and their vulnerabilities Exploit weaknesses and hack into machines to test their security Learn how to secure systems from hackers Book Description This book starts with the basics of ethical hacking, how to practice hacking safely and legally, and how to install and interact with Kali Linux and the Linux terminal. You will explore network hacking, where you will see how to test the security of wired and wireless networks. You’ll also learn how to crack the password for any Wi-Fi network (whether it uses WEP, WPA, or WPA2) and spy on the connected devices. Moving on, you will discover how to gain access to remote computer systems using client-side and server-side attacks. You will also get the hang of post-exploitation techniques, including remotely controlling and interacting with the systems that you compromised. Towards the end of the book, you will be able to pick up web application hacking techniques. You'll see how to discover, exploit, and prevent a number of website vulnerabilities, such as XSS and SQL injections. The attacks covered are practical techniques that work against real systems and are purely for educational purposes. At the end of each section, you will learn how to detect, prevent, and secure systems from these attacks. What you will learn Understand ethical hacking and the different fields and types of hackers Set up a penetration testing lab to practice safe and legal hacking Explore Linux basics, commands, and how to interact with the terminal Access password-protected networks and spy on connected clients Use server and client-side attacks to hack and control remote computers Control a hacked system remotely and use it to hack other systems Discover, exploit, and prevent a number of web application vulnerabilities such as XSS and SQL injections Who this book is for Learning Ethical Hacking from Scratch is for anyone interested in learning how to hack and test the security of systems like professional hackers and security experts.","language":"en","currency":"USD","id":"1788624785","title":"Learn Ethical Hacking from Scratch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AwpnDwAAQBAJ&source=gbs_api","authors":["Zaid Sabih"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"Rapid, Confident, Maintainable Code","description":"Debunk the myth that JavaScript is not easily testable. Whether you use Node.js, Express, MongoDB, jQuery, AngularJS, or directly manipulate the DOM, you can test-drive JavaScript. Learn the craft of writing meaningful, deterministic automated tests with Karma, Mocha, and Chai. Test asynchronous JavaScript, decouple and properly mock out dependencies, measure code coverage, and create lightweight modular designs of both server-side and client-side code. Your investment in writing tests will pay high dividends as you create code that's predictable and cost-effective to change. Design and code JavaScript applications with automated tests. Writing meaningful tests is a skill that takes learning, some unlearning, and a lot of practice, and with this book, you'll hone that skill. Fire up the editor and get hands-on through practical exercises for effective automated testing and designing maintainable, modular code. Start by learning when and why to do manual testing vs. automated verification. Focus tests on the important things, like the pre-conditions, the invariants, complex logic, and gnarly edge cases. Then begin to design asynchronous functions using automated tests. Carefully decouple and mock out intricate dependencies such as the DOM, geolocation API, file and database access, and Ajax calls to remote servers. Step by step, test code that uses Node.js, Express, MongoDB, jQuery, and AngularJS. Know when and how to use tools such as Chai, Istanbul, Karma, Mocha, Protractor, and Sinon. Create tests with minimum effort and run them fast without having to spin up web servers or manually edit HTML pages to run in browsers. Then explore end-to-end testing to ensure all parts are wired and working well together. Don't just imagine creating testable code, write it. What You Need: A computer with a text editor and your favorite browser. The book provides instructions to install the necessary automated testing-related tools.","language":"en","currency":"USD","id":"1680504908","title":"Test-Driving JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gJf9tI2mytIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Standards and Styles for Developing Maintainable Code","description":"Many programmers code by instinct, relying on convenient habits or a \"style\" they picked up early on. They aren't conscious of all the choices they make, like how they format their source, the names they use for variables, or the kinds of loops they use. They're focused entirely on problems they're solving, solutions they're creating, and algorithms they're implementing. So they write code in the way that seems natural, that happens intuitively, and that feels good. But if you're serious about your profession, intuition isn't enough. Perl Best Practices author Damian Conway explains that rules, conventions, standards, and practices not only help programmers communicate and coordinate with one another, they also provide a reliable framework for thinking about problems, and a common language for expressing solutions. This is especially critical in Perl, because the language is designed to offer many ways to accomplish the same task, and consequently it supports many incompatible dialects. With a good dose of Aussie humor, Dr. Conway (familiar to many in the Perl community) offers 256 guidelines on the art of coding to help you write better Perl code--in fact, the best Perl code you possibly can. The guidelines cover code layout, naming conventions, choice of data and control structures, program decomposition, interface design and implementation, modularity, object orientation, error handling, testing, and debugging. They're designed to work together to produce code that is clear, robust, efficient, maintainable, and concise, but Dr. Conway doesn't pretend that this is the one true universal and unequivocal set of best practices. Instead, Perl Best Practices offers coherent and widely applicable suggestions based on real-world experience of how code is actually written, rather than on someone's ivory-tower theories on howsoftware ought to be created. Most of all, Perl Best Practices offers guidelines that actually work, and that many developers around the world are already using. Much like Perl itself, these guidelines are about helping you to get your job done, without getting in the way. Praise for Perl Best Practices from Perl community members: \"As a manager of a large Perl project, I'd ensure that every member of my team has a copy of Perl Best Practices on their desk, and use it as the basis for an in-house style guide.\"-- Randal Schwartz \"There are no more excuses for writing bad Perl programs. All levels of Perl programmer will be more productive after reading this book.\"-- Peter Scott \"Perl Best Practices will be the next big important book in the evolution of Perl. The ideas and practices Damian lays down will help bring Perl out from under the embarrassing heading of \"scripting languages\". Many of us have known Perl is a real programming language, worthy of all the tasks normally delegated to Java and C++. With Perl Best Practices, Damian shows specifically how and why, so everyone else can see, too.\"-- Andy Lester \"Damian's done what many thought impossible: show how to build large, maintainable Perl applications, while still letting Perl be the powerful, expressive language that programmers have loved for years.\"-- Bill Odom \"Finally, a means to bring lasting order to the process and product of real Perl development teams.\"-- Andrew Sundstrom \"Perl Best Practices provides a valuable education in how to write robust, maintainable Perl, and is a definitive citation source when coaching other programmers.\"-- Bennett Todd\"I've been teaching Perl for years, and find the same question keeps being asked: Where can I find a reference for writing reusable, maintainable Perl code? Finally I have a decent answer.\"-- Paul Fenwick\"At last a well researched, well thought-out, comprehensive guide to Perl style. Instead of each of us developing our own, we can learn good practices from one of Perl's most prolific and experienced authors. I recommend this book to anyone who prefers getting on with the job rather than going back and fixing errors caused by syntax and poor style issues.\"-- Jacinta Richardson\"If you care about programming in any language read this book. Even if you don't intend to follow all of the practices, thinking through your style will improve it.\"-- Steven Lembark\"The Perl community's best author is back with another outstanding book. There has never been a comprehensive reference on high quality Perl coding and style until Perl Best Practices. This book fills a large gap in every Perl bookshelf.\"-- Uri Guttman","language":"en","currency":"USD","id":"9780596555023","title":"Perl Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gJf9tI2mytIC&source=gbs_api","authors":["Damian Conway"]},{"pageCount":668,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QFqxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build and deploy Java microservices using Spring Cloud, Istio, and Kubernetes","description":"Apply microservices patterns to build resilient and scalable distributed systems Key Features Understand the challenges of building large-scale microservice landscapes Build cloud-native production-ready microservices with this comprehensive guide Discover how to get the best out of Spring Cloud, Kubernetes, and Istio when used together Book Description Microservices architecture allows developers to build and maintain applications with ease, and enterprises are rapidly adopting it to build software using Spring Boot as their default framework. With this book, you’ll learn how to efficiently build and deploy microservices using Spring Boot. This microservices book will take you through tried and tested approaches to building distributed systems and implementing microservices architecture in your organization. Starting with a set of simple cooperating microservices developed using Spring Boot, you’ll learn how you can add functionalities such as persistence, make your microservices reactive, and describe their APIs using Swagger\/OpenAPI. As you advance, you’ll understand how to add different services from Spring Cloud to your microservice system. The book also demonstrates how to deploy your microservices using Kubernetes and manage them with Istio for improved security and traffic management. Finally, you’ll explore centralized log management using the EFK stack and monitor microservices using Prometheus and Grafana. By the end of this book, you’ll be able to build microservices that are scalable and robust using Spring Boot and Spring Cloud. What you will learn Build reactive microservices using Spring Boot Develop resilient and scalable microservices using Spring Cloud Use OAuth 2.0\/OIDC and Spring Security to protect public APIs Implement Docker to bridge the gap between development, testing, and production Deploy and manage microservices using Kubernetes Apply Istio for improved security, observability, and traffic management Who this book is for This book is for Java and Spring developers and architects who want to learn how to break up their existing monoliths into microservices and deploy them either on-premises or in the cloud using Kubernetes as a container orchestrator and Istio as a service Mesh. No familiarity with microservices architecture is required to get started with this book.","language":"en","currency":"USD","id":"1789613523","title":"Hands-On Microservices with Spring Boot and Spring Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QFqxDwAAQBAJ&source=gbs_api","authors":["Magnus Larsson"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Collective Wisdom from the Experts","description":"If you want to push your Java skills to the next level, this book provides expert advice from Java leaders and practitioners. You’ll be encouraged to look at problems in new ways, take broader responsibility for your work, stretch yourself by learning new techniques, and become as good at the entire craft of development as you possibly can. Edited by Kevlin Henney and Trisha Gee, 97 Things Every Java Programmer Should Know reflects lifetimes of experience writing Java software and living with the process of software development. Great programmers share their collected wisdom to help you rethink Java practices, whether working with legacy code or incorporating changes since Java 8. A few of the 97 things you should know: \"Behavior Is Easy, State Is Hard\"—Edson Yanaga “Learn Java Idioms and Cache in Your Brain”—Jeanne Boyarsky “Java Programming from a JVM Performance Perspective”—Monica Beckwith \"Garbage Collection Is Your Friend\"—Holly K Cummins “Java's Unspeakable Types”—Ben Evans \"The Rebirth of Java\"—Sander Mak “Do You Know What Time It Is?”—Christin Gorman","language":"en","currency":"USD","id":"1491952644","title":"97 Things Every Java Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvbkDwAAQBAJ&source=gbs_api","authors":["Kevlin Henney","Trisha Gee"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5gulmnPynoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Brain-Friendly Guide","description":"Ever wished you could learn C from a book? Head First C provides a complete learning experience for C and structured imperative programming. With a unique method that goes beyond syntax and how-to manuals, this guide not only teaches you the language, it helps you understand how to be a great programmer. You'll learn key areas such as language basics, pointers and pointer arithmetic, and dynamic memory management. Advanced topics include multi-threading and network programming—topics typically covered on a college-level course. This book also features labs: in-depth projects intended to stretch your abilities, test your new skills, and build confidence. Head First C mimics the style of college-level C courses, making it ideal as an accessible textbook for students. We think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First C uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep.","language":"en","currency":"USD","id":"1449345018","title":"Head First C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5gulmnPynoC&source=gbs_api","authors":["David Griffiths","Dawn Griffiths"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YsWxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":"A Hands On Guide to App Development","description":"Build your first app in Flutter—no experience necessary! Beginning Flutter: A Hands-On Guide to App Development is the essential resource for both experienced and novice developers interested in getting started with Flutter—the powerful new mobile software development kit. With Flutter, you can quickly and easily develop beautiful, powerful apps for both Android and iOS, without the need to learn multiple programming languages or juggle more than one code base. This book walks you through the process step by step. In Flutter, you’ll be working with Dart, the programming language of choice for top app developers. Even if you’re just starting out in your development career, you can learn Dart quickly, eliminating the barrier to entry for building apps. This is a more efficient way to develop and maintain cross-platform mobile apps, and this book makes the process even easier with a teach-by-example approach. Focus on providing quality content by eliminating the need to switch between multiple coding languages Learn the ins and outs of Flutter, including all the frameworks, widgets, and tools available to developers Accelerate your app development pace, keeping all the code for your cross-platform app in a single code base Leapfrog barriers to entry to the mobile software market, creating your first app with no experience necessary The Flutter community is growing rapidly and transforming the way Android and iOS apps get made. Beginning Flutter allows you to get on board with the latest app development technology, giving your mobile development career a big head start.","language":"en","currency":"USD","id":"1119550858","title":"Beginning Flutter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YsWxDwAAQBAJ&source=gbs_api","authors":["Marco L. Napoli"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qAOhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.99,"subtitle":null,"description":"The official book on the Rust programming language, written by the Rust development team at the Mozilla Foundation, fully updated for Rust 2018. The Rust Programming Language is the official book on Rust: an open source systems programming language that helps you write faster, more reliable software. Rust offers control over low-level details (such as memory usage) in combination with high-level ergonomics, eliminating the hassle traditionally associated with low-level languages. The authors of The Rust Programming Language, members of the Rust Core Team, share their knowledge and experience to show you how to take full advantage of Rust's features--from installation to creating robust and scalable programs. You'll begin with basics like creating functions, choosing data types, and binding variables and then move on to more advanced concepts, such as: • Ownership and borrowing, lifetimes, and traits • Using Rust's memory safety guarantees to build fast, safe programs • Testing, error handling, and effective refactoring • Generics, smart pointers, multithreading, trait objects, and advanced pattern matching • Using Cargo, Rust's built-in package manager, to build, test, and document your code and manage dependencies • How best to use Rust's advanced compiler with compiler-led programming techniques You'll find plenty of code examples throughout the book, as well as three chapters dedicated to building complete projects to test your learning: a number guessing game, a Rust implementation of a command line tool, and a multithreaded server. New to this edition: An extended section on Rust macros, an expanded chapter on modules, and appendixes on Rust development tools and editions.","language":"en","currency":"USD","id":"1718500459","title":"The Rust Programming Language (Covers Rust 2018)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qAOhDwAAQBAJ&source=gbs_api","authors":["Steve Klabnik","Carol Nichols"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ota_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Evolutionary Patterns to Transform Your Monolith","description":"How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture. With many illustrative examples, insightful migration patterns, and a bevy of practical advice to transition your monolith enterprise into a microservice operation, this practical guide covers multiple scenarios and strategies for a successful migration, from initial planning all the way through application and database decomposition. You’ll learn several tried and tested patterns and techniques that you can use as you migrate your existing architecture. Ideal for organizations looking to transition to microservices, rather than rebuild Helps companies determine whether to migrate, when to migrate, and where to begin Addresses communication, integration, and the migration of legacy systems Discusses multiple migration patterns and where they apply Provides database migration examples, along with synchronization strategies Explores application decomposition, including several architectural refactoring patterns Delves into details of database decomposition, including the impact of breaking referential and transactional integrity, new failure modes, and more","language":"en","currency":"USD","id":"1492047791","title":"Monolith to Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ota_DwAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2o-qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Effective Machine Learning Inspired by the Agile Manifesto","description":"Build resilient applied machine learning teams that deliver better data products through adapting the guiding principles of the Agile Manifesto. Bringing together talented people to create a great applied machine learning team is no small feat. With developers and data scientists both contributing expertise in their respective fields, communication alone can be a challenge. Agile Machine Learning teaches you how to deliver superior data products through agile processes and to learn, by example, how to organize and manage a fast-paced team challenged with solving novel data problems at scale, in a production environment. The authors’ approach models the ground-breaking engineering principles described in the Agile Manifesto. The book provides further context, and contrasts the original principles with the requirements of systems that deliver a data product. What You'll Learn Effectively run a data engineering team that is metrics-focused, experiment-focused, and data-focused Make sound implementation and model exploration decisions based on the data and the metrics Know the importance of data wallowing: analyzing data in real time in a group setting Recognize the value of always being able to measure your current state objectively Understand data literacy, a key attribute of a reliable data engineer, from definitions to expectations Who This Book Is For Anyone who manages a machine learning team, or is responsible for creating production-ready inference components. Anyone responsible for data project workflow of sampling data; labeling, training, testing, improving, and maintaining models; and system and data metrics will also find this book useful. Readers should be familiar with software engineering and understand the basics of machine learning and working with data.","language":"en","currency":"USD","id":"1484251075","title":"Agile Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2o-qDwAAQBAJ&source=gbs_api","authors":["Eric Carter","Matthew Hurst"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KXQrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Brain-Friendly Guide","description":"Learning a complex new language is no easy task especially when it s an object-oriented computer programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. It's constantly searching, scanning, waiting for something unusual to happen. After all, that's the way it was built to help you stay alive. It takes all the routine, ordinary, dull stuff and filters it to the background so it won't interfere with your brain's real work--recording things that matter. How does your brain know what matters? It's like the creators of the Head First approach say, suppose you're out for a hike and a tiger jumps in front of you, what happens in your brain? Neurons fire. Emotions crank up. Chemicals surge. That's how your brain knows. And that's how your brain will learn Java. Head First Java combines puzzles, strong visuals, mysteries, and soul-searching interviews with famous Java objects to engage you in many different ways. It's fast, it's fun, and it's effective. And, despite its playful appearance, Head First Java is serious stuff: a complete introduction to object-oriented programming and Java. You'll learn everything from the fundamentals to advanced topics, including threads, network sockets, and distributed programming with RMI. And the new. second edition focuses on Java 5.0, the latest version of the Java language and development platform. Because Java 5.0 is a major update to the platform, with deep, code-level changes, even more careful study and implementation is required. So learning the Head First way is more important than ever. If you've read a Head First book, you know what to expect--a visually rich format designed for the way your brain works. If you haven't, you're in for a treat. You'll see why people say it's unlike any other Java book you've ever read. By exploiting how your brain works, Head First Java compresses the time it takes to learn and retain--complex information. Its unique approach not only shows you what you need to know about Java syntax, it teaches you to think like a Java programmer. If you want to be bored, buy some other book. But if you want to understand Java, this book's for you.","language":"en","currency":"USD","id":"1449331440","title":"Head First Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KXQrAQAAQBAJ&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":698,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wTzlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.49,"subtitle":null,"description":"Learn all the Java and Android skills you need to start making powerful mobile applications About This Book Kick-start your Android programming career, or just have fun publishing apps to the Google Play marketplace A first-principles introduction to Java, via Android, which means you'll be able to start building your own applications from scratch Learn by example and build three real-world apps and over 40 mini apps throughout the book Who This Book Is For Are you trying to start a career in programming, but haven't found the right way in? Do you have a great idea for an app, but don't know how to make it a reality? Or maybe you're just frustrated that “to learn Android, you must know java.” If so, Android Programming for Beginners is for you. You don't need any programming experience to follow along with this book, just a computer and a sense of adventure. What You Will Learn Master the fundamentals of coding Java for Android Install and set up your Android development environment Build functional user interfaces with the Android Studio visual designer Add user interaction, data captures, sound, and animation to your apps Manage your apps' data using the built-in Android SQLite database Find out about the design patterns used by professionals to make top-grade applications Build, deploy, and publish real Android applications to the Google Play marketplace In Detail Android is the most popular OS in the world. There are millions of devices accessing tens of thousands of applications. It is many people's entry point into the world of technology; it is an operating system for everyone. Despite this, the entry-fee to actually make Android applications is usually a computer science degree, or five years' worth of Java experience. Android Programming for Beginners will be your companion to create Android applications from scratch—whether you're looking to start your programming career, make an application for work, be reintroduced to mobile development, or are just looking to program for fun. We will introduce you to all the fundamental concepts of programming in an Android context, from the Java basics to working with the Android API. All examples are created from within Android Studio, the official Android development environment that helps supercharge your application development process. After this crash-course, we'll dive deeper into Android programming and you'll learn how to create applications with a professional-standard UI through fragments, make location-aware apps with Google Maps integration, and store your user's data with SQLite. In addition, you'll see how to make your apps multilingual, capture images from a device's camera, and work with graphics, sound, and animations too. By the end of this book, you'll be ready to start building your own custom applications in Android and Java. Style and approach With more than 40 mini apps to code and run, Android Programming for Beginners is a hands-on guide to learning Android and Java. Each example application demonstrates a different aspect of Android programming. Alongside these mini apps, we push your abilities by building three larger applications to demonstrate Android application development in context.","language":"en","currency":"USD","id":"1785889036","title":"Android Programming for Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wTzlCwAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J1H4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"♛ 全台第一本屬於自己的 Android TDD！！！♛ APP 程式總是改壞？------ ☑ 用單元測試驗證正確性，再也不怕改錯！ APP 需求經常變更？------ ☑ TDD：紅燈、綠燈、重構，三步驟法則！ APP 人工作業耗時？------ ☑ 測試、部署自動化一次搞定！ 內容簡介 本書內容改編自第 11 屆 iT 邦幫忙鐵人賽，Mobile Development 組佳作網路系列文章──《Android TDD 測試驅動開發》，也是第一本完整介紹從 Android 單元測試、TDD到 DevOps 全面自動化的台灣本土專書。 這是寫給 Android 開發者的測試及 TDD 入門書，為初學者量身設計。帶領你撰寫第一個單元測試，學會依賴注入及使用 Stub 與 Mock 的時機，最後實踐 TDD 測試驅動開發，讓你在寫測試之前先想清楚需求，在開發初期釐清如何設計。有了測試後還要能自動化，透過 CI 工具 Jenkins 進行自動測試與上架至 Google Play，儘可能的將人工作業都自動化，以達到持續整合及持續部署。 精彩教學 ☑ 你將學會效率及品質兼具的開發方式 ♦ Kotlin 撰寫單元測試 ♦ 用依賴注入、Mock 框架來解 Android 的相依 ♦ 以 MVP、MVVM 架構提升可測試性 ♦ 在Android 實踐 TDD：紅燈、綠燈、重構 ☑ 你將學會 QA 所擅長的自動測試工具 ♦ Espresso 撰寫UI測試 ♦ Appium 撰寫測試 ♦ Cucumber 進行 BDD ☑ 你將學會 DevOps 的關鍵自動化工具 ♦ Android App 的 DevOps ♦ Jenkins CI 持續整合工具 ♦ 自動建置、測試、部署至 Google play ♦ 在雲端測試","language":"zh-CN","currency":"USD","id":"9864344900","title":"Android TDD測試驅動開發：從UnitTest、TDD到DevOps實踐（iT邦幫忙鐵人賽系列書）","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J1H4DwAAQBAJ&source=gbs_api","authors":["陳瑞忠"]},{"pageCount":752,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZCchAeprwvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Fundamentals, Data Structure, Sorting, Searching","description":"Robert Sedgewick has thoroughly rewritten and substantially expanded and updated his popular work to provide current and comprehensive coverage of important algorithms and data structures. Christopher Van Wyk and Sedgewick have developed new C++ implementations that both express the methods in a concise and direct manner, and also provide programmers with the practical means to test them on real applications. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 250,000 programmers! This particular book, Parts 1n4, represents the essential first half of Sedgewick's complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. Although the substance of the book applies to programming in any language, the implementations by Van Wyk and Sedgewick also exploit the natural match between C++ classes and ADT implementations. Highlights Expanded coverage of arrays, linked lists, strings, trees, and other basic data structures Greater emphasis on abstract data types (ADTs), modular programming, object-oriented programming, and C++ classes than in previous editions Over 100 algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT (searching) implementations New implementations of binomial queues, multiway radix sorting, randomized BSTs, splay trees, skip lists, multiway tries, B trees, extendible hashing, and much more Increased quantitative information about the algorithms, giving you a basis for comparing them Over 1000 new exercises to help you learn the properties of algorithms Whether you are learning the algorithms for the first time or wish to have up-to-date reference material that incorporates new programming styles with classic and new algorithms, you will find a wealth of useful information in this book.","language":"en","currency":"USD","id":"0768685036","title":"Algorithms in C++, Parts 1-4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZCchAeprwvYC&source=gbs_api","authors":["Robert Sedgewick"]},{"pageCount":752,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZCchAeprwvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Fundamentals, Data Structure, Sorting, Searching","description":"Robert Sedgewick has thoroughly rewritten and substantially expanded and updated his popular work to provide current and comprehensive coverage of important algorithms and data structures. Christopher Van Wyk and Sedgewick have developed new C++ implementations that both express the methods in a concise and direct manner, and also provide programmers with the practical means to test them on real applications. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 250,000 programmers! This particular book, Parts 1n4, represents the essential first half of Sedgewick's complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. Although the substance of the book applies to programming in any language, the implementations by Van Wyk and Sedgewick also exploit the natural match between C++ classes and ADT implementations. Highlights Expanded coverage of arrays, linked lists, strings, trees, and other basic data structures Greater emphasis on abstract data types (ADTs), modular programming, object-oriented programming, and C++ classes than in previous editions Over 100 algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT (searching) implementations New implementations of binomial queues, multiway radix sorting, randomized BSTs, splay trees, skip lists, multiway tries, B trees, extendible hashing, and much more Increased quantitative information about the algorithms, giving you a basis for comparing them Over 1000 new exercises to help you learn the properties of algorithms Whether you are learning the algorithms for the first time or wish to have up-to-date reference material that incorporates new programming styles with classic and new algorithms, you will find a wealth of useful information in this book.","language":"en","currency":"USD","id":"0768685036","title":"Algorithms in C++, Parts 1-4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZCchAeprwvYC&source=gbs_api","authors":["Robert Sedgewick"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NiI3Jd8p4mcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"A Practical Guide","description":"Consisting of a number of well-known open source products, JBoss is more a family of interrelated services than a single monolithic application. But, as with any tool that's as feature-rich as JBoss, there are number of pitfalls and complexities, too. Most developers struggle with the same issues when deploying J2EE applications on JBoss: they have trouble getting the many J2EE and JBoss deployment descriptors to work together; they have difficulty finding out how to get started; their projects don't have a packaging and deployment strategy that grows with the application; or, they find the Class Loaders confusing and don't know how to use them, which can cause problems. JBoss at Work: A Practical Guide helps developers overcome these challenges. As you work through the book, you'll build a project using extensive code examples. You'll delve into all the major facets of J2EE application deployment on JBoss, including JSPs, Servlets, EJBs, JMS, JNDI, web services, JavaMail, JDBC, and Hibernate. With the help of this book, you'll: Implement a full J2EE application and deploy it on JBoss Discover how to use the latest features of JBoss 4 and J2EE 1.4, including J2EE-compliant web services Master J2EE application deployment on JBoss with EARs, WARs, and EJB JARs Understand the core J2EE deployment descriptors and how they integrate with JBoss-specific descriptors Base your security strategy on JAAS Written for Java developers who want to use JBoss on their projects, the book covers the gamut of deploying J2EE technologies on JBoss, providing a brief survey of each subject aimed at the working professional with limited time. If you're one of the legions of developers who have decided to give JBoss a try, then JBoss at Work: A Practical Guide is your next logical purchase. It'll show you in plain language how to use the fastest growing open source tool in the industry today. If you've worked with JBoss before, this book will get you up to speed on JBoss 4, JBoss WS (web services), and Hibernate 3.","language":"en","currency":"USD","id":"9780596552930","title":"JBoss at Work: A Practical Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NiI3Jd8p4mcC&source=gbs_api","authors":["Tom Marrs","Scott Davis"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-Hc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Develop cloud native applications with microservices using Spring Boot, Spring Cloud, and Spring Cloud Data Flow About This Book Explore the new features and components in Spring Evolve towards micro services and cloud native applications Gain powerful insights into advanced concepts of Spring and Spring Boot to develop applications more effectively Understand the basics of Kotlin and use it to develop a quick service with Spring Boot Who This Book Is For This book is for an experienced Java developer who knows the basics of Spring, and wants to learn how to use Spring Boot to build applications and deploy them to the cloud. What You Will Learn Explore the new features in Spring Framework 5.0 Build microservices with Spring Boot Get to know the advanced features of Spring Boot in order to effectively develop and monitor applications Use Spring Cloud to deploy and manage applications on the Cloud Understand Spring Data and Spring Cloud Data Flow Understand the basics of reactive programming Get to know the best practices when developing applications with the Spring Framework Create a new project using Kotlin and implement a couple of basic services with unit and integration testing In Detail Spring 5.0 is due to arrive with a myriad of new and exciting features that will change the way we've used the framework so far. This book will show you this evolution—from solving the problems of testable applications to building distributed applications on the cloud. The book begins with an insight into the new features in Spring 5.0 and shows you how to build an application using Spring MVC. You will realize how application architectures have evolved from monoliths to those built around microservices. You will then get a thorough understanding of how to build and extend microservices using Spring Boot. You will also understand how to build and deploy Cloud-Native microservices with Spring Cloud. The advanced features of Spring Boot will be illustrated through powerful examples. We will be introduced to a JVM language that's quickly gaining popularity - Kotlin. Also, we will discuss how to set up a Kotlin project in Eclipse. By the end of the book, you will be equipped with the knowledge and best practices required to develop microservices with the Spring Framework. Style and approach This book follows an end-to-end tutorial approach with lots of examples and sample applications, covering the major building blocks of the Spring framework.","language":"en","currency":"USD","id":"1787122336","title":"Mastering Spring 5.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-Hc5DwAAQBAJ&source=gbs_api","authors":["Ranga Rao Karanam"]},{"pageCount":802,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d1jBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn to develop interactive web applications with clean and maintainable JavaScript code","description":"The JavaScript Workshop is a definitive guide to learning JavaScript in a practical way. Starting with JavaScript's core syntax and structure, the book gradually builds up to more advanced concepts like server-side development and functional programming. With this book, you'll gain the confidence to tackle any real-world JavaScript challenge.","language":"en","currency":"USD","id":"1838645888","title":"The The JavaScript Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d1jBDwAAQBAJ&source=gbs_api","authors":["Joseph Labrecque","Jahred Love","Daniel Rosenbaum","Nick Turner","Gaurav Mehla","Alonzo L. Hosford","Florian Sloot","Philip Kirkbride"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=e35JCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"The Big Nerd Ranch Guide","description":"Covering the bulk of what you need to know to develop full-featured applications for OS X, this edition is updated for OS X Yosemite (10.10), Xcode 6, and Swift. Written in an engaging tutorial style and class-tested for clarity and accuracy, it is an invaluable resource for any Mac programmer. The authors introduce the two most commonly used Mac developer tools: Xcode and Instruments. They also cover the Swift language, basic application architecture, and the major design patterns of Cocoa. Examples are illustrated with exemplary code, written in the idioms of the Cocoa community, to show you how Mac programs should be written. After reading this book, you will know enough to understand and utilize Apple’s online documentation for your own unique needs. And you will know enough to write your own stylish code. This edition was written for Xcode 6.3 and Swift 1.2. At WWDC 2015, Apple announced Xcode 7 and Swift 2, both of which introduce significant updates that (along with some changes to Cocoa for OS X 10.11) affect some of the exercises in this book. We have prepared a companion guide listing the changes needed to use Xcode 7 to work through the exercises in the book; it is available at https:\/\/github.com\/bignerdranch\/cocoa-programming-for-osx-5e\/blob\/master\/Swift2.md.","language":"en","currency":"USD","id":"0134077121","title":"Cocoa Programming for OS X","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=e35JCAAAQBAJ&source=gbs_api","authors":["Aaron Hillegass","Adam Preble","Nate Chandler"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Tm15DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Build Your Skills. Build Your Network. Build the Future of Technology.","description":"Free and open source is the foundation of software development, and it's built by people just like you. Discover the fundamental tenets that drive the movement. Take control of your career by selecting the right project to meet your professional goals. Master the language and avoid the pitfalls that typically ensnare new contributors. Join a community of like-minded people and change the world. Programmers, writers, designers, and everyone interested in software will make their mark through free and open source software contributions. Free and open source software is the default choice for the programming languages and technologies which run our world today, and it's all built and maintained by people just like you. No matter your skill level or area of expertise, with this book you will contribute to free and open source software projects. Using this practical approach you'll understand not only the mechanics of contributing, but also how doing so helps your career as well as the community. This book doesn't assume that you're a programmer, or even that you have prior experience with free and open source software. Learn what open source is, where it came from, and why it's important. Start on the right foot by mastering the structure and tools you need before you contribute. Choose the right project for you, amplifying the impact of your contribution. Submit your first contribution, whether it's code, writing, design, or community organising. Find out what to do when things don't go the way you expect. Discover how to start your own project and make it friendly and welcoming to contributors. Anyone can contribute! Make your mark today and help others while also helping yourself.","language":"en","currency":"USD","id":"1680506390","title":"Forge Your Future with Open Source","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Tm15DwAAQBAJ&source=gbs_api","authors":["VM (Vicky) Brasseur"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8BZOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"A Non-Technical Guide","description":"If you’re new to GitHub, this concise book shows you just what you need to get started and no more. It’s perfect for project and product managers, stakeholders, and other team members who want to collaborate on a development project—whether it’s to review and comment on work in progress or to contribute specific changes. It’s also great for developers just learning GitHub. GitHub has rapidly become the default platform for software development, but it’s also ideal for other text-based documents, from contracts to screenplays. This hands-on book shows you how to use GitHub’s web interface to view projects and collaborate effectively with your team. Learn how and why people use GitHub to collaborate View the status of a project—recent changes, outstanding work, and historic changes Create and edit files through GitHub without learning Git Suggest changes to projects you don’t have permission to edit directly Use tools like issues, pull requests, and branches to specify and collaborate on changes Create a new GitHub repository to control who has access to your project","language":"en","currency":"USD","id":"1491949821","title":"Introducing GitHub","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8BZOBQAAQBAJ&source=gbs_api","authors":["Peter Bell","Brent Beer"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rDP1VS1yMi0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.16,"subtitle":null,"description":"The innovative approach of the first edition of Programming Language Pragmatics provided students with an integrated view of programming language design and implementation, while offering a solid teaching text on timely language topics in a rigorous yet accessible style. The new edition carries on these distinctive features as well as the signature tradition of illustrating the most recent developments in programming language design with a variety of modern programming languages. Addresses the most recent developments in programming language design, including C99, C#, and Java 5 Introduces and discusses scripting languages throughout the book as well as in an entire new chapter Includes a comprehensive chapter on concurrency, with coverage of the new Java concurrency package (JSR 166) and the comparable mechanisms in C# Updates many sections and topics, including iterators, exceptions, polymorphism, templates\/generics, scope rules and declaration ordering, separate compilation, garbage collection, and threads and synchronization Highlights the interaction and tradeoffs inherent in language design and language implementation decisions with over 100 \"Design and Implementation\" call-out boxes Adds end-of-chapter \"Exploration\" exercises—open-ended, research-type activities Provides review questions after sections for quick self-assessment Includes over 800 numbered examples to help the reader quickly cross-reference and access content","language":"en","currency":"USD","id":"0080515169","title":"Programming Language Pragmatics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rDP1VS1yMi0C&source=gbs_api","authors":["Michael L. Scott"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y83aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.49,"subtitle":"Build powerful and reliable Python web applications from scratch, 3rd Edition","description":"Learn Django 3 with four end-to-end web projects Key Features Learn Django 3 by building real-world web applications from scratch in Python, using coding best practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Implement advanced functionalities like a full-text search engine, a user activity stream, or a recommendation engine Add real-time features with Django Channels and WebSockets Book Description If you want to learn the entire process of developing professional web applications with Python and Django, then this book is for you. In the process of building four professional Django projects, you will learn about Django 3 features, how to solve common web development problems, how to implement best practices, and how to successfully deploy your applications. In this book, you will build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Step-by-step guidance will teach you how to integrate popular technologies, enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. By the end of this book, you will have mastered Django 3 by building advanced web applications. What you will learn Build real-world web applications Learn Django essentials, including models, views, ORM, templates, URLs, forms, and authentication Implement advanced features such as custom model fields, custom template tags, cache, middleware, localization, and more Create complex functionalities, such as AJAX interactions, social authentication, a full-text search engine, a payment system, a CMS, a RESTful API, and more Integrate other technologies, including Redis, Celery, RabbitMQ, PostgreSQL, and Channels, into your projects Deploy Django projects in production using NGINX, uWSGI, and Daphne Who this book is for This book is intended for developers with Python knowledge who wish to learn Django in a pragmatic way. Perhaps you are completely new to Django, or you already know a little but you want to get the most out of it. This book will help you to master the most relevant areas of the framework by building practical projects from scratch. You need to have familiarity with programming concepts in order to read this book. Some previous knowledge of HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1838989323","title":"Django 3 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y83aDwAAQBAJ&source=gbs_api","authors":["Antonio Melé"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jzvcCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"New Opportunities for Connected Data","description":"Discover how graph databases can help you manage and query highly connected data. With this practical book, you’ll learn how to design and implement a graph database that brings the power of graphs to bear on a broad range of problem domains. Whether you want to speed up your response to user queries or build a database that can adapt as your business evolves, this book shows you how to apply the schema-free graph model to real-world problems. This second edition includes new code samples and diagrams, using the latest Neo4j syntax, as well as information on new functionality. Learn how different organizations are using graph databases to outperform their competitors. With this book’s data modeling, query, and code examples, you’ll quickly be able to implement your own solution. Model data with the Cypher query language and property graph model Learn best practices and common pitfalls when modeling with graphs Plan and implement a graph database solution in test-driven fashion Explore real-world examples to learn how and why organizations use a graph database Understand common patterns and components of graph database architecture Use analytical techniques and algorithms to mine graph database information","language":"en","currency":"USD","id":"1491930845","title":"Graph Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jzvcCQAAQBAJ&source=gbs_api","authors":["Ian Robinson","Jim Webber","Emil Eifrem"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dNoLBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"The Programming Contest Training Manual","description":"There are many distinct pleasures associated with computer programming. Craftsm- ship has its quiet rewards, the satisfaction that comes from building a useful object and making it work. Excitement arrives with the ?ash of insight that cracks a previously intractable problem. The spiritual quest for elegance can turn the hacker into an artist. Therearepleasuresinparsimony,insqueezingthelastdropofperformanceoutofclever algorithms and tight coding. Thegames,puzzles,andchallengesofproblemsfrominternationalprogrammingc- petitionsareagreatwaytoexperiencethesepleasureswhileimprovingyouralgorithmic and coding skills. This book contains over 100 problems that have appeared in previous programming contests, along with discussions of the theory and ideas necessary to - tack them. Instant online grading for all of these problems is available from two WWW robot judging sites. Combining this book with a judge gives an exciting new way to challenge and improve your programming skills. This book can be used for self-study, for teaching innovative courses in algorithms and programming, and in training for international competition. To the Reader Theproblemsinthisbookhavebeenselectedfromover1,000programmingproblemsat the Universidad de Valladolid online judge, available athttp:\/\/online-judge.uva.es.The judgehasruledonwelloveronemillionsubmissionsfrom27,000registeredusersaround the world to date. We have taken only the best of the best, the most fun, exciting, and interesting problems available.","language":"en","currency":"USD","id":"038722081X","title":"Programming Challenges","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dNoLBwAAQBAJ&source=gbs_api","authors":["Steven S Skiena","Miguel A. Revilla"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UWC93hR-vtoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Help for Database Programmers","description":"This unique cookbook contains a wealth of solutions to problems that SQL programmers face all the time. The recipes inside range from how to perform simple tasks, like importing external data, to ways of handling issues that are more complicated, like set algebra. Authors Ales Spetic and Jonathan Gennick, two authorities with extensive database and SQL programming experience, include a discussion with each recipe to explain the logic and concepts underlying the solution.SQL (Structured Query Language) is the closest thing to a standard query language that currently exists, and Transact-SQL -- a full-featured programming language that dramatically extends the power of SQL -- is the procedural language of choice for both Microsoft SQL Server and Sybase SQL Server systems. The Transact-SQL Cookbook is designed so you can use the recipes directly, as a source of ideas, or as a way to learn a little more about SQL and what you can do with it. Topics covered include: Audit logging. In addition to recipes for implementing an audit log, this chapter also includes recipes for: improving performance where large log tables are involved; supporting multiple-languages; and simulating server push. Hierarchies. Recipes show you how to manipulate hierarchical data using Transact-SQL. Importing data. This chapter introduces concepts like normalization and recipes useful for working with imported data tables. Sets. Recipes demonstrate different operations, such as how to find common elements, summarize the data in a set, and find the element in a set that represents an extreme. Statistics. This chapter?s recipes show you how to effectively use SQL for common statistical operations from means and standard deviations to weighted moving averages. Temporal data. Recipes demonstrate how to construct queries against time-based data. Data Structures. This chapter shows how to manipulate data structures like stacks, queues, matrices, and arrays. With an abundance of recipes to help you get your job done more efficiently, the Transact-SQL Cookbook is sure to become an essential part of your library.","language":"en","currency":"USD","id":"9780596552039","title":"Transact-SQL Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UWC93hR-vtoC&source=gbs_api","authors":["Ales Spetic","Jonathan Gennick"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eZbcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Native, Cross-Platform Apps the Easy Way","description":"Work in Flutter, a framework designed from the ground up for dual platform development, with support for native Java\/Kotlin or Objective-C\/Swift methods from Flutter apps. Write your next app in one language and build it for both Android and iOS. Deliver the native look, feel, and performance you and your users expect from an app written with each platform's own tools and languages. Deliver apps fast, doing half the work you were doing before and exploiting powerful new features to speed up development. Write once, run anywhere. Learn Flutter, Google's multi-platform mobile development framework. Instantly view the changes you make to an app with stateful hot reload and define a declarative UI in the same language as the app logic, without having to use separate XML UI files. You can also reuse existing platform-specific Android and iOS code and interact with it in an efficient and simple way. Use built-in UI elements - or build your own - to create a simple calculator app. Run native Java\/Kotlin or Objective-C\/Swift methods from your Flutter apps, and use a Flutter package to make HTTP requests to a Web API or to perform read and write operations on local storage. Apply visual effects to widgets, create transitions and animations, create a chat app using Firebase, and deploy everything on both platforms. Get native look and feel and performance in your Android and iOS apps, and the ability to build for both platforms from a single code base. What You Need: Flutter can be used for Android development on any Linux, Windows or macOS computer, but macOS is needed for iOS development.","language":"en","currency":"USD","id":"168050763X","title":"Programming Flutter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eZbcDwAAQBAJ&source=gbs_api","authors":["Carmine Zaccagnino"]}]