[{"pageCount":325,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yxwiAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"The Big Nerd Ranch Guide","description":"Want to write iOS apps or desktop Mac applications? This introduction to programming and the Objective-C language is your first step on the journey from someone who uses apps to someone who writes them. Based on Big Nerd Ranch's popular Objective-C Bootcamp, Objective-C Programming: The Big Nerd Ranch Guide covers C, Objective-C, and the common programming idioms that enable developers to make the most of Apple technologies. Compatible with Xcode 5, iOS 7, and OS X Mavericks (10.9), this guide features short chapters and an engaging style to keep you motivated and moving forward. At the same time, it encourages you to think critically as a programmer. Here are some of the topics covered: Using Xcode, Apple’s documentation, and other tools Programming basics: variables, loops, functions, etc. Objects, classes, methods, and messages Pointers, addresses, and memory management with ARC Properties and Key-Value Coding (KVC) Class extensions Categories Classes from the Foundation framework Blocks Delegation, target-action, and notification design patterns Key-Value Observing (KVO) Runtime basics","language":"en","currency":"USD","id":"0133491900","title":"Objective-C Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yxwiAgAAQBAJ&source=gbs_api","authors":["Aaron Hillegass","Mikey Ward"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SUWPAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Pushing the Limits","description":"Unleash the power of the Android OS and build the kinds ofbrilliant, innovative apps users love to use If you already know your way around the Android OS and can builda simple Android app in under an hour, this book is for you. Ifyou’re itching to see just how far you can push it anddiscover what Android is really capable of, it’s for you. Andif you’re ready to learn how to build advanced, intuitive,innovative apps that are a blast to use, this book isdefinitely for you. From custom views and advanced multi-touch gestures, tointegrating online web services and exploiting the latestgeofencing and activity recognition features, ace Androiddeveloper, Erik Hellman, delivers expert tips, tricks andlittle-known techniques for pushing the Android envelope so youcan: Optimize your components for the smoothest user experiencepossible Create your own custom Views Push the boundaries of the Android SDK Master Android Studio and Gradle Make optimal use of the Android audio, video and graphicsAPIs Program in Text-To-Speech and Speech Recognition Make the most of the new Android maps and location API Use Android connectivity technologies to communicate withremote devices Perform background processing Use Android cryptography APIs Find and safely use hidden Android APIs Cloud-enable your applications with Google Play Services Distribute and sell your applications on Google Play Store Learn how to unleash the power of Android and transform yourapps from good to great in Android Programming: Pushing theLimits.","language":"en","currency":"USD","id":"111871735X","title":"Android Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SUWPAQAAQBAJ&source=gbs_api","authors":["Erik Hellman"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=junbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"A practical, project-based guide to building real-world cross-platform mobile applications and games","description":"Learn Flutter and the Dart programming language by building impressive real-world mobile applications for Android and iOS Key Features Learn cross-platform mobile development with Flutter and Dart by building 11 real-world apps Create wide array of mobile projects such as 2D game, productivity timer, movie browsing app, and more Practical projects demonstrating Flutter development techniques with tips, tricks, and best practices Book Description Flutter is a modern reactive mobile framework that removes a lot of the complexity found in building native mobile apps for iOS and Android. With Flutter, developers can now build fast and native mobile apps from a single codebase. This book is packed with 11 projects that will help you build your own mobile applications using Flutter. It begins with an introduction to Dart programming and explains how it can be used with the Flutter SDK to customize mobile apps. Each chapter contains instructions on how to build an independent app from scratch, and each project focuses on important Flutter features.From building Flutter Widgets and applying animations to using databases (SQLite and sembast) and Firebase, you'll build on your knowledge through the chapters. As you progress, you’ll learn how to connect to remote services, integrate maps, and even use Flare to create apps and games in Flutter. Gradually, you’ll be able to create apps and games that are ready to be published on the Google Play Store and the App Store. In the concluding chapters, you’ll learn how to use the BLoC pattern and various best practices related to creating enterprise apps with Flutter. By the end of this book, you will have the skills you need to write and deliver fully functional mobile apps using Flutter. What you will learn Design reusable mobile architectures that can be applied to apps at any scale Get up to speed with error handling and debugging for mobile application development Apply the principle of ‘composition over inheritance’ to break down complex problems into many simple problems Update your code and see the results immediately using Flutter’s hot reload Identify and prevent bugs from reappearing with Flutter’s developer tools Manage an app's state with Streams and the BLoC pattern Build a simple web application using Flutter Web Who this book is for This book is for mobile developers and software developers who want to learn Flutter to build state-of-the-art mobile apps. Although prior experience with Dart programming or Flutter is not required, knowledge of object-oriented programming (OOP), data structures and software design patterns will be beneficial.","language":"en","currency":"USD","id":"1838642536","title":"Flutter Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=junbDwAAQBAJ&source=gbs_api","authors":["Simone Alessandria"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TeiuCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is intended for software developers interested in systems level and application programming, and are looking for a quick entry into using Rust and understanding the core features of the framework. It is assumed that you have a basic understanding of Java, C#, Ruby, Python or JavaScript.","language":"en","currency":"USD","id":"1785282131","title":"Rust Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TeiuCQAAQBAJ&source=gbs_api","authors":["Ivo Balbaert"]},{"pageCount":960,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LpVCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.41,"subtitle":null,"description":"Widely considered one of the best practical guides to programming, Steve McConnell’s original CODE COMPLETE has been helping developers write better software for more than a decade. Now this classic book has been fully updated and revised with leading-edge practices—and hundreds of new code samples—illustrating the art and science of software construction. Capturing the body of knowledge available from research, academia, and everyday commercial practice, McConnell synthesizes the most effective techniques and must-know principles into clear, pragmatic guidance. No matter what your experience level, development environment, or project size, this book will inform and stimulate your thinking—and help you build the highest quality code. Discover the timeless techniques and strategies that help you: Design for minimum complexity and maximum creativity Reap the benefits of collaborative development Apply defensive programming techniques to reduce and flush out errors Exploit opportunities to refactor—or evolve—code, and do it safely Use construction practices that are right-weight for your project Debug problems quickly and effectively Resolve critical construction issues early and correctly Build quality into the beginning, middle, and end of your project","language":"en","currency":"USD","id":"0735636974","title":"Code Complete","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LpVCAwAAQBAJ&source=gbs_api","authors":["Steve McConnell"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ka2VUBqHiWkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day. This highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing. Each chapter in the book consists of several “items” presented in the form of a short, standalone essay that provides specific advice, insight into Java platform subtleties, and outstanding code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why. Highlights include: New coverage of generics, enums, annotations, autoboxing, the for-each loop, varargs, concurrency utilities, and much more Updated techniques and best practices on classic topics, including objects, classes, libraries, methods, and serialization How to avoid the traps and pitfalls of commonly misunderstood subtleties of the language Focus on the language and its most fundamental libraries: java.lang, java.util, and, to a lesser extent, java.util.concurrent and java.io Simply put, Effective Java™, Second Edition, presents the most practical, authoritative guidelines available for writing efficient, well-designed programs.","language":"en","currency":"USD","id":"9780132778046","title":"Effective Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ka2VUBqHiWkC&source=gbs_api","authors":["Joshua Bloch"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZeyoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.49,"subtitle":"The Big Nerd Ranch Guide","description":"Android Programming: The Big Nerd Ranch Guide is an introductory Android book for programmers with Kotlin experience. Based on Big Nerd Ranch’s popular Android Bootcamp, this guide will lead you through the wilderness using hands-on example apps combined with clear explanations of key concepts and APIs. This book focuses on practical techniques for developing apps in Kotlin compatible with Android 5.0 (Lollipop) through Android 8.1 (Oreo) and beyond. Write and run code every step of the way, using Android Studio to create apps that integrate with other apps, download and display pictures from the web, play sounds, and more. Each chapter and app has been designed and tested to provide the knowledge and experience you need to get started in Android development. The Android team is constantly improving and updating Android Studio and other tools. As a result, some of the instructions provided in the book have changed. You can find an addendum addressing breaking changes at: https:\/\/github.com\/bignerdranch\/AndroidCourseResources\/raw\/master\/4thEdition\/Errata\/4eAddendum.pdf.","language":"en","currency":"USD","id":"0135257565","title":"Android Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZeyoDwAAQBAJ&source=gbs_api","authors":["Bill Phillips","Chris Stewart","Kristin Marsicano","Brian Gardner"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YCyWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Deep dive into the latest edition of the Swift programming language, 5th Edition","description":"Harness the power of the latest edition with this in-depth and comprehensive guide to the Swift language Key Features Fifth edition of this bestselling book, improved and updated to cover the latest version of the Swift 5 programming language Get to grips with popular and modern design techniques to write easy-to-manage Swift code Learn how to use core Swift features such as concurrency, generics, and copy-on-write in your code Book Description Over the years, the Mastering Swift book has established itself amongst developers as a popular choice as an in-depth and practical guide to the Swift programming language. The latest edition is fully updated and revised to cover the new version: Swift 5. Inside this book, you'll find the key features of Swift 5 easily explained with complete sets of examples. From the basics of the language to popular features such as concurrency, generics, and memory management, this definitive guide will help you develop your expertise and mastery of the Swift language. Mastering Swift 5, Fifth Edition will give you an in-depth knowledge of some of the most sophisticated elements in Swift development, including protocol extensions, error handling, and closures. It will guide you on how to use and apply them in your own projects. Later, you'll see how to leverage the power of protocol-oriented programming to write flexible and easier-to-manage code. You will also see how to add the copy-on-write feature to your custom value types and how to avoid memory management issues caused by strong reference cycles. What you will learn Understand core Swift components, including operators, collections, control flows, and functions Learn how and when to use classes, structures, and enumerations Understand how to use protocol-oriented design with extensions to write easier-to-manage code Use design patterns with Swift, to solve commonly occurring design problems Implement copy-on-write for you custom value types to improve performance Add concurrency to your applications using Grand Central Dispatch and Operation Queues Implement generics to write flexible and reusable code Who this book is for This book is for developers who want to delve into the newest version of Swift. If you are a developer and learn best by looking at and working with code, then this book is for you. A basic understanding of Apple's tools would be beneficial but not mandatory. All examples should work on the Linux platform as well.","language":"en","currency":"USD","id":"1789132738","title":"Mastering Swift 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YCyWDwAAQBAJ&source=gbs_api","authors":["Jon Hoffman"]},{"pageCount":708,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xZr-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"Move into iOS development by getting a firm grasp of its fundamentals, including the Xcode 12 IDE, Cocoa Touch, and the latest version of Apple’s acclaimed programming language, Swift 5.3. With this thoroughly updated guide, you’ll learn the Swift language, understand Apple’s Xcode development tools, and discover the Cocoa framework. Become familiar with built-in Swift types Dive deep into Swift objects, protocols, and generics Tour the life cycle of an Xcode project Learn how nibs are loaded Understand Cocoa’s event-driven design Communicate with C and Objective-C In this edition, catch up on the latest iOS programming features: Multiple trailing closures Code editor document tabs New Simulator features Resources in Swift packages Logging and testing improvements And more! Once you master the fundamentals, you’ll be ready to tackle the details of iOS app development with author Matt Neuburg’s companion guide, Programming iOS 14.","language":"en","currency":"USD","id":"1492092045","title":"iOS 14 Programming Fundamentals with Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xZr-DwAAQBAJ&source=gbs_api","authors":["Matt Neuburg"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ksJeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Build Your Functional Skills One Idea at a Time","description":"Behind every programming language lies a vision of how programs should be built. The vision behind Clojure is of a radically simple language framework holding together a sophisticated collection of programming features. Learning Clojure involves much more than just learning the mechanics of the language. To really get Clojure you need to understand the ideas underlying this structure of framework and features. You need this book: an accessible introduction to Clojure that focuses on the ideas behind the language as well as the practical details of writing code. Clojure attracts developers on the cutting edge and is arguably the best language for learning to program in the functional style without compromise. But this comes with a steep learning curve. Getting Clojure directly addresses this by teaching you how to think functionally as it teaches you the language. You'll learn about Clojure's powerful data structures and high-level functions, but you'll also learn what it means for a language to be functional, and how to think in Clojure's functional way. Each chapter of Getting Clojure takes a feature or two or three from the language, explains the syntax and the mechanics behind that feature so that you can make it work before digging into the deeper questions: What is the thinking behind the feature? And how does it fit in with the rest of the language? In Getting Clojure you'll learn Clojure's very simple syntax, but you'll also learn why that syntax is integral the way the language is constructed. You'll discover that most data structures in Clojure are immutable, but also why that leads to more reliable programs. And you'll see how easy it is to write Clojure functions and also how you can use those functions to build complex and capable systems. With real-world examples of how working Clojure programmers use the language, Getting Clojure will help you see the challenges of programming through the eye of experienced Clojure developers. What You Need: You will need to some background in programming. To follow along with the examples in the book, you will need Java 6 or new, Clojure 1.8 or 1.9, and Leiningen 2.","language":"en","currency":"USD","id":"1680506099","title":"Getting Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ksJeDwAAQBAJ&source=gbs_api","authors":["Russ Olsen"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ri1muolw_YwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"When carefully selected and used, Domain-Specific Languages (DSLs) may simplify complex code, promote effective communication with customers, improve productivity, and unclog development bottlenecks. In Domain-Specific Languages , noted software development expert Martin Fowler first provides the information software professionals need to decide if and when to utilize DSLs. Then, where DSLs prove suitable, Fowler presents effective techniques for building them, and guides software engineers in choosing the right approaches for their applications. This book’s techniques may be utilized with most modern object-oriented languages; the author provides numerous examples in Java and C#, as well as selected examples in Ruby. Wherever possible, chapters are organized to be self-standing, and most reference topics are presented in a familiar patterns format. Armed with this wide-ranging book, developers will have the knowledge they need to make important decisions about DSLs—and, where appropriate, gain the significant technical and business benefits they offer. The topics covered include: How DSLs compare to frameworks and libraries, and when those alternatives are sufficient Using parsers and parser generators, and parsing external DSLs Understanding, comparing, and choosing DSL language constructs Determining whether to use code generation, and comparing code generation strategies Previewing new language workbench tools for creating DSLs","language":"en","currency":"USD","id":"9780131392809","title":"Domain-Specific Languages","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ri1muolw_YwC&source=gbs_api","authors":["Martin Fowler"]},{"pageCount":1412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yr66AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"IBM® Rational® Application Developer for WebSphere® Software v7.5 (Application Developer, for short) is the full function Eclipse 3.4 based development platform for developing JavaTM Standard Edition Version 6 (Java SE 6) and Java Enterprise Edition Version 5 (Java EE 5) applications with a focus on applications to be deployed to IBM WebSphere Application Server and IBM WebSphere Portal. Rational Application Developer provides integrated development tools for all development roles, including Web developers, Java developers, business analysts, architects, and enterprise programmers. Rational Application Developer is part of the IBM Rational Software Delivery Platform (SDP), which contains products in four life cycle categories: - Architecture management, which includes integrated development environments - Change and release management - Process and portfolio management - Quality management This IBM RedbooksTM publication is a programming guide that highlights the features and tooling included with Rational Application Developer v7.5. Many of the chapters provide working examples that demonstrate how to use the tooling to develop applications, as well as achieve the benefits of visual and rapid application development. This publication is an update of Rational Application Developer V7 Programming Guide, SG24-7501.","language":"en","currency":"USD","id":"073843289X","title":"Rational Application Developer V7.5 Programming Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yr66AgAAQBAJ&source=gbs_api","authors":["Ueli Wahli","Miguel Vieira Ferreira Lopes Gomes","Brian Hainey","Ahmed Moharram","Juan Pablo Napoli","Marco Rohr","Henry Cui","Patrick Gan","Celso Gonzalez","Pinar Ugurlu","Lara Ziosi","IBM Redbooks"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7jaQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"What will you learn from this book? Go makes it easy to build software that’s simple, reliable, and efficient. Andthis book makes it easy for programmers like you to get started. Googledesigned Go for high-performance networking and multiprocessing, but—like Python and JavaScript—the language is easy to read and use. With thispractical hands-on guide, you’ll learn how to write Go code using clearexamples that demonstrate the language in action. Best of all, you’ll understandthe conventions and techniques that employers want entry-level Godevelopers to know. Why does this book look so different? Based on the latest research in cognitive science and learning theory, HeadFirst Go uses a visually rich format to engage your mind rather than a textheavyapproach that puts you to sleep. Why waste your time struggling withnew concepts? This multisensory learning experience is designed for theway your brain really works.","language":"en","currency":"USD","id":"1491969504","title":"Head First Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7jaQDwAAQBAJ&source=gbs_api","authors":["Jay McGavren"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":928,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Wu5qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The comprehensive developer guide to the latest Android featuresand capabilities Professional Android, 4th Edition shows developers how toleverage the latest features of Android to create robust andcompelling mobile apps. This hands-on approach provides in-depthcoverage through a series of projects, each introducing a newAndroid platform feature and highlighting the techniques and bestpractices that exploit its utmost functionality. The exercisesbegin simply, and gradually build into advanced Androiddevelopment. Clear, concise examples show you how to quicklyconstruct real-world mobile applications. This book is your guide to smart, efficient, effective Androiddevelopment. Learn the best practices that get more out of Android Understand the anatomy, lifecycle, and UI metaphor of Androidapps Design for all mobile platforms, including tablets Utilize both the Android framework and Google Playservices","language":"en","currency":"USD","id":"1118949536","title":"Professional Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Wu5qDwAAQBAJ&source=gbs_api","authors":["Reto Meier","Ian Lake"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W7_lBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Master Java EE design pattern implementation to improve yourdesign skills and your application’s architecture Professional Java EE Design Patterns is the perfectcompanion for anyone who wants to work more effectively with JavaEE, and the only resource that covers both the theory andapplication of design patterns in solving real-world problems. Theauthors guide readers through both the fundamental and advancedfeatures of Java EE 7, presenting patterns throughout, anddemonstrating how they are used in day-to-day problem solving. As the most popular programming language in community-drivenenterprise software, Java EE provides an API and runtimeenvironment that is a superset of Java SE. Written for the juniorand experienced Java EE developer seeking to improve design qualityand effectiveness, the book covers areas including: Implementation and problem-solving with design patterns Connection between existing Java SE design patterns and newJava EE concepts Harnessing the power of Java EE in design patterns Individually-based focus that fully explores each pattern Colorful war-stories showing how patterns were used in thefield to solve real-life problems Unlike most Java EE books that simply offer descriptions orrecipes, this book drives home the implementation of the pattern toreal problems to ensure that the reader learns how the patternsshould be used and to be aware of their pitfalls. For the programmer looking for a comprehensive guide that isactually useful in the everyday workflow, Professional Java EEDesign Patterns is the definitive resource on the market.","language":"en","currency":"USD","id":"1118843452","title":"Professional Java EE Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W7_lBQAAQBAJ&source=gbs_api","authors":["Murat Yener","Alex Theedom"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F6qgFtLwpJgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Musings on Linux and Open Source by an Accidental Revolutionary","description":"Open source provides the competitive advantage in the Internet Age. According to the August Forrester Report, 56 percent of IT managers interviewed at Global 2,500 companies are already using some type of open source software in their infrastructure and another 6 percent will install it in the next two years. This revolutionary model for collaborative software development is being embraced and studied by many of the biggest players in the high-tech industry, from Sun Microsystems to IBM to Intel.The Cathedral & the Bazaar is a must for anyone who cares about the future of the computer industry or the dynamics of the information economy. Already, billions of dollars have been made and lost based on the ideas in this book. Its conclusions will be studied, debated, and implemented for years to come. According to Bob Young, \"This is Eric Raymond's great contribution to the success of the open source revolution, to the adoption of Linux-based operating systems, and to the success of open source users and the companies that supply them.\"The interest in open source software development has grown enormously in the past year. This revised and expanded paperback edition includes new material on open source developments in 1999 and 2000. Raymond's clear and effective writing style accurately describing the benefits of open source software has been key to its success. With major vendors creating acceptance for open source within companies, independent vendors will become the open source story in 2001.","language":"en","currency":"USD","id":"9780596553968","title":"The Cathedral & the Bazaar","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F6qgFtLwpJgC&source=gbs_api","authors":["Eric S. Raymond"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ang5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Build efficient web apps and deliver great results by integrating Angular and the .NET framework About This Book Become a more productive developer and learn to use frameworks that implement good development practices Achieve advanced autocompletion, navigation, and refactoring in Angular using Typescript Follow a gradual introduction to the concepts with a lot of examples and explore the evolution of a production-ready application Who This Book Is For If you are a .NET developer who now wants to efficiently build single-page applications using the new features that Angular 4 has to offer, then this book is for you. Familiarity of HTML, CSS, and JavaScript is assumed to get the most from this book. What You Will Learn Create a standalone Angular application to prototype user interfaces Validate complex forms with Angular version 4 and use Bootstrap to style them Build RESTful web services that work well with single-page applications Use Gulp and Bower in Visual Studio to run tasks and manage JavaScript packages Implement automatic validation for web service requests to reduce your boilerplate code Use web services with Angular version 4 to offload and secure your application logic Test your Angular version 4 and web service code to improve the quality of your software deliverables In Detail Are you are looking for a better, more efficient, and more powerful way of building front-end web applications? Well, look no further, you have come to the right place! This book comprehensively integrates Angular version 4 into your tool belt, then runs you through all the new options you now have on hand for your web apps without bogging you down. The frameworks, tools, and libraries mentioned here will make your work productive and minimize the friction usually associated with building server-side web applications. Starting off with building blocks of Angular version 4, we gradually move into integrating TypeScript and ES6. You will get confident in building single page applications and using Angular for prototyping components. You will then move on to building web services and full-stack web application using ASP.NET WebAPI. Finally, you will learn the development process focused on rapid delivery and testability for all application layers. Style and approach This book covers everything there is to know about getting well-acquainted with Angular 4 and .NET without bogging you down. Everything is neatly laid out under clear headings for quick consultation, offering you the information required to understand a concept immediately, with short, relevant examples of each feature.","language":"en","currency":"USD","id":"1785881140","title":"Learning Angular for .NET Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ang5DwAAQBAJ&source=gbs_api","authors":["Rajesh Gunasundaram"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZZ_6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A deep dive into distributed ledgers, consensus protocols, smart contracts, DApps, cryptocurrencies, Ethereum, and more, 3rd Edition","description":"Mastering Blockchain, Third Edition is the blockchain bible to equip you with extensive knowledge of distributed ledgers, cryptocurrencies, smart contracts, consensus algorithms, cryptography and blockchain platforms such as Ethereum, Bitcoin, and many more.","language":"en","currency":"USD","id":"1839211377","title":"Mastering Blockchain","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZZ_6DwAAQBAJ&source=gbs_api","authors":["Imran Bashir"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=98ycCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Understanding domains, technologies, and user experience","description":"Master powerful new approaches to web architecture, design, and user experience This book presents a pragmatic, problem-driven, user-focused approach to planning, designing, and building dynamic web solutions. You’ll learn how to gain maximum value from Domain-Driven Design (DDD), define optimal supporting architecture, and succeed with modern UX-first design approaches. The author guides you through choosing and implementing specific technologies and addresses key user-experience topics, including mobile-friendly and responsive design. You’ll learn how to gain more value from existing Microsoft technologies such as ASP.NET MVC and SignalR by using them alongside other technologies such as Bootstrap, AJAX, JSON, and JQuery. By using these techniques and understanding the new ASP.NET Core 1.0, you can quickly build advanced web solutions that solve today’s problems and deliver an outstanding user experience. Microsoft MVP Dino Esposito shows you how to: Plan websites and web apps to mirror real-world social and business processes Use DDD to dissect and master the complexity of business domains Use UX-Driven Design to reduce costs and give customers what they want Realistically compare server-side and client-side web paradigms Get started with the new ASP.NET Core 1.0 Simplify modern visual webpage construction with Bootstrap Master practical, efficient techniques for running ASP.NET MVC projects Consider new options for implementing persistence and working with data models Understand Responsive Web Design’s pros, cons, and tradeoffs Build truly mobile-friendly, mobile-optimized websites About This Book For experienced developers and solution architects who want to plan and develop web solutions more effectively Assumes basic familiarity with the Microsoft web development stack","language":"en","currency":"USD","id":"1509300546","title":"Modern Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=98ycCwAAQBAJ&source=gbs_api","authors":["Dino Esposito"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5AuLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build seven web development projects with Spring MVC, Angular 6, JHipster, WebFlux, and Spring Boot 2","description":"Discover the latest features of Spring framework by building robust, fast, and reactive web applications Key Features Take advantage of all the features of Spring 5.0 with third party tools to build a robust back end Secure Spring based web application using Spring Security framework with LDAP and OAuth protocol Develop robust and scalable microservice based applications on Spring Cloud, using Spring Boot Book Description Spring makes it easy to create RESTful applications, merge with social services, communicate with modern databases, secure your system, and make your code modular and easy to test. With the arrival of Spring Boot, developers can really focus on the code and deliver great value, with minimal contour. This book will show you how to build various projects in Spring 5.0, using its features and third party tools. We'll start by creating a web application using Spring MVC, Spring Data, the World Bank API for some statistics on different countries, and MySQL database. Moving ahead, you'll build a RESTful web services application using Spring WebFlux framework. You'll be then taken through creating a Spring Boot-based simple blog management system, which uses Elasticsearch as the data store. Then, you'll use Spring Security with the LDAP libraries for authenticating users and create a central authentication and authorization server using OAuth 2 protocol. Further, you'll understand how to create Spring Boot-based monolithic application using JHipster. Toward the end, we'll create an online book store with microservice architecture using Spring Cloud and Netflix OSS components, and a task management system using Spring and Kotlin. By the end of the book, you'll be able to create coherent and flexible real-time web applications using Spring Framework. What you will learn Build Spring based application using Bootstrap template and JQuery Understand the Spring WebFlux framework and how it uses Reactor library Interact with Elasticsearch for indexing, querying, and aggregating data Create a simple monolithic application using JHipster Use Spring Security and Spring Security LDAP and OAuth libraries for Authentication Develop a microservice-based application with Spring Cloud and Netflix Work on Spring Framework with Kotlin Who this book is for This book is for competent Spring developers who wish to understand how to develop complex yet flexible applications with Spring. You must have a good knowledge of Java programming and be familiar with the basics of Spring.","language":"en","currency":"USD","id":"1788391977","title":"Spring 5.0 Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5AuLDwAAQBAJ&source=gbs_api","authors":["Nilang Patel"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JsNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Unleash the power of collaborative development workflows using GitHub, 2nd Edition","description":"This book will teach you what you need to know to start using GitHub effectively for collaborating and working on your software projects. Key Features Effectively use GitHub by learning its key features to leverage the power of Git and make collaboration on code easy to work with. Be more productive on the development workflow of your projects using the valuable toolset that GitHub provides. Explore the world of GitHub by following simple, step-by-step, real-world scenarios accompanied by helpful, explanatory screenshots. Book Description Whether you are an experienced developer or a novice, learning to work with Version Control Systems is a must in the software development world. Git is the most popular tool for that purpose, and GitHub was built around it, leveraging its powers by bringing it to the web. Starting with the basics of creating a repository, you will then learn how to manage the issue tracker, the place where discussions about your project take place. Continuing our journey, we will explore how to use the wiki and write rich documentation that will accompany your project. You will also master organization\/team management and some of the features that made GitHub so well known, including pull requests. Next, we will focus on creating simple web pages hosted on GitHub and lastly, we will explore the settings that are configurable for a user and a repository. What you will learn Create and upload repositories to your account Create organizations and manage teams with different access levels on repositories Use the issue tracker effectively and add context to issues with labels and milestones Create, access, and personalize your user account and profile settings Build a community around your project using the sophisticated tools GitHub provides Create GitHub pages and understand web analytics Who this book is for This book is for experienced or novice developers with a basic knowledge of Git. If you ever wanted to learn how big projects such as Twitter, Google, or even GitHub collaborate on code, then this book is for you.","language":"en","currency":"USD","id":"1789138469","title":"GitHub Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JsNiDwAAQBAJ&source=gbs_api","authors":["Achilleas Pipinellis"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Tackle Software Complexity with Domain-Driven Design and F#","description":"You want increased customer satisfaction, faster development cycles, and less wasted work. Domain-driven design (DDD) combined with functional programming is the innovative combo that will get you there. In this pragmatic, down-to-earth guide, you'll see how applying the core principles of functional programming can result in software designs that model real-world requirements both elegantly and concisely - often more so than an object-oriented approach. Practical examples in the open-source F# functional language, and examples from familiar business domains, show you how to apply these techniques to build software that is business-focused, flexible, and high quality. Domain-driven design is a well-established approach to designing software that ensures that domain experts and developers work together effectively to create high-quality software. This book is the first to combine DDD with techniques from statically typed functional programming. This book is perfect for newcomers to DDD or functional programming - all the techniques you need will be introduced and explained. Model a complex domain accurately using the F# type system, creating compilable code that is also readable documentation---ensuring that the code and design never get out of sync. Encode business rules in the design so that you have \"compile-time unit tests,\" and eliminate many potential bugs by making illegal states unrepresentable. Assemble a series of small, testable functions into a complete use case, and compose these individual scenarios into a large-scale design. Discover why the combination of functional programming and DDD leads naturally to service-oriented and hexagonal architectures. Finally, create a functional domain model that works with traditional databases, NoSQL, and event stores, and safely expose your domain via a website or API. Solve real problems by focusing on real-world requirements for your software. What You Need: The code in this book is designed to be run interactively on Windows, Mac and Linux.You will need a recent version of F# (4.0 or greater), and the appropriate .NET runtime for your platform.Full installation instructions for all platforms at fsharp.org.","language":"en","currency":"USD","id":"1680505491","title":"Domain Modeling Made Functional","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qA9QDwAAQBAJ&source=gbs_api","authors":["Scott Wlaschin"]},{"pageCount":207,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iq2zDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.99,"subtitle":"Second Edition","description":"This book discusses how model-based approaches can improve the daily practice of software professionals. This is known as Model-Driven Software Engineering (MDSE) or, simply, Model-Driven Engineering (MDE). MDSE practices have proved to increase efficiency and effectiveness in software development, as demonstrated by various quantitative and qualitative studies. MDSE adoption in the software industry is foreseen to grow exponentially in the near future, e.g., due to the convergence of software development and business analysis. The aim of this book is to provide you with an agile and flexible tool to introduce you to the MDSE world, thus allowing you to quickly understand its basic principles and techniques and to choose the right set of MDSE instruments for your needs so that you can start to benefit from MDSE right away. The book is organized into two main parts. The first part discusses the foundations of MDSE in terms of basic concepts (i.e., models and transformations), driving principles, application scenarios, and current standards, like the well-known MDA initiative proposed by OMG (Object Management Group) as well as the practices on how to integrate MDSE in existing development processes. The second part deals with the technical aspects of MDSE, spanning from the basics on when and how to build a domain-specific modeling language, to the description of Model-to-Text and Model-to-Model transformations, and the tools that support the management of MDSE projects. The second edition of the book features: a set of completely new topics, including: full example of the creation of a new modeling language (IFML), discussion of modeling issues and approaches in specific domains, like business process modeling, user interaction modeling, and enterprise architecture complete revision of examples, figures, and text, for improving readability, understandability, and coherence better formulation of definitions, dependencies between concepts and ideas addition of a complete index of book content In addition to the contents of the book, more resources are provided on the book's website http:\/\/www.mdse-book.com, including the examples presented in the book.","language":"en","currency":"USD","id":"1627056955","title":"Model-Driven Software Engineering in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iq2zDgAAQBAJ&source=gbs_api","authors":["Marco Brambilla","Jordi Cabot","Manuel Wimmer"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Wlu8DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"The Big Nerd Ranch Guide","description":"Front-end development targets the browser, putting your applications in front of the widest range of users regardless of device or operating system. This guide will give you a solid foundation for creating rich web experiences across platforms. Focusing on JavaScript, CSS3, and HTML5, this book is for programmers with a background in other platforms and developers with previous web experience who need to get up to speed quickly on current tools and best practices. Each chapter of this book will guide you through essential concepts and APIs as you build a series of applications. You will implement responsive UIs, access remote web services, build applications with Ember.js, and more. You will also debug and test your code with cutting-edge development tools and harness the power of Node.js and the wealth of open-source modules in the npm registry. After working through the step-by-step example projects, you will understand how to build modern websites and web applications.","language":"en","currency":"USD","id":"0134432576","title":"Front-End Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Wlu8DAAAQBAJ&source=gbs_api","authors":["Chris Aquino","Todd Gandee"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9pY3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Applications and Microservices with the Spring Framework","description":"Learn Spring Boot and how to build Java-based enterprise, web, and microservice applications with it. In this book, you'll see how to work with relational and NoSQL databases, build your first microservice, enterprise, or web application, and enhance that application with REST APIs. You'll also learn how to build reactive web applications using Spring Boot along with Spring Web Reactive. Then you’ll secure your Spring Boot-created application or service before testing and deploying it. After reading and learning with Beginning Spring Boot 2, you'll have the skills and techniques to start building your first Spring Boot applications and microservices with confidence to take the next steps in your career journey. What You'll Learn Use Spring Boot autoconfiguration Work with relational and NoSQL databases Build web applications with Spring Boot Apply REST APIs using Spring Boot Create reactive web applications using Spring Web Reactive Secure your Spring Boot applications or web services Test and deploy your Spring Boot applications Who This Book Is For Experienced Java and Spring Framework developers who are new to the new Spring Boot micro-framework.","language":"en","currency":"USD","id":"1484229312","title":"Beginning Spring Boot 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9pY3DwAAQBAJ&source=gbs_api","authors":["K. Siva Prasad Reddy"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RHOOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.65,"subtitle":"A Hands-On Approach for Beginners","description":"Businesses are gathering data today at exponential rates and yet few people know how to access it meaningfully. If you’re a business or IT professional, this short hands-on guide teaches you how to pull and transform data with SQL in significant ways. You will quickly master the fundamentals of SQL and learn how to create your own databases. Author Thomas Nield provides exercises throughout the book to help you practice your newfound SQL skills at home, without having to use a database server environment. Not only will you learn how to use key SQL statements to find and manipulate your data, but you’ll also discover how to efficiently design and manage databases to meet your needs. You’ll also learn how to: Explore relational databases, including lightweight and centralized models Use SQLite and SQLiteStudio to create lightweight databases in minutes Query and transform data in meaningful ways by using SELECT, WHERE, GROUP BY, and ORDER BY Join tables to get a more complete view of your business data Build your own tables and centralized databases by using normalized design principles Manage data by learning how to INSERT, DELETE, and UPDATE records","language":"en","currency":"USD","id":"1491938560","title":"Getting Started with SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RHOOCwAAQBAJ&source=gbs_api","authors":["Thomas Nield"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8AcvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Practical Programming for Total Beginners","description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: –Search for text in a file or across multiple files –Create, update, move, and rename files and folders –Search the Web and download online content –Update and format data in Excel spreadsheets of any size –Split, merge, watermark, and encrypt PDFs –Send reminder emails and text notifications –Fill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","language":"en","currency":"USD","id":"1593276850","title":"Automate the Boring Stuff with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8AcvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iy50DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 100 recipes and solutions to solve the most common problems faced by Android developers, 3rd Edition","description":"Build feature-rich, reliable Android Pie apps with the help of more than 100 proven industry standard recipes and strategies. Key Features Uncover the latest features in Android 9 Pie to make your applications stand out Develop Android Pie applications with the latest mobile technologies, from set up to security Get up-to-speed with Android Studio 3 and its impressive new features Book Description The Android OS has the largest installation base of any operating system in the world. There has never been a better time to learn Android development to write your own applications, or to make your own contributions to the open source community! With this extensively updated cookbook, you'll find solutions for working with the user interfaces, multitouch gestures, location awareness, web services, and device features such as the phone, camera, and accelerometer. You also get useful steps on packaging your app for the Android Market. Each recipe provides a clear solution and sample code you can use in your project from the outset. Whether you are writing your first app or your hundredth, this is a book that you will come back to time and time again, with its many tips and tricks on the rich features of Android Pie. What you will learn Develop applications using the latest Android framework while maintaining backward-compatibility with the support library Create engaging applications using knowledge gained from recipes on graphics, animations, and multimedia Work through succinct steps on specifics that will help you complete your project faster Add location awareness to your own app with examples using the latest Google Play services API Utilize Google Speech Recognition APIs for your app Who this book is for If you are new to Android development and want to take a hands-on approach to learning the framework, or if you are an experienced developer in need of clear working code to solve the many challenges in Android development, you will benefit from this book. Either way, this is a resource you'll want to keep on your desk as a quick reference to help you solve new problems as you tackle more challenging projects.","language":"en","currency":"USD","id":"1788622960","title":"Android 9 Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iy50DwAAQBAJ&source=gbs_api","authors":["Rick Boyer"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AulODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Grasp the fundamentals of Spring 5.0 to build modern, robust, and scalable Java applications","description":"Discover the real power of Spring Framework 5.0 and learn to create powerful applications in its newest version Key Features Learn reactive programming by implementing a reactive application with Spring Webflux Create a robust and scalable messaging application with Spring messaging support Apply your knowledge to build three real-world projects in Spring Book Description With growing demands, organizations are looking for systems that are robust and scalable. Therefore, the Spring Framework has become the most popular framework for Java development. It not only simplifies software development but also improves developer productivity. This book covers effective ways to develop robust applications in Java using Spring. The book has three parts, where each one covers the building of a comprehensive project in Java and Spring. In the first part, you will construct a CMS Portal using Spring's support for building REST APIs. You will also learn to integrate these APIs with AngularJS and later develop this application in a reactive fashion using Project Reactor, Spring WebFlux, and Spring Data. In the second part, you’ll understand how to build a messaging application, which will consume the Twitter API and perform filtering and transformations. Here, you will also learn about server-sent events and explore Spring’s support for Kotlin, which makes application development quick and efficient. In the last part, you will build a real microservice application using the most important techniques and patterns such as service discovery, circuit breakers, security, data streams, monitoring, and a lot more from this architectural style. By the end of the book, you will be confident about using Spring to build your applications. What you will learn Implement REST APIs with Spring REST support Introduce the Spring Boot and understand how it makes creating robust applications extremely simple Understand how Spring Data helps us add persistence in MongoDB and SQL databases Introduce Reactive Programming and use this with Spring Webflux Implement a Reactive REST client and learn how it can create asynchronous applications Create a robust, scalable, and fault tolerant application with Spring Messaging Implement a websocket to add interactive behaviors in your applications Introduce the Spring Cloud projects Who this book is for If you’re a developer starting out with Spring, then this book will help you learn about the new Spring 5.0 framework concepts followed by their implementation in Java and Kotlin. The book will also help experienced Spring developers gain insights into the new features added in Spring 5.0.","language":"en","currency":"USD","id":"1788628020","title":"Spring 5.0 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AulODwAAQBAJ&source=gbs_api","authors":["Claudio Eduardo de Oliveira"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jiménez","Graham Lee","Corey Wade"]},{"pageCount":732,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRrRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Full stack web development with .NET Core 3.1 and Angular 9, 3rd Edition","description":"This full-stack guide will help you become fluent in both frontend and backend web development by combining the impressive capabilities of ASP.NET Core 3.1 and Angular 9 from project setup right through the deployment. Furthermore, you will learn to add capabilities like security, testability, and scalability to your apps using expert techniques.","language":"en","currency":"USD","id":"1789611482","title":"ASP.NET Core 3 and Angular 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRrRDwAAQBAJ&source=gbs_api","authors":["Valerio De Sanctis"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=skpODAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Master the New Build System for Android","description":"Android adopted Gradle as the preferred build automation system a few years ago, but many Android developers are still unfamiliar with this open source tool. This hands-on guide provides a collection of Gradle recipes to help you quickly and easily accomplish the most common build tasks for your Android apps. You’ll learn how to customize project layouts, add dependencies, and generate many different versions of your app. Gradle is based on Groovy, yet very little knowledge of the JVM language is required for you to get started. Code examples use Android SDK version 23, with emulators from Marshmallow (Android 6) or Lollipop (Android 5). If you’re comfortable with Java and Android, you’re ready. Understand Gradle’s generated build files for Android apps Run Gradle from the command line or inside Android Studio Add more Java libraries to your Android app Import and export Eclipse ADT projects Digitally sign a Release APK for the Google Play store Use product flavors to build many versions of the same app Add custom tasks to the Gradle build process Test both your app’s Android and non-Android components Improve the performance of your Gradle build","language":"en","currency":"USD","id":"1491947292","title":"Gradle Recipes for Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=skpODAAAQBAJ&source=gbs_api","authors":["Ken Kousen"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Gmi3DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.39,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. The Language of SQL, Second Edition Many SQL texts attempt to serve as an encyclopedic reference on SQL syntax -- an approach that is often counterproductive, because that information is readily available in online references published by the major database vendors. For SQL beginners, it’s more important for a book to focus on general concepts and to offer clear explanations and examples of what various SQL statements can accomplish. This is that book. A number of features make The Language of SQL unique among introductory SQL books. First, you will not be required to download software or sit with a computer as you read the text. The intent of this book is to provide examples of SQL usage that can be understood simply by reading. Second, topics are organized in an intuitive and logical sequence. SQL keywords are introduced one at a time, allowing you to grow your understanding as you encounter new terms and concepts. Finally, this book covers the syntax of three widely used databases: Microsoft SQL Server, MySQL, and Oracle. Special “Database Differences” sidebars clearly show you any differences in syntax among these three databases, and instructions are included on how to obtain and install free versions of the databases. This is the only book you need to gain a quick working knowledge of SQL and relational databases. ·Learn How To... Use SQL to retrieve data from relational databases Apply functions and calculations to data Group and summarize data in a variety of useful ways Use complex logic to retrieve only the data you need Update data and create new tables Design relational databases so that data retrieval is easy and intuitive Use spreadsheets to transform your data into meaningful displays Retrieve data from multiple tables via joins, subqueries, views, and set logic Create, modify, and execute stored procedures Install Microsoft SQL Server, MySQL, or Oracle","language":"en","currency":"USD","id":"0134658337","title":"The Language of SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Gmi3DAAAQBAJ&source=gbs_api","authors":["Larry Rockoff"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YOh1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.49,"subtitle":"A practical guide for learning Python, complete with real-world projects for you to explore","description":"With an interesting mix of theory and practicals, explore Python and its features, and progress from beginner to being skilled in this popular scripting language Key Features A comprehensive introduction to the world of Python programming Paves an easy-to-follow path for you to navigate through concepts Filled with over 90 practical exercises and activities to reinforce your learning Book Description After a brief history of Python and key differences between Python 2 and Python 3, you'll understand how Python has been used in applications such as YouTube and Google App Engine. As you work with the language, you'll learn about control statements, delve into controlling program flow and gradually work on more structured programs via functions. As you settle into the Python ecosystem, you'll learn about data structures and study ways to correctly store and represent information. By working through specific examples, you'll learn how Python implements object-oriented programming (OOP) concepts of abstraction, encapsulation of data, inheritance, and polymorphism. You'll be given an overview of how imports, modules, and packages work in Python, how you can handle errors to prevent apps from crashing, as well as file manipulation. By the end of this book, you'll have built up an impressive portfolio of projects and armed yourself with the skills you need to tackle Python projects in the real world. What you will learn Use control statements Manipulate primitive and non-primitive data structures Use loops to iterate over objects or data for accurate results Write encapsulated and succinct Python functions Build Python classes using object-oriented programming Manipulate files on the file system (open, read, write, and delete) Who this book is for Python Fundamentals is great for anyone who wants to start using Python to build anything from simple command-line programs to web applications. Prior knowledge of Python isn't required.","language":"en","currency":"USD","id":"1789809940","title":"Python Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YOh1DwAAQBAJ&source=gbs_api","authors":["Ryan Marvin","Mark Ng’ang’a","Amos Omondi"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PILwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27,"subtitle":null,"description":"Android Application Development For Dummies All-In-One, 3rd Edition gathers six Android For Dummies mini-books into one friendly guide. You’ll go from Android newbie all the way to confident programmer and learn to develop apps for the world’s largest smart phone market. Kotlin experts Barry Burd and John Paul Mueller introduce you to Android programming from start to finish! Like all For Dummies books, this guide is written with clear explanations and careful organization, so non-technical readers and experienced programmers alike can get up to speed quickly. This new edition covers the latest features and enhancements to the Android platform. Learn how to develop apps for all sorts of devices including: your smartphone, tablet, wearables, TV, auto, and Internet of Things (IoTs) like your refrigerator Discover the new Kotlin programming language, which makes development easier Create apps even faster than before using the new techniques found in this book Develop apps for the largest smartphone market to reach the biggest possible audience This book focuses on Android 10, the newest and most flexible Android platform. Get started turning your app development dreams into reality today!","language":"en","currency":"USD","id":"1119660467","title":"Android Application Development All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PILwDwAAQBAJ&source=gbs_api","authors":["Barry Burd","John Paul Mueller"]},{"pageCount":425,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rufiBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.87,"subtitle":"The ultimate and most up-to-date guide to manage WildFly appication server","description":"WildFly is the most popular open-source Java application server. This book is an in-depth guide to the administration and management of the of the application server, covering all of the latest architectural and management changes such as: - How to achieve High Availability of your WildFly cluster - How to configure the newest subsystems (agroal, mp subsystems) - Delivering advanced and leak-proof Datasource configuration - Provisioning custom Server distributions with Galleon tool. - Using the Undertow Web server as front-end for mod_cluster and as Reverse Proxy Server - Migrating your older legacy configurations to WildFly newer subsystems - Securing the application server with Elytron Framework - Configuring a robust JMS cluster with Apache Artemis MQ - Running WildFly in the cloud with Openshift and CRC - Configuring Eclipse Micro Profiles and much more, with improved online examples!","language":"en","currency":"USD","id":"8894038920","title":"WildFly Administration Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rufiBAAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ik0qCTVzl44C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Code of Conduct for Professional Programmers","description":"Programmers who endure and succeed amidst swirling uncertainty and nonstop pressure share a common attribute: They care deeply about the practice of creating software. They treat it as a craft. They are professionals. In The Clean Coder: A Code of Conduct for Professional Programmers, legendary software expert Robert C. Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice–about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers will learn What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding, and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time, and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”–and how to say it When to say “Yes”–and what yes really means Great software is something to marvel at: powerful, elegant, functional, a pleasure to work with as both a developer and as a user. Great software isn’t written by machines. It is written by professionals with an unshakable commitment to craftsmanship. The Clean Coder will help you become one of them–and earn the pride and fulfillment that they alone possess.","language":"en","currency":"USD","id":"0132542889","title":"The Clean Coder","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ik0qCTVzl44C&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-LZpAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Android Security Cookbook' breaks down and enumerates the processes used to exploit and remediate Android app security vulnerabilities in the form of detailed recipes and walkthroughs. Android Security Cookbook is aimed at anyone who is curious about Android app security and wants to be able to take the necessary practical measures to protect themselves; this means that Android application developers, security researchers and analysts, penetration testers, and generally any CIO, CTO, or IT managers facing the impeding onslaught of mobile devices in the business environment will benefit from reading this book.","language":"en","currency":"USD","id":"178216717X","title":"Android Security Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-LZpAgAAQBAJ&source=gbs_api","authors":["Keith Makan","Scott Alexander-Bown"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build real-time, scalable, and cloud-enabled Android apps with Firebase","description":"Develop a fully functional and dynamic Android application using the latest features of Firebase Key Features Explore all the latest tools in Firebase—Firebase Firestore, ML-Kit, and Firebase Predictions Master Firebase cloud messaging, remote configuration, and work with a real-time database Make your app a global success with the help of Google Analytics and AdMob Book Description Firebase offers a wide spectrum of tools and services to help you develop high-quality apps in a short period of time. It also allows you to build web and mobile apps quickly without managing the infrastructure.Mastering Firebase for Android Development takes you through the complete toolchain of Firebase,including the latest tools announced in Google IO 2018 such as Firebase ML-Kit, FireStore, and Firebase Predictions. The book begins by teaching you to configure your development environment with Firebase and set up a different structure for a Firebase real-time database. As you make your way through the chapters, you’ll establish the authentication feature in Android and explore email and phone authentication for managing the on-boarding of users. You’ll be taken through topics on Firebase crash reporting, Firebase functions, Firebase Cloud, Firebase Hosting, and Cloud Messaging for push notifications and explore other key areas in depth. In the concluding chapters, you will learn to use Firebase Test Lab to test your application before using Firebase Performance Monitoring to trace performance setbacks. By the end of the book, you will be well equipped with the Firebase ecosystem, which will help you find solutions to your common application development challenges. What you will learn Learn about Firebase push notifications and write backend functionalities Identify the root cause of an application crash and diagnose and fix bugs Store different Multipurpose Internet MailExtension(MIME) type files Explore web hosting and connect the Firebase functions to the host website Send push notifications and understand the deep integration of analytics tools and cohorts Market and monetize your application using Firebase Adwords and Admob Build a secure authentication framework while enhancing the sign-in and on-boarding experience for end users Who this book is for Mastering Firebase for Android Development is for individualslooking to extend their skills with Firebase and build faster, scalable, and real-time mobile applications. Basic understanding of Android programming is necessary. In all, this in-depth guide is an accessible pathway to mastering Firebase.","language":"en","currency":"USD","id":"1788624254","title":"Mastering Firebase for Android Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RMNiDwAAQBAJ&source=gbs_api","authors":["Ashok Kumar S"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.99,"subtitle":"101 Scripts for Linux, OS X, and UNIX Systems","description":"Shell scripts are an efficient way to interact with your machine and manage your files and system operations. With just a few lines of code, your computer will do exactly what you want it to do. But you can also use shell scripts for many other essential (and not-so-essential) tasks. This second edition of Wicked Cool Shell Scripts offers a collection of useful, customizable, and fun shell scripts for solving common problems and personalizing your computing environment. Each chapter contains ready-to-use scripts and explanations of how they work, why you’d want to use them, and suggestions for changing and expanding them. You'll find a mix of classic favorites, like a disk backup utility that keeps your files safe when your system crashes, a password manager, a weather tracker, and several games, as well as 23 brand-new scripts, including: – ZIP code lookup tool that reports the city and state – Bitcoin address information retriever – suite of tools for working with cloud services like Dropbox and iCloud – for renaming and applying commands to files in bulk – processing and editing tools Whether you want to save time managing your system or just find new ways to goof off, these scripts are wicked cool!","language":"en","currency":"USD","id":"1593277830","title":"Wicked Cool Shell Scripts, 2nd Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nAYvDwAAQBAJ&source=gbs_api","authors":["Dave Taylor","Brandon Perry"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QOhxBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are completely new to either Java, Android, or game programming and are aiming to publish Android games, then this book is for you. This book also acts as a refresher for those who already have experience in Java on another platforms or other object-oriented languages.","language":"en","currency":"USD","id":"1784393843","title":"Learning Java by Building Android Games","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QOhxBgAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ldUHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.02,"subtitle":null,"description":"Книга посвящена разработке мобильных приложений для Android на языке Kotlin. Рассматриваются основные элементы языка, такие как функции и классы, приемы объектно-ориентированного программирования. Рассказывается о разработке микросервисов RESTful для приложений Android, о методах реализации шаблона архитектуры MVC. Описаны способы централизации, преобразования и хранения данных с применением Logstash, защиты приложений с использованием Spring Security. Изучается управление зависимостями с помощью Kotlin. Уделено внимание развертыванию микроcервисов Kotlin для AWS и приложений Android в Play Store. Файлы для книги можно скачать по ссылке ftp:\/\/ftp.bhv.ru\/9785977565899.zip","language":"ru","currency":"USD","id":"5977565895","title":"JavaScript. 20 уроков для начинающих","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ldUHEAAAQBAJ&source=gbs_api","authors":["Дронов Владимир Александрович"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oEFPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Design and develop attractive user interfaces for Android applications","description":"Master the art of creating impressive and reactive UIs for mobile applications on the latest version of Android Oreo. About This Book A comprehensive guide to designing and developing highly interactive user interfaces for your app. Design responsive and agile applications targeting multiple Android devices (up to Android Oreo) using Android Studio 3.0 Write reactive user interfaces with minimal effort by leveraging the latest Android technologies, such as Architecture components and the Lifecycle API Avoid common design problems and pitfalls with the help of shared UI design patterns and best practices. Who This Book Is For This book is for novice Android and Java developers who have a basic knowledge of Android development and want to start developing stunning user interfaces. What You Will Learn Create effective and efficient user interfaces that allow users to carry out tasks smoothly Understand the fundamentals of Android UI design, and take a look at the basic layouts, Inputs, and controls Learn about various UI components provided by Android, which include structured layout objects and UI controls that allow you to build the graphical user interface for your app Explore various styles and themes that allow you to customize the look and feel of your app Leverage the animation and graphics APIs to improve user experience and draw custom 2D graphics In Detail A great user interface (UI) can spell the difference between success and failure for any new application. This book will show you not just how to code great UIs, but how to design them as well. It will take novice Android developers on a journey, showing them how to leverage the Android platform to produce stunning Android applications. Begin with the basics of creating Android applications and then move on to topics such as screen and layout design. Next, learn about techniques that will help improve performance for your application. Also, explore how to create reactive applications that are fast, animated, and guide the user toward their goals with minimal distraction. Understand Android architecture components and learn how to build your application to automatically respond to changes made by the user. Great platforms are not always enough, so this book also focuses on creating custom components, layout managers, and 2D graphics. Also, explore many tips and best practices to ease your UI development process. By the end, you'll be able to design and build not only amazing UIs, but also systems that provide the best possible user experience. Style and approach This book takes an easy tutorial approach to help you learn how to create consistent and efficient user interfaces for your apps. The book first takes you through the basics of user interfaces such as basic layouts, inputs, and controls, and also covers animations and graphics. By the end of the book, you will have learned best practices and will be able to develop inspired interfaces that look good and also work subtly in the background.","language":"en","currency":"USD","id":"1788472136","title":"Hands-On Android UI Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oEFPDwAAQBAJ&source=gbs_api","authors":["Jason Morris"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":952,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B_OCVIL_W80C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"From Novice to Professional","description":"* This best-selling title has comprehensive discussions about PHP 5, MySQL 5, and how these two popular open source technologies work together to create powerful websites. * Updated to reflect the new features found in MySQL’s most significant release to date. Readers are introduced to advanced database features like triggers, stored procedures, and views. They learn how to integrate these new capabilities into their PHP-driven web applications. The book also discusses PHP’s new MySQL extension, mysqli, which is required for MySQL versions 4.1 and higher. * Packed with hundreds of practical examples covering all aspects of web development, including forms management, templating, database integration, Web services, security, and session handling.","language":"en","currency":"USD","id":"9781430201175","title":"Beginning PHP and MySQL 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B_OCVIL_W80C&source=gbs_api","authors":["W Jason Gilmore"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uouPDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"5th International Conference, GALA 2016, Utrecht, The Netherlands, December 5–7, 2016, Proceedings","description":"This book constitutes the refereed proceedings of the 5th International Conference on Games and Learning Alliance, GALA 2016, held in Utrecht, The Netherlands, in December 2016. The 27 revised regular papers presented together with 14 poster papers were carefully reviewed and selected from 55 submissions. The papers cover topics such as games and sustainability; games for math and programming; games and health; games and soft skills; games and management; games and learning; game development and assessment; and mobile games.","language":"en","currency":"USD","id":"3319501828","title":"Games and Learning Alliance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uouPDQAAQBAJ&source=gbs_api","authors":["Rosa Bottino","Johan Jeuring","Remco C. Veltkamp"]},{"pageCount":331,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TQUaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"With over 75 million downloads per month, Spring Boot is the most widely used Java framework available. Its ease and power have revolutionized application development from monoliths to microservices. Yet Spring Boot's simplicity can also be confounding. How do developers learn enough to be productive immediately? This practical book shows you how to use this framework to write successful mission-critical applications. Mark Heckler from VMware, the company behind Spring, guides you through Spring Boot's architecture and approach, covering topics such as debugging, testing, and deployment. If you want to develop cloud native Java or Kotlin applications with Spring Boot rapidly and effectively--using reactive programming, building APIs, and creating database access of all kinds--this book is for you. Learn how Spring Boot simplifies cloud native application development and deployment Build reactive applications and extend communication across the network boundary to create distributed systems Understand how Spring Boot's architecture and approach increase developer productivity and application portability Deploy Spring Boot applications for production workloads rapidly and reliably Monitor application and system health for optimal performance and reliability Debug, test, and secure cloud-based applications painlessly","language":"en","currency":"USD","id":"1492076937","title":"Spring Boot: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TQUaEAAAQBAJ&source=gbs_api","authors":["Mark Heckler"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZapSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27,"subtitle":null,"description":"Explore the engine that drives the internet It takes a powerful suite of technologies to drive the most-visited websites in the world. PHP, mySQL, JavaScript, and other web-building languages serve as the foundation for application development and programming projects at all levels of the web. Dig into this all-in-one book to get a grasp on these in-demand skills, and figure out how to apply them to become a professional web builder. You’ll get valuable information from seven handy books covering the pieces of web programming, HTML5 & CSS3, JavaScript, PHP, MySQL, creating object-oriented programs, and using PHP frameworks. Helps you grasp the technologies that power web applications Covers PHP version 7.2 Includes coverage of the latest updates in web development Perfect for developers to use to solve problems This book is ideal for the inexperienced programmer interested in adding these skills to their toolbox. New coders who've made it through an online course or boot camp will also find great value in how this book builds on what you already know.","language":"en","currency":"USD","id":"1119468337","title":"PHP, MySQL, & JavaScript All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZapSDwAAQBAJ&source=gbs_api","authors":["Richard Blum"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pu4RCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Android gaming is a hot topic these days, but one of the few areas of technology that does not have an abundance of clear and useful documentation online. However, there is an ever-increasing demand for Android games. This book will help you get up to speed with the essentials of game development with Android. The book begins by teaching you the setup of a game development environment on a fundamental level. Moving on, the book deals with concepts such as building a home screen UI, implementing game objects, and painting the scene at a fixed resolution. Gradually, it builds up to the implementation of a flexible and advanced game engine that uses OpenGL ES 2 for fast, smooth frame rates. This is achieved by starting with a simple game and gradually increasing the complexity of the three complete games built step by step. By the end of the book, you will have successfully built three exciting games over the course of three engrossing and insightful projects.","language":"en","currency":"USD","id":"1785286196","title":"Android Game Programming by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pu4RCgAAQBAJ&source=gbs_api","authors":["John Horton"]},{"pageCount":1040,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MdxACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Core Java® has long been recognized as the leading, no-nonsense tutorial and reference for experienced programmers who want to write robust Java code for real-world applications. Now, Core Java®, Volume I–Fundamentals, Tenth Edition, has been extensively updated to reflect the most eagerly awaited and innovative version of Java in years: Java SE 8. Rewritten and reorganized to illuminate new Java SE 8 features, idioms, and best practices, it contains hundreds of example programs–all carefully crafted for easy understanding and practical applicability. Writing for serious programmers solving real-world problems, Cay Horstmann helps you achieve a deep understanding of the Java language and library. In this first volume of the two-volume work, Horstmann focuses on fundamental language concepts and the foundations of modern user interface programming. You’ll find in-depth coverage of topics ranging from Java object-oriented programming to generics, collections, lambda expressions, Swing UI design, and the latest approaches to concurrency and functional programming. This guide will help you Leverage your existing programming knowledge to quickly master core Java syntax Understand how encapsulation, classes, and inheritance work in Java Master interfaces, inner classes, and lambda expressions for functional programming Improve program robustness with exception handling and effective debugging Write safer, more readable programs with generics and strong typing Use pre-built collections to collect multiple objects for later retrieval Master concurrent programming techniques from the ground up Build modern cross-platform GUIs with standard Swing components Deploy configurable applications and applets, and deliver them across the Internet Simplify concurrency and enhance performance with new functional techniques If you’re an experienced programmer moving to Java SE 8, Core Java®, Tenth Edition, will be your reliable, practical companion–now and for many years to come. Look for the companion volume, Core Java®, Volume II–Advanced Features, Tenth Edition (ISBN-13: 978-0-13-417729-8), for coverage of Java 8 streams, input and output, XML, databases, annotations, and other advanced topics. Register your product or convenient access to downloads, updates, and corrections as they become available. See inside the book for information.","language":"en","currency":"USD","id":"0134177355","title":"Core Java Volume I--Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MdxACwAAQBAJ&source=gbs_api","authors":["Cay S. Horstmann"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vEwOCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Gaming has historically been a strong driver of technology, whether we're talking about hardware or software performance, the variety of input methods, or graphics support, and the Android game platform is no different. Android is a mature, yet still growing, platform that many game developers have embraced as it provides tools, APIs, and services to help bootstrap Android projects and ensure their success, many of which are specially designed to help game developers. This book is a progressive, hands-on guide to developing highly interactive and complex Android games from scratch. You will learn all the aspects of developing a game using a space shooter game as the example that will evolve with you through the chapters. You will learn all about frame-by-frame animations and resource animations. You will also create beautiful and responsive menus and dialogs and explore the different options for playing sound effects and music in Android. You will then learn the basics of creating a particle system and how to use the Leonids library. Finally, we will configure and use Google Play Services on the developer console and port our game to the big screen.","language":"en","currency":"USD","id":"1785281364","title":"Mastering Android Game Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vEwOCgAAQBAJ&source=gbs_api","authors":["Raul Portales"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fhiMDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The Big Nerd Ranch Guide","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Through the authors' carefully constructed explanations and examples, you will develop an understanding of Swift grammar and the elements of effective Swift style. This book is written for Swift 3.0 and will also show you how to navigate Xcode 8 and get the most out of Apple's documentation. Throughout the book, the authors share their insights into Swift to ensure that you understand the hows and whys of Swift and can put that understanding to use in different contexts. After working through the book, you will have the knowledge and confidence to develop your own solutions to a wide range of programming challenges using Swift.","language":"en","currency":"USD","id":"0134610695","title":"Swift Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fhiMDQAAQBAJ&source=gbs_api","authors":["Matthew Mathias","John Gallagher"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H4q1t-jAcBIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"The Art of UNIX Programming poses the belief that understanding the unwritten UNIX engineering tradition and mastering its design patterns will help programmers of all stripes to become better programmers. This book attempts to capture the engineering wisdom and design philosophy of the UNIX, Linux, and Open Source software development community as it has evolved over the past three decades, and as it is applied today by the most experienced programmers. Eric Raymond offers the next generation of \"hackers\" the unique opportunity to learn the connection between UNIX philosophy and practice through careful case studies of the very best UNIX\/Linux programs.","language":"en","currency":"USD","id":"9780132465885","title":"The Art of UNIX Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H4q1t-jAcBIC&source=gbs_api","authors":["Eric S. Raymond"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lOXJCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":null,"description":"This edition of Robert Sedgewick's popular work provides current and comprehensive coverage of important algorithms for Java programmers. Michael Schidlowsky and Sedgewick have developed new Java implementations that both express the methods in a concise and direct manner and provide programmers with the practical means to test them on real applications. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick's work an invaluable resource for more than 400,000 programmers! This particular book, Parts 1-4 , represents the essential first half of Sedgewick's complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. Although the substance of the book applies to programming in any language, the implementations by Schidlowsky and Sedgewick also exploit the natural match between Java classes and abstract data type (ADT) implementations. Highlights Java class implementations of more than 100 important practical algorithms Emphasis on ADTs, modular programming, and object-oriented programming Extensive coverage of arrays, linked lists, trees, and other fundamental data structures Thorough treatment of algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT implementations (search algorithms) Complete implementations for binomial queues, multiway radix sorting, randomized BSTs, splay trees, skip lists, multiway tries, B trees, extendible hashing, and many other advanced methods Quantitative information about the algorithms that gives you a basis for comparing them More than 1,000 exercises and more than 250 detailed figures to help you learn properties of the algorithms Whether you are learning the algorithms for the first time or wish to have up-to-date reference material that incorporates new programming styles with classic and new algorithms, you will find a wealth of useful information in this book.","language":"en","currency":"USD","id":"0321623975","title":"Algorithms in Java, Parts 1-4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lOXJCgAAQBAJ&source=gbs_api","authors":["Robert Sedgewick"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-LZpAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Android Security Cookbook' breaks down and enumerates the processes used to exploit and remediate Android app security vulnerabilities in the form of detailed recipes and walkthroughs. Android Security Cookbook is aimed at anyone who is curious about Android app security and wants to be able to take the necessary practical measures to protect themselves; this means that Android application developers, security researchers and analysts, penetration testers, and generally any CIO, CTO, or IT managers facing the impeding onslaught of mobile devices in the business environment will benefit from reading this book.","language":"en","currency":"USD","id":"178216717X","title":"Android Security Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-LZpAgAAQBAJ&source=gbs_api","authors":["Keith Makan","Scott Alexander-Bown"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9vCoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn shell scripting to solve complex shell-related problems and to efficiently automate your day-to-day tasks About This Book Familiarize yourself with the terminal by learning about powerful shell features Automate tasks by writing shell scripts for repetitive work Packed with easy-to-follow, hands-on examples to help you write any type of shell script with confidence Who This Book Is For This book is aimed at administrators and those who have a basic knowledge of shell scripting and who want to learn how to get the most out of writing shell scripts. What You Will Learn Write effective shell scripts easily Perform search operations and manipulate large text data with a single shell command Modularize reusable shell scripts by creating shell libraries Redirect input, output, and errors of a command or script execution to other streams Debug code with different shell debugging techniques to make your scripts bug-free Manage processes, along with the environment variables needed to execute them properly Execute and embed other languages in your scripts Manage creation, deletion, and search operations in files In Detail Shell scripting is a quick method to prototype complex applications or problems. Shell scripts are a collection of commands to automate tasks, usually those for which the user has a repeated need, when working on Linux-based systems. Using simple commands or a combination of them in a shell can solve complex problems easily. This book starts with the basics, including essential commands that can be executed on Linux systems to perform tasks within a few nanoseconds. You'll learn to use outputs from commands and transform them to show the data you require. Discover how to write shell scripts easily, execute script files, debug, and handle errors. Next, you'll explore environment variables in shell programming and learn how to customize them and add a new environment. Finally, the book walks you through processes and how these interact with your shell scripts, along with how to use scripts to automate tasks and how to embed other languages and execute them. Style and approach This book is a pragmatic guide to writing efficient shell programs, complete with hands-on examples and tips.","language":"en","currency":"USD","id":"1783552379","title":"Linux Shell Scripting Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9vCoCwAAQBAJ&source=gbs_api","authors":["Sinny Kumari"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6nc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Gain a thorough understanding of operating in a Python development environment, and some of the most important advanced topics with Daniel Arbuckle. This dynamic, concise book is full of real-world solutions for Python 3.6 problems, and advanced-level concepts such as reactive programming, microservices, ctypes and Cython. About This Book Covers the latest and advanced concepts of Python such as parallel processing with Python 3.6 Explore the Python language from its basic installation and setup to concepts such as reactive programming and microservices Get introduced to the mechanism for rewriting code in a compiled language along with ctypes and Cython tools Who This Book Is For If you are a programmer and are familiar with the basics of Python, and you want to broaden your knowledge base to develop projects better and faster, this book is for you. Even if you are not familiar with Python, Daniel Arbuckle's Mastering Python starts with the basics and takes you on a journey to become an expert in the technology. What You Will Learn Get to grips with the basics of operating in a Python development environment Build Python packages to efficiently create reusable code Become proficient at creating tools and utility programs in Python Use the Git version control system to protect your development environment from unwanted changes Harness the power of Python to automate other software Distribute computational tasks across multiple processors Handle high I\/O loads with asynchronous I\/O to get a smoother performance Take advantage of Python's metaprogramming and programmable syntax features Get acquainted with the concepts behind reactive programming and RxPy In Detail Daniel Arbuckle's Mastering Python covers the basics of operating in a Python development environment, before moving on to more advanced topics. Daniel presents you with real-world solutions to Python 3.6 and advanced-level concepts, such as reactive programming, microservices, ctypes, and Cython tools. You don't need to be familiar with the Python language to use this book, as Daniel starts with a Python primer. Throughout, Daniel highlights the major aspects of managing your Python development environment, shows you how to handle parallel computation, and helps you to master asynchronous I\/O with Python 3.6 to improve performance. Finally, Daniel will teach you the secrets of metaprogramming and unit testing in Python, helping you acquire the perfect skillset to be a Python expert. Daniel will get you up to speed on everything from basic programming practices to high-end tools and techniques, things that will help set you apart as a successful Python programmer. Style and Approach Daniel Arbuckle's Mastering Python covers basic to advanced-level concepts in computer science. If you are a beginner, then Daniel will help you get started. If you are experienced, he will expand your knowledge base.","language":"en","currency":"USD","id":"1787284409","title":"Daniel Arbuckle's Mastering Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6nc5DwAAQBAJ&source=gbs_api","authors":["Daniel Arbuckle"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WwJwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Arm yourself to make the most of the versatile, powerful Ubuntu Server with over 100 hands-on recipes About This Book Master the skills to setup secure and scalable web services with popular tools like Apache, Nginx, MySQL and HAProxy Set up your own cloud with Open Stack and quickly deploy applications with Docker or LXD Packed with clear, step-by-step recipes to let you protect you valuable data with your own chat servers, code hosting and collaboration tools. Who This Book Is For Ubuntu Server Cookbook is for system administrators or software developers with a basic understanding of the Linux operating system who want to set up their own servers. You are not required to have in-depth knowledge or hands-on experience with Ubuntu, but you should know the basics commands for directory navigation, file management, and the file editing tool. An understanding of computer networks is advisable What You Will Learn Set up high performance, scalable, and fault-tolerant back ends with web and database servers Facilitate team communication with a real-time chat service and collaboration tools Quickly deploy your applications to their own containers and scale your infrastructure as and when needed Find out how to set up your own cloud infrastructure for your internal use or rent it to the public Ensure quick and easy access for your users while also securing your infrastructure from intruders Set up a high performance private network with a personal VPN server and centralized authentication system Swiftly start a content streaming service Set up network storage for private data and source code and say good bye to costly and unreliable cloud services In Detail Ubuntu is one of the most secure operating systems and defines the highest level of security as compared other operating system. Ubuntu server is a popular Linux distribution and the first choice when deploying a Linux server. It can be used with a $35 Raspberry Pi to top-notch, thousand-dollar-per-month cloud hardware. Built with lists that there are 4 million + websites built using Ubuntu. With its easy-to-use package management tools and availability of well-known packages, we can quickly set up our own services such as web servers and database servers using Ubuntu. This book will help you develop the skills required to set up high performance and secure services with open source tools. Starting from user management and an in-depth look at networking, we then move on to cover the installation and management of web servers and database servers, as well as load balancing various services. You will quickly learn to set up your own cloud and minimize costs and efforts with application containers. Next, you will get to grips with setting up a secure real-time communication system. Finally, we'll explore source code hosting and various collaboration tools. By the end of this book, you will be able to make the most of Ubuntu's advanced functionalities. Style and approach This easy-to-follow guide contains a series of step-by-step recipes ranging from simple to complex. Each topic will start with basic introduction to each technology followed by a detailed step-by-step installation guide and then a detailed explanation of the approach taken during installation and the various advanced options available.","language":"en","currency":"USD","id":"178588798X","title":"Ubuntu Server Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WwJwDQAAQBAJ&source=gbs_api","authors":["Uday R. Sawant"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kpdpDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.98,"subtitle":"","description":"Android-Entwickler können sich die Arbeit mit der Java-Alternative Kotlin erleichtern. In unserer dreiteiligen Tutorialreihe erfahren Sie, wie der Einstieg gelingt, welche Features Kotlin bietet und wie Sie Ihre fertige App testen können. In einem Zweiteiler lernen Sie die Angriffswege auf iOS-Apps kennen. Unsere Tipps zur Abwehr von Lauschangriffen auf den eigenen Datenverkehr runden das Thema App-Sicherheit unter iOS ab. Lesen Sie außerdem, wie Sie mit Skripten Prozesse in Apple-Standardanwendungen sinnvoll automatisieren können und wie Ihre eigenen Apps dank Siri aufs Wort hören. Facebooks JavaScript-Framework React aktualisiert Webseiten blitzschnell und zerlegt komplexe Anwendungen in handliche Module. Wir zeigen an einem Beispiel, wie das funktioniert. Auch Google will mit dem Web-Optimierungsprojekt AMP das Netz schneller machen, doch die nützlichen Werkzeuge haben ihren Preis. Website oder App? Progressive Web-Apps machen den Übergang mit responsivem Webdesign und hybriden Apps fließend. Erfahren Sie wie. Das plattformübergreifende CMake umfasst eine Suite von Open-Source-Werkzeugen, mit denen Softwareentwickler komplexe Anwendungen effizient übersetzen, testen und ausliefern können. Ein dreiteiliges Tutorial demonstriert die Möglichkeiten dieses Build-Systems. Nach einer Einführung, zeigen wir, wie man eigene Module in der CMake-eigenen Skriptsprache realisieren kann. Hat man mithilfe des Build-Systems CMake ein Projekt erfolgreich übersetzt, müssen die fertigen Programme paketiert und ausgeliefert werden – nachdem sie ausgiebig getestet wurden. Auch hier hilft CMake, ebenso wie bei der Portierung auf unterschiedliche Betriebssysteme. Auf der Heft-DVD finden Sie Videotutorials zur Entwicklung von iOS-10-Apps mit Swift 3, eine Einführung in die Java-Programmierung und ein Beitrag über Grundlagen von .NET und c#. Leser des eMagazins finden einen entsprechenden Downloadcode.","language":"de","currency":"USD","id":"3957881633","title":"c't Programmieren (2017)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kpdpDgAAQBAJ&source=gbs_api","authors":[" c't-Redaktion"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7L945SzaO_AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Pro Android is the first book to include coverage of Google Android 1.5 SDK (including the branch formerly called Cupcake). This essential book covers the fundamentals of building applications for embedded devices thru through to advanced concepts, such as custom 3D components. Takes a pragmatic approach to developing Google Android applications. Examines the Android Virtual Device; the Input-Method Framework, special development considerations for touch screen vs. keyboard\/traditional input, Voice Recognition, and Live Folders, Covers the Android media APIs (media APIs, Wi-Fi APIs, etc), including the new simplified OpenGL, improved media framework and more. With Android 1.5 and this book that includes Android 1.5 coverage, developers should will be able to build leading-edge mobile applications ranging from games to Google Apps like add-ons to Google Docs and more—no matter the device interface. Extend and run APIs of the Google Chrome browser\/WebOS on G1, G2 and other forthcoming next-generation Google phones and other Android-enabled devices and netbooks.","language":"en","currency":"USD","id":"1430215976","title":"Pro Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7L945SzaO_AC&source=gbs_api","authors":["Satya Komatineni","Sayed Hashimi"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5MSiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for experienced Java developers with NLP needs, whether academics, industrialists, or hobbyists. A basic knowledge of NLP terminology will be beneficial.","language":"en","currency":"USD","id":"1783284684","title":"Natural Language Processing with Java and LingPipe Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5MSiBQAAQBAJ&source=gbs_api","authors":["Breck Baldwin","Krishna Dayanidhi"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6KceEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Познакомьтесь с возможностями программирования Android на языке Kotlin! Множество примеров приложений с четкими объяснениями ключевых концепций и API позволят легко разобраться в самых трудных задачах. Эта книга посвящена прикладным методам разработки приложений на Kotlin, и подойдет для всех версий Android от 5.0 (Lollipop) до 8.1 (Oreo) и выше. Используйте Android Studio для создания приложений, чтобы проверять код на каждом этапе, интегрировать его с другими приложениями, работать с изображениями, воспроизводить аудио и делать многое другое. Каждая глава продумана (и протестирована) так, чтобы вы смогли получить максимум опыта и знания, необходимые для разработки под Android.","language":"ru","currency":"USD","id":"5446116577","title":"Android. Программирование для профессионалов. 4-е издание","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6KceEAAAQBAJ&source=gbs_api","authors":["Филлипс Билл","Стюарт Крис","Марсикано Кристин","Гарднер Брайан"]},{"pageCount":1007,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L2vDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Study Guide Using Spring Framework 5","description":"Pass the Pivotal Certified Professional exam for Core Spring, based on the latest Spring Framework 5, using source code examples, study summaries, and mock exams. This book now includes WebFlux, reactive programming, and more found in Spring 5. You'll find a descriptive overview of certification-related Spring modules and a single example application demonstrating the use of all required Spring modules. Furthermore, in Pivotal Certified Professional Core Spring 5 Developer Exam, Second Edition, each chapter contains a brief study summary and question set, and the book’s free downloadable source code package includes one mock exam (50 questions – like a real exam). After using this study guide, you will be ready to take and pass the Pivotal Certified Professional exam. When you become Pivotal Certified, you will have one of the most valuable credentials in Java. Pivotal certification helps you advance your skills and your career, and get the maximum benefit from Spring. Passing the exam demonstrates your understanding of Spring and validates your familiarity with: container-basics, aspect oriented programming (AOP), data access and transactions, Spring Security, Spring Boot, microservices, and Spring model-view-controller (MVC). Good luck! What You Will Learn Understand the core principles of Spring Framework 5 Use dependency injection Work with aspects in Spring and do AOP (aspect oriented programming) Control transactional behavior and work with SQL and NoSQL databases Create and secure web applications based on Spring MVC Get to know the format of the exam and the type of questions in it Create Spring microservices applications Who This Book Is For Spring developers who have taken the Pivotal Core Spring class are eligible to take the Pivotal Certified Professional exam.","language":"en","currency":"USD","id":"1484251369","title":"Pivotal Certified Professional Core Spring 5 Developer Exam","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L2vDDwAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=apMUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":null,"description":"This book will guide you through the basic game development process using Python, covering game topics including graphics, sound, artificial intelligence, animation, game engines, etc. Real games are created as you work through the text and significant parts of a game engine are built and made available for download. New chapters on card games and a side-scroller. The companion files contain all of the resources described in the book, e.g., example code, game assets, video\/sound editing software, and color figures. Instructor resources are available for use as a textbook. FEATURES: Teaches basic game development concepts using Python including graphics, sound, artificial intelligence, animation, game engines, collision detection, Web-based games, and more Includes code samples using Pygame Features new chapters on card games (Ch.11) and building a side-scrolling game (Ch.12) Includes a companion disc with example code, games assets, and color figures","language":"en","currency":"USD","id":"1683926250","title":"Game Development Using Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=apMUEAAAQBAJ&source=gbs_api","authors":["James R. Parker, PhD"]},{"pageCount":604,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EF5txSsyBFUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Beginning Android 4 is an update to Beginning Android 3, originally written by Mark Murphy. It is your first step on the path to creating marketable apps for the burgeoning Android Market, Amazon's Android Appstore, and more. Google’s Android operating-system has taken the industry by storm, going from its humble beginnings as a smartphone operating system to its current status as a platform for apps that run across a gamut of devices from phones to tablets to netbooks to televisions, and the list is sure to grow. Smart developers are not sitting idly by in the stands, but are jumping into the game of creating innovative and salable applications for this fast-growing, mobile- and consumer-device platform. If you’re not in the game yet, now is your chance! Beginning Android 4 is fresh with details on the latest iteration of the Android platform. Begin at the beginning by installing the tools and compiling a skeleton app. Move through creating layouts, employing widgets, taking user input, and giving back results. Soon you’ll be creating innovative applications involving multi-touch, multi-tasking, location-based feature sets using GPS. You’ll be drawing data live from the Internet using web services and delighting your customers with life-enhancing apps. Not since the PC era first began has there been this much opportunity for the common developer. What are you waiting for? Grab your copy of Beginning Android 4 and get started!","language":"en","currency":"USD","id":"1430239859","title":"Beginning Android 4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EF5txSsyBFUC&source=gbs_api","authors":["Mark Murphy","Grant Allen"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9ebGBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Methods for managing complex software construction following the practices, principles and patterns of Domain-Driven Design with code examples in C# This book presents the philosophy of Domain-Driven Design (DDD) in a down-to-earth and practical manner for experienced developers building applications for complex domains. A focus is placed on the principles and practices of decomposing a complex problem space as well as the implementation patterns and best practices for shaping a maintainable solution space. You will learn how to build effective domain models through the use of tactical patterns and how to retain their integrity by applying the strategic patterns of DDD. Full end-to-end coding examples demonstrate techniques for integrating a decomposed and distributed solution space while coding best practices and patterns advise you on how to architect applications for maintenance and scale. Offers a thorough introduction to the philosophy of DDD for professional developers Includes masses of code and examples of concept in action that other books have only covered theoretically Covers the patterns of CQRS, Messaging, REST, Event Sourcing and Event-Driven Architectures Also ideal for Java developers who want to better understand the implementation of DDD","language":"en","currency":"USD","id":"1118714652","title":"Patterns, Principles, and Practices of Domain-Driven Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9ebGBwAAQBAJ&source=gbs_api","authors":["Scott Millett","Nick Tune"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GJgQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Android Best Practices by Godfrey Nolan shows you how to make your Android apps stand out from the crowd with great reviews. Why settle for just making any Android app? Build a brilliant Android app instead that lets your users praise it for ease of use, better performance, and more. Using a series of example apps which gradually evolve throughout this book, Android Best Practices brings together current Android best practices from user interface (UI)\/user experience (UX) design, test-driven development (TDD), and design patterns (e.g., MVC) to help you take your app to the next level. In this book you’ll learn how to: • Use Android design patterns for consistent UI experience on many devices • Use agile techniques such as test-driven development, behavior-driven development, and continuous integration • Improve the speed and overall performance of your app • Organize an Android app using design patterns such as MVC\/MVP • Create and consume REST and SOAP web services Designing and developing an app that runs well on many if not all the leading Android smartphones and tablets today can be one of the most daunting challenges for Android developers. Well, this book takes much of the mystery out of that for you. After reading and using Android Best Practices, you'll become a much better Android app designer and developer, which in turn can make your apps better placed and more successful in the market place.","language":"en","currency":"USD","id":"1430258586","title":"Android Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GJgQAwAAQBAJ&source=gbs_api","authors":["Godfrey Nolan","David Truxall","Raghav Sood","Onur Cinar"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O4mkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 85 recipes to build modular, readable, and testable Golang applications across various domains, 2nd Edition","description":"Tackle the trickiest of problems in Go programming with this practical guide Key Features Develop applications for different domains using modern programming techniques Tackle common problems when it comes to parallelism, concurrency, and reactive programming in Go Work with ready-to-execute code based on the latest version of Go Book Description Go (or Golang) is a statically typed programming language developed at Google. Known for its vast standard library, it also provides features such as garbage collection, type safety, dynamic-typing capabilities, and additional built-in types. This book will serve as a reference while implementing Go features to build your own applications. This Go cookbook helps you put into practice the advanced concepts and libraries that Golang offers. The recipes in the book follow best practices such as documentation, testing, and vendoring with Go modules, as well as performing clean abstractions using interfaces. You'll learn how code works and the common pitfalls to watch out for. The book covers basic type and error handling, and then moves on to explore applications, such as websites, command-line tools, and filesystems, that interact with users. You'll even get to grips with parallelism, distributed systems, and performance tuning. By the end of the book, you'll be able to use open source code and concepts in Go programming to build enterprise-class applications without any hassle. What you will learn Work with third-party Go projects and modify them for your use Write Go code using modern best practices Manage your dependencies with the new Go module system Solve common problems encountered when dealing with backend systems or DevOps Explore the Go standard library and its uses Test, profile, and fine-tune Go applications Who this book is for If you're a web developer, programmer, or enterprise developer looking for quick solutions to common and not-so-common problems in Go programming, this book is for you. Basic knowledge of the Go language is assumed.","language":"en","currency":"USD","id":"1789804701","title":"Go Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O4mkDwAAQBAJ&source=gbs_api","authors":["Aaron Torres"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VPFsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build your own smart devices using the Android Things platform","description":"Android Things is the new Android based Operating System for the Internet of Things. With this book you will learn the core concepts by running code examples on different peripherals. Key Features No previous knowledge of IoT or microcontrollers required. Hands-On with simple code and plenty of examples. Use Kotlin to write simpler and more readable code Book Description Android Things is the IoT platform made by Google, based on Android. It allows us to build smart devices in a simple and convenient way, leveraging on the Android ecosystem tools and libraries, while letting Google take care of security updates. This book takes you through the basics of IoT and smart devices. It will help you to interact with common IoT device components and learn the underlying protocols. For a simple setup, we will be using Rainbow HAT so that we don't need to do any wiring. In the first chapter, you will learn about the Android Things platform, the design concepts behind it, and how it relates to other IoT frameworks. We will look at the Developer Kits and learn how to install Android Things on them by creating a simple project. Later, we will explore the real power of Android Things, learning how to make a UI, designing and communicating with companion apps in different ways, showcasing a few libraries. We will demonstrate libraries and you will see how powerful the Android Things operating system is. What you will learn Understand key design concepts of Android Things and its advantages Set up an Android Things Developer Kit Interact with all the components of Rainbow HAT Understand how peripheral protocols work (GPIO, PWM, I2C, and SPI) Implement best practices of how to handle IoT peripherals with in terms Android Things Develop techniques for building companion apps for your devices Who this book is for This book is for developers who have a basic knowledge of Android and want to start using the Android Things developer kit.","language":"en","currency":"USD","id":"1789347947","title":"Android Things Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VPFsDwAAQBAJ&source=gbs_api","authors":["Raul Portales"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Use React and React Native to build applications for desktop browsers, mobile browsers, and even as native mobile apps About This Book Build React and React Native applications using familiar component concepts Dive deep into each platform, from routing in React to creating native mobile applications that can run offline Use Facebook's Relay, React and GraphQL technologies, to create a unified architecture that powers both web and native applications Who This Book Is For This book is written for any JavaScript developer—beginner or expert—who wants to start learning how to put both of Facebook's UI libraries to work. No knowledge of React is needed, though a working knowledge of ES2015 will help you follow along better. What You Will Learn Craft reusable React components Control navigation using the React Router to help keep your UI in sync with URLs Build isomorphic web applications using Node.js Use the Flexbox layout model to create responsive mobile designs Leverage the native APIs of Android and iOS to build engaging applications with React Native Respond to gestures in a way that's intuitive for the user Use Relay to build a unified data architecture for your React UIs In Detail React and React Native allow you to build cross-platform desktop and mobile applications using Facebook's innovative UI libraries. Combined with the Flux data architecture and Relay, you can now create powerful and feature-complete applications from just one code base! This book is split into three parts. The first part shows you how to start crafting composable UIs using React, from rendering with JSX and creating reusable components through to routing and creating isomorphic applications that run on Node. We then move on to showing you how to take the concepts of React and apply them to building Native UIs using React Native. You'll find out how to build responsive and streamlined UIs that can properly handle user interactions in a mobile environment. You'll also learn how to access device-specific APIs such as the geolocation API, and how to handle offline development with React Native. Finally, we'll tie all of these skills together and shows you how you can create React applications that run on every major platform. As well as understanding application state in depth, you'll learn how to leverage Relay to make feature-complete, data-driven web and native mobile applications. Style and approach Split into three major sections to help organize your learning, this hands-on, code-first book will help you get up to speed with React and React Native—the UI framework that powers Netflix, Yahoo, and Facebook.","language":"en","currency":"USD","id":"178646957X","title":"React and React Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jLkrDwAAQBAJ&source=gbs_api","authors":["Adam Boduch"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q12xdhdX91QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":"Build and Customize Your Online Store with this Speedy, Lightweight E-commerce Solution","description":"Build and customize your online store with this speedy, lightweight e-commerce solution.","language":"en","currency":"USD","id":"1849511152","title":"Prestashop 1.3 Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q12xdhdX91QC&source=gbs_api","authors":["John Horton"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Re62DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Comprehensive Introduction Using Scala","description":"Learn software engineering from scratch, from installing and setting up your development environment, to navigating a terminal and building a model command line operating system, all using the Scala programming language as a medium. The demand for software engineers is growing exponentially, and with this book you can start your journey into this rewarding industry, even with no prior programming experience. Using Scala, a language known to contain “everything and the kitchen sink,” you’ll begin coding on a gentle learning curve by applying the basics of programming such as expressions, control flow, functions, and classes. You’ll then move on to an overview of all the major programming paradigms. You’ll finish by studying software engineering concepts such as testing and scalability, data structures, algorithm design and analysis, and basic design patterns. With Software Engineering from Scratch as your navigator, you can get up to speed on the software engineering industry, develop a solid foundation of many of its core concepts, and develop an understanding of where to invest your time next. What You Will Learn Use Scala, even with no prior knowledge Demonstrate general Scala programming concepts and patterns Begin thinking like a software engineer Work on every level of the software development cycle Who This Book Is For Anyone who wants to learn about software engineering; no prior programming experience required.","language":"en","currency":"USD","id":"1484252063","title":"Software Engineering from Scratch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Re62DwAAQBAJ&source=gbs_api","authors":["Jason Lee Hodges"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lhnADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Develop a full-stack web application with Python and Flask","description":"Learn all that’s needed to build a fully functional web application from scratch. Key Features Delve deep into the principle behind RESTful API Learn how to build a scalable web application with the RESTful API architecture and Flask framework Know what are the exact tools and methodology to test your applications and how to use them Book Description Python is a flexible language that can be used for much more than just script development. By knowing the Python RESTful APIs work, you can build a powerful backend for web applications and mobile applications using Python. You'll take your first steps by building a simple API and learning how the frontend web interface can communicate with the backend. You'll also learn how to serialize and deserialize objects using the marshmallow library. Then, you'll learn how to authenticate and authorize users using Flask-JWT. You'll also learn how to enhance your APIs by adding useful features, such as email, image upload, searching, and pagination. You'll wrap up the whole book by deploying your APIs to the cloud. By the end of this book, you'll have the confidence and skill to leverage the power of RESTful APIs and Python to build efficient web applications. What you will learn Understand the concept of a RESTful API Build a RESTful API using Flask and the Flask-Restful extension Manipulate a database using Flask-SQLAlchemy and Flask-Migrate Send out plaintext and HTML format emails using the Mailgun API Implement a pagination function using Flask-SQLAlchemy Use caching to improve API performance and efficiently obtain the latest information Deploy an application to Heroku and test it using Postman Who this book is for This book is ideal for aspiring software developers who have a basic-to-intermediate knowledge of Python programming and who want to develop web applications using Python. Knowledge of how web applications work will be beneficial but is not essential.","language":"en","currency":"USD","id":"1838981101","title":"Python API Development Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lhnADwAAQBAJ&source=gbs_api","authors":["Jack Chan","Ray Chung","Jack Huang"]},{"pageCount":136,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dF62DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.53,"subtitle":null,"description":"This special compendium provides a concise and unified vision of facial image processing. It addresses a collection of state-of-the-art techniques, covering the most important areas for facial biometrics and behavior analysis. These techniques also converge to serve an emerging practical application of interactive distance learning. Readers will get a broad picture of the fundamental science of the field and technical details that make the research interesting. Moreover, the intellectual investigation motivated by the demand of real-life application will make this volume an inspiring read for current and prospective researchers and engineers in the fields of computer vision, machine learning and image processing. Contents: IntroductionFacial Expression Recognition3D Face ModelingEye Gaze EstimationExpressive Audio-visual AvatarModel Based Video EncodingStudent Engagement MonitoringConclusion and Future Work Readership: Researchers, academics, professionals and graduate students in machine perception\/computer vision, artificial intelligence, pattern recognition and computer engineering.","language":"en","currency":"USD","id":"9814733040","title":"Face Processing and Applications to Distance Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dF62DAAAQBAJ&source=gbs_api","authors":["Vuong Le","Pooya Khorrami","Usman Tariq","Hao Tang","Thomas Huang"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZtTXgX9tAMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Beginning Android 4 Games Development offers everything you need to join the ranks of successful Android game developers. You'll start with game design fundamentals and programming basics, and then progress toward creating your own basic game engine and playable game that works on Android 4.0 and earlier devices. This will give you everything you need to branch out and write your own Android games. The potential user base and the wide array of available high-performance devices makes Android an attractive target for aspiring game developers. Do you have an awesome idea for the next break-through mobile gaming title? Beginning Android 4 Games Development will help you kick-start your project. The book will guide you through the process of making several example games for the Android platform, and involves a wide range of topics: The fundamentals of Android game development targeting Android 1.5-4.0+ devices The Android platform basics to apply those fundamentals in the context of making a game The design of 2D and 3D games and their successful implementation on the Android platform","language":"en","currency":"USD","id":"1430239883","title":"Beginning Android 4 Games Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZtTXgX9tAMkC&source=gbs_api","authors":["Mario Zechner","Robert Green"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TgKACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to do more with the Android SDK with this advanced Android Application guide which shows you how to make even better Android apps that users will love About This Book Learn how to design and build better Android apps to reach new users Explore the latest features and tools in the Android SDK that will help you become a better developer From concurrency to testing – through to adding adverts and billing, this book ties together every element to help you deliver a high-quality Android application on Google Play Who This Book Is For Mastering Android Application Development is intended for Android developers that want insight on and guidance through the steps they need to take to give their creations the edge in a competitive market. What You Will Learn Create an Android project with Android M features Design the basic navigation for our app using the UI components Set up a cloud-based platform and store data on it Implement programming patterns such as Singleton and Observer to maintain your project code for future use Display lists and grids using Android RecyclerView Implement user interface components and make your app look professional Handle, download, and store images along with memory management Create the database and content providers to perform read-write operations Add notifications to the app and analytics to track the user's usage Show a Google map view on your app Configure minify to obfuscate the code Add adverts and create products for purchase in your app In Detail There are millions of Android apps out there for people to download – how do you make sure yours has the edge? It's not always about innovation and ideas – the most successful apps are those that are able to satisfy customer demands – they're the ones that look the best, the fastest, and the easiest and most intuitive to use. This book shows you how to create Android applications that do precisely that – it has been designed help you consider and answer those questions throughout the development process, so you can create applications that stand out against the crowd. Learn how to create exemplary UIs that contribute to a satisfying user experience through the lens of Material Design, and explore how to harness the range of features within the Android SDK to help you. Dive deeper into complex programming concepts and discover how to leverage concurrency and navigate memory management and image handling. You'll also find further guidance on testing and debugging so you can guarantee that your application is reliable and robust for users. Beyond this you'll find out how to extend your app and add greater functionality, including notifications, location services, adverts and app billing (essential if you want to properly monetize your creation!). To make sure you have confidence at every stage in the process, the book also shows you how to release your app to the Play store – to make sure your maximising your efforts to create a popular Android application! Style and approach This is a step-by-step guide where theory and practice are merged in a way that helps you to put a new concept into practice with ease. By helping to focus on the end result, and showing all the technical steps you need to get there, you will be poised for development success!","language":"en","currency":"USD","id":"1785887629","title":"Mastering Android Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TgKACwAAQBAJ&source=gbs_api","authors":["Antonio Pachon Ruiz"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NJmhi6T0nGMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Scripting the Linux Shell","description":"The bash shell is a complete programming language, not merely a glue to combine external Linux commands. By taking full advantage of shell internals, shell programs can perform as snappily as utilities written in C or other compiled languages. And you will see how, without assuming Unix lore, you can write professional bash 4.0 programs through standard programming techniques. Complete bash coverage Teaches bash as a programming language Helps you master bash 4.0 features","language":"en","currency":"USD","id":"143021998X","title":"Pro Bash Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NJmhi6T0nGMC&source=gbs_api","authors":["Chris Johnson"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IXJuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This book is intended for developers who are interested in getting acquainted with the concepts of Android Studio in a very short span of time. It is assumed that you are familiar with the OOPS paradigm and Java. It is also recommendable to have prior knowledge of the main characteristics of the Android mobile system.","language":"en","currency":"USD","id":"1784393320","title":"Android Studio Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IXJuBgAAQBAJ&source=gbs_api","authors":["Belén Cruz Zapata"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QtCTBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are a web developer who wants to learn more about developing applications in Flask and scale them with industry-standard practices, this is the book for you. This book will also act as a handy tool if you are aware of Flask's major extensions and want to make the best use of them. It is assumed that you have knowledge of Python and a basic understanding of Flask. If you are completely new to Flask, reading the book from the first chapter and going forward will help in getting acquainted with Flask as you go ahead.","language":"en","currency":"USD","id":"1783983418","title":"Flask Framework Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QtCTBQAAQBAJ&source=gbs_api","authors":["Shalabh Aggarwal"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xWOsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Enterprise Edition for Java: From Novice to Professional","description":"Build Java-based enterprise applications using the open source Eclipse Jakarta EE platform. This feature-packed book teaches you enterprise Java development top to bottom. It covers Java web-tier development using servlets, JavaServer Faces (JSF), RESTful applications, and JSON. You’ll also cover Java data-tier development using persistence and transaction handling, messaging services, remote procedure calls, concurrency, and security to round out a complete Java-based enterprise application. Step by step and easy to follow, Beginning Jakarta EE includes many practical examples. Written by a Java expert and consultant, this book contains the best information possible on enterprise Java technologies. You’ll see that Jakarta EE is the next evolution of Java EE 8 and how it is one of the leading Java platforms for enterprise application development. What You Will Learn Build enterprise Java applications using Jakarta EE Set up your development environment Create page-flow web applications with JSF Write single-page web applications with REST and JSON Persist data using JPA in Jakarta EE Build enterprise Java modules using EJBs and CDI Work with transaction engines using JTA Secure, log, and monitor your Jakarta EE applications Who This Book Is For Beginning Java EE application developers with some experience of Java 8.","language":"en","currency":"USD","id":"1484250796","title":"Beginning Jakarta EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xWOsDwAAQBAJ&source=gbs_api","authors":["Peter Späth"]},{"pageCount":822,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G0C7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Taking you to the limit in Concurrency, OOP, and the most advanced capabilities of C","description":"Push the limits of what C - and you - can do, with this high-intensity guide to the most advanced capabilities of C Key Features Make the most of C’s low-level control, flexibility, and high performance A comprehensive guide to C’s most powerful and challenging features A thought-provoking guide packed with hands-on exercises and examples Book Description There’s a lot more to C than knowing the language syntax. The industry looks for developers with a rigorous, scientific understanding of the principles and practices. Extreme C will teach you to use C’s advanced low-level power to write effective, efficient systems. This intensive, practical guide will help you become an expert C programmer. Building on your existing C knowledge, you will master preprocessor directives, macros, conditional compilation, pointers, and much more. You will gain new insight into algorithm design, functions, and structures. You will discover how C helps you squeeze maximum performance out of critical, resource-constrained applications. C still plays a critical role in 21st-century programming, remaining the core language for precision engineering, aviations, space research, and more. This book shows how C works with Unix, how to implement OO principles in C, and fully covers multi-processing. In Extreme C, Amini encourages you to think, question, apply, and experiment for yourself. The book is essential for anybody who wants to take their C to the next level. What you will learn Build advanced C knowledge on strong foundations, rooted in first principles Understand memory structures and compilation pipeline and how they work, and how to make most out of them Apply object-oriented design principles to your procedural C code Write low-level code that’s close to the hardware and squeezes maximum performance out of a computer system Master concurrency, multithreading, multi-processing, and integration with other languages Unit Testing and debugging, build systems, and inter-process communication for C programming Who this book is for Extreme C is for C programmers who want to dig deep into the language and its capabilities. It will help you make the most of the low-level control C gives you.","language":"en","currency":"USD","id":"1789341353","title":"Extreme C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G0C7DwAAQBAJ&source=gbs_api","authors":["Kamran Amini"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fM3cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Create reliable, robust, and efficient Android apps with industry-standard design patterns About This Book Create efficient object interaction patterns for faster and more efficient Android development Get into efficient and fast app development and start making money from your android apps Implement industry-standard design patterns and best practices to reduce your app development time drastically Who This Book Is For This book is intended for Android developers who have some basic android development experience. Basic Java programming knowledge is a must to get the most out of this book. What You Will Learn Build a simple app and run it on real and emulated devices Explore the WYSIWYG and XML approaches to material design provided within Android Studio Detect user activities by using touch screen listeners, gesture detection, and reading sensors Apply transitions and shared elements to employ elegant animations and efficiently use the minimal screen space of mobile devices Develop apps that automatically apply the best layouts for different devices by using designated directories Socialize in the digital word by connecting your app to social media Make your apps available to the largest possible audience with the AppCompat support library In Detail Are you an Android developer with some experience under your belt? Are you wondering how the experts create efficient and good-looking apps? Then your wait will end with this book! We will teach you about different Android development patterns that will enable you to write clean code and make your app stand out from the crowd. The book starts by introducing the Android development environment and exploring the support libraries. You will gradually explore the different design and layout patterns and get to know the best practices of how to use them together. Then you'll then develop an application that will help you grasp activities, services, and broadcasts and their roles in Android development. Moving on, you will add user-detecting classes and APIs such as gesture detection, touch screen listeners, and sensors to your app. You will also learn to adapt your app to run on tablets and other devices and platforms, including Android Wear, auto, and TV. Finally, you will see how to connect your app to social media and explore deployment patterns as well as the best publishing and monetizing practices. The book will start by introducing the Android development environment and exploring the support libraries. You will gradually explore the different Design and layout patterns and learn the best practices on how to use them together. You will then develop an application that will help you grasp Activities, Services and Broadcasts and their roles in Android development. Moving on, you will add user detecting classes and APIs such as at gesture detection, touch screen listeners and sensors to our app. You will also learn to adapt your app to run on tablets and other devices and platforms, including Android Wear, Auto, and TV. Finally, you will learn to connect your app to social media and explore deployment patterns and best publishing and monetizing practices. Style and approach This book takes a step-by-step approach. The steps are explained using real-world practical examples. Each chapter uses case studies where we show you how using design patterns will help in your development process.","language":"en","currency":"USD","id":"1786465914","title":"Android Design Patterns and Best Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fM3cDgAAQBAJ&source=gbs_api","authors":["Kyle Mew"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7rHjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"A Guide to Ubuntu 20.04 Desktop and Server Editions","description":"Arguably one of the most highly regarded and widely used enterprise level operating systems available today is the Ubuntu 20.04 distribution. Not only is it considered to be among the most stable and reliable operating systems, it is also backed by the considerable resources and technical skills of Canonical, Ltd. Ubuntu 20.04 Essentials is designed to provide detailed information on the installation, use and administration of the Ubuntu 20.04 distribution. For beginners, the book covers topics such as operating system installation, the basics of the GNOME desktop environment, configuring email and web servers and installing packages and system updates. Additional installation topics such as dual booting with Microsoft Windows are also covered, together with all important security topics such as configuring a firewall and user and group administration. For the experienced user, topics such as remote desktop access, the Cockpit web interface, logical volume management (LVM), disk partitioning, swap management, KVM virtualization, Secure Shell (SSH), Linux Containers and file sharing using both Samba and NFS are covered in detail to provide a thorough overview of this enterprise class operating system.","language":"en","currency":"USD","id":"1951442059","title":"Ubuntu 20.04 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7rHjDwAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-jmPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Tools for Business Intelligence, data prep, and visual analytics, 3rd Edition","description":"Create powerful data visualizations and unlock intelligent business insights with Tableau Key Features Explore all the latest Tableau 2019 features and redefine business analytics for your organization Create impressive data visualizations and interactive dashboards to get insights from your data Learn effective data storytelling to transform how your business leverages data and makes decisions Book Description Tableau is the gold standard of business intelligence and visual analytics tools in every industry. It enables rapid data visualization and interpretation with charts, graphs, dashboards, and much more. Updated with the latest features of Tableau, this book takes you from the foundations of the Tableau 2019 paradigm through to advanced topics. This third edition of the bestselling guide by Tableau Zen Master, Joshua Milligan, will help you come to grips with updated features, such as set actions and transparent views. Beginning with installation, you'll create your first visualizations with Tableau and then explore practical examples and advanced techniques. You'll create bar charts, tree maps, scatterplots, time series, and a variety of other visualizations. Next, you'll discover techniques to overcome challenges presented by data structure and quality and engage in effective data storytelling and decision making with business critical information. Finally, you'll be introduced to Tableau Prep, and learn how to use it to integrate and shape data for analysis. By the end of this book, you will be equipped to leverage the powerful features of Tableau 2019 for decision making. What you will learn Develop stunning visualizations that explain complexity with clarity Explore the exciting new features of Tableau Desktop and Tableau Prep Connect to various data sources to bring all your data together Uncover techniques to prep and structure your data for easy analysis Create and use calculations to solve problems and enrich analytics Master advanced topics such as sets, LOD calcs, and much more Enable smart decisions with clustering, distribution, and forecasting Share your data stories to build a culture of trust and action Who this book is for This Tableau book is for anyone who wants to understand data. If you’re new to Tableau, don’t worry. This book builds on the foundations to help you understand how Tableau really works and then builds on that knowledge with practical examples before moving on to advanced techniques. Working experience with databases will be useful but is not necessary to get the most out of this book.","language":"en","currency":"USD","id":"1788838742","title":"Learning Tableau 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-jmPDwAAQBAJ&source=gbs_api","authors":["Joshua N. Milligan"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=snc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build, customize, and debug your own Android system About This Book Master Android system-level programming by integrating, customizing, and extending popular open source projects Use Android emulators to explore the true potential of your hardware Master key debugging techniques to create a hassle-free development environment Who This Book Is For This book is for Android system programmers and developers who want to use Android and create indigenous projects with it. You should know the important points about the operating system and the C\/C++ programming language. What You Will Learn Set up the Android development environment and organize source code repositories Get acquainted with the Android system architecture Build the Android emulator from the AOSP source tree Find out how to enable WiFi in the Android emulator Debug the boot up process using a customized Ramdisk Port your Android system to a new platform using VirtualBox Find out what recovery is and see how to enable it in the AOSP build Prepare and test OTA packages In Detail Android system programming involves both hardware and software knowledge to work on system level programming. The developers need to use various techniques to debug the different components in the target devices. With all the challenges, you usually have a deep learning curve to master relevant knowledge in this area. This book will not only give you the key knowledge you need to understand Android system programming, but will also prepare you as you get hands-on with projects and gain debugging skills that you can use in your future projects. You will start by exploring the basic setup of AOSP, and building and testing an emulator image. In the first project, you will learn how to customize and extend the Android emulator. Then you'll move on to the real challenge—building your own Android system on VirtualBox. You'll see how to debug the init process, resolve the bootloader issue, and enable various hardware interfaces. When you have a complete system, you will learn how to patch and upgrade it through recovery. Throughout the book, you will get to know useful tips on how to integrate and reuse existing open source projects such as LineageOS (CyanogenMod), Android-x86, Xposed, and GApps in your own system. Style and approach This is an easy-to-follow guide full of hands-on examples and system-level programming tips.","language":"en","currency":"USD","id":"1787120384","title":"Android System Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=snc5DwAAQBAJ&source=gbs_api","authors":["Roger Ye"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hYGOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are an application developer who has experience with Dart and want to develop reusable and robust code in Dart, then this book is for you. You are expected to have a basic knowledge of core elements and applications.","language":"en","currency":"USD","id":"1783989572","title":"Mastering Dart","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hYGOBQAAQBAJ&source=gbs_api","authors":["Sergey Akopkokhyants"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aaXWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build fast and efficient Android apps that run as reliably as clockwork in a multi-device world About This Book Wide coverage of various topics that help in developing optimal applications Explore the concepts of Advanced Native Coding in depth A must-have for professional-standard Android developers for whom performance failures and the sloppy use of resources are simply unacceptable Who This Book Is For This book is aimed at developers with an advanced knowledge of Android and who want to test their skills and learn new techniques to increase the performance of their applications. We assume they are comfortable working with the entire Android SDK, and have been doing it for a few years. They need to be familiar with frameworks such as NDK to use native code, which is crucial for app performance What You Will Learn Create Android applications that squeeze the most from the limited resource capacity of devices Swap code that isn't performing Efficient memory management by identifying problems such as leaks Reap the benefits of multithreaded and asynchronous programming Maximize the security and encryption mechanisms natively provided by Android Perform efficient network operations and techniques to retrieve data from servers Master the NDK to write native code that can perform faster operations In Detail Performant applications are one of the key drivers of success in the mobile world. Users may abandon an app if it runs slowly. Learning how to build applications that balance speed and performance with functionality and UX can be a challenge; however, it's now more important than ever to get that balance right. Android High Performance will start you thinking about how to wring the most from any hardware your app is installed on, so you can increase your reach and engagement. The book begins by providing an introduction to state–of-the-art Android techniques and the importance of performance in an Android application. Then, we will explain the Android SDK tools regularly used to debug and profile Android applications. We will also learn about some advanced topics such as building layouts, multithreading, networking, and security. Battery life is one of the biggest bottlenecks in applications; and this book will show typical examples of code that exhausts battery life, how to prevent this, and how to measure battery consumption from an application in every kind of situation to ensure your apps don't drain more than they should. This book explains techniques for building optimized and efficient systems that do not drain the battery, cause memory leaks, or slow down with time. Style and approach The book follows a tutorial-based approach to take the reader from the basic fundamentals of debugging to advanced performance-improvement concepts.","language":"en","currency":"USD","id":"1785283383","title":"Android High Performance Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aaXWDQAAQBAJ&source=gbs_api","authors":["Enrique Lopez Manas","Diego Grancini"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CrzONuZ0YAIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Learn how to develop applications for Android mobile devices using simple examples, ready to run with your copy of the software development kit. Author and Android columnist, writer, developer, and community advocate Mark L. Murphy shows you what you need to know to get started on programming Android applications–everything from crafting graphical user interfaces to using GPS, accessing web services, and more! The Android development platform, created by Google and the Open Handset Alliance, is a platform in its truest sense, encompassing hundreds of classes beyond the traditional Java classes and open source components that ship with the SDK. Some Android books race through the material, trying to cover as much ground as possible in as few pages as possible. Experienced writer and community advocate Mark Murphy shows you how to develop Android applications simply and with care. The book includes dozens of sample projects, ready to run with your copy of the SDK—not just one huge project where you have difficulty finding the specific examples of the technique you are looking for. You can even get these sample programs online at Apress.com.","language":"en","currency":"USD","id":"1430224207","title":"Beginning Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CrzONuZ0YAIC&source=gbs_api","authors":["Mark Murphy"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BGuQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":"Exam Core 1 220-1001 and Exam Core 2 220-1002","description":"A comprehensive step-by-step review for A+ certification, revised for the latest exams The CompTIA A+ Complete Review Guide: Exam 220-1001 and Exam 220-1002, Fourth Edition is an ideal preparation tool to help you ace the exam and get certified. The must-have companion to the CompTIA A+ Complete Study Guide, this book provides a streamlined review of vital exam topics, helping you reinforce comprehension and strengthen retention. Now in its fourth edition, this review guide has been fully updated to focus on the latest best practices and new exam objectives. A clear and concise review structure helps you to focus on problem areas while logically organized topics allow for quick reference and flexible study. Covering both A+ exams, this book covers topics including PC hardware, networking, operating systems and procedures, security, troubleshooting, and more. Access to the Sybex online learning environment includes practice test questions, bonus exams, electronic flashcards, and a searchable glossary of key terms. Organize your exam prep to focus on challenging areas and reinforce your understanding of essential exam objectives. A+ certification is a vital step for careers in information technology, allowing current and prospective computer technicians to validate or recertify their skills. An essential component to any A+ exam strategy, this valuable review will help you: Learn to install and configure modern hardware and peripherals such as network switches, firewalls, and Bluetooth modules Keep updated on current software, including Windows, Linux, and mobile operating systems Integrate exam reviews with other Sybex learning resources to provide a comprehensive study plan The CompTIA A+ Complete Review Guide: Exam 220-1001 and Exam 220-1002, Fourth Edition is an integral part of your overall exam prep strategy, allowing you to focus your study on what matters most.","language":"en","currency":"USD","id":"111951696X","title":"CompTIA A+ Complete Review Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BGuQDwAAQBAJ&source=gbs_api","authors":["Troy McMillan"]},{"pageCount":228,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SD5FDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"14 Complete Projects on Advanced Techniques and Approaches","description":"Choose the best approach for your app and implement your solution quickly by leveraging complete projects. This book is a collection of practical projects that use advanced Android techniques and approaches, written by Android instructor Mark Wickham. Mark has taught a series of popular classes at Android development conferences since 2013 and Practical Android covers content from his most popular classes. Each chapter covers an important concept and provides you with a deep dive into the implementation. The book is an ideal resource for developers who have some development experience, but may not be Android or mobile development experts. Each chapter includes at least one complete project to show the reader how to implement the concepts. What You'll Learn Apply JSON in Android Work with connectivity, which covers all aspects of HTTP in Android Determine if your server is reachable Use lazy loading, a common pattern for most apps and which is not trivial to implement Take advantage of remote crashlogs to implement a solution for your apps so you know when they crash and can provide timely fixes Implement push messaging to take your app to the next level Develop with Android Audio, which provides complete coverage of all the Android audio APIs and synthesis engines Who This Book Is For Those with prior experience with using Android and have a strong Java background.","language":"en","currency":"USD","id":"1484233336","title":"Practical Android","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SD5FDwAAQBAJ&source=gbs_api","authors":["Mark Wickham"]},{"pageCount":396,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FwOkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Improve your Mobile Development with Google’s Latest Open-Source SDK","description":"Explore what Flutter has to offer, where it came from, and where it’s going. Mobile development is progressing at a fast rate and with Flutter – an open-source mobile application development SDK created by Google – you can develop applications for Android and iOS, as well as Google Fuchsia.Learn to create three apps (a personal information manager, a chat system, and a game project) that you can install on your mobile devices and use for real. You will begin by getting a solid foundation of Flutter knowledge, and building on it immediately by constructing two more traditional productivity apps.. You will also learn to create a game, enabling you to see a whole other perspective on what Flutter can do. In addition to building these apps, you'll have the benefit of reviewing real-world issues you might encounter, along with ways to deal with them through tips and tricks, all designed to make your Flutter experience that much more productive and, frankly, fun! Practical Flutter will leave you with a solid grasp of how to build apps with Flutter, and springboard into creating more advanced apps on your own. By the time your journey through this material concludes, another larger one will begin as you springboard, well-prepared, into the larger world of Flutter development, tackling any project that comes your way with aplomb. Practical Flutter is a learning adventure you won't want to miss. What You'll Learn Get a Flutter project started and logically structure it Use the interface elements Flutter provides, such as widgets, controls, and extensions Build layouts using interface elements Use available tooling, specifically Android Studio Leverage server-side development and connect a Flutter app to a server back-end. Who This Book Is For Mobile developers who are looking to build for multiple mobile platforms and trying to do so with a codebase that is largely the same across all. Basic knowledge of iOS and Android generally, and some general programming experience is expected.","language":"en","currency":"USD","id":"1484249720","title":"Practical Flutter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FwOkDwAAQBAJ&source=gbs_api","authors":["Frank Zammetti"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I4knCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Android Fragments is a 100-page quick start accelerated guide to learning and quickly using Android fragments. You'll learn how to code for fragments; deal with config changes; code for regular vs. fragmented dialogs; work with preferences and saving state; work with the compatibility library; and handle advanced async tasks and progress dialogs. After reading and using this book, which is based on material from the best-selling Pro Android, you'll be an Android UI savant. At the very least, your apps' user interfaces and event handling will be more competitive and better performing, especially for tablet-optimized UIs and events.","language":"en","currency":"USD","id":"1484208536","title":"Android Fragments","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I4knCgAAQBAJ&source=gbs_api","authors":["Dave MacLean","Satya Komatineni"]},{"pageCount":752,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z0knCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Pro Android 5 shows you how to build real-world and fun mobile apps using the Android 5 SDK. This book updates the best-selling Pro Android and covers everything from the fundamentals of building apps for smartphones, tablets, and embedded devices to advanced concepts such as custom components, multi-tasking, sensors\/augmented reality, better accessories support and much more. Using the tutorials and expert advice, you'll quickly be able to build cool mobile apps and run them on dozens of Android-based smartphones. You'll explore and use the Android APIs, including those for media and sensors. And you'll check out what's new in Android, including the improved user interface across all Android platforms, integration with services, and more. By reading this definitive tutorial and reference, you'll gain the knowledge and experience to create stunning, cutting-edge Android apps that can make you money, while keeping you agile enough to respond to changes in the future.","language":"en","currency":"USD","id":"1430246812","title":"Pro Android 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z0knCgAAQBAJ&source=gbs_api","authors":["Dave MacLean","Satya Komatineni","Grant Allen"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t9FtDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Plan, design, and build engaging user interfaces for your Android applications About This Book Take an initial idea for an Android app and develop it into a detailed plan, supported by sketches and wireframes Provide a better experience for your users by following best practices and the new material design principles Work more efficiently and save time by testing your ideas at an early stage by building a prototype Who This Book Is For If you are a Java developer with a keen interest in building stunning UIs for your applications in order to retain customers and create great experiences for them, then this book is for you. A good knowledge level of HTML, CSS, and some grounding in Android Development is assumed. What You Will Learn Develop a user interface that adheres to all the core material design principles Transform your initial app idea into a concrete and detailed plan Add Views, ViewGroups, layouts, and common UI components to your own Android projects Use fragments and various strategies to gather user input Create a new Android Studio project and develop it into a prototype Identify and solve problems with your app's UI to deliver a better user experience Start getting to grips with the new UI features coming up in Android N, including multi-window mode and direct reply notifications In Detail Great design is one of the key drivers in the adoption of new applications, yet unfortunately design considerations are often neglected in the face of “will it work,” “can we make it quicker,” or “can we get more people using it”? This book seeks to redress this balance by showing you how to get your PM to start treating the design phase of your project seriously. This book is focused entirely on the development of UI features, and you'll be able to practically implementing the design practices that we extol throughout the book. Starting by briefly outlining some of the factors you need to keep in mind when building a UI, you'll learn the concepts of Android User Interface from scratch. We then move on to formulate a plan on how to implement these concepts in various applications. We will deep dive into how UI features are implemented in real-world applications where UIs are complex and dynamic. This book offers near complete coverage of UI-specific content including, views, fragments, the wireframing process, and how to add in splash screens—everything you need to make professional standard UIs for modern applications. It will then cover material design and show you how to implement Google's design aesthetic in a practical manner. Finally, it ensures the best possible user experience by analyzing the UI using various tools, and then addressing any problems they uncover. By the end of the book, you'll be able to leverage the concepts of Android User Interface in your applications in order to attract new customers. Style and approach This book follows a comprehensive approach that focuses on the concepts of UI from scratch. The book ends with teaching Android developers on how to optimize their UI, best practices and securing applications.","language":"en","currency":"USD","id":"1785888625","title":"Android UI Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t9FtDQAAQBAJ&source=gbs_api","authors":["Jessica Thornsby"]},{"pageCount":121,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WZheAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":35,"subtitle":null,"description":"Human computation is a new and evolving research area that centers around harnessing human intelligence to solve computational problems that are beyond the scope of existing Artificial Intelligence (AI) algorithms. With the growth of the Web, human computation systems can now leverage the abilities of an unprecedented number of people via the Web to perform complex computation. There are various genres of human computation applications that exist today. Games with a purpose (e.g., the ESP Game) specifically target online gamers who generate useful data (e.g., image tags) while playing an enjoyable game. Crowdsourcing marketplaces (e.g., Amazon Mechanical Turk) are human computation systems that coordinate workers to perform tasks in exchange for monetary rewards. In identity verification tasks, users perform computation in order to gain access to some online content; an example is reCAPTCHA, which leverages millions of users who solve CAPTCHAs every day to correct words in books that optical character recognition (OCR) programs fail to recognize with certainty. This book is aimed at achieving four goals: (1) defining human computation as a research area; (2) providing a comprehensive review of existing work; (3) drawing connections to a wide variety of disciplines, including AI, Machine Learning, HCI, Mechanism\/Market Design and Psychology, and capturing their unique perspectives on the core research questions in human computation; and (4) suggesting promising research directions for the future. Table of Contents: Introduction \/ Human Computation Algorithms \/ Aggregating Outputs \/ Task Routing \/ Understanding Workers and Requesters \/ The Art of Asking Questions \/ The Future of Human Computation","language":"en","currency":"USD","id":"1608455173","title":"Human Computation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WZheAQAAQBAJ&source=gbs_api","authors":["Edith Law","Luis von Ahn"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a52BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build performant and concurrent Unix and Linux systems with C++17","description":"A hands-on guide to making system programming with C++ easy Key Features Write system-level code leveraging C++17 Learn the internals of the Linux Application Binary Interface (ABI) and apply it to system programming Explore C++ concurrency to take advantage of server-level constructs Book Description C++ is a general-purpose programming language with a bias toward system programming as it provides ready access to hardware-level resources, efficient compilation, and a versatile approach to higher-level abstractions. This book will help you understand the benefits of system programming with C++17. You will gain a firm understanding of various C, C++, and POSIX standards, as well as their respective system types for both C++ and POSIX. After a brief refresher on C++, Resource Acquisition Is Initialization (RAII), and the new C++ Guideline Support Library (GSL), you will learn to program Linux and Unix systems along with process management. As you progress through the chapters, you will become acquainted with C++'s support for IO. You will then study various memory management methods, including a chapter on allocators and how they benefit system programming. You will also explore how to program file input and output and learn about POSIX sockets. This book will help you get to grips with safely setting up a UDP and TCP server\/client. Finally, you will be guided through Unix time interfaces, multithreading, and error handling with C++ exceptions. By the end of this book, you will be comfortable with using C++ to program high-quality systems. What you will learn Understand the benefits of using C++ for system programming Program Linux\/Unix systems using C++ Discover the advantages of Resource Acquisition Is Initialization (RAII) Program both console and file input and output Uncover the POSIX socket APIs and understand how to program them Explore advanced system programming topics, such as C++ allocators Use POSIX and C++ threads to program concurrent systems Grasp how C++ can be used to create performant system applications Who this book is for If you are a fresh developer with intermediate knowledge of C++ but little or no knowledge of Unix and Linux system programming, this book will help you learn system programming with C++ in a practical way.","language":"en","currency":"USD","id":"1789131774","title":"Hands-On System Programming with C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a52BDwAAQBAJ&source=gbs_api","authors":["Dr. Rian Quinn"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H6a-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Perform powerful penetration testing using Kali Linux, Metasploit, Nessus, Nmap, and Wireshark","description":"Explore the latest ethical hacking tools and techniques in Kali Linux 2019 to perform penetration testing from scratch Key Features Get up and running with Kali Linux 2019.2 Gain comprehensive insights into security concepts such as social engineering, wireless network exploitation, and web application attacks Learn to use Linux commands in the way ethical hackers do to gain control of your environment Book Description The current rise in hacking and security breaches makes it more important than ever to effectively pentest your environment, ensuring endpoint protection. This book will take you through the latest version of Kali Linux and help you use various tools and techniques to efficiently deal with crucial security aspects. Through real-world examples, you’ll understand how to set up a lab and later explore core penetration testing concepts. Throughout the course of this book, you’ll get up to speed with gathering sensitive information and even discover different vulnerability assessment tools bundled in Kali Linux 2019. In later chapters, you’ll gain insights into concepts such as social engineering, attacking wireless networks, exploitation of web applications and remote access connections to further build on your pentesting skills. You’ll also focus on techniques such as bypassing controls, attacking the end user and maintaining persistence access through social media. Finally, this pentesting book covers best practices for performing complex penetration testing techniques in a highly secured environment. By the end of this book, you’ll be able to use Kali Linux to detect vulnerabilities and secure your system by applying penetration testing techniques of varying complexity. What you will learn Explore the fundamentals of ethical hacking Learn how to install and configure Kali Linux Get up to speed with performing wireless network pentesting Gain insights into passive and active information gathering Understand web application pentesting Decode WEP, WPA, and WPA2 encryptions using a variety of methods, such as the fake authentication attack, the ARP request replay attack, and the dictionary attack Who this book is for If you are an IT security professional or a security consultant who wants to get started with penetration testing using Kali Linux 2019.2, then this book is for you. The book will also help if you’re simply looking to learn more about ethical hacking and various security breaches. Although prior knowledge of Kali Linux is not necessary, some understanding of cybersecurity will be useful.","language":"en","currency":"USD","id":"1789612624","title":"Learn Kali Linux 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H6a-DwAAQBAJ&source=gbs_api","authors":["Glen D. Singh"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Modern web development using React 16, Node, Express, and MongoDB","description":"Unleash the power of MERN stack by building diverse web applications using React, Node.js, Express, and MongoDB Key Features Create dynamic web applications with the MERN stack Leverage the power of React in building interactive and complex user interfaces Unlock the potential of Node, Express, and MongoDB to build modern full-stack applications Book Description The benefits of using a full JavaScript stack for web development are undeniable, especially when robust and widely adopted technologies such as React, Node, and Express and are available. Combining the power of React with industry-tested, server-side technologies, such as Node, Express, and MongoDB, creates a diverse array of possibilities when developing real-world web applications. This book guides you through preparing the development environment for MERN stack-based web development, to creating a basic skeleton application and extending it to build four different web applications. These applications include a social media, an online marketplace, a media streaming, and a web-based game application with virtual reality features. While learning to set up the stack and developing a diverse range of applications with this book, you will grasp the inner workings of the MERN stack, extend its capabilities for complex features, and gain actionable knowledge of how to prepare MERN-based applications to meet the growing demands of real-world web applications. What you will learn Set up your development environment and develop a MERN application Implement user authentication and authorization using JSON Web Tokens Build a social media application by extending the basic MERN application Create an online marketplace application with shopping cart and Stripe payments Develop a media streaming application using MongoDB GridFS Implement server-side rendering with data to improve SEO Set up and use React 360 to develop user interfaces with VR capabilities Learn industry best practices to make MERN stack applications reliable and scalable Who this book is for Full-Stack React Web Development Projects is for JavaScript developers who have some experience with React, but no previous experience with full-stack development involving Node, Express, and MongoDB, and who want practical guidelines to start building different types of real-world web applications with this stack.","language":"en","currency":"USD","id":"1788832949","title":"Full-Stack React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anteDwAAQBAJ&source=gbs_api","authors":["Shama Hoque"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bPJnCEC0JkIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Eclipse is the most adopted integrated development environment (IDE) for Java programmers. And, now, Eclipse seems to be the preferred IDE for Android apps developers. Android Apps with Eclipse provides a detailed overview of Eclipse, including steps and the screenshots to help Android developers to quickly get up to speed on Eclipse and to streamline their day-to-day software development. This book includes the following: Overview of Eclipse fundamentals for both Java and C\/C++ Development. Using Eclipse Android Development Toolkit (ADT) to develop, debug, and troubleshoot Android applications. Using Eclipse C\/C++ Development Toolkit (CDT) in conjunction with Android Native Development Kit (NDK) to integrate, develop and troubleshoot native Android components through Eclipse.","language":"en","currency":"USD","id":"1430244356","title":"Android Apps with Eclipse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bPJnCEC0JkIC&source=gbs_api","authors":["Onur Cinar"]},{"pageCount":532,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The truth about DevOps by the people on the front line","description":"Discover DevOps secrets from leading experts. Viktor Farcic interviews DevOps industries voices including Mike Kail, Greg Bledsoe, Jeff Sussna, James Turnbull, Kohsuke Kawaguchi, Liz Keogh, and more. Key Features Leading DevOps experts share their insights into modern DevOps practice Engage with the real-world challenges of putting DevOps to work Strengthen your DevOps practices now and prepare for future DevOps trends Book Description DevOps promises to break down silos, uniting organizations to deliver high quality output in a cross-functional way. In reality it often results in confusion and new silos: pockets of DevOps practitioners fight the status quo, senior decision-makers demand DevOps paint jobs without committing to true change. Even a clear definition of what DevOps is remains elusive. In DevOps Paradox, top DevOps consultants, industry leaders, and founders reveal their own approaches to all aspects of DevOps implementation and operation. Surround yourself with expert DevOps advisors. Viktor Farcic draws on experts from across the industry to discuss how to introduce DevOps to chaotic organizations, align incentives between teams, and make use of the latest tools and techniques. With each expert offering their own opinions on what DevOps is and how to make it work, you will be able to form your own informed view of the importance and value of DevOps as we enter a new decade. If you want to see how real DevOps experts address the challenges and resolve the paradoxes, this book is for you. What you will learn Expert opinions on: Introducing DevOps into real-world, chaotic business environments Deciding between adopting cutting edge tools or sticking with tried-and-tested methods Initiating necessary business change without positional power Managing and overcoming fear of change in DevOps implementations Anticipating future trends in DevOps and how to prepare for them Getting the most from Kubernetes, Docker, Puppet, Chef, and Ansible Creating the right incentives for DevOps success across an organization The impact of new techniques, such as Lambda, serverless, and schedulers, on DevOps practice Who this book is for Anybody interested in DevOps will gain a lot from this book. If you want to get beyond the simplistic ideals and engage with the deep challenges of putting DevOps to work in the real world, this book is for you.","language":"en","currency":"USD","id":"1789138809","title":"DevOps Paradox","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6isDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WI2eIsbcKUAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is written in a Cookbook style, beginning with recipes which focus on helping developers make their software\/application available in Android.Android developers who want to learn Android NDK programming, or develop multimedia and games in Android NDK will benefit from this book","language":"en","currency":"USD","id":"1849691517","title":"Android Native Development Kit Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WI2eIsbcKUAC&source=gbs_api","authors":["Feipeng Liu"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GHxZDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Covering Android 7","description":"Get your first Android apps up and running with the help of plain English and practical examples. If you have a great idea for an Android app, but have never programmed before, then this book is for you. Android Apps for Absolute Beginners cuts through the fog of jargon and mystery that surrounds Android app development, and gives you simple, step-by-step instructions to get you started. This book teaches Android application development in language anyone can understand, giving you the best possible start in Android development. It provides clean, straightforward examples that make learning easy, allowing you to pick up the concepts without fuss. It offers clear code descriptions and layout so that you can get your apps running as soon as possible Although this book covers what's new in Android 7, it is also backwards compatible to cover some of the previous Android releases. What You'll Learn Download, install, and configure the latest software needed for Android app development Work efficiently using an integrated development environment (IDE) Build useful, attractive applications and get them working immediately Create apps with ease using XML markup and drag-and-drop graphical layout editors Use new media and graphics to skin your app so that it has maximum appeal Create advanced apps combining XML, Java and new media content Who This Book Is For If you have a great idea for an Android app, but have never programmed before, then this book is for you. You don’t need to have any previous computer programming skills — as long as you have a desire to learn and you know which end of the mouse is which, the world of Android apps development awaits.","language":"en","currency":"USD","id":"1484222687","title":"Android Apps for Absolute Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GHxZDgAAQBAJ&source=gbs_api","authors":["Wallace Jackson"]},{"pageCount":430,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z82qDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get up to date with the finer points of Ubuntu Server using this comprehensive guide About This Book Get well-versed with newly-added features in Ubuntu 16.04 Master the art of installing, managing, and troubleshooting Ubuntu Server A practical easy-to-understand book that will help you enhance your existing skills. Who This Book Is For This book is intended for readers with intermediate or advanced-beginner skills with Linux, who would like to learn all about setting up servers with Ubuntu Server. This book assumes that the reader knows the basics of Linux, such as editing configuration files and running basic commands. What You Will Learn Learn how to manage users, groups, and permissions Encrypt and decrypt disks with Linux Unified Key Setup \/Luks Setup SSH for remote access, and connect it to other nodes Understand how to add, remove, and search for packages Use NFS and Samba to share directories with other users Get to know techniques for managing Apache and MariaDB Explore best practices and troubleshooting techniques In Detail Ubuntu is a Debian-based Linux operating system, and has various versions targeted at servers, desktops, phones, tablets and televisions. The Ubuntu Server Edition, also called Ubuntu Server, offers support for several common configurations, and also simplifies common Linux server deployment processes. With this book as their guide, readers will be able to configure and deploy Ubuntu Servers using Ubuntu Server 16.04, with all the skills necessary to manage real servers. The book begins with the concept of user management, group management, as well as file-system permissions. To manage your storage on Ubuntu Server systems, you will learn how to add and format storage and view disk usage. Later, you will also learn how to configure network interfaces, manage IP addresses, deploy Network Manager in order to connect to networks, and manage network interfaces. Furthermore, you will understand how to start and stop services so that you can manage running processes on Linux servers. The book will then demonstrate how to access and share files to or from Ubuntu Servers. You will learn how to create and manage databases using MariaDB and share web content with Apache. To virtualize hosts and applications, you will be shown how to set up KVM\/Qemu and Docker and manage virtual machines with virt-manager. Lastly, you will explore best practices and troubleshooting techniques when working with Ubuntu Servers. By the end of the book, you will be an expert Ubuntu Server user well-versed in its advanced concepts. Style and Approach This book is an advanced guide that will show readers how to administer, manage, and deploy Ubuntu server and will also provide expert-level knowledge on advanced security and backup techniques.","language":"en","currency":"USD","id":"1785287133","title":"Mastering Ubuntu Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z82qDQAAQBAJ&source=gbs_api","authors":["Jay LaCroix"]},{"pageCount":982,"thumbnail":"http:\/\/books.google.com\/books\/content?id=01NxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Practical Spring and Spring Boot solutions for building effective applications","description":"An end-to-end software development guide for the Java eco-system using the most advanced frameworks: Spring and Spring Boot. Learn the complete workflow by building projects and solving problems. About This Book Learn reactive programming by implementing a reactive application with Spring WebFlux Create a robust and scalable messaging application with Spring messaging support Get up-to-date with the defining characteristics of Spring Boot 2.0 in Spring Framework 5 Learn about developer tools, AMQP messaging, WebSockets, security, MongoDB data access, REST, and more This collection of effective recipes serves as guidelines for Spring Boot application development Who This Book Is For Java developers wanting to build production-grade applications using the newest popular Spring tools for a rich end-to-end application development experience. What You Will Learn Get to know the Spring Boot and understand how it makes creating robust applications extremely simple Understand how Spring Data helps us add persistence in MongoDB and SQL databases Implement a websocket to add interactive behaviors in your applications Create powerful, production-grade applications and services with minimal fuss Use custom metrics to track the number of messages published and consumed Build anything from lightweight unit tests to fully running embedded web container integration tests Learn effective testing techniques by integrating Cucumber and Spock Use Hashicorp Consul and Netflix Eureka for dynamic Service Discovery In Detail Spring Framework has become the most popular framework for Java development. It not only simplifies software development but also improves developer productivity. This book covers effective ways to develop robust applications in Java using Spring. The course is up made of three modules, each one having a take-away relating to building end-to-end java applications. The first module takes the approach of learning Spring frameworks by building applications.You will learn to build APIs and integrate them with popular fraemworks suh as AngularJS, Spring WebFlux, and Spring Data. You will also learn to build microservices using Spring's support for Kotlin. You will learn about the Reactive paradigm in the Spring architecture using Project Reactor. In the second module, after getting hands-on with Spring, you will learn about the most popular tool in the Spring ecosystem-Spring Boot. You will learn to build applications with Spring Boot, bundle them, and deploy them on the cloud. After learning to build applications with Spring Boot, you will be able to use various tests that are an important part of application development. We also cover the important developer tools such as AMQP messaging, websockets, security, and more. This will give you a good functional understanding of scalable development in the Spring ecosystem with Spring Boot. In the third and final module, you will tackle the most important challenges in Java application development with Spring Boot using practical recipes. Including recipes for testing, deployment, monitoring, and securing your applications. This module will also address the functional and technical requirements for building enterprise applications. By the end of the course you will be comfortable with using Spring and Spring Boot to develop Java applications and will have mastered the intricacies of production-grade applications. Style and approach A simple step-by-step guide with practical examples to help you develop and deploy Spring and Spring Boot applications in the real-world.","language":"en","currency":"USD","id":"1789539137","title":"Developing Java Applications with Spring and Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=01NxDwAAQBAJ&source=gbs_api","authors":["Claudio Eduardo de Oliveira","Greg L. Turnquist","Alex Antonov"]},{"pageCount":225,"thumbnail":"http:\/\/books.google.com\/books\/content?id=enc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Make the most of asynchronous android programming About This Book Install and set up RxJava for Android development Implement the Reactive paradigm for Android programming using RxJava Create cutting edge real world Android apps with Reactive programming. Who This Book Is For Are you an android developer trying to figure out how to use reactive paradigm for your programming needs? If yes then this is the book for you. No previous knowledge of RxJava is required. What You Will Learn Set up an environment for asynchronous that is reactive Android programming Write custom observables and higher level abstractions Orchestrating multiple calls using Reactive programming principles Fetch remote financial data using RxJava Integrate and process Twitter streams gracefully Utilize Reactive programming to develop interactive and responsive Android apps Create your own application to follow financial stock updates in real-time based on selected companies' symbols Integrate updates from the Twitter for those companies. In Detail Writing code on Android is hard. Writing a high quality code that involves concurrent and parallel tasks is even harder. Ensuring that this code will run without unforeseen race conditions is an the order of magnitude harder. RxJava is the tool that can help write code for such tasks. In this book a novice developer will be introduced to a wide variety of tools that RxJava provides to enable them to produce robust and high-quality code for their asynchronous tasks by building a relatively simple(and high quality) application using advanced RxJava techniques to produce a high quality product. Part 1 of the book will lead the developer through RxJava's initial setup in Android environment. In Part 2, the reader will learn RxJava 2.0 step-by-step by starting off with stock data processing and display.The developer will learn to choose appropriate Schedulers and to use Retrofit library for remote requests.In Part 3, the reader will also learn advanced topics such as adding integration to Twitter to process its streaming data by combining it with stock data. Style and approach This book is a step by step practical guide which will essentially teach you to set up, implement, and debug Reactive Android Code with ease.","language":"en","currency":"USD","id":"1787281469","title":"Reactive Android Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=enc5DwAAQBAJ&source=gbs_api","authors":["Tadas Subonis"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mWXDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":null,"description":"Arguably one of the most highly regarded and widely used enterprise level operating systems available today is the CentOS 8 distribution. Not only is it considered to be among the most stable and reliable operating systems, it is also backed by the considerable resources and technical skills of Red Hat, Inc. CentOS 8 Essentials is designed to provide detailed information on the installation, use and administration of the CentOS 8 distribution. For beginners, the book covers topics such as operating system installation, the basics of the GNOME desktop environment, configuring email and web servers and installing packages and system updates using App Streams. Additional installation topics such as dual booting with Microsoft Windows are also covered, together with all important security topics such as configuring a firewall and user and group administration. For the experienced user, topics such as remote desktop access, the Cockpit web interface, logical volume management (LVM), disk partitioning, swap management, KVM virtualization, Secure Shell (SSH), Linux Containers and file sharing using both Samba and NFS are covered in detail to provide a thorough overview of this enterprise class operating system.","language":"en","currency":"USD","id":"1951442083","title":"CentOS 8 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mWXDDwAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xNRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The easiest way to build Python RESTful APIs and web services with Django","description":"Design, build and test RESTful web services with the Django framework and Python Key Features Create efficient real-world RESTful web services with the latest Django framework Authenticate, secure, and integrate third-party packages efficiently in your Web Services Leverage the power of Python for faster Web Service development Book Description Django is a Python web framework that makes the web development process very easy. It reduces the amount of trivial code, which simplifies the creation of web applications and results in faster development. It is very powerful and a great choice for creating RESTful web services. If you are a Python developer and want to efficiently create RESTful web services with Django for your apps, then this is the right book for you. The book starts off by showing you how to install and configure the environment, required software, and tools to create RESTful web services with Django and the Django REST framework. We then move on to working with advanced serialization and migrations to interact with SQLite and non-SQL data sources. We will use the features included in the Django REST framework to improve our simple web service. Further, we will create API views to process diverse HTTP requests on objects, go through relationships and hyperlinked API management, and then discover the necessary steps to include security and permissions related to data models and APIs. We will also apply throttling rules and run tests to check that versioning works as expected. Next we will run automated tests to improve code coverage. By the end of the book, you will be able to build RESTful web services with Django. What you will learn The best way to build a RESTful Web Service or API with Django and the Django REST Framework Develop complex RESTful APIs from scratch with Django and the Django REST Framework Work with either SQL or NoSQL data sources Design RESTful Web Services based on application requirements Use third-party packages and extensions to perform common tasks Create automated tests for RESTful web services Debug, test, and profile RESTful web services with Django and the Django REST Framework Who this book is for This book is for Python developers who want to create RESTful web services with Django; you need to have a basic working knowledge of Django but no previous experience with RESTful web services is required.","language":"en","currency":"USD","id":"1788835573","title":"Django RESTful Web Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xNRJDwAAQBAJ&source=gbs_api","authors":["Gaston C. Hillar"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FhlKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Efficiently secure critical infrastructure systems","description":"Your one-step guide to understanding industrial cyber security, its control systems, and its operations. About This Book Learn about endpoint protection such as anti-malware implementation, updating, monitoring, and sanitizing user workloads and mobile devices Filled with practical examples to help you secure critical infrastructure systems efficiently A step-by-step guide that will teach you the techniques and methodologies of building robust infrastructure systems Who This Book Is For If you are a security professional and want to ensure a robust environment for critical infrastructure systems, this book is for you. IT professionals interested in getting into the cyber security domain or who are looking at gaining industrial cyber security certifications will also find this book useful. What You Will Learn Understand industrial cybersecurity, its control systems and operations Design security-oriented architectures, network segmentation, and security support services Configure event monitoring systems, anti-malware applications, and endpoint security Gain knowledge of ICS risks, threat detection, and access management Learn about patch management and life cycle management Secure your industrial control systems from design through retirement In Detail With industries expanding, cyber attacks have increased significantly. Understanding your control system's vulnerabilities and learning techniques to defend critical infrastructure systems from cyber threats is increasingly important. With the help of real-world use cases, this book will teach you the methodologies and security measures necessary to protect critical infrastructure systems and will get you up to speed with identifying unique challenges.Industrial cybersecurity begins by introducing Industrial Control System (ICS) technology, including ICS architectures, communication media, and protocols. This is followed by a presentation on ICS (in) security. After presenting an ICS-related attack scenario, securing of the ICS is discussed, including topics such as network segmentation, defense-in-depth strategies, and protective solutions. Along with practical examples for protecting industrial control systems, this book details security assessments, risk management, and security program development. It also covers essential cybersecurity aspects, such as threat detection and access management. Topics related to endpoint hardening such as monitoring, updating, and anti-malware implementations are also discussed. Style and approach A step-by-step guide to implement Industrial Cyber Security effectively.","language":"en","currency":"USD","id":"1788395980","title":"Industrial Cybersecurity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FhlKDwAAQBAJ&source=gbs_api","authors":["Pascal Ackerman"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qiGJefOjM-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Written in a friendly, recipe-based style, this practical cookbook will show you how to create, maintain and customize attractive eCommerce solutions with ease.This book is written for anyone who is interested in building eCommerce solutions with VirtueMart. If you have little to no experience with eCommerce this book will show you how to overcome any problem no matter how complex it appears. Experienced site builders and administrators will also find the solutions this cookbook offers useful. Basic HTML and CSS would be beneficial.","language":"en","currency":"USD","id":"1782162097","title":"Building E-Commerce Sites with Virtuemart Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qiGJefOjM-wC&source=gbs_api","authors":["John Horton"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vNLIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Learn Advance Concepts, Patterns, Best Practices, NFRs, Frameworks, Tools and DevOps","description":"Gold mine of microservices interview Questions & Answers for aspirants and domain experts. DESCRIPTION An SME typically attends several interviews and discussions for jobs or projects during his or her career. There is always a dire need to look up and read multiple books and references before these interviews\/discussions so that you stay on top of things. This book will assist software engineers, programmer analysts, designers, consultants, technical, and solution, domain, and enterprise architects to perform well in microservices interview discussions and to launch a successful career. This book also tackles the NFR domain, which is the key aspect to be addressed while creating microservices applications. This book will also assist SMEs to become competent in their respective areas. Usually, it takes a good amount of time to understand the core concepts, fundamentals, patterns, and principles but this book is a gold mine of topics that are typically discussed during a microservices interview. The book is an honest attempt to share with practitioners, SMEs, and aspirants my experiences, learning, insights and proven methodologies that will benefit them in the long run. Interviewers will also be able to leverage this book to make sure they hire candidates with the right competencies depending on the job requirements. The primary audiences for this title are the gamut of roles starting from IT consultants, Programmer Analysts, Software Engineers, Solution Architects, and Interview Panelists who support strategic and tactical engagements for Fortune 100 customers worldwide. This title is for SMEs with background and competencies in architecture, design, and development of microservices-based applications and people who would like to gain advanced and next-level skills. The book provides a comprehensive approach for preparing for job interviews. It covers all key domains including, Core & Advance Concepts, Patterns, Frameworks & Tools, and DevOps. KEY FEATURES ● More than 200 questions in 5 domains including a chapter on patterns, practices, and NFRs. ● Extended coverage from architecture, design, development to NFRs domains. ● The book can be selectively read based on the relevant domains. ● Extensive coverage in terms of depth and breadth of domains. ● The title has more than 50 diagrams depicting various scenarios, models, and methodologies. WHAT WILL YOU LEARN ● Concepts, principles, and guidelines for various domains for the microservices ecosystem. ● This book presents an exhaustive question bank with special emphasis on practical scenarios and business cases. ● Based on our experience, we assure that at least 80% of the contents will be discussed during a typical interview. ● Common pitfalls to be avoided and patterns to leverage ● Frameworks, methodologies, and design approach leveraged for microservices topologies ● Design guidelines used for architecting microservices applications & systems ● Provides a holistic view of key concepts, design principles, and patterns related to evangelizing microservices applications ● Leverage the book as a reference guide for adopting best practices, standards, and design guidelines ● Extensive coverage in terms of depth and breadth of domains. The book can also be read selectively as per the choice of domain. ● This book has more than two hundred questions in five domains and around 50 depictions. WHO THIS BOOK IS FOR This books is for Enterprise Architects, Solution Architects, and Technical Architects\/Designers, Project Managers, Programmer Analysts and Software Engineers, Students and Interview Panelists TABLE OF CONTENTS 1. Introduction 2. Core Concepts 3. Advance Concepts 4. Patterns, Practices and NFRs 5. Tools and Frameworks 6. DevOps","language":"en","currency":"USD","id":"819433442X","title":"Cracking Microservices Interview","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vNLIDwAAQBAJ&source=gbs_api","authors":["Sameer Paradkar"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gcfgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Single Board Computer Development for Raspberry Pi and Mobile Devices","description":"Mastering ARM hardware architecture opens a world of programming for nearly all phones and tablets including the iPhone\/iPad and most Android phones. It’s also the heart of many single board computers like the Raspberry Pi. Gain the skills required to dive into the fundamentals of the ARM hardware architecture with this book and start your own projects while you develop a working knowledge of assembly language for the ARM 64-bit processor. You'll review assembly language programming for the ARM Processor in 64-bit mode and write programs for a number of single board computers, including the Nvidia Jetson Nano and the Raspberry Pi (running 64-bit Linux). The book also discusses how to target assembly language programs for Apple iPhones and iPads along with 64-Bit ARM based Android phones and tablets. It covers all the tools you require, the basics of the ARM hardware architecture, all the groups of ARM 64-Bit Assembly instructions, and how data is stored in the computer’s memory. In addition, interface apps to hardware such as the Raspberry Pi’s GPIO ports. The book covers code optimization, as well as how to inter-operate with C and Python code. Readers will develop enough background to use the official ARM reference documentation for their own projects. With Programming with 64-Bit ARM Assembly Language as your guide you’ll study how to read, reverse engineer and hack machine code, then be able to apply these new skills to study code examples and take control of both your ARM devices’ hardware and software. What You'll Learn Make operating system calls from assembly language and include other software libraries in your projects Interface apps to hardware devices such as the Raspberry Pi GPIO ports Reverse engineer and hack code Use the official ARM reference documentation for your own projects Who This Book Is For Software developers who have already learned to program in a higher-level language like Python, Java, C#, or even C and now wish to learn Assembly programming.","language":"en","currency":"USD","id":"1484258819","title":"Programming with 64-Bit ARM Assembly Language","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gcfgDwAAQBAJ&source=gbs_api","authors":["Stephen Smith"]},{"pageCount":120,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MZOkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"The book follows a tutorial-based approach and will teach you how to work with JSON tools, design JSON objects, and how to use different techniques to handle JSON data.This book is a great resource for developers who would like to learn more about JSON and who wish to apply it in their own projects. It will be useful to have some prior knowledge of HTML and JavaScript to help you understand the concepts covered in this book. Some familiarity with a server-side language such as PHP, C#, or Python would also be beneficial, but this is not compulsory.","language":"en","currency":"USD","id":"1783286040","title":"JavaScript and JSON Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MZOkAQAAQBAJ&source=gbs_api","authors":["Sai Srinivas Sriparasa"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y1qWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A guide to developing efficient and elegant T-SQL code","description":"Troubleshoot query performance issues, identify anti-patterns in code, and write efficient T-SQL queries Key Features Discover T-SQL functionalities and services that help you interact with relational databases Understand the roles, tasks and responsibilities of a T-SQL developer Explore solutions for carrying out database querying tasks, database administration, and troubleshooting Book Description Transact-SQL (T-SQL) is Microsoft's proprietary extension to the SQL language that is used with Microsoft SQL Server and Azure SQL Database. This book will be a useful guide to learning the art of writing efficient T-SQL code in modern SQL Server versions, as well as the Azure SQL Database. The book will get you started with query processing fundamentals to help you write powerful, performant T-SQL queries. You will then focus on query execution plans and learn how to leverage them for troubleshooting. In the later chapters, you will learn how to identify various T-SQL patterns and anti-patterns. This will help you analyze execution plans to gain insights into current performance, and determine whether or not a query is scalable. You will also learn to build diagnostic queries using dynamic management views (DMVs) and dynamic management functions (DMFs) to address various challenges in T-SQL execution. Next, you will study how to leverage the built-in tools of SQL Server to shorten the time taken to address query performance and scalability issues. In the concluding chapters, the book will guide you through implementing various features, such as Extended Events, Query Store, and Query Tuning Assistant using hands-on examples. By the end of this book, you will have the skills to determine query performance bottlenecks, avoid pitfalls, and discover the anti-patterns in use. Foreword by Conor Cunningham, Partner Architect – SQL Server and Azure SQL – Microsoft What you will learn Use Query Store to understand and easily change query performance Recognize and eliminate bottlenecks that lead to slow performance Deploy quick fixes and long-term solutions to improve query performance Implement best practices to minimize performance risk using T-SQL Achieve optimal performance by ensuring careful query and index design Use the latest performance optimization features in SQL Server 2017 and SQL Server 2019 Protect query performance during upgrades to newer versions of SQL Server Who this book is for This book is for database administrators, database developers, data analysts, data scientists, and T-SQL practitioners who want to get started with writing T-SQL code and troubleshooting query performance issues, through the help of practical examples. Previous knowledge of T-SQL querying is not required to get started on this book.","language":"en","currency":"USD","id":"178934297X","title":"Learn T-SQL Querying","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y1qWDwAAQBAJ&source=gbs_api","authors":["Pedro Lopes","Pam Lahoud"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3rLqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.2,"subtitle":"Per Anhalter durchs Code-Universum","description":"Als Reaktion auf neue Anforderungen und veränderte Hardware entstanden in den vergangenen Jahren viele neue Programmiersprachen, darunter solche wie Kotlin als neue Sprache für die Java Virtual Machine, Swift zur Programmierung von iOS- und macOS-Anwendungen, die C-Nachfolger Go und D oder die JavaScript-Weiterentwicklung TypeScript. Das iX Special 2020 stellt die Merkmale der Sprachen vor und zeigt, wie sie beispielsweise mit Nebenläufigkeit umgehen. Anhand ausgewählter Projekte und Bibliotheken sowie Interviews werden Themen wie Programmierparadigmen und Typsicherheit der Sprachen beleuchtet. Die C-Nachfolger Moderne Sprachen für die JVM und das Web JavaScript-Alternativen Funktionale Sprachen Zielgruppe: Softwareentwickler, Projektleiter, Softwarearchitekten","language":"de","currency":"USD","id":"3957882699","title":"iX Special Moderne Programmiersprachen","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3rLqDwAAQBAJ&source=gbs_api","authors":["iX - Redaktion"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHg5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Become a developer superhero and build stunning cross-platform apps with Delphi About This Book A one-stop guide on Delphi to help you build cross-platform apps This book covers important concepts such as the FireMonkey library, shows you how to interact with the Internet of Things, and enables you to integrate with Cloud services The code is explained in detail with observations on how to create native apps for Ios and Android with a single code base Who This Book Is For If you want to create stunning applications for mobile, desktop, the cloud, and the Internet of Things, then this book is for you. This book is for developers who would like to build native cross-platform apps with a single codebase for iOS and Android. A basic knowledge of Delphi is assumed, although we do cover a primer on the language. What You Will Learn Understand the basics of Delphi and the FireMonkey application platform as well as the specifics of Android and iOS platforms Complete complex apps quickly with access to platform features and APIs using a single, easy-to-maintain code base Work with local data sources, including embedded SQL databases, REST servers, and Backend-as-a-Service providers Take full advantage of mobile hardware capabilities by working with sensors and Internet of Things gadgets and devices Integrate with cloud services and data using REST APIs and scalable multi-tier frameworks for outstanding multi-user and social experience Architect and deploy powerful mobile back-end services and get super-productive by leveraging Delphi IDE agile functionality Get to know the best practices for writing a high-quality, reliable, and maintainable codebase in the Delphi Object Pascal language In Detail Delphi is the most powerful Object Pascal IDE and component library for cross-platform native app development. It enables building natively compiled, blazingly fast apps for all major platforms including Android, iOS, Windows, Mac, and Linux. If you want to build server-side applications, create web services, and have clear GUIs for your project, then this book is for you. The book begins with a basic primer on Delphi helping you get accustomed to the IDE and the Object Pascal language and will then quickly move on to advanced-level concepts. Through this book, we'll help you understand the architecture of applications and will teach you the important concepts of the FireMonkey library, show you how to build server-side services, and enable you to interact with the Internet of Things. Towards the end, you will learn to integrate your app with various web services and deploy them. By the end of the book, you will be able to build powerful, cross-platform, native apps for iOS and Android with a single code base. Style and approach This book will help you build cross-platform mobile apps with Delphi using a step-by-step approach.","language":"en","currency":"USD","id":"1786465841","title":"Expert Delphi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHg5DwAAQBAJ&source=gbs_api","authors":["Pawel Glowacki"]},{"pageCount":251,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SS7dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.85,"subtitle":null,"description":"Meningkatnya permintaan pelanggan dalam pengiriman barang, membuat perusahaan dituntut untuk dapat mengontrol agar barang yang dipesan oleh pelanggan dapat dikirimkan dengan tepat dan cepat. Sistem yang di gunakan menggunakan database MySQL sebagai tempat penyimpanan data dan menggunakan Mobile Tracking untuk membarikan informasi lokasi barang. Mobile Tracking yang akan dikembangkan pada alat Smart Conveyor Belt dimana aplikasi ini akan menampilkan status dan lokasi pada barang tersebut guna mempermudah pelanggan untuk mengetahui status barang dan dimana lokasi posisi barang yang di pesan.","language":"id","currency":"USD","id":"6237898387","title":"Pengembangan Smart Conveyor Pada Tracking Barang Berbasis IOT","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SS7dDwAAQBAJ&source=gbs_api","authors":["Syafrial Fachri Pane","Ichsan Hizman Hardy","Evietania Charis Sujadi"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FtCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A comprehensive guide to building computer vision and image processing applications with C++, 3rd Edition","description":"Work on practical computer vision projects covering advanced object detector techniques and modern deep learning and machine learning algorithms Key Features Learn about the new features that help unlock the full potential of OpenCV 4 Build face detection applications with a cascade classifier using face landmarks Create an optical character recognition (OCR) model using deep learning and convolutional neural networks Book Description Mastering OpenCV, now in its third edition, targets computer vision engineers taking their first steps toward mastering OpenCV. Keeping the mathematical formulations to a solid but bare minimum, the book delivers complete projects from ideation to running code, targeting current hot topics in computer vision such as face recognition, landmark detection and pose estimation, and number recognition with deep convolutional networks. You’ll learn from experienced OpenCV experts how to implement computer vision products and projects both in academia and industry in a comfortable package. You’ll get acquainted with API functionality and gain insights into design choices in a complete computer vision project. You’ll also go beyond the basics of computer vision to implement solutions for complex image processing projects. By the end of the book, you will have created various working prototypes with the help of projects in the book and be well versed with the new features of OpenCV4. What you will learn Build real-world computer vision problems with working OpenCV code samples Uncover best practices in engineering and maintaining OpenCV projects Explore algorithmic design approaches for complex computer vision tasks Work with OpenCV’s most updated API (v4.0.0) through projects Understand 3D scene reconstruction and Structure from Motion (SfM) Study camera calibration and overlay AR using the ArUco Module Who this book is for This book is for those who have a basic knowledge of OpenCV and are competent C++ programmers. You need to have an understanding of some of the more theoretical\/mathematical concepts, as we move quite quickly throughout the book.","language":"en","currency":"USD","id":"1789539269","title":"Mastering OpenCV 4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FtCBDwAAQBAJ&source=gbs_api","authors":["Roy Shilkrot","David Millán Escrivá"]},{"pageCount":362,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z-mvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A beginner's guide to developing interactive business intelligence solutions using Microsoft Power BI","description":"Solve business challenges with Microsoft Power BI's advanced visualization and data analysis techniques Key Features Create effective storytelling reports by implementing simple-to-intermediate Power BI features Develop powerful analytical models to extract key insights for changing business needs Build, publish, and share impressive dashboards for your organization Book Description To succeed in today's transforming business world, organizations need business intelligence capabilities to make smarter decisions faster than ever before. This Power BI book is an entry-level guide that will get you up and running with data modeling, visualization, and analytical techniques from scratch. You'll find this book handy if you want to get well-versed with the extensive Power BI ecosystem. You'll start by covering the basics of business intelligence and installing Power BI. You'll then learn the wide range of Power BI features to unlock business insights. As you progress, the book will take you through how to use Power Query to ingest, cleanse, and shape your data, and use Power BI DAX to create simple to complex calculations. You'll also be able to add a variety of interactive visualizations to your reports to bring your data to life. Finally, you'll gain hands-on experience in creating visually stunning reports that speak to business decision makers, and see how you can securely share these reports and collaborate with others. By the end of this book, you'll be ready to create simple, yet effective, BI reports and dashboards using the latest features of Power BI. What you will learn Explore the different features of Power BI to create interactive dashboards Use the Query Editor to import and transform data Perform simple and complex DAX calculations to enhance analysis Discover business insights and tell a story with your data using Power BI Explore data and learn to manage datasets, dataflows, and data gateways Use workspaces to collaborate with others and publish your reports Who this book is for If you’re an IT manager, data analyst, or BI user new to using Power BI for solving business intelligence problems, this book is for you. You’ll also find this book useful if you want to migrate from other BI tools to create powerful and interactive dashboards. No experience of working with Power BI is expected.","language":"en","currency":"USD","id":"1838646655","title":"Learn Power BI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z-mvDwAAQBAJ&source=gbs_api","authors":["Greg Deckler"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QYLgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"Learn to install, administer and use Ubuntu 18.04","description":"Arguably one of the most highly regarded and widely used enterprise level operating systems available today is the Ubuntu 18.04 distribution. Not only is it considered to be among the most stable and reliable operating systems, it is also backed by the considerable resources and technical skills of Canonical, Ltd. Ubuntu 18.04 Essentials is designed to provide detailed information on the installation, use and administration of the Ubuntu 18.04 distribution. For beginners, the book covers topics such as operating system installation, the basics of the GNOME desktop environment, configuring email and web servers and installing packages and system updates. Additional installation topics such as dual booting with Microsoft Windows are also covered, together with all important security topics such as configuring a firewall and user and group administration. For the experienced user, topics such as remote desktop access, the Cockpit web interface, logical volume management (LVM), disk partitioning, swap management, KVM virtualization, Secure Shell (SSH), Linux Containers and file sharing using both Samba and NFS are covered in detail to provide a thorough overview of this enterprise class operating system.","language":"en","currency":"USD","id":"1951442172","title":"Ubuntu 18.04 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QYLgDwAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Er_LDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":null,"description":"Fedora 31 Essentials is designed to provide detailed information on the installation, use and administration of the Fedora 31 distribution. For beginners, the book covers topics such as operating system installation, the basics of the GNOME desktop environment, configuring email and web servers and installing packages and system updates using App Streams. Additional installation topics such as dual booting with Microsoft Windows are also covered, together with all important security topics such as configuring a firewall and user and group administration. For the experienced user, topics such as remote desktop access, the Cockpit web interface, logical volume management (LVM), disk partitioning, swap management, KVM virtualization, Secure Shell (SSH), Linux Containers and file sharing using both Samba and NFS are covered in detail to provide a thorough overview of this enterprise class operating system.","language":"en","currency":"USD","id":"1951442113","title":"Fedora 31 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Er_LDwAAQBAJ&source=gbs_api","authors":["Neil Smyth"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVt1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build a modern, full-stack web application using Spring Boot and Vuex","description":"Become efficient in both frontend and backend web development with Spring and Vue Key Features Connect application’s frontend and backend with Vue, Vuex, and Spring Boot Leverage the latest web standards to enhance code performance, readability, and cross-compatibility Build secure full-stack web applications with Spring Security Book Description Building Applications with Spring 5 and Vue.js 2, with its practical approach, helps you become a full-stack web developer. As well as knowing how to write frontend and backend code, a developer has to tackle all problems encountered in the application development life cycle – starting from the simple idea of an application, to the UI and technical designs, and all the way to implementation, testing, production deployment, and monitoring. With the help of this book, you'll get to grips with Spring 5 and Vue.js 2 as you learn how to develop a web application. From the initial structuring to full deployment, you’ll be guided at every step of developing a web application from scratch with Vue.js 2 and Spring 5. You’ll learn how to create different components of your application as you progress through each chapter, followed by exploring different tools in these frameworks to expedite your development cycle. By the end of this book, you’ll have gained a complete understanding of the key design patterns and best practices that underpin professional full-stack web development. What you will learn Analyze requirements and design data models Develop a single-page application using Vue.js 2 and Spring 5 Practice concept, logical, and physical data modeling Design, implement, secure, and test RESTful API Add test cases to improve reliability of an application Monitor and deploy your application to production Who this book is for Building Applications with Spring 5.0 and Vue.js 2.0 is for you if you are developer who is new to Vue.js or Spring. It is assumed that you have some knowledge of HTML, CSS, and Java.","language":"en","currency":"USD","id":"178883125X","title":"Building Applications with Spring 5 and Vue.js 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVt1DwAAQBAJ&source=gbs_api","authors":["James J. Ye"]},{"pageCount":410,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RLZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design and create your own IoT applications using Raspberry Pi 3","description":"Augment your IoT skills with the help of engaging and enlightening tutorials designed for Raspberry Pi 3 Key Features Design and implement state-of-the-art solutions for the Internet of Things Build complex projects using motions detectors, controllers, sensors, and Raspberry Pi 3 A hands-on guide that provides interoperable solutions for sensors, actuators, and controllers Book Description The Internet of Things (IoT) is the fastest growing technology market. Industries are embracing IoT technologies to improve operational expenses, product life, and people's well-being. Mastering Internet of Things starts by presenting IoT fundamentals and the smart city. You will learn the important technologies and protocols that are used for the Internet of Things, their features, corresponding security implications, and practical examples on how to use them. This book focuses on creating applications and services for the Internet of Things. Further, you will learn to create applications and services for the Internet of Things. You will be discover various interesting projects and understand how to publish sensor data, control devices, and react to asynchronous events using the XMPP protocol. The book also introduces chat, to interact with your devices. You will learn how to automate your tasks by using Internet of Things Service Platforms as the base for an application. You will understand the subject of privacy, requirements they should be familiar with, and how to avoid violating any of the important new regulations being introduced. At the end of the book, you will have mastered creating open, interoperable and secure networks of things, protecting the privacy and integrity of your users and their information. What you will learn Create your own project, run and debug it Master different communication patterns using the MQTT, HTTP, CoAP, LWM2M and XMPP protocols Build trust-based as hoc networks for open, secure and interoperable communication Explore the IoT Service Platform Manage the entire product life cycle of devices Understand and set up the security and privacy features required for your system Master interoperability, and how it is solved in the realms of HTTP,CoAP, LWM2M and XMPP Who this book is for If you're a developer or electronic engineer and are curious about the Internet of Things, this is the book for you. With only a rudimentary understanding of electronics and Raspberry Pi 3, and some programming experience using managed code, such as C# or Java, you will be taught to develop state-of-the-art solutions for the Internet of Things.","language":"en","currency":"USD","id":"1788397436","title":"Mastering Internet of Things","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RLZTDwAAQBAJ&source=gbs_api","authors":["Peter Waher"]},{"pageCount":492,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VaAQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Beginning Android 3D Game Development is a unique, examples-driven book for today's Android and game app developers who want to learn how to build 3D game apps that run on the latest Android 5.0 (KitKat) platform using Java and OpenGL ES. Android game app development continues to be one of the hottest areas where indies and existing game app developers seem to be most active. Android is the second best mobile apps eco and arguably even a hotter game apps eco than iOS. 3D makes your games come alive; so in this book you'll find that we go in depth on creating 3D games for the Android platform with OpenGL ES 2.0 using an original case study game called Drone Grid. Moreover, this book offers an extensive case study with code that will be modular and re-useable helping you create your own games using advanced vertex and fragment shaders. Drone Grid is a game app case study that is somewhat similar to the best selling Geometry Wars game series utilizing a gravity grid and colorful abstract graphics and particles. After reading and using this book, you'll be able to build your first 3D Android game app for smartphones and tablets. You may even be able to upload and sell from popular Android app stores like Google Play and Amazon Appstore.","language":"en","currency":"USD","id":"1430265485","title":"Beginning Android 3D Game Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VaAQAwAAQBAJ&source=gbs_api","authors":["Robert Chin"]}]