[{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHINEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Focused coverage of every topic on the current version of the CompTIA CySA+ exam Get on the fast track to becoming CompTIA CySA+ certified with this affordable, portable study tool. Inside, cybersecurity professional Bobby Rogers guides you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA CySA+ Exam CS0-002, this certification passport is your ticket to success on exam day. Designed for focus on key topics and exam success: List of official exam objectives covered by domain Exam Tip element offers expert pointers for success on the test Key Term highlights specific term or acronym definitions key to passing the exam Caution notes common pitfalls and real-world issues as well as warnings about the exam Tables, bulleted lists, and figures throughout focus on quick reference and review Cross-References point to an essential, related concept covered elsewhere in the book Practice questions and content review after each objective section prepare you for exam mastery Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: Customizable practice exam test engine for CS0-002 200+ realistic multiple-choice and performance-based practice questions and in-depth explanations","language":"en","currency":"USD","id":"1260462250","title":"CompTIA CySA+ Cybersecurity Analyst Certification Passport (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHINEAAAQBAJ&source=gbs_api","authors":["Bobby E. Rogers"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y0hNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This effective study guide provides 100% coverage of every topic on the latest version of the CISM exam Written by an information security executive consultant, experienced author, and university instructor, this highly effective integrated self-study system enables you to take the challenging CISM exam with complete confidence. CISM Certified Information Security Manager All-in-One Exam Guide covers all four exam domains developed by ISACA. You’ll find learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. All questions closely match those on the live test in tone, format, and content. “Note,” “Tip,” and “Caution” sections throughout provide real-world insight and call out potentially harmful situations. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam domains, including: • Information security governance • Information risk management • Information security program development and management • Information security incident management Electronic content includes: • 400 practice exam questions • Test engine that provides full-length practice exams and customizable quizzes by exam topic • Secured book PDF","language":"en","currency":"USD","id":"126002704X","title":"CISM Certified Information Security Manager All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y0hNDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9-ivDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.3,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This cost-effective study bundle contains two books and bonus online content to use in preparation for the CISM exam Take ISACA’s challenging Certified Information Security Manager exam with confidence using this comprehensive self-study package. Comprised of CISM Certified Information Security Manager All-in-One Exam Guide, CISM Certified Information Security Manager Practice Exams, and bonus digital content, this bundle contains 100% coverage of every domain on the current exam. Readers will get real-world examples, professional insights, and concise explanations. CISM Certified Information Security Manager Bundle contains practice questions that match those on the live exam in content, style, tone, format, and difficulty. Every domain on the test is covered, including information security governance, information risk management, security program development and management, and information security incident management. This authoritative bundle serves both as a study tool AND a valuable on-the-job reference for security professionals. •Readers will save 22% compared to buying the two books separately•Online content includes 550 accurate practice exam questions and a quick review guide•Written by an IT expert and experienced author","language":"en","currency":"USD","id":"1260459012","title":"CISM Certified Information Security Manager Bundle","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9-ivDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AiEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This quick review, cram-style study guide offers 100% coverage of every topic on the latest version of the CompTIA Security+ exam This powerful exam preparation resource presents an accelerated review of the pertinent technology and covers all objectives for the CompTIA Security+ exam (exam SY0-601). Written in an all new Passport format developed by training expert Mike Meyers, the book enables you to focus on specific topics, determine areas of need, and tailor an effective course for study. Mike Meyers’ CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601) features accurate practice exam questions and in-depth answer explanations as well as end-of-chapter bulleted summaries that reinforce salient points. Throughout, “Exam Tips” highlight important topics, “Note” icons define need-to-know terms, “Caution” notes alert you to potential pitfalls, and “Resource” icons specify resources for further information. • Provides complete coverage of every objective on exam SY0-601 • Online content includes 200 practice questions and additional performance-based questions • Written by a cybersecurity expert and edited by certification guru Mike Meyers","language":"en","currency":"USD","id":"1260467961","title":"Mike Meyers CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AiEOEAAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hpyyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Pro Skills for Next Level Maker Projects","description":"Turn your projects from a weekend hack to a long-living creation! Loosely drawing from the field known in large software companies as Site Reliability Engineering (SRE), this book distills from these disciplines and addresses issues that matter to makers: keeping projects up and running, and providing means to control, monitor, and troubleshoot them. Most examples use the Raspberry Pi, but the techniques discussed apply to other platforms as well. This book is all about breadth, and in the spirit of making, it visits different technologies as needed. However, the big goal in this book is to create a shift in the reader’s mindset, where weekend hacks are pushed to the next level and are treated as products to be deployed. In that regard, this book can be a stepping stone for hobbyist makers into developing a broader, professional skill set. First, the book describes techniques for creating web-browser based dashboards for projects. These allow project creators to monitor, control, and troubleshoot their projects in real-time. Project Reliability Engineering discusses various aspects of the process of creating a web dashboard, such as network communication protocols, multithreading, and web design, and data visualization. Later chapters cover configuration of the project and the machine it’s running on, and additional techniques for project monitoring and diagnosis. These include good logging practices; automatic log and metrics monitoring; and alerting via email and text messages; A mixture of advanced concepts forms the last chapter of the book, touching on topics such as usage of microservices in complex projects; debugging techniques for object-oriented projects; and fail-safing the project’s software and hardware. What You’ll Learn Monitor and control projects, keep them up and running, and troubleshoot them efficiently Get acquainted with available tools and libraries, and learn how to make your own tools Expand your knowledge in Python, JavaScript and Linux Develop deeper understanding of web technologies Design robust and complex systems Who This Book Is For Members of the maker community with some development skills.","language":"en","currency":"USD","id":"1484250192","title":"Project Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hpyyDwAAQBAJ&source=gbs_api","authors":["Eyal Shahar"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g9ksDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Second International Conference, GOODTECHS 2016, Venice, Italy, November 30 – December 1, 2016, Proceedings","description":"This book constitutes the proceedings of the Second EAI international Conference on Smart Objects and Technologies for Social Good, GOODTECHS 2016, held in Venice, Italy, November 30 – December 1, 2016. The 38 revised full papers were carefully reviewed and selected from 73 submissions. The papers reflect the design, implementation, deployment, operation and evaluation of smart objects and technologies for social good. A social good can be understood as a service that benefits a large number of people in a most possible way. Some classic examples are healthcare, safety, environment, democracy, and human rights, or even art, entertainment, and communication.","language":"en","currency":"USD","id":"3319619497","title":"Smart Objects and Technologies for Social Good","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g9ksDwAAQBAJ&source=gbs_api","authors":["Ombretta Gaggi","Pietro Manzoni","Claudio Palazzi","Armir Bujari","Johann M. Marquez-Barja"]},{"pageCount":205,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bs_pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"20th IFIP WG 6.1 International Conference, DAIS 2020, Held as Part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020, Valletta, Malta, June 15–19, 2020, Proceedings","description":"This book constitutes the proceedings of the 20th IFIP International Conference on Distributed Applications and Interoperable Systems, DAIS 2020, which was supposed to be held in Valletta, Malta, in June 2020, as part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020. The conference was held virtually due to the COVID-19 pandemic. The 10 full papers presented together with 1 short paper and 1 invited paper were carefully reviewed and selected from 17 submissions. The papers addressed challenges in multiple application areas, such as privacy and security, cloud and systems, fault-tolerance and reproducibility, machine learning for systems, and distributed algorithms.","language":"en","currency":"USD","id":"3030503232","title":"Distributed Applications and Interoperable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bs_pDwAAQBAJ&source=gbs_api","authors":["Anne Remke","Valerio Schiavoni"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lus_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"11th International Conference, MTSR 2017, Tallinn, Estonia, November 28 – December 1, 2017, Proceedings","description":"This book constitutes the thoroughly refereed proceedings of the 11th International Conference on Metadata and Semantic Research, MTSR 2017 2017, held in Tallinn, Estonia, November 28th to December 1st, 2017. The 18 full and 13 short papers presented were carefully reviewed and selected from 58 submissions. They focus on the Internet of Things (IoT) and the practical implementation of ontologies and linked data. Further topics are theoretical and foundational principles of metadata; ontologies and information organization; applications of linked data, open data, big data and user-generated metadata; digital interconnectedness; metadata standardization; authority control and interoperability in digital libraries and research data repositories; emerging issues in RDF, OWL, SKOS, schema.org, BIBFRAME, metadata and ontology design; linked data applications for e-books; digital publishing and Content Management Systems (CMSs); content discovery services, search, information retrieval and data visualization applications.","language":"en","currency":"USD","id":"3319708635","title":"Metadata and Semantic Research","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lus_DwAAQBAJ&source=gbs_api","authors":["Emmanouel Garoufallou","Sirje Virkus","Rania Siatri","Damiana Koutsomiha"]},{"pageCount":662,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Avx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings","description":"The four-volume set LNCS 11334-11337 constitutes the proceedings of the 18th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP 2018, held in Guangzhou, China, in November 2018. The 141 full and 50 short papers presented were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on Distributed and Parallel Computing; High Performance Computing; Big Data and Information Processing; Internet of Things and Cloud Computing; and Security and Privacy in Computing.","language":"en","currency":"USD","id":"3030050637","title":"Algorithms and Architectures for Parallel Processing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Avx9DwAAQBAJ&source=gbs_api","authors":["Jaideep Vaidya","Jin Li"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QpreDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"WESOACS, ASOCA, ISYCC, TBCE, and STRAPS, Toulouse, France, October 28–31, 2019, Revised Selected Papers","description":"This book constitutes the revised selected papers of the scientific satellite events that were held in conjunction with the 17th International Conference on Service-Oriented Computing, ICSOC 2019, held in Toulouse, France, in October 2019. The ICSOC 2019 workshop track consisted of five workshops on a wide range of topics that fall into the general area of service computing: - The 15th International Workshop on Engineering Service-Oriented Applications and Cloud Services (WESOACS). 4 papers over the 6 received submissions were accepted. - The 4th International Workshop on Adaptive Service-oriented and Cloud Applications (ASOCA). 2 papers over the 4 received submissions were accepted. Moreover, 2 invited papers were presented in this workshop. - The 4th International IoT Systems Provisioning & Management for Context-Aware Smart Cities (ISYCC). 3 papers over the 5 received submissions were accepted. Moreover, 3 invited papers were presented in this workshop. - The 1st edition of Towards Blockchain-Based Collaborative Enterprise (TBCE). It accepted 2 papers over the 3 received submissions. - The 1st edition of Smart daTa integRation And Processing on Service based environments (STRAPS). 3 papers over the 7 received submissions were accepted. An additional invited paper was presented in this workshop.","language":"en","currency":"USD","id":"3030459896","title":"Service-Oriented Computing – ICSOC 2019 Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QpreDwAAQBAJ&source=gbs_api","authors":["Sami Yangui","Athman Bouguettaya","Xiao Xue","Noura Faci","Walid Gaaloul","Qi Yu","Zhangbing Zhou","Nathalie Hernandez","Elisa Y. Nakagawa"]},{"pageCount":347,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dmclDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT 2017) –","description":"The volume presents a collection of peer-reviewed articles from the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT-17), held in Vilamoura, Algarve, Portugal on 21–23 June 2017. The conference addressed critical areas of computer science, as well as promoting knowledge transfer and the generation of new ideas in the field of intelligent decision making, project management and data analysis. The range of topics addressed includes methods of classification, prediction, data analysis, decision support, modeling, social media and many more in such diverse areas as finance, linguistics, management and transportation.","language":"en","currency":"USD","id":"3319594249","title":"Intelligent Decision Technologies 2017","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dmclDwAAQBAJ&source=gbs_api","authors":["Ireneusz Czarnowski","Robert J Howlett","Lakhmi C. Jain"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=18RXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"12th IFIP WG 5.11 International Symposium, ISESS 2017, Zadar, Croatia, May 10-12, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 12th IFIP WG 5.11 International Symposium on Environmental Software Systems, ISESS 2017, held in Zadar, Croatia, in May 2017. The 35 revised full papers presented together with 4 keynote lectures were carefully reviewed and selected from 46 submissions. The papers deal with environmental challenges and try to provide solutions using forward-looking and leading-edge IT technology. They are organized in the following topical sections: air and climate; water and hydrosphere; health and biosphere; risk and disaster management; information systems; and modelling, visualization and decision support.","language":"en","currency":"USD","id":"331989935X","title":"Environmental Software Systems. Computer Science for Environmental Protection","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=18RXDwAAQBAJ&source=gbs_api","authors":["Jiří Hřebíček","Ralf Denzer","Gerald Schimak","Tomáš Pitner"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Der pragmatische Einstieg","description":"Continuous Delivery ermöglicht es, Software viel schneller und mit wesentlich höherer Zuverlässigkeit in Produktion zu bringen, als es bisher möglich war. Grundlage dafür ist eine Continuous-Delivery-Pipeline, die das Ausrollen der Software weitgehend automatisiert und so einen reproduzierbaren, risikoarmen Prozess für die Bereitstellung neuer Releases bietet. Dieses Buch macht Sie mit dem Aufbau einer Continuous-Delivery-Pipeline vertraut und erklärt, welche Technologien Sie dazu einsetzen können. Dabei lernen Sie u.a. folgende Themen kennen: • Infrastruktur-Automatisierung mit Chef, Docker und Vagrant • Automatisierung von Builds und Continuous Integration • Akzeptanztests, Kapazitätstests, exploratives Testen • Einführung von Continuous Delivery im Unternehmen • Continuous Delivery und DevOps • Auswirkungen auf die Softwarearchitektur Als praktisches Beispiel wird ein konkreter Technologie- Stack vorgestellt. Zahlreiche Aufgaben und Vorschläge für weitergehende Experimente laden Sie darüber hinaus zur praktischen Vertiefung des Themas ein. Nach der Lektüre können Sie abschätzen, welche Vorteile Continuous Delivery konkret bietet, und Sie verfügen über das nötige Handwerkszeug, um Continuous Delivery in Ihrem eigenen Arbeitsumfeld zu etablieren. Die Neuauflage wurde in Bezug auf Werkzeuge wie Docker, Jenkins, Graphite und den ELK-Stack aktualisiert. An neuen Themen sind Docker Compose, Docker Machine, Immutable Server, Microservices und die Einführung von Continuous Delivery ohne DevOps hinzugekommen.","language":"de","currency":"USD","id":"3864919304","title":"Continuous Delivery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sq32DwAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8-8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"20th International Conference, Manchester, UK, November 14–16, 2019, Proceedings","description":"This two-volume set of LNCS 11871 and 11872 constitutes the thoroughly refereed conference proceedings of the 20th International Conference on Intelligent Data Engineering and Automated Learning, IDEAL 2019, held in Manchester, UK, in November 2019. The 94 full papers presented were carefully reviewed and selected from 149 submissions. These papers provided a timely sample of the latest advances in data engineering and machine learning, from methodologies, frameworks, and algorithms to applications. The core themes of IDEAL 2019 include big data challenges, machine learning, data mining, information retrieval and management, bio-\/neuro-informatics, bio-inspired models (including neural networks, evolutionary computation and swarm intelligence), agents and hybrid intelligent systems, real-world applications of intelligent techniques and AI.","language":"en","currency":"USD","id":"3030336077","title":"Intelligent Data Engineering and Automated Learning – IDEAL 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8-8DwAAQBAJ&source=gbs_api","authors":["Hujun Yin","David Camacho","Peter Tino","Antonio J. Tallón-Ballesteros","Ronaldo Menezes","Richard Allmendinger"]},{"pageCount":829,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QYolDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":"Euro-Par 2016 International Workshops, Grenoble, France, August 24-26, 2016, Revised Selected Papers","description":"This book constitutes the proceedings of the workshops of the 23rd International Conference on Parallel and Distributed Computing, Euro-Par 2016, held in Grenoble, France in August 2016. The 65 full papers presented were carefully reviewed and selected from 95 submissions. The volume includes the papers from the following workshops: Euro-EDUPAR (Second European Workshop on Parallel and Distributed Computing Education for Undergraduate Students) – HeteroPar 2016 (the 14th International Workshop on Algorithms, Models and Tools for Parallel Computing on Heterogeneous Platforms) – IWMSE (5th International Workshop on Multicore Software Engineering) – LSDVE (Fourth Workshop on Large-Scale Distributed Virtual Environments) - PADABS (Fourth Workshop on Parallel and Distributed Agent-Based Simulations) – PBio (Fourth International Workshop on Parallelism in Bioinformatics) – PELGA (Second Workshop on Performance Engineering for Large-Scale Graph Analytics) – REPPAR (Third International Workshop on Reproducibility in Parallel Computing) – Resilience (9th Workshop in Resilience in High Performance Computing in Clusters, Clouds, and Grids) – ROME (Fourth Workshop on Runtime and Operating Systems for the Many-Core Era) – UCHPC (9th Workshop on UnConventional High-Performance Computing).","language":"en","currency":"USD","id":"3319589431","title":"Euro-Par 2016: Parallel Processing Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QYolDwAAQBAJ&source=gbs_api","authors":["Frédéric Desprez","Pierre-François Dutot","Christos Kaklamanis","Loris Marchal","Korbinian Molitorisz","Laura Ricci","Vittorio Scarano","Miguel A. Vega-Rodríguez","Ana Lucia Varbanescu","Sascha Hunold","Stephen L. Scott","Stefan Lankes","Josef Weidendorfer"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7PLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"BPM 2016 International Workshops, Rio de Janeiro, Brazil, September 19, 2016, Revised Papers","description":"This book constitutes the revised papers of the ten international workshops that were held at BPM 2016, the 14th International Conference on Business Process Management, held in Rio de Janeiro, Brazil, in September 2016. The 36 papers included in this volume were carefully reviewed and selected from a total of 64 submissions. They are from the following workshops: BPI 2016 – 12th International Workshop on Business Process Intelligence; BPMO 2016 – 1st Workshop on Workshop on Business Process Management and Ontologies; BPMS2 2016 – 9th Workshop on Social and Human Aspects of Business Process Management; DeMiMoP 2016 – 4th International Workshop on Decision Mining & Modeling for Business Processes; IWPE 2016 – 2nd International Workshop on Process Engineering; PQ 2016 – 1st International Workshop on Process Querying; ReMa 2016 – 1st Workshop on Resource Management in Business Processes; PRAISE 2016 – 1st International Workshop on Runtime Analysis of Process-Aware Information Systems; SABPM 2016 – 1st International Workshop on Sustainability-Aware Business Process Management; TAProViz 2016 – 5th International Workshop on Theory and Application of Visualizations and Human-centric Aspects in Processes.","language":"en","currency":"USD","id":"331958457X","title":"Business Process Management Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7PLDgAAQBAJ&source=gbs_api","authors":["Marlon Dumas","Marcelo Fantinato"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6QtjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"The 15th International Symposium on Distributed Computing and Artificial Intelligence 2018 (DCAI 2018) is a forum to present applications of innovative techniques for studying and solving complex problems. The exchange of ideas between scientists and technicians from both the academic and industrial sector is essential to facilitate the development of systems that can meet the ever-increasing demands of today’s society. The present edition brings together past experience, current work and promising future trends associated with distributed computing, artificial intelligence and their application in order to provide efficient solutions to real problems. This symposium is organized by the University of Castilla-La Mancha, the Osaka Institute of Technology and the University of Salamanca. The present edition was held in Toledo, Spain, from 20th – 22nd June, 2018.","language":"en","currency":"USD","id":"3319946498","title":"Distributed Computing and Artificial Intelligence, 15th International Conference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6QtjDwAAQBAJ&source=gbs_api","authors":["Fernando De La Prieta","Sigeru Omatu","Antonio Fernández-Caballero"]},{"pageCount":233,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GXioDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"8th International Conference, CLOSER 2018, Funchal, Madeira, Portugal, March 19-21, 2018, Revised Selected Papers","description":"This book constitutes extended, revised and selected papers from the 8th International Conference on Cloud Computing and Services Science, CLOSER 2018, held in Funchal, Portugal in March 2018. The 11 papers presented in this volume were carefully reviewed and selected from a total of 94 submissions. CLOSER 2018 focused on the emerging area of Cloud Computing, inspired by some latest advances that concern the infrastructure, operations and available services throughout the global network.","language":"en","currency":"USD","id":"3030291936","title":"Cloud Computing and Services Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GXioDwAAQBAJ&source=gbs_api","authors":["Víctor Méndez Muñoz","Donald Ferguson","Markus Helfert","Claus Pahl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYtHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"11th International Andrei P. Ershov Informatics Conference, PSI 2017, Moscow, Russia, June 27-29, 2017, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 11th International Andrei P. Ershov Informatics Conference, PSI 2017, held in Moscow, Russia, in June 2017. The 31 full papers presented in this volume were carefully reviewed and selected from 57 submissions. The papers cover various topics related to the foundations of program and system development and analysis, programming methodology and software engineering and information technologies.","language":"en","currency":"USD","id":"3319743139","title":"Perspectives of System Informatics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYtHDwAAQBAJ&source=gbs_api","authors":["Alexander K. Petrenko","Andrei Voronkov"]},{"pageCount":405,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OaafDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"13th International Conference, ENASE 2018, Funchal, Madeira, Portugal, March 23–24, 2018, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 13th International Conference on Evaluation of Novel Approaches to Software Engineering, ENASE 2018, held in Funchal, Madeira, Portugal, in March 2018. The 17 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 95 submissions. The papers are organized in topical sections on service science and business information systems and software engineering.","language":"en","currency":"USD","id":"3030225593","title":"Evaluation of Novel Approaches to Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OaafDwAAQBAJ&source=gbs_api","authors":["Ernesto Damiani","George Spanoudakis","Leszek A. Maciaszek"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KfecDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"14th International Conference, KMO 2019, Zamora, Spain, July 15–18, 2019, Proceedings","description":"This book contains the refereed proceedings of the 14th International Conference on Knowledge Management in Organizations, KMO 2019, held in Zamora, Spain, in July 2019. The 46 papers accepted for KMO 2018 were selected from 109 submissions and are organized in topical sections on: knowledge management models and analysis; knowledge transfer and learning; knowledge and service innovation; knowledge creation; knowledge and organization; information systems and information science; data mining and intelligent science; social networks and social aspects of KM; big data and IoT; and new trends in IT.","language":"en","currency":"USD","id":"3030214516","title":"Knowledge Management in Organizations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KfecDwAAQBAJ&source=gbs_api","authors":["Lorna Uden","I-Hsien Ting","Juan Manuel Corchado"]},{"pageCount":157,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_hZtCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"Third Future Internet Symposium, Berlin, Germany, September 20-22, 2010. Proceedings","description":"This book constitutes the proceedings of the Third Future Internet Symposium, FIS, held in Berlin, Germany in September 2010.The aim of this symposium was to bring together scientists and engineers from academia and industry and from various disciplines to exchange and discuss their ideas, views, and research results towards a consolidated, converged and sustainable future internet. The 16 revised full papers presented were carefully reviewed and selected from numerous submissions. The papers cover a wide range of topics such as future internet architectures and protocols; semantic technologies; and internet of services, things and content.","language":"en","currency":"USD","id":"3642158773","title":"Future Internet - FIS 2010","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_hZtCQAAQBAJ&source=gbs_api","authors":["Arne J. Berre","Asunción Gómez-Pérez","Kurt Tutschku"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHINEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Focused coverage of every topic on the current version of the CompTIA CySA+ exam Get on the fast track to becoming CompTIA CySA+ certified with this affordable, portable study tool. Inside, cybersecurity professional Bobby Rogers guides you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA CySA+ Exam CS0-002, this certification passport is your ticket to success on exam day. Designed for focus on key topics and exam success: List of official exam objectives covered by domain Exam Tip element offers expert pointers for success on the test Key Term highlights specific term or acronym definitions key to passing the exam Caution notes common pitfalls and real-world issues as well as warnings about the exam Tables, bulleted lists, and figures throughout focus on quick reference and review Cross-References point to an essential, related concept covered elsewhere in the book Practice questions and content review after each objective section prepare you for exam mastery Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: Customizable practice exam test engine for CS0-002 200+ realistic multiple-choice and performance-based practice questions and in-depth explanations","language":"en","currency":"USD","id":"1260462250","title":"CompTIA CySA+ Cybersecurity Analyst Certification Passport (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHINEAAAQBAJ&source=gbs_api","authors":["Bobby E. Rogers"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y0hNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This effective study guide provides 100% coverage of every topic on the latest version of the CISM exam Written by an information security executive consultant, experienced author, and university instructor, this highly effective integrated self-study system enables you to take the challenging CISM exam with complete confidence. CISM Certified Information Security Manager All-in-One Exam Guide covers all four exam domains developed by ISACA. You’ll find learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. All questions closely match those on the live test in tone, format, and content. “Note,” “Tip,” and “Caution” sections throughout provide real-world insight and call out potentially harmful situations. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam domains, including: • Information security governance • Information risk management • Information security program development and management • Information security incident management Electronic content includes: • 400 practice exam questions • Test engine that provides full-length practice exams and customizable quizzes by exam topic • Secured book PDF","language":"en","currency":"USD","id":"126002704X","title":"CISM Certified Information Security Manager All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y0hNDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9-ivDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.3,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This cost-effective study bundle contains two books and bonus online content to use in preparation for the CISM exam Take ISACA’s challenging Certified Information Security Manager exam with confidence using this comprehensive self-study package. Comprised of CISM Certified Information Security Manager All-in-One Exam Guide, CISM Certified Information Security Manager Practice Exams, and bonus digital content, this bundle contains 100% coverage of every domain on the current exam. Readers will get real-world examples, professional insights, and concise explanations. CISM Certified Information Security Manager Bundle contains practice questions that match those on the live exam in content, style, tone, format, and difficulty. Every domain on the test is covered, including information security governance, information risk management, security program development and management, and information security incident management. This authoritative bundle serves both as a study tool AND a valuable on-the-job reference for security professionals. •Readers will save 22% compared to buying the two books separately•Online content includes 550 accurate practice exam questions and a quick review guide•Written by an IT expert and experienced author","language":"en","currency":"USD","id":"1260459012","title":"CISM Certified Information Security Manager Bundle","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9-ivDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AiEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This quick review, cram-style study guide offers 100% coverage of every topic on the latest version of the CompTIA Security+ exam This powerful exam preparation resource presents an accelerated review of the pertinent technology and covers all objectives for the CompTIA Security+ exam (exam SY0-601). Written in an all new Passport format developed by training expert Mike Meyers, the book enables you to focus on specific topics, determine areas of need, and tailor an effective course for study. Mike Meyers’ CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601) features accurate practice exam questions and in-depth answer explanations as well as end-of-chapter bulleted summaries that reinforce salient points. Throughout, “Exam Tips” highlight important topics, “Note” icons define need-to-know terms, “Caution” notes alert you to potential pitfalls, and “Resource” icons specify resources for further information. • Provides complete coverage of every objective on exam SY0-601 • Online content includes 200 practice questions and additional performance-based questions • Written by a cybersecurity expert and edited by certification guru Mike Meyers","language":"en","currency":"USD","id":"1260467961","title":"Mike Meyers CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AiEOEAAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hpyyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Pro Skills for Next Level Maker Projects","description":"Turn your projects from a weekend hack to a long-living creation! Loosely drawing from the field known in large software companies as Site Reliability Engineering (SRE), this book distills from these disciplines and addresses issues that matter to makers: keeping projects up and running, and providing means to control, monitor, and troubleshoot them. Most examples use the Raspberry Pi, but the techniques discussed apply to other platforms as well. This book is all about breadth, and in the spirit of making, it visits different technologies as needed. However, the big goal in this book is to create a shift in the reader’s mindset, where weekend hacks are pushed to the next level and are treated as products to be deployed. In that regard, this book can be a stepping stone for hobbyist makers into developing a broader, professional skill set. First, the book describes techniques for creating web-browser based dashboards for projects. These allow project creators to monitor, control, and troubleshoot their projects in real-time. Project Reliability Engineering discusses various aspects of the process of creating a web dashboard, such as network communication protocols, multithreading, and web design, and data visualization. Later chapters cover configuration of the project and the machine it’s running on, and additional techniques for project monitoring and diagnosis. These include good logging practices; automatic log and metrics monitoring; and alerting via email and text messages; A mixture of advanced concepts forms the last chapter of the book, touching on topics such as usage of microservices in complex projects; debugging techniques for object-oriented projects; and fail-safing the project’s software and hardware. What You’ll Learn Monitor and control projects, keep them up and running, and troubleshoot them efficiently Get acquainted with available tools and libraries, and learn how to make your own tools Expand your knowledge in Python, JavaScript and Linux Develop deeper understanding of web technologies Design robust and complex systems Who This Book Is For Members of the maker community with some development skills.","language":"en","currency":"USD","id":"1484250192","title":"Project Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hpyyDwAAQBAJ&source=gbs_api","authors":["Eyal Shahar"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g9ksDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Second International Conference, GOODTECHS 2016, Venice, Italy, November 30 – December 1, 2016, Proceedings","description":"This book constitutes the proceedings of the Second EAI international Conference on Smart Objects and Technologies for Social Good, GOODTECHS 2016, held in Venice, Italy, November 30 – December 1, 2016. The 38 revised full papers were carefully reviewed and selected from 73 submissions. The papers reflect the design, implementation, deployment, operation and evaluation of smart objects and technologies for social good. A social good can be understood as a service that benefits a large number of people in a most possible way. Some classic examples are healthcare, safety, environment, democracy, and human rights, or even art, entertainment, and communication.","language":"en","currency":"USD","id":"3319619497","title":"Smart Objects and Technologies for Social Good","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g9ksDwAAQBAJ&source=gbs_api","authors":["Ombretta Gaggi","Pietro Manzoni","Claudio Palazzi","Armir Bujari","Johann M. Marquez-Barja"]},{"pageCount":205,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bs_pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"20th IFIP WG 6.1 International Conference, DAIS 2020, Held as Part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020, Valletta, Malta, June 15–19, 2020, Proceedings","description":"This book constitutes the proceedings of the 20th IFIP International Conference on Distributed Applications and Interoperable Systems, DAIS 2020, which was supposed to be held in Valletta, Malta, in June 2020, as part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020. The conference was held virtually due to the COVID-19 pandemic. The 10 full papers presented together with 1 short paper and 1 invited paper were carefully reviewed and selected from 17 submissions. The papers addressed challenges in multiple application areas, such as privacy and security, cloud and systems, fault-tolerance and reproducibility, machine learning for systems, and distributed algorithms.","language":"en","currency":"USD","id":"3030503232","title":"Distributed Applications and Interoperable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bs_pDwAAQBAJ&source=gbs_api","authors":["Anne Remke","Valerio Schiavoni"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lus_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"11th International Conference, MTSR 2017, Tallinn, Estonia, November 28 – December 1, 2017, Proceedings","description":"This book constitutes the thoroughly refereed proceedings of the 11th International Conference on Metadata and Semantic Research, MTSR 2017 2017, held in Tallinn, Estonia, November 28th to December 1st, 2017. The 18 full and 13 short papers presented were carefully reviewed and selected from 58 submissions. They focus on the Internet of Things (IoT) and the practical implementation of ontologies and linked data. Further topics are theoretical and foundational principles of metadata; ontologies and information organization; applications of linked data, open data, big data and user-generated metadata; digital interconnectedness; metadata standardization; authority control and interoperability in digital libraries and research data repositories; emerging issues in RDF, OWL, SKOS, schema.org, BIBFRAME, metadata and ontology design; linked data applications for e-books; digital publishing and Content Management Systems (CMSs); content discovery services, search, information retrieval and data visualization applications.","language":"en","currency":"USD","id":"3319708635","title":"Metadata and Semantic Research","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lus_DwAAQBAJ&source=gbs_api","authors":["Emmanouel Garoufallou","Sirje Virkus","Rania Siatri","Damiana Koutsomiha"]},{"pageCount":662,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Avx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings","description":"The four-volume set LNCS 11334-11337 constitutes the proceedings of the 18th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP 2018, held in Guangzhou, China, in November 2018. The 141 full and 50 short papers presented were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on Distributed and Parallel Computing; High Performance Computing; Big Data and Information Processing; Internet of Things and Cloud Computing; and Security and Privacy in Computing.","language":"en","currency":"USD","id":"3030050637","title":"Algorithms and Architectures for Parallel Processing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Avx9DwAAQBAJ&source=gbs_api","authors":["Jaideep Vaidya","Jin Li"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QpreDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"WESOACS, ASOCA, ISYCC, TBCE, and STRAPS, Toulouse, France, October 28–31, 2019, Revised Selected Papers","description":"This book constitutes the revised selected papers of the scientific satellite events that were held in conjunction with the 17th International Conference on Service-Oriented Computing, ICSOC 2019, held in Toulouse, France, in October 2019. The ICSOC 2019 workshop track consisted of five workshops on a wide range of topics that fall into the general area of service computing: - The 15th International Workshop on Engineering Service-Oriented Applications and Cloud Services (WESOACS). 4 papers over the 6 received submissions were accepted. - The 4th International Workshop on Adaptive Service-oriented and Cloud Applications (ASOCA). 2 papers over the 4 received submissions were accepted. Moreover, 2 invited papers were presented in this workshop. - The 4th International IoT Systems Provisioning & Management for Context-Aware Smart Cities (ISYCC). 3 papers over the 5 received submissions were accepted. Moreover, 3 invited papers were presented in this workshop. - The 1st edition of Towards Blockchain-Based Collaborative Enterprise (TBCE). It accepted 2 papers over the 3 received submissions. - The 1st edition of Smart daTa integRation And Processing on Service based environments (STRAPS). 3 papers over the 7 received submissions were accepted. An additional invited paper was presented in this workshop.","language":"en","currency":"USD","id":"3030459896","title":"Service-Oriented Computing – ICSOC 2019 Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QpreDwAAQBAJ&source=gbs_api","authors":["Sami Yangui","Athman Bouguettaya","Xiao Xue","Noura Faci","Walid Gaaloul","Qi Yu","Zhangbing Zhou","Nathalie Hernandez","Elisa Y. Nakagawa"]},{"pageCount":347,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dmclDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT 2017) –","description":"The volume presents a collection of peer-reviewed articles from the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT-17), held in Vilamoura, Algarve, Portugal on 21–23 June 2017. The conference addressed critical areas of computer science, as well as promoting knowledge transfer and the generation of new ideas in the field of intelligent decision making, project management and data analysis. The range of topics addressed includes methods of classification, prediction, data analysis, decision support, modeling, social media and many more in such diverse areas as finance, linguistics, management and transportation.","language":"en","currency":"USD","id":"3319594249","title":"Intelligent Decision Technologies 2017","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dmclDwAAQBAJ&source=gbs_api","authors":["Ireneusz Czarnowski","Robert J Howlett","Lakhmi C. Jain"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=18RXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"12th IFIP WG 5.11 International Symposium, ISESS 2017, Zadar, Croatia, May 10-12, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 12th IFIP WG 5.11 International Symposium on Environmental Software Systems, ISESS 2017, held in Zadar, Croatia, in May 2017. The 35 revised full papers presented together with 4 keynote lectures were carefully reviewed and selected from 46 submissions. The papers deal with environmental challenges and try to provide solutions using forward-looking and leading-edge IT technology. They are organized in the following topical sections: air and climate; water and hydrosphere; health and biosphere; risk and disaster management; information systems; and modelling, visualization and decision support.","language":"en","currency":"USD","id":"331989935X","title":"Environmental Software Systems. Computer Science for Environmental Protection","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=18RXDwAAQBAJ&source=gbs_api","authors":["Jiří Hřebíček","Ralf Denzer","Gerald Schimak","Tomáš Pitner"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Der pragmatische Einstieg","description":"Continuous Delivery ermöglicht es, Software viel schneller und mit wesentlich höherer Zuverlässigkeit in Produktion zu bringen, als es bisher möglich war. Grundlage dafür ist eine Continuous-Delivery-Pipeline, die das Ausrollen der Software weitgehend automatisiert und so einen reproduzierbaren, risikoarmen Prozess für die Bereitstellung neuer Releases bietet. Dieses Buch macht Sie mit dem Aufbau einer Continuous-Delivery-Pipeline vertraut und erklärt, welche Technologien Sie dazu einsetzen können. Dabei lernen Sie u.a. folgende Themen kennen: • Infrastruktur-Automatisierung mit Chef, Docker und Vagrant • Automatisierung von Builds und Continuous Integration • Akzeptanztests, Kapazitätstests, exploratives Testen • Einführung von Continuous Delivery im Unternehmen • Continuous Delivery und DevOps • Auswirkungen auf die Softwarearchitektur Als praktisches Beispiel wird ein konkreter Technologie- Stack vorgestellt. Zahlreiche Aufgaben und Vorschläge für weitergehende Experimente laden Sie darüber hinaus zur praktischen Vertiefung des Themas ein. Nach der Lektüre können Sie abschätzen, welche Vorteile Continuous Delivery konkret bietet, und Sie verfügen über das nötige Handwerkszeug, um Continuous Delivery in Ihrem eigenen Arbeitsumfeld zu etablieren. Die Neuauflage wurde in Bezug auf Werkzeuge wie Docker, Jenkins, Graphite und den ELK-Stack aktualisiert. An neuen Themen sind Docker Compose, Docker Machine, Immutable Server, Microservices und die Einführung von Continuous Delivery ohne DevOps hinzugekommen.","language":"de","currency":"USD","id":"3864919304","title":"Continuous Delivery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sq32DwAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8-8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"20th International Conference, Manchester, UK, November 14–16, 2019, Proceedings","description":"This two-volume set of LNCS 11871 and 11872 constitutes the thoroughly refereed conference proceedings of the 20th International Conference on Intelligent Data Engineering and Automated Learning, IDEAL 2019, held in Manchester, UK, in November 2019. The 94 full papers presented were carefully reviewed and selected from 149 submissions. These papers provided a timely sample of the latest advances in data engineering and machine learning, from methodologies, frameworks, and algorithms to applications. The core themes of IDEAL 2019 include big data challenges, machine learning, data mining, information retrieval and management, bio-\/neuro-informatics, bio-inspired models (including neural networks, evolutionary computation and swarm intelligence), agents and hybrid intelligent systems, real-world applications of intelligent techniques and AI.","language":"en","currency":"USD","id":"3030336077","title":"Intelligent Data Engineering and Automated Learning – IDEAL 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8-8DwAAQBAJ&source=gbs_api","authors":["Hujun Yin","David Camacho","Peter Tino","Antonio J. Tallón-Ballesteros","Ronaldo Menezes","Richard Allmendinger"]},{"pageCount":829,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QYolDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":"Euro-Par 2016 International Workshops, Grenoble, France, August 24-26, 2016, Revised Selected Papers","description":"This book constitutes the proceedings of the workshops of the 23rd International Conference on Parallel and Distributed Computing, Euro-Par 2016, held in Grenoble, France in August 2016. The 65 full papers presented were carefully reviewed and selected from 95 submissions. The volume includes the papers from the following workshops: Euro-EDUPAR (Second European Workshop on Parallel and Distributed Computing Education for Undergraduate Students) – HeteroPar 2016 (the 14th International Workshop on Algorithms, Models and Tools for Parallel Computing on Heterogeneous Platforms) – IWMSE (5th International Workshop on Multicore Software Engineering) – LSDVE (Fourth Workshop on Large-Scale Distributed Virtual Environments) - PADABS (Fourth Workshop on Parallel and Distributed Agent-Based Simulations) – PBio (Fourth International Workshop on Parallelism in Bioinformatics) – PELGA (Second Workshop on Performance Engineering for Large-Scale Graph Analytics) – REPPAR (Third International Workshop on Reproducibility in Parallel Computing) – Resilience (9th Workshop in Resilience in High Performance Computing in Clusters, Clouds, and Grids) – ROME (Fourth Workshop on Runtime and Operating Systems for the Many-Core Era) – UCHPC (9th Workshop on UnConventional High-Performance Computing).","language":"en","currency":"USD","id":"3319589431","title":"Euro-Par 2016: Parallel Processing Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QYolDwAAQBAJ&source=gbs_api","authors":["Frédéric Desprez","Pierre-François Dutot","Christos Kaklamanis","Loris Marchal","Korbinian Molitorisz","Laura Ricci","Vittorio Scarano","Miguel A. Vega-Rodríguez","Ana Lucia Varbanescu","Sascha Hunold","Stephen L. Scott","Stefan Lankes","Josef Weidendorfer"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7PLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"BPM 2016 International Workshops, Rio de Janeiro, Brazil, September 19, 2016, Revised Papers","description":"This book constitutes the revised papers of the ten international workshops that were held at BPM 2016, the 14th International Conference on Business Process Management, held in Rio de Janeiro, Brazil, in September 2016. The 36 papers included in this volume were carefully reviewed and selected from a total of 64 submissions. They are from the following workshops: BPI 2016 – 12th International Workshop on Business Process Intelligence; BPMO 2016 – 1st Workshop on Workshop on Business Process Management and Ontologies; BPMS2 2016 – 9th Workshop on Social and Human Aspects of Business Process Management; DeMiMoP 2016 – 4th International Workshop on Decision Mining & Modeling for Business Processes; IWPE 2016 – 2nd International Workshop on Process Engineering; PQ 2016 – 1st International Workshop on Process Querying; ReMa 2016 – 1st Workshop on Resource Management in Business Processes; PRAISE 2016 – 1st International Workshop on Runtime Analysis of Process-Aware Information Systems; SABPM 2016 – 1st International Workshop on Sustainability-Aware Business Process Management; TAProViz 2016 – 5th International Workshop on Theory and Application of Visualizations and Human-centric Aspects in Processes.","language":"en","currency":"USD","id":"331958457X","title":"Business Process Management Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7PLDgAAQBAJ&source=gbs_api","authors":["Marlon Dumas","Marcelo Fantinato"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6QtjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"The 15th International Symposium on Distributed Computing and Artificial Intelligence 2018 (DCAI 2018) is a forum to present applications of innovative techniques for studying and solving complex problems. The exchange of ideas between scientists and technicians from both the academic and industrial sector is essential to facilitate the development of systems that can meet the ever-increasing demands of today’s society. The present edition brings together past experience, current work and promising future trends associated with distributed computing, artificial intelligence and their application in order to provide efficient solutions to real problems. This symposium is organized by the University of Castilla-La Mancha, the Osaka Institute of Technology and the University of Salamanca. The present edition was held in Toledo, Spain, from 20th – 22nd June, 2018.","language":"en","currency":"USD","id":"3319946498","title":"Distributed Computing and Artificial Intelligence, 15th International Conference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6QtjDwAAQBAJ&source=gbs_api","authors":["Fernando De La Prieta","Sigeru Omatu","Antonio Fernández-Caballero"]},{"pageCount":233,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GXioDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"8th International Conference, CLOSER 2018, Funchal, Madeira, Portugal, March 19-21, 2018, Revised Selected Papers","description":"This book constitutes extended, revised and selected papers from the 8th International Conference on Cloud Computing and Services Science, CLOSER 2018, held in Funchal, Portugal in March 2018. The 11 papers presented in this volume were carefully reviewed and selected from a total of 94 submissions. CLOSER 2018 focused on the emerging area of Cloud Computing, inspired by some latest advances that concern the infrastructure, operations and available services throughout the global network.","language":"en","currency":"USD","id":"3030291936","title":"Cloud Computing and Services Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GXioDwAAQBAJ&source=gbs_api","authors":["Víctor Méndez Muñoz","Donald Ferguson","Markus Helfert","Claus Pahl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYtHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"11th International Andrei P. Ershov Informatics Conference, PSI 2017, Moscow, Russia, June 27-29, 2017, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 11th International Andrei P. Ershov Informatics Conference, PSI 2017, held in Moscow, Russia, in June 2017. The 31 full papers presented in this volume were carefully reviewed and selected from 57 submissions. The papers cover various topics related to the foundations of program and system development and analysis, programming methodology and software engineering and information technologies.","language":"en","currency":"USD","id":"3319743139","title":"Perspectives of System Informatics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYtHDwAAQBAJ&source=gbs_api","authors":["Alexander K. Petrenko","Andrei Voronkov"]},{"pageCount":405,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OaafDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"13th International Conference, ENASE 2018, Funchal, Madeira, Portugal, March 23–24, 2018, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 13th International Conference on Evaluation of Novel Approaches to Software Engineering, ENASE 2018, held in Funchal, Madeira, Portugal, in March 2018. The 17 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 95 submissions. The papers are organized in topical sections on service science and business information systems and software engineering.","language":"en","currency":"USD","id":"3030225593","title":"Evaluation of Novel Approaches to Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OaafDwAAQBAJ&source=gbs_api","authors":["Ernesto Damiani","George Spanoudakis","Leszek A. Maciaszek"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KfecDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"14th International Conference, KMO 2019, Zamora, Spain, July 15–18, 2019, Proceedings","description":"This book contains the refereed proceedings of the 14th International Conference on Knowledge Management in Organizations, KMO 2019, held in Zamora, Spain, in July 2019. The 46 papers accepted for KMO 2018 were selected from 109 submissions and are organized in topical sections on: knowledge management models and analysis; knowledge transfer and learning; knowledge and service innovation; knowledge creation; knowledge and organization; information systems and information science; data mining and intelligent science; social networks and social aspects of KM; big data and IoT; and new trends in IT.","language":"en","currency":"USD","id":"3030214516","title":"Knowledge Management in Organizations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KfecDwAAQBAJ&source=gbs_api","authors":["Lorna Uden","I-Hsien Ting","Juan Manuel Corchado"]},{"pageCount":157,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_hZtCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"Third Future Internet Symposium, Berlin, Germany, September 20-22, 2010. Proceedings","description":"This book constitutes the proceedings of the Third Future Internet Symposium, FIS, held in Berlin, Germany in September 2010.The aim of this symposium was to bring together scientists and engineers from academia and industry and from various disciplines to exchange and discuss their ideas, views, and research results towards a consolidated, converged and sustainable future internet. The 16 revised full papers presented were carefully reviewed and selected from numerous submissions. The papers cover a wide range of topics such as future internet architectures and protocols; semantic technologies; and internet of services, things and content.","language":"en","currency":"USD","id":"3642158773","title":"Future Internet - FIS 2010","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_hZtCQAAQBAJ&source=gbs_api","authors":["Arne J. Berre","Asunción Gómez-Pérez","Kurt Tutschku"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHINEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Focused coverage of every topic on the current version of the CompTIA CySA+ exam Get on the fast track to becoming CompTIA CySA+ certified with this affordable, portable study tool. Inside, cybersecurity professional Bobby Rogers guides you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA CySA+ Exam CS0-002, this certification passport is your ticket to success on exam day. Designed for focus on key topics and exam success: List of official exam objectives covered by domain Exam Tip element offers expert pointers for success on the test Key Term highlights specific term or acronym definitions key to passing the exam Caution notes common pitfalls and real-world issues as well as warnings about the exam Tables, bulleted lists, and figures throughout focus on quick reference and review Cross-References point to an essential, related concept covered elsewhere in the book Practice questions and content review after each objective section prepare you for exam mastery Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: Customizable practice exam test engine for CS0-002 200+ realistic multiple-choice and performance-based practice questions and in-depth explanations","language":"en","currency":"USD","id":"1260462250","title":"CompTIA CySA+ Cybersecurity Analyst Certification Passport (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHINEAAAQBAJ&source=gbs_api","authors":["Bobby E. Rogers"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y0hNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This effective study guide provides 100% coverage of every topic on the latest version of the CISM exam Written by an information security executive consultant, experienced author, and university instructor, this highly effective integrated self-study system enables you to take the challenging CISM exam with complete confidence. CISM Certified Information Security Manager All-in-One Exam Guide covers all four exam domains developed by ISACA. You’ll find learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. All questions closely match those on the live test in tone, format, and content. “Note,” “Tip,” and “Caution” sections throughout provide real-world insight and call out potentially harmful situations. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam domains, including: • Information security governance • Information risk management • Information security program development and management • Information security incident management Electronic content includes: • 400 practice exam questions • Test engine that provides full-length practice exams and customizable quizzes by exam topic • Secured book PDF","language":"en","currency":"USD","id":"126002704X","title":"CISM Certified Information Security Manager All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y0hNDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9-ivDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.3,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This cost-effective study bundle contains two books and bonus online content to use in preparation for the CISM exam Take ISACA’s challenging Certified Information Security Manager exam with confidence using this comprehensive self-study package. Comprised of CISM Certified Information Security Manager All-in-One Exam Guide, CISM Certified Information Security Manager Practice Exams, and bonus digital content, this bundle contains 100% coverage of every domain on the current exam. Readers will get real-world examples, professional insights, and concise explanations. CISM Certified Information Security Manager Bundle contains practice questions that match those on the live exam in content, style, tone, format, and difficulty. Every domain on the test is covered, including information security governance, information risk management, security program development and management, and information security incident management. This authoritative bundle serves both as a study tool AND a valuable on-the-job reference for security professionals. •Readers will save 22% compared to buying the two books separately•Online content includes 550 accurate practice exam questions and a quick review guide•Written by an IT expert and experienced author","language":"en","currency":"USD","id":"1260459012","title":"CISM Certified Information Security Manager Bundle","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9-ivDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AiEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This quick review, cram-style study guide offers 100% coverage of every topic on the latest version of the CompTIA Security+ exam This powerful exam preparation resource presents an accelerated review of the pertinent technology and covers all objectives for the CompTIA Security+ exam (exam SY0-601). Written in an all new Passport format developed by training expert Mike Meyers, the book enables you to focus on specific topics, determine areas of need, and tailor an effective course for study. Mike Meyers’ CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601) features accurate practice exam questions and in-depth answer explanations as well as end-of-chapter bulleted summaries that reinforce salient points. Throughout, “Exam Tips” highlight important topics, “Note” icons define need-to-know terms, “Caution” notes alert you to potential pitfalls, and “Resource” icons specify resources for further information. • Provides complete coverage of every objective on exam SY0-601 • Online content includes 200 practice questions and additional performance-based questions • Written by a cybersecurity expert and edited by certification guru Mike Meyers","language":"en","currency":"USD","id":"1260467961","title":"Mike Meyers CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AiEOEAAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hpyyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Pro Skills for Next Level Maker Projects","description":"Turn your projects from a weekend hack to a long-living creation! Loosely drawing from the field known in large software companies as Site Reliability Engineering (SRE), this book distills from these disciplines and addresses issues that matter to makers: keeping projects up and running, and providing means to control, monitor, and troubleshoot them. Most examples use the Raspberry Pi, but the techniques discussed apply to other platforms as well. This book is all about breadth, and in the spirit of making, it visits different technologies as needed. However, the big goal in this book is to create a shift in the reader’s mindset, where weekend hacks are pushed to the next level and are treated as products to be deployed. In that regard, this book can be a stepping stone for hobbyist makers into developing a broader, professional skill set. First, the book describes techniques for creating web-browser based dashboards for projects. These allow project creators to monitor, control, and troubleshoot their projects in real-time. Project Reliability Engineering discusses various aspects of the process of creating a web dashboard, such as network communication protocols, multithreading, and web design, and data visualization. Later chapters cover configuration of the project and the machine it’s running on, and additional techniques for project monitoring and diagnosis. These include good logging practices; automatic log and metrics monitoring; and alerting via email and text messages; A mixture of advanced concepts forms the last chapter of the book, touching on topics such as usage of microservices in complex projects; debugging techniques for object-oriented projects; and fail-safing the project’s software and hardware. What You’ll Learn Monitor and control projects, keep them up and running, and troubleshoot them efficiently Get acquainted with available tools and libraries, and learn how to make your own tools Expand your knowledge in Python, JavaScript and Linux Develop deeper understanding of web technologies Design robust and complex systems Who This Book Is For Members of the maker community with some development skills.","language":"en","currency":"USD","id":"1484250192","title":"Project Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hpyyDwAAQBAJ&source=gbs_api","authors":["Eyal Shahar"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g9ksDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Second International Conference, GOODTECHS 2016, Venice, Italy, November 30 – December 1, 2016, Proceedings","description":"This book constitutes the proceedings of the Second EAI international Conference on Smart Objects and Technologies for Social Good, GOODTECHS 2016, held in Venice, Italy, November 30 – December 1, 2016. The 38 revised full papers were carefully reviewed and selected from 73 submissions. The papers reflect the design, implementation, deployment, operation and evaluation of smart objects and technologies for social good. A social good can be understood as a service that benefits a large number of people in a most possible way. Some classic examples are healthcare, safety, environment, democracy, and human rights, or even art, entertainment, and communication.","language":"en","currency":"USD","id":"3319619497","title":"Smart Objects and Technologies for Social Good","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g9ksDwAAQBAJ&source=gbs_api","authors":["Ombretta Gaggi","Pietro Manzoni","Claudio Palazzi","Armir Bujari","Johann M. Marquez-Barja"]},{"pageCount":205,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bs_pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"20th IFIP WG 6.1 International Conference, DAIS 2020, Held as Part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020, Valletta, Malta, June 15–19, 2020, Proceedings","description":"This book constitutes the proceedings of the 20th IFIP International Conference on Distributed Applications and Interoperable Systems, DAIS 2020, which was supposed to be held in Valletta, Malta, in June 2020, as part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020. The conference was held virtually due to the COVID-19 pandemic. The 10 full papers presented together with 1 short paper and 1 invited paper were carefully reviewed and selected from 17 submissions. The papers addressed challenges in multiple application areas, such as privacy and security, cloud and systems, fault-tolerance and reproducibility, machine learning for systems, and distributed algorithms.","language":"en","currency":"USD","id":"3030503232","title":"Distributed Applications and Interoperable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bs_pDwAAQBAJ&source=gbs_api","authors":["Anne Remke","Valerio Schiavoni"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lus_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"11th International Conference, MTSR 2017, Tallinn, Estonia, November 28 – December 1, 2017, Proceedings","description":"This book constitutes the thoroughly refereed proceedings of the 11th International Conference on Metadata and Semantic Research, MTSR 2017 2017, held in Tallinn, Estonia, November 28th to December 1st, 2017. The 18 full and 13 short papers presented were carefully reviewed and selected from 58 submissions. They focus on the Internet of Things (IoT) and the practical implementation of ontologies and linked data. Further topics are theoretical and foundational principles of metadata; ontologies and information organization; applications of linked data, open data, big data and user-generated metadata; digital interconnectedness; metadata standardization; authority control and interoperability in digital libraries and research data repositories; emerging issues in RDF, OWL, SKOS, schema.org, BIBFRAME, metadata and ontology design; linked data applications for e-books; digital publishing and Content Management Systems (CMSs); content discovery services, search, information retrieval and data visualization applications.","language":"en","currency":"USD","id":"3319708635","title":"Metadata and Semantic Research","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lus_DwAAQBAJ&source=gbs_api","authors":["Emmanouel Garoufallou","Sirje Virkus","Rania Siatri","Damiana Koutsomiha"]},{"pageCount":662,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Avx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings","description":"The four-volume set LNCS 11334-11337 constitutes the proceedings of the 18th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP 2018, held in Guangzhou, China, in November 2018. The 141 full and 50 short papers presented were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on Distributed and Parallel Computing; High Performance Computing; Big Data and Information Processing; Internet of Things and Cloud Computing; and Security and Privacy in Computing.","language":"en","currency":"USD","id":"3030050637","title":"Algorithms and Architectures for Parallel Processing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Avx9DwAAQBAJ&source=gbs_api","authors":["Jaideep Vaidya","Jin Li"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QpreDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"WESOACS, ASOCA, ISYCC, TBCE, and STRAPS, Toulouse, France, October 28–31, 2019, Revised Selected Papers","description":"This book constitutes the revised selected papers of the scientific satellite events that were held in conjunction with the 17th International Conference on Service-Oriented Computing, ICSOC 2019, held in Toulouse, France, in October 2019. The ICSOC 2019 workshop track consisted of five workshops on a wide range of topics that fall into the general area of service computing: - The 15th International Workshop on Engineering Service-Oriented Applications and Cloud Services (WESOACS). 4 papers over the 6 received submissions were accepted. - The 4th International Workshop on Adaptive Service-oriented and Cloud Applications (ASOCA). 2 papers over the 4 received submissions were accepted. Moreover, 2 invited papers were presented in this workshop. - The 4th International IoT Systems Provisioning & Management for Context-Aware Smart Cities (ISYCC). 3 papers over the 5 received submissions were accepted. Moreover, 3 invited papers were presented in this workshop. - The 1st edition of Towards Blockchain-Based Collaborative Enterprise (TBCE). It accepted 2 papers over the 3 received submissions. - The 1st edition of Smart daTa integRation And Processing on Service based environments (STRAPS). 3 papers over the 7 received submissions were accepted. An additional invited paper was presented in this workshop.","language":"en","currency":"USD","id":"3030459896","title":"Service-Oriented Computing – ICSOC 2019 Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QpreDwAAQBAJ&source=gbs_api","authors":["Sami Yangui","Athman Bouguettaya","Xiao Xue","Noura Faci","Walid Gaaloul","Qi Yu","Zhangbing Zhou","Nathalie Hernandez","Elisa Y. Nakagawa"]},{"pageCount":347,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dmclDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT 2017) –","description":"The volume presents a collection of peer-reviewed articles from the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT-17), held in Vilamoura, Algarve, Portugal on 21–23 June 2017. The conference addressed critical areas of computer science, as well as promoting knowledge transfer and the generation of new ideas in the field of intelligent decision making, project management and data analysis. The range of topics addressed includes methods of classification, prediction, data analysis, decision support, modeling, social media and many more in such diverse areas as finance, linguistics, management and transportation.","language":"en","currency":"USD","id":"3319594249","title":"Intelligent Decision Technologies 2017","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dmclDwAAQBAJ&source=gbs_api","authors":["Ireneusz Czarnowski","Robert J Howlett","Lakhmi C. Jain"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=18RXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"12th IFIP WG 5.11 International Symposium, ISESS 2017, Zadar, Croatia, May 10-12, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 12th IFIP WG 5.11 International Symposium on Environmental Software Systems, ISESS 2017, held in Zadar, Croatia, in May 2017. The 35 revised full papers presented together with 4 keynote lectures were carefully reviewed and selected from 46 submissions. The papers deal with environmental challenges and try to provide solutions using forward-looking and leading-edge IT technology. They are organized in the following topical sections: air and climate; water and hydrosphere; health and biosphere; risk and disaster management; information systems; and modelling, visualization and decision support.","language":"en","currency":"USD","id":"331989935X","title":"Environmental Software Systems. Computer Science for Environmental Protection","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=18RXDwAAQBAJ&source=gbs_api","authors":["Jiří Hřebíček","Ralf Denzer","Gerald Schimak","Tomáš Pitner"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Der pragmatische Einstieg","description":"Continuous Delivery ermöglicht es, Software viel schneller und mit wesentlich höherer Zuverlässigkeit in Produktion zu bringen, als es bisher möglich war. Grundlage dafür ist eine Continuous-Delivery-Pipeline, die das Ausrollen der Software weitgehend automatisiert und so einen reproduzierbaren, risikoarmen Prozess für die Bereitstellung neuer Releases bietet. Dieses Buch macht Sie mit dem Aufbau einer Continuous-Delivery-Pipeline vertraut und erklärt, welche Technologien Sie dazu einsetzen können. Dabei lernen Sie u.a. folgende Themen kennen: • Infrastruktur-Automatisierung mit Chef, Docker und Vagrant • Automatisierung von Builds und Continuous Integration • Akzeptanztests, Kapazitätstests, exploratives Testen • Einführung von Continuous Delivery im Unternehmen • Continuous Delivery und DevOps • Auswirkungen auf die Softwarearchitektur Als praktisches Beispiel wird ein konkreter Technologie- Stack vorgestellt. Zahlreiche Aufgaben und Vorschläge für weitergehende Experimente laden Sie darüber hinaus zur praktischen Vertiefung des Themas ein. Nach der Lektüre können Sie abschätzen, welche Vorteile Continuous Delivery konkret bietet, und Sie verfügen über das nötige Handwerkszeug, um Continuous Delivery in Ihrem eigenen Arbeitsumfeld zu etablieren. Die Neuauflage wurde in Bezug auf Werkzeuge wie Docker, Jenkins, Graphite und den ELK-Stack aktualisiert. An neuen Themen sind Docker Compose, Docker Machine, Immutable Server, Microservices und die Einführung von Continuous Delivery ohne DevOps hinzugekommen.","language":"de","currency":"USD","id":"3864919304","title":"Continuous Delivery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sq32DwAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8-8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"20th International Conference, Manchester, UK, November 14–16, 2019, Proceedings","description":"This two-volume set of LNCS 11871 and 11872 constitutes the thoroughly refereed conference proceedings of the 20th International Conference on Intelligent Data Engineering and Automated Learning, IDEAL 2019, held in Manchester, UK, in November 2019. The 94 full papers presented were carefully reviewed and selected from 149 submissions. These papers provided a timely sample of the latest advances in data engineering and machine learning, from methodologies, frameworks, and algorithms to applications. The core themes of IDEAL 2019 include big data challenges, machine learning, data mining, information retrieval and management, bio-\/neuro-informatics, bio-inspired models (including neural networks, evolutionary computation and swarm intelligence), agents and hybrid intelligent systems, real-world applications of intelligent techniques and AI.","language":"en","currency":"USD","id":"3030336077","title":"Intelligent Data Engineering and Automated Learning – IDEAL 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8-8DwAAQBAJ&source=gbs_api","authors":["Hujun Yin","David Camacho","Peter Tino","Antonio J. Tallón-Ballesteros","Ronaldo Menezes","Richard Allmendinger"]},{"pageCount":829,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QYolDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":"Euro-Par 2016 International Workshops, Grenoble, France, August 24-26, 2016, Revised Selected Papers","description":"This book constitutes the proceedings of the workshops of the 23rd International Conference on Parallel and Distributed Computing, Euro-Par 2016, held in Grenoble, France in August 2016. The 65 full papers presented were carefully reviewed and selected from 95 submissions. The volume includes the papers from the following workshops: Euro-EDUPAR (Second European Workshop on Parallel and Distributed Computing Education for Undergraduate Students) – HeteroPar 2016 (the 14th International Workshop on Algorithms, Models and Tools for Parallel Computing on Heterogeneous Platforms) – IWMSE (5th International Workshop on Multicore Software Engineering) – LSDVE (Fourth Workshop on Large-Scale Distributed Virtual Environments) - PADABS (Fourth Workshop on Parallel and Distributed Agent-Based Simulations) – PBio (Fourth International Workshop on Parallelism in Bioinformatics) – PELGA (Second Workshop on Performance Engineering for Large-Scale Graph Analytics) – REPPAR (Third International Workshop on Reproducibility in Parallel Computing) – Resilience (9th Workshop in Resilience in High Performance Computing in Clusters, Clouds, and Grids) – ROME (Fourth Workshop on Runtime and Operating Systems for the Many-Core Era) – UCHPC (9th Workshop on UnConventional High-Performance Computing).","language":"en","currency":"USD","id":"3319589431","title":"Euro-Par 2016: Parallel Processing Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QYolDwAAQBAJ&source=gbs_api","authors":["Frédéric Desprez","Pierre-François Dutot","Christos Kaklamanis","Loris Marchal","Korbinian Molitorisz","Laura Ricci","Vittorio Scarano","Miguel A. Vega-Rodríguez","Ana Lucia Varbanescu","Sascha Hunold","Stephen L. Scott","Stefan Lankes","Josef Weidendorfer"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7PLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"BPM 2016 International Workshops, Rio de Janeiro, Brazil, September 19, 2016, Revised Papers","description":"This book constitutes the revised papers of the ten international workshops that were held at BPM 2016, the 14th International Conference on Business Process Management, held in Rio de Janeiro, Brazil, in September 2016. The 36 papers included in this volume were carefully reviewed and selected from a total of 64 submissions. They are from the following workshops: BPI 2016 – 12th International Workshop on Business Process Intelligence; BPMO 2016 – 1st Workshop on Workshop on Business Process Management and Ontologies; BPMS2 2016 – 9th Workshop on Social and Human Aspects of Business Process Management; DeMiMoP 2016 – 4th International Workshop on Decision Mining & Modeling for Business Processes; IWPE 2016 – 2nd International Workshop on Process Engineering; PQ 2016 – 1st International Workshop on Process Querying; ReMa 2016 – 1st Workshop on Resource Management in Business Processes; PRAISE 2016 – 1st International Workshop on Runtime Analysis of Process-Aware Information Systems; SABPM 2016 – 1st International Workshop on Sustainability-Aware Business Process Management; TAProViz 2016 – 5th International Workshop on Theory and Application of Visualizations and Human-centric Aspects in Processes.","language":"en","currency":"USD","id":"331958457X","title":"Business Process Management Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7PLDgAAQBAJ&source=gbs_api","authors":["Marlon Dumas","Marcelo Fantinato"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6QtjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"The 15th International Symposium on Distributed Computing and Artificial Intelligence 2018 (DCAI 2018) is a forum to present applications of innovative techniques for studying and solving complex problems. The exchange of ideas between scientists and technicians from both the academic and industrial sector is essential to facilitate the development of systems that can meet the ever-increasing demands of today’s society. The present edition brings together past experience, current work and promising future trends associated with distributed computing, artificial intelligence and their application in order to provide efficient solutions to real problems. This symposium is organized by the University of Castilla-La Mancha, the Osaka Institute of Technology and the University of Salamanca. The present edition was held in Toledo, Spain, from 20th – 22nd June, 2018.","language":"en","currency":"USD","id":"3319946498","title":"Distributed Computing and Artificial Intelligence, 15th International Conference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6QtjDwAAQBAJ&source=gbs_api","authors":["Fernando De La Prieta","Sigeru Omatu","Antonio Fernández-Caballero"]},{"pageCount":233,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GXioDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"8th International Conference, CLOSER 2018, Funchal, Madeira, Portugal, March 19-21, 2018, Revised Selected Papers","description":"This book constitutes extended, revised and selected papers from the 8th International Conference on Cloud Computing and Services Science, CLOSER 2018, held in Funchal, Portugal in March 2018. The 11 papers presented in this volume were carefully reviewed and selected from a total of 94 submissions. CLOSER 2018 focused on the emerging area of Cloud Computing, inspired by some latest advances that concern the infrastructure, operations and available services throughout the global network.","language":"en","currency":"USD","id":"3030291936","title":"Cloud Computing and Services Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GXioDwAAQBAJ&source=gbs_api","authors":["Víctor Méndez Muñoz","Donald Ferguson","Markus Helfert","Claus Pahl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYtHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"11th International Andrei P. Ershov Informatics Conference, PSI 2017, Moscow, Russia, June 27-29, 2017, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 11th International Andrei P. Ershov Informatics Conference, PSI 2017, held in Moscow, Russia, in June 2017. The 31 full papers presented in this volume were carefully reviewed and selected from 57 submissions. The papers cover various topics related to the foundations of program and system development and analysis, programming methodology and software engineering and information technologies.","language":"en","currency":"USD","id":"3319743139","title":"Perspectives of System Informatics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYtHDwAAQBAJ&source=gbs_api","authors":["Alexander K. Petrenko","Andrei Voronkov"]},{"pageCount":405,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OaafDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"13th International Conference, ENASE 2018, Funchal, Madeira, Portugal, March 23–24, 2018, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 13th International Conference on Evaluation of Novel Approaches to Software Engineering, ENASE 2018, held in Funchal, Madeira, Portugal, in March 2018. The 17 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 95 submissions. The papers are organized in topical sections on service science and business information systems and software engineering.","language":"en","currency":"USD","id":"3030225593","title":"Evaluation of Novel Approaches to Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OaafDwAAQBAJ&source=gbs_api","authors":["Ernesto Damiani","George Spanoudakis","Leszek A. Maciaszek"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KfecDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"14th International Conference, KMO 2019, Zamora, Spain, July 15–18, 2019, Proceedings","description":"This book contains the refereed proceedings of the 14th International Conference on Knowledge Management in Organizations, KMO 2019, held in Zamora, Spain, in July 2019. The 46 papers accepted for KMO 2018 were selected from 109 submissions and are organized in topical sections on: knowledge management models and analysis; knowledge transfer and learning; knowledge and service innovation; knowledge creation; knowledge and organization; information systems and information science; data mining and intelligent science; social networks and social aspects of KM; big data and IoT; and new trends in IT.","language":"en","currency":"USD","id":"3030214516","title":"Knowledge Management in Organizations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KfecDwAAQBAJ&source=gbs_api","authors":["Lorna Uden","I-Hsien Ting","Juan Manuel Corchado"]},{"pageCount":157,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_hZtCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"Third Future Internet Symposium, Berlin, Germany, September 20-22, 2010. Proceedings","description":"This book constitutes the proceedings of the Third Future Internet Symposium, FIS, held in Berlin, Germany in September 2010.The aim of this symposium was to bring together scientists and engineers from academia and industry and from various disciplines to exchange and discuss their ideas, views, and research results towards a consolidated, converged and sustainable future internet. The 16 revised full papers presented were carefully reviewed and selected from numerous submissions. The papers cover a wide range of topics such as future internet architectures and protocols; semantic technologies; and internet of services, things and content.","language":"en","currency":"USD","id":"3642158773","title":"Future Internet - FIS 2010","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_hZtCQAAQBAJ&source=gbs_api","authors":["Arne J. Berre","Asunción Gómez-Pérez","Kurt Tutschku"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHINEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Focused coverage of every topic on the current version of the CompTIA CySA+ exam Get on the fast track to becoming CompTIA CySA+ certified with this affordable, portable study tool. Inside, cybersecurity professional Bobby Rogers guides you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA CySA+ Exam CS0-002, this certification passport is your ticket to success on exam day. Designed for focus on key topics and exam success: List of official exam objectives covered by domain Exam Tip element offers expert pointers for success on the test Key Term highlights specific term or acronym definitions key to passing the exam Caution notes common pitfalls and real-world issues as well as warnings about the exam Tables, bulleted lists, and figures throughout focus on quick reference and review Cross-References point to an essential, related concept covered elsewhere in the book Practice questions and content review after each objective section prepare you for exam mastery Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: Customizable practice exam test engine for CS0-002 200+ realistic multiple-choice and performance-based practice questions and in-depth explanations","language":"en","currency":"USD","id":"1260462250","title":"CompTIA CySA+ Cybersecurity Analyst Certification Passport (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHINEAAAQBAJ&source=gbs_api","authors":["Bobby E. Rogers"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y0hNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This effective study guide provides 100% coverage of every topic on the latest version of the CISM exam Written by an information security executive consultant, experienced author, and university instructor, this highly effective integrated self-study system enables you to take the challenging CISM exam with complete confidence. CISM Certified Information Security Manager All-in-One Exam Guide covers all four exam domains developed by ISACA. You’ll find learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. All questions closely match those on the live test in tone, format, and content. “Note,” “Tip,” and “Caution” sections throughout provide real-world insight and call out potentially harmful situations. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam domains, including: • Information security governance • Information risk management • Information security program development and management • Information security incident management Electronic content includes: • 400 practice exam questions • Test engine that provides full-length practice exams and customizable quizzes by exam topic • Secured book PDF","language":"en","currency":"USD","id":"126002704X","title":"CISM Certified Information Security Manager All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y0hNDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9-ivDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.3,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This cost-effective study bundle contains two books and bonus online content to use in preparation for the CISM exam Take ISACA’s challenging Certified Information Security Manager exam with confidence using this comprehensive self-study package. Comprised of CISM Certified Information Security Manager All-in-One Exam Guide, CISM Certified Information Security Manager Practice Exams, and bonus digital content, this bundle contains 100% coverage of every domain on the current exam. Readers will get real-world examples, professional insights, and concise explanations. CISM Certified Information Security Manager Bundle contains practice questions that match those on the live exam in content, style, tone, format, and difficulty. Every domain on the test is covered, including information security governance, information risk management, security program development and management, and information security incident management. This authoritative bundle serves both as a study tool AND a valuable on-the-job reference for security professionals. •Readers will save 22% compared to buying the two books separately•Online content includes 550 accurate practice exam questions and a quick review guide•Written by an IT expert and experienced author","language":"en","currency":"USD","id":"1260459012","title":"CISM Certified Information Security Manager Bundle","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9-ivDwAAQBAJ&source=gbs_api","authors":["Peter H. Gregory"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AiEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This quick review, cram-style study guide offers 100% coverage of every topic on the latest version of the CompTIA Security+ exam This powerful exam preparation resource presents an accelerated review of the pertinent technology and covers all objectives for the CompTIA Security+ exam (exam SY0-601). Written in an all new Passport format developed by training expert Mike Meyers, the book enables you to focus on specific topics, determine areas of need, and tailor an effective course for study. Mike Meyers’ CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601) features accurate practice exam questions and in-depth answer explanations as well as end-of-chapter bulleted summaries that reinforce salient points. Throughout, “Exam Tips” highlight important topics, “Note” icons define need-to-know terms, “Caution” notes alert you to potential pitfalls, and “Resource” icons specify resources for further information. • Provides complete coverage of every objective on exam SY0-601 • Online content includes 200 practice questions and additional performance-based questions • Written by a cybersecurity expert and edited by certification guru Mike Meyers","language":"en","currency":"USD","id":"1260467961","title":"Mike Meyers CompTIA Security+ Certification Passport, Sixth Edition (Exam SY0-601)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AiEOEAAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hpyyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Pro Skills for Next Level Maker Projects","description":"Turn your projects from a weekend hack to a long-living creation! Loosely drawing from the field known in large software companies as Site Reliability Engineering (SRE), this book distills from these disciplines and addresses issues that matter to makers: keeping projects up and running, and providing means to control, monitor, and troubleshoot them. Most examples use the Raspberry Pi, but the techniques discussed apply to other platforms as well. This book is all about breadth, and in the spirit of making, it visits different technologies as needed. However, the big goal in this book is to create a shift in the reader’s mindset, where weekend hacks are pushed to the next level and are treated as products to be deployed. In that regard, this book can be a stepping stone for hobbyist makers into developing a broader, professional skill set. First, the book describes techniques for creating web-browser based dashboards for projects. These allow project creators to monitor, control, and troubleshoot their projects in real-time. Project Reliability Engineering discusses various aspects of the process of creating a web dashboard, such as network communication protocols, multithreading, and web design, and data visualization. Later chapters cover configuration of the project and the machine it’s running on, and additional techniques for project monitoring and diagnosis. These include good logging practices; automatic log and metrics monitoring; and alerting via email and text messages; A mixture of advanced concepts forms the last chapter of the book, touching on topics such as usage of microservices in complex projects; debugging techniques for object-oriented projects; and fail-safing the project’s software and hardware. What You’ll Learn Monitor and control projects, keep them up and running, and troubleshoot them efficiently Get acquainted with available tools and libraries, and learn how to make your own tools Expand your knowledge in Python, JavaScript and Linux Develop deeper understanding of web technologies Design robust and complex systems Who This Book Is For Members of the maker community with some development skills.","language":"en","currency":"USD","id":"1484250192","title":"Project Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hpyyDwAAQBAJ&source=gbs_api","authors":["Eyal Shahar"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g9ksDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Second International Conference, GOODTECHS 2016, Venice, Italy, November 30 – December 1, 2016, Proceedings","description":"This book constitutes the proceedings of the Second EAI international Conference on Smart Objects and Technologies for Social Good, GOODTECHS 2016, held in Venice, Italy, November 30 – December 1, 2016. The 38 revised full papers were carefully reviewed and selected from 73 submissions. The papers reflect the design, implementation, deployment, operation and evaluation of smart objects and technologies for social good. A social good can be understood as a service that benefits a large number of people in a most possible way. Some classic examples are healthcare, safety, environment, democracy, and human rights, or even art, entertainment, and communication.","language":"en","currency":"USD","id":"3319619497","title":"Smart Objects and Technologies for Social Good","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g9ksDwAAQBAJ&source=gbs_api","authors":["Ombretta Gaggi","Pietro Manzoni","Claudio Palazzi","Armir Bujari","Johann M. Marquez-Barja"]},{"pageCount":205,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bs_pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"20th IFIP WG 6.1 International Conference, DAIS 2020, Held as Part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020, Valletta, Malta, June 15–19, 2020, Proceedings","description":"This book constitutes the proceedings of the 20th IFIP International Conference on Distributed Applications and Interoperable Systems, DAIS 2020, which was supposed to be held in Valletta, Malta, in June 2020, as part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020. The conference was held virtually due to the COVID-19 pandemic. The 10 full papers presented together with 1 short paper and 1 invited paper were carefully reviewed and selected from 17 submissions. The papers addressed challenges in multiple application areas, such as privacy and security, cloud and systems, fault-tolerance and reproducibility, machine learning for systems, and distributed algorithms.","language":"en","currency":"USD","id":"3030503232","title":"Distributed Applications and Interoperable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bs_pDwAAQBAJ&source=gbs_api","authors":["Anne Remke","Valerio Schiavoni"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lus_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"11th International Conference, MTSR 2017, Tallinn, Estonia, November 28 – December 1, 2017, Proceedings","description":"This book constitutes the thoroughly refereed proceedings of the 11th International Conference on Metadata and Semantic Research, MTSR 2017 2017, held in Tallinn, Estonia, November 28th to December 1st, 2017. The 18 full and 13 short papers presented were carefully reviewed and selected from 58 submissions. They focus on the Internet of Things (IoT) and the practical implementation of ontologies and linked data. Further topics are theoretical and foundational principles of metadata; ontologies and information organization; applications of linked data, open data, big data and user-generated metadata; digital interconnectedness; metadata standardization; authority control and interoperability in digital libraries and research data repositories; emerging issues in RDF, OWL, SKOS, schema.org, BIBFRAME, metadata and ontology design; linked data applications for e-books; digital publishing and Content Management Systems (CMSs); content discovery services, search, information retrieval and data visualization applications.","language":"en","currency":"USD","id":"3319708635","title":"Metadata and Semantic Research","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lus_DwAAQBAJ&source=gbs_api","authors":["Emmanouel Garoufallou","Sirje Virkus","Rania Siatri","Damiana Koutsomiha"]},{"pageCount":662,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Avx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"18th International Conference, ICA3PP 2018, Guangzhou, China, November 15-17, 2018, Proceedings","description":"The four-volume set LNCS 11334-11337 constitutes the proceedings of the 18th International Conference on Algorithms and Architectures for Parallel Processing, ICA3PP 2018, held in Guangzhou, China, in November 2018. The 141 full and 50 short papers presented were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on Distributed and Parallel Computing; High Performance Computing; Big Data and Information Processing; Internet of Things and Cloud Computing; and Security and Privacy in Computing.","language":"en","currency":"USD","id":"3030050637","title":"Algorithms and Architectures for Parallel Processing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Avx9DwAAQBAJ&source=gbs_api","authors":["Jaideep Vaidya","Jin Li"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QpreDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"WESOACS, ASOCA, ISYCC, TBCE, and STRAPS, Toulouse, France, October 28–31, 2019, Revised Selected Papers","description":"This book constitutes the revised selected papers of the scientific satellite events that were held in conjunction with the 17th International Conference on Service-Oriented Computing, ICSOC 2019, held in Toulouse, France, in October 2019. The ICSOC 2019 workshop track consisted of five workshops on a wide range of topics that fall into the general area of service computing: - The 15th International Workshop on Engineering Service-Oriented Applications and Cloud Services (WESOACS). 4 papers over the 6 received submissions were accepted. - The 4th International Workshop on Adaptive Service-oriented and Cloud Applications (ASOCA). 2 papers over the 4 received submissions were accepted. Moreover, 2 invited papers were presented in this workshop. - The 4th International IoT Systems Provisioning & Management for Context-Aware Smart Cities (ISYCC). 3 papers over the 5 received submissions were accepted. Moreover, 3 invited papers were presented in this workshop. - The 1st edition of Towards Blockchain-Based Collaborative Enterprise (TBCE). It accepted 2 papers over the 3 received submissions. - The 1st edition of Smart daTa integRation And Processing on Service based environments (STRAPS). 3 papers over the 7 received submissions were accepted. An additional invited paper was presented in this workshop.","language":"en","currency":"USD","id":"3030459896","title":"Service-Oriented Computing – ICSOC 2019 Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QpreDwAAQBAJ&source=gbs_api","authors":["Sami Yangui","Athman Bouguettaya","Xiao Xue","Noura Faci","Walid Gaaloul","Qi Yu","Zhangbing Zhou","Nathalie Hernandez","Elisa Y. Nakagawa"]},{"pageCount":347,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dmclDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT 2017) –","description":"The volume presents a collection of peer-reviewed articles from the 9th KES International Conference on Intelligent Decision Technologies (KES-IDT-17), held in Vilamoura, Algarve, Portugal on 21–23 June 2017. The conference addressed critical areas of computer science, as well as promoting knowledge transfer and the generation of new ideas in the field of intelligent decision making, project management and data analysis. The range of topics addressed includes methods of classification, prediction, data analysis, decision support, modeling, social media and many more in such diverse areas as finance, linguistics, management and transportation.","language":"en","currency":"USD","id":"3319594249","title":"Intelligent Decision Technologies 2017","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dmclDwAAQBAJ&source=gbs_api","authors":["Ireneusz Czarnowski","Robert J Howlett","Lakhmi C. Jain"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=18RXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"12th IFIP WG 5.11 International Symposium, ISESS 2017, Zadar, Croatia, May 10-12, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 12th IFIP WG 5.11 International Symposium on Environmental Software Systems, ISESS 2017, held in Zadar, Croatia, in May 2017. The 35 revised full papers presented together with 4 keynote lectures were carefully reviewed and selected from 46 submissions. The papers deal with environmental challenges and try to provide solutions using forward-looking and leading-edge IT technology. They are organized in the following topical sections: air and climate; water and hydrosphere; health and biosphere; risk and disaster management; information systems; and modelling, visualization and decision support.","language":"en","currency":"USD","id":"331989935X","title":"Environmental Software Systems. Computer Science for Environmental Protection","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=18RXDwAAQBAJ&source=gbs_api","authors":["Jiří Hřebíček","Ralf Denzer","Gerald Schimak","Tomáš Pitner"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Der pragmatische Einstieg","description":"Continuous Delivery ermöglicht es, Software viel schneller und mit wesentlich höherer Zuverlässigkeit in Produktion zu bringen, als es bisher möglich war. Grundlage dafür ist eine Continuous-Delivery-Pipeline, die das Ausrollen der Software weitgehend automatisiert und so einen reproduzierbaren, risikoarmen Prozess für die Bereitstellung neuer Releases bietet. Dieses Buch macht Sie mit dem Aufbau einer Continuous-Delivery-Pipeline vertraut und erklärt, welche Technologien Sie dazu einsetzen können. Dabei lernen Sie u.a. folgende Themen kennen: • Infrastruktur-Automatisierung mit Chef, Docker und Vagrant • Automatisierung von Builds und Continuous Integration • Akzeptanztests, Kapazitätstests, exploratives Testen • Einführung von Continuous Delivery im Unternehmen • Continuous Delivery und DevOps • Auswirkungen auf die Softwarearchitektur Als praktisches Beispiel wird ein konkreter Technologie- Stack vorgestellt. Zahlreiche Aufgaben und Vorschläge für weitergehende Experimente laden Sie darüber hinaus zur praktischen Vertiefung des Themas ein. Nach der Lektüre können Sie abschätzen, welche Vorteile Continuous Delivery konkret bietet, und Sie verfügen über das nötige Handwerkszeug, um Continuous Delivery in Ihrem eigenen Arbeitsumfeld zu etablieren. Die Neuauflage wurde in Bezug auf Werkzeuge wie Docker, Jenkins, Graphite und den ELK-Stack aktualisiert. An neuen Themen sind Docker Compose, Docker Machine, Immutable Server, Microservices und die Einführung von Continuous Delivery ohne DevOps hinzugekommen.","language":"de","currency":"USD","id":"3864919304","title":"Continuous Delivery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sq32DwAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8-8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"20th International Conference, Manchester, UK, November 14–16, 2019, Proceedings","description":"This two-volume set of LNCS 11871 and 11872 constitutes the thoroughly refereed conference proceedings of the 20th International Conference on Intelligent Data Engineering and Automated Learning, IDEAL 2019, held in Manchester, UK, in November 2019. The 94 full papers presented were carefully reviewed and selected from 149 submissions. These papers provided a timely sample of the latest advances in data engineering and machine learning, from methodologies, frameworks, and algorithms to applications. The core themes of IDEAL 2019 include big data challenges, machine learning, data mining, information retrieval and management, bio-\/neuro-informatics, bio-inspired models (including neural networks, evolutionary computation and swarm intelligence), agents and hybrid intelligent systems, real-world applications of intelligent techniques and AI.","language":"en","currency":"USD","id":"3030336077","title":"Intelligent Data Engineering and Automated Learning – IDEAL 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8-8DwAAQBAJ&source=gbs_api","authors":["Hujun Yin","David Camacho","Peter Tino","Antonio J. Tallón-Ballesteros","Ronaldo Menezes","Richard Allmendinger"]},{"pageCount":829,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QYolDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":"Euro-Par 2016 International Workshops, Grenoble, France, August 24-26, 2016, Revised Selected Papers","description":"This book constitutes the proceedings of the workshops of the 23rd International Conference on Parallel and Distributed Computing, Euro-Par 2016, held in Grenoble, France in August 2016. The 65 full papers presented were carefully reviewed and selected from 95 submissions. The volume includes the papers from the following workshops: Euro-EDUPAR (Second European Workshop on Parallel and Distributed Computing Education for Undergraduate Students) – HeteroPar 2016 (the 14th International Workshop on Algorithms, Models and Tools for Parallel Computing on Heterogeneous Platforms) – IWMSE (5th International Workshop on Multicore Software Engineering) – LSDVE (Fourth Workshop on Large-Scale Distributed Virtual Environments) - PADABS (Fourth Workshop on Parallel and Distributed Agent-Based Simulations) – PBio (Fourth International Workshop on Parallelism in Bioinformatics) – PELGA (Second Workshop on Performance Engineering for Large-Scale Graph Analytics) – REPPAR (Third International Workshop on Reproducibility in Parallel Computing) – Resilience (9th Workshop in Resilience in High Performance Computing in Clusters, Clouds, and Grids) – ROME (Fourth Workshop on Runtime and Operating Systems for the Many-Core Era) – UCHPC (9th Workshop on UnConventional High-Performance Computing).","language":"en","currency":"USD","id":"3319589431","title":"Euro-Par 2016: Parallel Processing Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QYolDwAAQBAJ&source=gbs_api","authors":["Frédéric Desprez","Pierre-François Dutot","Christos Kaklamanis","Loris Marchal","Korbinian Molitorisz","Laura Ricci","Vittorio Scarano","Miguel A. Vega-Rodríguez","Ana Lucia Varbanescu","Sascha Hunold","Stephen L. Scott","Stefan Lankes","Josef Weidendorfer"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7PLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"BPM 2016 International Workshops, Rio de Janeiro, Brazil, September 19, 2016, Revised Papers","description":"This book constitutes the revised papers of the ten international workshops that were held at BPM 2016, the 14th International Conference on Business Process Management, held in Rio de Janeiro, Brazil, in September 2016. The 36 papers included in this volume were carefully reviewed and selected from a total of 64 submissions. They are from the following workshops: BPI 2016 – 12th International Workshop on Business Process Intelligence; BPMO 2016 – 1st Workshop on Workshop on Business Process Management and Ontologies; BPMS2 2016 – 9th Workshop on Social and Human Aspects of Business Process Management; DeMiMoP 2016 – 4th International Workshop on Decision Mining & Modeling for Business Processes; IWPE 2016 – 2nd International Workshop on Process Engineering; PQ 2016 – 1st International Workshop on Process Querying; ReMa 2016 – 1st Workshop on Resource Management in Business Processes; PRAISE 2016 – 1st International Workshop on Runtime Analysis of Process-Aware Information Systems; SABPM 2016 – 1st International Workshop on Sustainability-Aware Business Process Management; TAProViz 2016 – 5th International Workshop on Theory and Application of Visualizations and Human-centric Aspects in Processes.","language":"en","currency":"USD","id":"331958457X","title":"Business Process Management Workshops","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7PLDgAAQBAJ&source=gbs_api","authors":["Marlon Dumas","Marcelo Fantinato"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6QtjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"The 15th International Symposium on Distributed Computing and Artificial Intelligence 2018 (DCAI 2018) is a forum to present applications of innovative techniques for studying and solving complex problems. The exchange of ideas between scientists and technicians from both the academic and industrial sector is essential to facilitate the development of systems that can meet the ever-increasing demands of today’s society. The present edition brings together past experience, current work and promising future trends associated with distributed computing, artificial intelligence and their application in order to provide efficient solutions to real problems. This symposium is organized by the University of Castilla-La Mancha, the Osaka Institute of Technology and the University of Salamanca. The present edition was held in Toledo, Spain, from 20th – 22nd June, 2018.","language":"en","currency":"USD","id":"3319946498","title":"Distributed Computing and Artificial Intelligence, 15th International Conference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6QtjDwAAQBAJ&source=gbs_api","authors":["Fernando De La Prieta","Sigeru Omatu","Antonio Fernández-Caballero"]},{"pageCount":233,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GXioDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"8th International Conference, CLOSER 2018, Funchal, Madeira, Portugal, March 19-21, 2018, Revised Selected Papers","description":"This book constitutes extended, revised and selected papers from the 8th International Conference on Cloud Computing and Services Science, CLOSER 2018, held in Funchal, Portugal in March 2018. The 11 papers presented in this volume were carefully reviewed and selected from a total of 94 submissions. CLOSER 2018 focused on the emerging area of Cloud Computing, inspired by some latest advances that concern the infrastructure, operations and available services throughout the global network.","language":"en","currency":"USD","id":"3030291936","title":"Cloud Computing and Services Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GXioDwAAQBAJ&source=gbs_api","authors":["Víctor Méndez Muñoz","Donald Ferguson","Markus Helfert","Claus Pahl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RYtHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"11th International Andrei P. Ershov Informatics Conference, PSI 2017, Moscow, Russia, June 27-29, 2017, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 11th International Andrei P. Ershov Informatics Conference, PSI 2017, held in Moscow, Russia, in June 2017. The 31 full papers presented in this volume were carefully reviewed and selected from 57 submissions. The papers cover various topics related to the foundations of program and system development and analysis, programming methodology and software engineering and information technologies.","language":"en","currency":"USD","id":"3319743139","title":"Perspectives of System Informatics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RYtHDwAAQBAJ&source=gbs_api","authors":["Alexander K. Petrenko","Andrei Voronkov"]},{"pageCount":405,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OaafDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"13th International Conference, ENASE 2018, Funchal, Madeira, Portugal, March 23–24, 2018, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 13th International Conference on Evaluation of Novel Approaches to Software Engineering, ENASE 2018, held in Funchal, Madeira, Portugal, in March 2018. The 17 revised full papers and 5 revised short papers presented were carefully reviewed and selected from 95 submissions. The papers are organized in topical sections on service science and business information systems and software engineering.","language":"en","currency":"USD","id":"3030225593","title":"Evaluation of Novel Approaches to Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OaafDwAAQBAJ&source=gbs_api","authors":["Ernesto Damiani","George Spanoudakis","Leszek A. Maciaszek"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KfecDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"14th International Conference, KMO 2019, Zamora, Spain, July 15–18, 2019, Proceedings","description":"This book contains the refereed proceedings of the 14th International Conference on Knowledge Management in Organizations, KMO 2019, held in Zamora, Spain, in July 2019. The 46 papers accepted for KMO 2018 were selected from 109 submissions and are organized in topical sections on: knowledge management models and analysis; knowledge transfer and learning; knowledge and service innovation; knowledge creation; knowledge and organization; information systems and information science; data mining and intelligent science; social networks and social aspects of KM; big data and IoT; and new trends in IT.","language":"en","currency":"USD","id":"3030214516","title":"Knowledge Management in Organizations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KfecDwAAQBAJ&source=gbs_api","authors":["Lorna Uden","I-Hsien Ting","Juan Manuel Corchado"]},{"pageCount":157,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_hZtCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"Third Future Internet Symposium, Berlin, Germany, September 20-22, 2010. Proceedings","description":"This book constitutes the proceedings of the Third Future Internet Symposium, FIS, held in Berlin, Germany in September 2010.The aim of this symposium was to bring together scientists and engineers from academia and industry and from various disciplines to exchange and discuss their ideas, views, and research results towards a consolidated, converged and sustainable future internet. The 16 revised full papers presented were carefully reviewed and selected from numerous submissions. The papers cover a wide range of topics such as future internet architectures and protocols; semantic technologies; and internet of services, things and content.","language":"en","currency":"USD","id":"3642158773","title":"Future Internet - FIS 2010","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_hZtCQAAQBAJ&source=gbs_api","authors":["Arne J. Berre","Asunción Gómez-Pérez","Kurt Tutschku"]}]