[{"pageCount":351,"thumbnail":"http:\/\/books.google.com\/books\/content?id=msO4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Practical Guide to Successfully Using Both in Your Projects","description":"Combine the strengths of Angular, the leading framework for developing complex client-side applications, and ASP.NET Core MVC 3, the latest evolution of Microsoft’s framework for server-side applications. This new edition offers updated Angular, ASP.NET Core 3, Entity Framework Core 3 examples, an all-new chapter on interoperability with Blazor, and more! Best-selling author Adam Freeman brings together these two key technologies and explains how to use ASP.NET Core MVC 3 to provide back-end services for Angular applications. This fast-paced and practical guide starts from the nuts and bolts and gives you the knowledge you need to combine Angular and ASP.NET Core MVC 3 in your projects. Each topic is covered clearly and concisely and is packed with the essential details you need to learn to be truly effective. What You Will Learn Gain a solid understanding of how ASP.NET Core MVC 3 and Angular can work together Utilize both Visual Studio and Visual Studio Code to develop Angular\/ASP.NET Core MVC projects Create ASP.NET Core RESTful web services to support Angular applications Expose data from Entity Framework Core to Angular applications Use ASP.NET Core Identity to provide security services to Angular applications Understand how Angular and Blazor applications can work together Who This Book Is For This book is for developers with knowledge of ASP.NET Core MVC who are introducing Angular into their projects.","language":"en","currency":"USD","id":"1484252845","title":"Essential Angular for ASP.NET Core MVC 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=msO4DwAAQBAJ&source=gbs_api","authors":["Adam Freeman"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=V3EtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Tools and Techniques for Developers","description":"Concurrency can be notoriously difficult to get right, but fortunately, the Go open source programming language makes working with concurrency tractable and even easy. If you’re a developer familiar with Go, this practical book demonstrates best practices and patterns to help you incorporate concurrency into your systems. Author Katherine Cox-Buday takes you step-by-step through the process. You’ll understand how Go chooses to model concurrency, what issues arise from this model, and how you can compose primitives within this model to solve problems. Learn the skills and tooling you need to confidently write and implement concurrent systems of any size. Understand how Go addresses fundamental problems that make concurrency difficult to do correctly Learn the key differences between concurrency and parallelism Dig into the syntax of Go’s memory synchronization primitives Form patterns with these primitives to write maintainable concurrent code Compose patterns into a series of practices that enable you to write large, distributed systems that scale Learn the sophistication behind goroutines and how Go’s runtime stitches everything together","language":"en","currency":"USD","id":"1491941308","title":"Concurrency in Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=V3EtDwAAQBAJ&source=gbs_api","authors":["Katherine Cox-Buday"]},{"pageCount":1120,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nSWSvHi8clAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.19,"subtitle":null,"description":"Here is the CORBA book that every C++ software engineer has been waiting for. Advanced CORBA® Programming with C++ provides designers and developers with the tools required to understand CORBA technology at the architectural, design, and source code levels. This book offers hands-on explanations for building efficient applications, as well as lucid examples that provide practical advice on avoiding costly mistakes. With this book as a guide, programmers will find the support they need to successfully undertake industrial-strength CORBA development projects. The content is systematically arranged and presented so the book may be used as both a tutorial and a reference. The rich example programs in this definitive text show CORBA developers how to write clearer code that is more maintainable, portable, and efficient. The authors' detailed coverage of the IDL-to-C++ mapping moves beyond the mechanics of the APIs to discuss topics such as potential pitfalls and efficiency. An in-depth presentation of the new Portable Object Adapter (POA) explains how to take advantage of its numerous features to create scalable and high-performance servers. In addition, detailed discussion of advanced topics, such as garbage collection and multithreading, provides developers with the knowledge they need to write commercial applications. Other highlights In-depth coverage of IDL, including common idioms and design trade-offs Complete and detailed explanations of the Life Cycle, Naming, Trading, and Event Services Discussion of IIOP and implementation repositories Insight into the dynamic aspects of CORBA, such as dynamic typing and the new DynAny interfaces Advice on selecting appropriate application architectures and designs Detailed, portable, and vendor-independent source code","language":"en","currency":"USD","id":"0672333945","title":"Advanced CORBA® Programming with C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nSWSvHi8clAC&source=gbs_api","authors":["Michi Henning","Steve Vinoski"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fmDwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Securely orchestrate, scale, and manage your microservices in Kubernetes deployments","description":"Kubernetes is a widely used opensource orchestration platform for managing container applications. Developers are not yet aware of the pitfalls of a containerized environment. This book takes you through core security principles, best practices, and real-world use cases to learn mitigation or prevention strategies from known attacks and CVEs.","language":"en","currency":"USD","id":"1839212187","title":"Learn Kubernetes Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fmDwDwAAQBAJ&source=gbs_api","authors":["Kaizhe Huang","Pranjal Jumde"]},{"pageCount":88,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ccRsBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.95,"subtitle":"Definitions and Pattern Summaries","description":"Domain-Driven Design (DDD) is an approach to software development for complex businesses and other domains. DDD tackles that complexity by focusing the team's attention on knowledge of the domain, picking apart the most tricky, intricate problems with models, and shaping the software around those models. Easier said than done! The techniques of DDD help us approach this systematically. This reference gives a quick and authoritative summary of the key concepts of DDD. It is not meant as a learning introduction to the subject. Eric Evans' original book and a handful of others explain DDD in depth from different perspectives. On the other hand, we often need to scan a topic quickly or get the gist of a particular pattern. That is the purpose of this reference. It is complementary to the more discursive books. The starting point of this text was a set of excerpts from the original book by Eric Evans, Domain-Driven-Design: Tackling Complexity in the Heart of Software, 2004 - in particular, the pattern summaries, which were placed in the Creative Commons by Evans and the publisher, Pearson Education. In this reference, those original summaries have been updated and expanded with new content. The practice and understanding of DDD has not stood still over the past decade, and Evans has taken this chance to document some important refinements. Some of the patterns and definitions have been edited or rewritten by Evans to clarify the original intent. Three patterns have been added, describing concepts whose usefulness and importance has emerged in the intervening years. Also, the sequence and grouping of the topics has been changed significantly to better emphasize the core principles. This is an up-to-date, quick reference to DDD.","language":"en","currency":"USD","id":"1457501198","title":"Domain-Driven Design Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ccRsBgAAQBAJ&source=gbs_api","authors":["Eric Evans"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WkyMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.39,"subtitle":"Building, Deploying, and Scaling Modern Applications in the Cloud","description":"Kubernetes is the operating system of the cloud native world, providing a reliable and scalable platform for running containerized workloads. In this friendly, pragmatic book, cloud experts John Arundel and Justin Domingus show you what Kubernetes can do—and what you can do with it. You’ll learn all about the Kubernetes ecosystem, and use battle-tested solutions to everyday problems. You’ll build, step by step, an example cloud native application and its supporting infrastructure, along with a development environment and continuous deployment pipeline that you can use for your own applications. Understand containers and Kubernetes from first principles; no experience necessary Run your own clusters or choose a managed Kubernetes service from Amazon, Google, and others Use Kubernetes to manage resource usage and the container lifecycle Optimize clusters for cost, performance, resilience, capacity, and scalability Learn the best tools for developing, testing, and deploying your applications Apply the latest industry practices for security, observability, and monitoring Adopt DevOps principles to help make your development teams lean, fast, and effective","language":"en","currency":"USD","id":"1492040711","title":"Cloud Native DevOps with Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WkyMDwAAQBAJ&source=gbs_api","authors":["John Arundel","Justin Domingus"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82C-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":100,"subtitle":"Powering Digitalization","description":"5G Core Networks: Powering Digitalization provides an overview of the 5G Core network architecture, as well as giving descriptions of cloud technologies and the key concepts in the 3GPP rel-15\/16 specifications. Written by the authors who are heavily involved in development of the 5G standards and who wrote the successful book on EPC and 4G Packet Networks, this book provides an authoritative reference on the technologies and standards of the 3GPP 5G Core network. Content includes: An overview of the 5G Core Architecture The Stand-Alone and Non-Stand-Alone Architectures Detailed presentation of 5G Core key concepts An overview of 5G Radio and Cloud technologies Learn The differences between the 5G Core network and previous core network generations How the interworking with previous network standards is defined Why certain functionality has been included and what is beyond the scope of 5G Core How the specifications relate to state-of-the-art web-scale concepts and virtualization technologies Details of the protocol and service descriptions Examples of network deployment options Provides a clear, concise and comprehensive view of 5GS\/5GC Written by established experts in the 5GS\/5GC standardization process, all of whom have extensive experience and understanding of its goals, history and vision Covers potential service and operator scenarios for each architecture Explains the Service Based Architecture, Network Slicing and support of Edge Computing, describing the benefits they will bring Explains what options and parts of the standards will initially be deployed in real networks, along with their migration paths","language":"en","currency":"USD","id":"008103010X","title":"5G Core Networks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82C-DwAAQBAJ&source=gbs_api","authors":["Stefan Rommer","Peter Hedman","Magnus Olsson","Lars Frid","Shabnam Sultana","Catherine Mulligan"]},{"pageCount":390,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eG4SQYqG3YAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"This is the first textbook treatment of the algebraic approach to graph transformation, based on algebraic structures and category theory. It contains an introduction to classical graphs. Basic and advanced results are first shown for an abstract form of replacement systems and are then instantiated to several forms of graph and Petri net transformation systems. The book develops typed attributed graph transformation and contains a practical case study.","language":"en","currency":"USD","id":"3540311882","title":"Fundamentals of Algebraic Graph Transformation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eG4SQYqG3YAC&source=gbs_api","authors":["Hartmut Ehrig","Karsten Ehrig","Ulrike Prange","Gabriele Taentzer"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1ZlUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, deploy, and configure cloud-based, enterprise Java applications with WildFly Swarm and OpenShift","description":"Create microservices using Java EE technologies with WildFly Swarm,deploy them in the OpenShift cloud, make them resilient to network failures using Hystrix, configure continuous integration using Jenkins, and security using Keycloak. Key Features Create functional microservices with WildFly Swarm Use OpenShift to deploy your microservices in the cloud Make your application production-ready using Jenkins, Hystrix, and Keycloak Book Description The book starts by introducing you to WildFly Swarm—a tool that allows you to create runnable microservices from Java EE components. You’ll learn the basics of Swarm operation—creating microservices containing only the parts of enterprise runtime needed in a specific case. Later, you’ll learn how to configure and test those services. In order to deploy our services in the cloud, we’ll use OpenShift. You’ll get to know basic information on its architecture, features, and relationship to Docker and Kubernetes. Later, you’ll learn how to deploy and configure your services to run in the OpenShift cloud. In the last part of the book, you’ll see how to make your application production-ready. You’ll find out how to configure continuous integration for your services using Jenkins, make your application resistant to network failures using Hystrix, and how to secure them using Keycloak. By the end of the book, you’ll have a functional example application and will have practical knowledge of Java EE cloud development that can be used as a reference in your other projects. What you will learn Utilize Java EE technology to develop modern cloud-enabled applications Easily create microservices with WildFly Swarm using proven Java EE technologies See the benefits of OpenShift – easy deployment of your services, out of the box scalability and healing, and integration with Continuous Integration tools Integrate the sample application with Jenkins’ Continuous Integration server Utilize Hystrix to provide resilience​ to your application Provide security to your application using Keycloak Who this book is for If you're an experienced developer familiar with Java EE technologies and would like to learn how you can use those technologies in the cloud with WildFly and OpenShift, then this book is for you.","language":"en","currency":"USD","id":"1787283801","title":"Hands-On Cloud Development with WildFly","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1ZlUDwAAQBAJ&source=gbs_api","authors":["Tomasz Adamski"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6pZCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.28,"subtitle":null,"description":"The rules and practices for Scrum—a simple process for managing complex projects—are few, straightforward, and easy to learn. But Scrum’s simplicity itself—its lack of prescription—can be disarming, and new practitioners often find themselves reverting to old project management habits and tools and yielding lesser results. In this illuminating series of case studies, Scrum co-creator and evangelist Ken Schwaber identifies the real-world lessons—the successes and failures—culled from his years of experience coaching companies in agile project management. Through them, you’ll understand how to use Scrum to solve complex problems and drive better results—delivering more valuable software faster. Gain the foundation in Scrum theory—and practice—you need to: Rein in even the most complex, unwieldy projects Effectively manage unknown or changing product requirements Simplify the chain of command with self-managing development teams Receive clearer specifications—and feedback—from customers Greatly reduce project planning time and required tools Build—and release—products in 30-day cycles so clients get deliverables earlier Avoid missteps by regularly inspecting, reporting on, and fine-tuning projects Support multiple teams working on a large-scale project from many geographic locations Maximize return on investment!","language":"en","currency":"USD","id":"0735637903","title":"Agile Project Management with Scrum","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6pZCAwAAQBAJ&source=gbs_api","authors":["Ken Schwaber"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o86PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Level up your Go programming skills to develop faster and more efficient code","description":"Explore Golang's data structures and algorithms to design, implement, and analyze code in the professional setting Key Features Learn the basics of data structures and algorithms and implement them efficiently Use data structures such as arrays, stacks, trees, lists and graphs in real-world scenarios Compare the complexity of different algorithms and data structures for improved code performance Book Description Golang is one of the fastest growing programming languages in the software industry. Its speed, simplicity, and reliability make it the perfect choice for building robust applications. This brings the need to have a solid foundation in data structures and algorithms with Go so as to build scalable applications. Complete with hands-on tutorials, this book will guide you in using the best data structures and algorithms for problem solving. The book begins with an introduction to Go data structures and algorithms. You'll learn how to store data using linked lists, arrays, stacks, and queues. Moving ahead, you'll discover how to implement sorting and searching algorithms, followed by binary search trees. This book will also help you improve the performance of your applications by stringing data types and implementing hash structures in algorithm design. Finally, you'll be able to apply traditional data structures to solve real-world problems. By the end of the book, you'll have become adept at implementing classic data structures and algorithms in Go, propelling you to become a confident Go programmer. What you will learn Improve application performance using the most suitable data structure and algorithm Explore the wide range of classic algorithms such as recursion and hashing algorithms Work with algorithms such as garbage collection for efficient memory management Analyze the cost and benefit trade-off to identify algorithms and data structures for problem solving Explore techniques for writing pseudocode algorithm and ace whiteboard coding in interviews Discover the pitfalls in selecting data structures and algorithms by predicting their speed and efficiency Who this book is for This book is for developers who want to understand how to select the best data structures and algorithms that will help solve coding problems. Basic Go programming experience will be an added advantage.","language":"en","currency":"USD","id":"178961841X","title":"Learn Data Structures and Algorithms with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o86PDwAAQBAJ&source=gbs_api","authors":["Bhagvan Kommadi"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jiménez","Graham Lee","Corey Wade"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ntROCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get to grips with key data visualization and predictive analytic skills using R About This Book Acquire predictive analytic skills using various tools of R Make predictions about future events by discovering valuable information from data using R Comprehensible guidelines that focus on predictive model design with real-world data Who This Book Is For If you are a statistician, chief information officer, data scientist, ML engineer, ML practitioner, quantitative analyst, and student of machine learning, this is the book for you. You should have basic knowledge of the use of R. Readers without previous experience of programming in R will also be able to use the tools in the book. What You Will Learn Customize R by installing and loading new packages Explore the structure of data using clustering algorithms Turn unstructured text into ordered data, and acquire knowledge from the data Classify your observations using Naive Bayes, k-NN, and decision trees Reduce the dimensionality of your data using principal component analysis Discover association rules using Apriori Understand how statistical distributions can help retrieve information from data using correlations, linear regression, and multilevel regression Use PMML to deploy the models generated in R In Detail R is statistical software that is used for data analysis. There are two main types of learning from data: unsupervised learning, where the structure of data is extracted automatically; and supervised learning, where a labeled part of the data is used to learn the relationship or scores in a target attribute. As important information is often hidden in a lot of data, R helps to extract that information with its many standard and cutting-edge statistical functions. This book is packed with easy-to-follow guidelines that explain the workings of the many key data mining tools of R, which are used to discover knowledge from your data. You will learn how to perform key predictive analytics tasks using R, such as train and test predictive models for classification and regression tasks, score new data sets and so on. All chapters will guide you in acquiring the skills in a practical way. Most chapters also include a theoretical introduction that will sharpen your understanding of the subject matter and invite you to go further. The book familiarizes you with the most common data mining tools of R, such as k-means, hierarchical regression, linear regression, association rules, principal component analysis, multilevel modeling, k-NN, Naive Bayes, decision trees, and text mining. It also provides a description of visualization techniques using the basic visualization tools of R as well as lattice for visualizing patterns in data organized in groups. This book is invaluable for anyone fascinated by the data mining opportunities offered by GNU R and its packages. Style and approach This is a practical book, which analyzes compelling data about life, health, and death with the help of tutorials. It offers you a useful way of interpreting the data that's specific to this book, but that can also be applied to any other data.","language":"en","currency":"USD","id":"1782169369","title":"Learning Predictive Analytics with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ntROCwAAQBAJ&source=gbs_api","authors":["Eric Mayor"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pR0-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Test Driven Development with JUnit 5","description":"Explore the new way of building and maintaining test cases with Java test driven development (TDD) using JUnit 5. This book doesn't just talk about the new concepts, it shows you ways of applying them in TDD and Java 8 to continuously deliver code that excels in all metrics. Unit testing and test driven development have now become part of every developer's skill set. For Java developers, the most popular testing tool has been JUnit, and JUnit 5 is built using the latest features of Java. With Java Unit Testing with JUnit 5, you'll master these new features, including method parameters, extensions, assertions and assumptions, and dynamic tests. You'll also see how to write clean tests with less code. This book is a departure from using older practices and presents new ways of performing tests, building assertions, and injecting dependencies. What You Will Learn Write tests the JUnit 5 way Run your tests from within your IDE Integrate tests with your build and static analysis tools Migrate from JUnit 4 to JUnit 5 Who This Book Is For Java developers both with and without any prior unit testing experience.","language":"en","currency":"USD","id":"1484230159","title":"Java Unit Testing with JUnit 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pR0-DwAAQBAJ&source=gbs_api","authors":["Shekhar Gulati","Rahul Sharma"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SyHlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Load, wrangle, and analyze your data using the world's most powerful statistical programming language About This Book Load, manipulate and analyze data from different sources Gain a deeper understanding of fundamentals of applied statistics A practical guide to performing data analysis in practice Who This Book Is For Whether you are learning data analysis for the first time, or you want to deepen the understanding you already have, this book will prove to an invaluable resource. If you are looking for a book to bring you all the way through the fundamentals to the application of advanced and effective analytics methodologies, and have some prior programming experience and a mathematical background, then this is for you. What You Will Learn Navigate the R environment Describe and visualize the behavior of data and relationships between data Gain a thorough understanding of statistical reasoning and sampling Employ hypothesis tests to draw inferences from your data Learn Bayesian methods for estimating parameters Perform regression to predict continuous variables Apply powerful classification methods to predict categorical data Handle missing data gracefully using multiple imputation Identify and manage problematic data points Employ parallelization and Rcpp to scale your analyses to larger data Put best practices into effect to make your job easier and facilitate reproducibility In Detail Frequently the tool of choice for academics, R has spread deep into the private sector and can be found in the production pipelines at some of the most advanced and successful enterprises. The power and domain-specificity of R allows the user to express complex analytics easily, quickly, and succinctly. With over 7,000 user contributed packages, it's easy to find support for the latest and greatest algorithms and techniques. Starting with the basics of R and statistical reasoning, Data Analysis with R dives into advanced predictive analytics, showing how to apply those techniques to real-world data though with real-world examples. Packed with engaging problems and exercises, this book begins with a review of R and its syntax. From there, get to grips with the fundamentals of applied statistics and build on this knowledge to perform sophisticated and powerful analytics. Solve the difficulties relating to performing data analysis in practice and find solutions to working with “messy data”, large data, communicating results, and facilitating reproducibility. This book is engineered to be an invaluable resource through many stages of anyone's career as a data analyst. Style and approach Learn data analysis using engaging examples and fun exercises, and with a gentle and friendly but comprehensive \"learn-by-doing\" approach.","language":"en","currency":"USD","id":"1785286447","title":"Data Analysis with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SyHlCwAAQBAJ&source=gbs_api","authors":["Tony Fischetti"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2E7lAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"A step-by-step pragmatic approach to web application development using Spring MVC, with relevant screenshots and concise explanations. This book is aimed at helping Java developers who want to teach themselves Spring MVC, even if they have no previous experience with Spring MVC. It would be helpful to have a bit of familiarity with basic servlet programming concepts, but no prior experience is required.","language":"en","currency":"USD","id":"1783284889","title":"Spring MVC Beginner’s Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2E7lAwAAQBAJ&source=gbs_api","authors":["Amuthan G"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jOpgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable applications using traditional, reactive, and concurrent design patterns in Kotlin","description":"Make the most of Kotlin by leveraging design patterns and best practices to build scalable and high performing apps Key Features Understand traditional GOF design patterns to apply generic solutions Shift from OOP to FP; covering reactive and concurrent patterns in a step-by-step manner Choose the best microservices architecture and MVC for your development environment Book Description Design patterns enable you as a developer to speed up the development process by providing you with proven development paradigms. Reusing design patterns helps prevent complex issues that can cause major problems, improves your code base, promotes code reuse, and makes an architecture more robust. The mission of this book is to ease the adoption of design patterns in Kotlin and provide good practices for programmers. The book begins by showing you the practical aspects of smarter coding in Kotlin, explaining the basic Kotlin syntax and the impact of design patterns. From there, the book provides an in-depth explanation of the classical design patterns of creational, structural, and behavioral families, before heading into functional programming. It then takes you through reactive and concurrent patterns, teaching you about using streams, threads, and coroutines to write better code along the way By the end of the book, you will be able to efficiently address common problems faced while developing applications and be comfortable working on scalable and maintainable projects of any size. What you will learn Get to grips with Kotlin principles, including its strengths and weaknesses Understand classical design patterns in Kotlin Explore functional programming using built-in features of Kotlin Solve real-world problems using reactive and concurrent design patterns Use threads and coroutines to simplify concurrent code flow Understand antipatterns to write clean Kotlin code, avoiding common pitfalls Learn about the design considerations necessary while choosing between architectures Who this book is for This book is for developers who would like to master design patterns with Kotlin to build efficient and scalable applications. Basic Java or Kotlin programming knowledge is assumed","language":"en","currency":"USD","id":"1788999592","title":"Hands-On Design Patterns with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jOpgDwAAQBAJ&source=gbs_api","authors":["Alexey Soshin"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uXoXN-ZhmqMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Principles, Patterns & Constraints for Building Enterprise Solutions with REST","description":"The Definitive Guide to Building Web-Centric SOA with REST The World Wide Web is based on the most successful technology architecture in history. It has changed how we view, access, and exchange information and, with the advent of REST, it has also provided us with compelling ways to build and improve automation solutions. REST provides a great deal of guidance to ensure that an architecture and its automation logic are technically sound, though it is still your responsibility to build services that actually add value to your business. SOA with REST is the first comprehensive tutorial and reference for designing and building RESTful services as part of service-oriented solutions and in conjunction with service-oriented architecture (SOA). This book demonstrates that REST is not only a suitable medium for building truly service-oriented solutions, but also that the service-oriented architectural model is a necessary foundation for REST technology architectures to realize their full business potential. The authors provide thorough mapping of REST constraints and architectural goals with service-orientation principles and SOA characteristics. Using real-world examples, they show how to leverage REST’s simplicity, flexibility, and low overhead without compromising the power or manageability of service-oriented solutions and architectures. This ebook will be valuable to IT architects, developers, and any practitioner seeking to use SOA and REST together.","language":"en","currency":"USD","id":"0132869918","title":"SOA with REST","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uXoXN-ZhmqMC&source=gbs_api","authors":["Thomas Erl","Benjamin Carlyle","Cesare Pautasso","Raj Balasubramanian","Herbj¿rn Wilhelmsen","David Booth"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jJAEEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Don’t Let the Real Test Be Your First Test! Prepare to pass the CySA+ Cybersecurity Analyst certification exam CS0-002 and obtain the latest security credential from CompTIA using the practice questions contained in this guide. CompTIA CySA+TM Cybersecurity Analyst Certification Practice Exams offers 100% coverage of all objectives for the exam. Written by a leading information security expert and experienced instructor, this guide includes knowledge, scenario, and performance-based questions. Throughout, in-depth explanations are provided for both correct and incorrect answers. Between the book and online content, you will get more than 500 practice questions designed to fully prepare you for the challenging exam. This guide is ideal as a companion to CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide, Second Edition (Exam CS0-002). Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: 200+ practice exam questions Interactive performance-based questions Test engine that provides full-length practice exams and customizable quizzes by chapter or exam objective","language":"en","currency":"USD","id":"1260473643","title":"CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jJAEEAAAQBAJ&source=gbs_api","authors":["Kelly Sparks"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I_3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Automating the Container Orchestration Platform","description":"Operators are a way of packaging, deploying, and managing Kubernetes applications. A Kubernetes application doesn’t just run on Kubernetes; it’s composed and managed in Kubernetes terms. Operators add application-specific operational knowledge to a Kubernetes cluster, making it easier to automate complex, stateful applications and to augment the platform. Operators can coordinate application upgrades seamlessly, react to failures automatically, and streamline repetitive maintenance like backups. Think of Operators as site reliability engineers in software. They work by extending the Kubernetes control plane and API, helping systems integrators, cluster administrators, and application developers reliably deploy and manage key services and components. Using real-world examples, authors Jason Dobies and Joshua Wood demonstrate how to use Operators today and how to create Operators for your applications with the Operator Framework and SDK. Learn how to establish a Kubernetes cluster and deploy an Operator Examine a range of Operators from usage to implementation Explore the three pillars of the Operator Framework: the Operator SDK, the Operator Lifecycle Manager, and Operator Metering Build Operators from the ground up using the Operator SDK Build, package, and run an Operator in development, testing, and production phases Learn how to distribute your Operator for installation on Kubernetes clusters","language":"en","currency":"USD","id":"1492047996","title":"Kubernetes Operators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I_3RDwAAQBAJ&source=gbs_api","authors":["Jason Dobies","Joshua Wood"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IrQhEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This fully updated study guide covers every topic on the current version of the CompTIA Security+ exam Take the latest version of the CompTIA Security+ exam with complete confidence using the detailed information contained in this highly effective self-study system. Written by two leading information security experts, this authoritative guide addresses the skills required for securing a network and managing risk and enables you to become CompTIA certified. CompTIA Security+ All-in-One Exam Guide, Sixth Edition (Exam SY0-601) covers all exam domains and features 200 accurate practice questions. To aid in study, the book features learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. All questions mirror those on the live exam in tone, format, and content. Beyond fully preparing you for the challenging exam, the book also serves as a valuable on-the-job reference for IT professionals. Provides 100% coverage of every objective on exam SY0-601 Online content includes performance-based question simulations and 200 multiple-choice practice questions Written by a team of experienced IT security educators","language":"en","currency":"USD","id":"1260464016","title":"CompTIA Security+ All-in-One Exam Guide, Sixth Edition (Exam SY0-601))","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IrQhEAAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Dwayne Williams","Roger L. Davis","Chuck Cothren"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vkD-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Get up and running with VS Code by building multi-platform, cloud-native, and microservices-based apps","description":"Developing Multi-platform Apps with Visual Studio Code is a comprehensive guide that will teach you how to use numerous features of VS Code, their functionalities, and the most helpful extensions effectively to increase productivity while developing enterprise-grade applications.","language":"en","currency":"USD","id":"1838826645","title":"Developing Multi-Platform Apps with Visual Studio Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vkD-DwAAQBAJ&source=gbs_api","authors":["Ovais Mehboob Ahmed Khan","Khusro Habib"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-Hc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Develop cloud native applications with microservices using Spring Boot, Spring Cloud, and Spring Cloud Data Flow About This Book Explore the new features and components in Spring Evolve towards micro services and cloud native applications Gain powerful insights into advanced concepts of Spring and Spring Boot to develop applications more effectively Understand the basics of Kotlin and use it to develop a quick service with Spring Boot Who This Book Is For This book is for an experienced Java developer who knows the basics of Spring, and wants to learn how to use Spring Boot to build applications and deploy them to the cloud. What You Will Learn Explore the new features in Spring Framework 5.0 Build microservices with Spring Boot Get to know the advanced features of Spring Boot in order to effectively develop and monitor applications Use Spring Cloud to deploy and manage applications on the Cloud Understand Spring Data and Spring Cloud Data Flow Understand the basics of reactive programming Get to know the best practices when developing applications with the Spring Framework Create a new project using Kotlin and implement a couple of basic services with unit and integration testing In Detail Spring 5.0 is due to arrive with a myriad of new and exciting features that will change the way we've used the framework so far. This book will show you this evolution—from solving the problems of testable applications to building distributed applications on the cloud. The book begins with an insight into the new features in Spring 5.0 and shows you how to build an application using Spring MVC. You will realize how application architectures have evolved from monoliths to those built around microservices. You will then get a thorough understanding of how to build and extend microservices using Spring Boot. You will also understand how to build and deploy Cloud-Native microservices with Spring Cloud. The advanced features of Spring Boot will be illustrated through powerful examples. We will be introduced to a JVM language that's quickly gaining popularity - Kotlin. Also, we will discuss how to set up a Kotlin project in Eclipse. By the end of the book, you will be equipped with the knowledge and best practices required to develop microservices with the Spring Framework. Style and approach This book follows an end-to-end tutorial approach with lots of examples and sample applications, covering the major building blocks of the Spring framework.","language":"en","currency":"USD","id":"1787122336","title":"Mastering Spring 5.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-Hc5DwAAQBAJ&source=gbs_api","authors":["Ranga Rao Karanam"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fv1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build reactive and scalable microservices using the Reactor framework","description":"Discover how project Reactor enhances the reactive programming paradigm and allows you to build scalable asynchronous applications Key Features Use reactive APIs, Flux, and Mono to implement reactive extensions Create concurrent applications without the complexity of Java's concurrent API Understand techniques to implement event-driven and reactive applications Book Description Reactor is an implementation of the Java 9 Reactive Streams specification, an API for asynchronous data processing. This specification is based on a reactive programming paradigm, enabling developers to build enterprise-grade, robust applications with reduced complexity and in less time. Hands-On Reactive Programming with Reactor shows you how Reactor works, as well as how to use it to develop reactive applications in Java. The book begins with the fundamentals of Reactor and the role it plays in building effective applications. You will learn how to build fully non-blocking applications and will later be guided by the Publisher and Subscriber APIs. You will gain an understanding how to use two reactive composable APIs, Flux and Mono, which are used extensively to implement Reactive Extensions. All of these components are combined using various operations to build a complete solution. In addition to this, you will get to grips with the Flow API and understand backpressure in order to control overruns. You will also study the use of Spring WebFlux, an extension of the Reactor framework for building microservices. By the end of the book, you will have gained enough confidence to build reactive and scalable microservices. What you will learn Explore benefits of the Reactive paradigm and the Reactive Streams API Discover the impact of Flux and Mono implications in Reactor Expand and repeat data in stream processing Get to grips with various types of processors and choose the best one Understand how to map errors to make corrections easier Create robust tests using testing utilities offered by Reactor Find the best way to schedule the execution of code Who this book is for If you’re looking to develop event- and data-driven applications easily with Reactor, this book is for you. Sound knowledge of Java fundamentals is necessary to understand the concepts covered in the book.","language":"en","currency":"USD","id":"1789136342","title":"Hands-On Reactive Programming with Reactor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fv1wDwAAQBAJ&source=gbs_api","authors":["Rahul Sharma"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VutODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable, functional reactive microservices with Akka, Play, and Lagom","description":"Build fault-tolerant, robust, and distributed applications in Scala Key Features - Understand and use the concepts of reactive programming to build distributed systems running on multiple nodes. - Learn how reactive architecture reduces complexity throughout the development process. - Get to grips with functional reactive programming and Reactive Microservices. Book Description Reactive programming is a scalable, fast way to build applications, and one that helps us write code that is concise, clear, and readable. It can be used for many purposes such as GUIs, robotics, music, and others, and is central to many concurrent systems. This book will be your guide to getting started with Reactive programming in Scala. You will begin with the fundamental concepts of Reactive programming and gradually move on to working with asynchronous data streams. You will then start building an application using Akka Actors and extend it using the Play framework. You will also learn about reactive stream specifications, event sourcing techniques, and different methods to integrate Akka Streams into the Play Framework. This book will also take you one step forward by showing you the advantages of the Lagom framework while working with reactive microservices. You will also learn to scale applications using multi-node clusters and test, secure, and deploy your microservices to the cloud. By the end of the book, you will have gained the knowledge to build robust and distributed systems with Scala and Akka. What you will learn Understand the fundamental principles of Reactive and Functional programming Develop applications utilizing features of the Akka framework Explore techniques to integrate Scala, Akka, and Play together Learn about Reactive Streams with real-time use cases Develop Reactive Web Applications with Play, Scala, Akka, and Akka Streams Develop and deploy Reactive microservices using the Lagom framework and ConductR Who this book is for This book is for Scala developers who would like to build fault-tolerant, scalable distributed systems. No knowledge of Reactive programming is required.","language":"en","currency":"USD","id":"1787282872","title":"Scala Reactive Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VutODwAAQBAJ&source=gbs_api","authors":["Rambabu Posa"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uYtcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build, operate, and orchestrate scalable microservices applications in the cloud This book combines a comprehensive guide to success with Microsoft Azure Service Fabric and a practical catalog of design patterns and best practices for microservices design, implementation, and operation. Haishi Bai brings together all the information you’ll need to deliver scalable and reliable distributed microservices applications on Service Fabric. He thoroughly covers the crucial DevOps aspects of utilizing Service Fabric, reviews its interactions with key cloud-based services, and introduces essential service integration mechanisms such as messaging systems and reactive systems. Leading Microsoft Azure expert Haishi Bai shows how to: Set up your Service Fabric development environment Program and deploy Service Fabric applications to a local or a cloud-based cluster Compare and use stateful services, stateless services, and the actor model Design Service Fabric applications to maximize availability, reliability, and scalability Improve management efficiency via scripting Configure network security and other advanced cluster settings Collect diagnostic data, and use Azure Operational Management Suite to interpret it Integrate microservices components developed in parallel Use containers to mobilize applications for failover, replication, scaling, and load balancing Streamline containerization with Docker in Linux and Windows environments Orchestrate containers to schedule workloads and maintain services at desired states Implement proven design patterns for common cloud application workloads Balance throughput, latency, scalability, and cost","language":"en","currency":"USD","id":"1509307117","title":"Programming Microsoft Azure Service Fabric","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uYtcDwAAQBAJ&source=gbs_api","authors":["Haishi Bai"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KXdvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"12th European Conference on Software Architecture, ECSA 2018, Madrid, Spain, September 24–28, 2018, Proceedings","description":"This book constitutes the refereed proceedings of the 12th European Conference on Software Architecture, ECSA 2018, held in Madrid, Spain, in September 2018. The 17 full papers presented together with 7 short papers were carefully reviewed and selected from 96 submissions. They are organized in topical sections as follows: Self-Adaptive Architectures, IoT Architectures, Embedded and Cyber-Physical Systems, Microservices Architectures, Service-Oriented Architectures, Architectural Design Decisions, Software Architecture in Practice.","language":"en","currency":"USD","id":"3030007618","title":"Software Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KXdvDwAAQBAJ&source=gbs_api","authors":["Carlos E. Cuesta","David Garlan","Jennifer Pérez"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Design, develop, and deploy highly adaptable, scalable, and secure RESTful web APIs","description":"Build effective RESTful APIs for enterprise with design patterns and REST framework’s out-of-the-box capabilities Key Features Understand advanced topics such as API gateways, API securities, and cloud Implement patterns programmatically with easy-to-follow examples Modernize legacy codebase using API connectors, layers, and microservices Book Description This book deals with the Representational State Transfer (REST) paradigm, which is an architectural style that allows networked devices to communicate with each other over the internet. With the help of this book, you’ll explore the concepts of service-oriented architecture (SOA), event-driven architecture (EDA), and resource-oriented architecture (ROA). This book covers why there is an insistence for high-quality APIs toward enterprise integration. It also covers how to optimize and explore endpoints for microservices with API gateways and touches upon integrated platforms and Hubs for RESTful APIs. You’ll also understand how application delivery and deployments can be simplified and streamlined in the REST world. The book will help you dig deeper into the distinct contributions of RESTful services for IoT analytics and applications. Besides detailing the API design and development aspects, this book will assist you in designing and developing production-ready, testable, sustainable, and enterprise-grade APIs. By the end of the book, you’ll be empowered with all that you need to create highly flexible APIs for next-generation RESTful services and applications. What you will learn Explore RESTful concepts, including URI, HATEOAS, and Code on Demand Study core patterns like Statelessness, Pagination, and Discoverability Optimize endpoints for linked microservices with API gateways Delve into API authentication, authorization, and API security implementations Work with Service Orchestration to craft composite and process-aware services Expose RESTful protocol-based APIs for cloud computing Who this book is for This book is primarily for web, mobile, and cloud services developers, architects, and consultants who want to build well-designed APIs for creating and sustaining enterprise-class applications. You’ll also benefit from this book if you want to understand the finer details of RESTful APIs and their design techniques along with some tricks and tips.","language":"en","currency":"USD","id":"1788998588","title":"Hands-On RESTful API Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGSGDwAAQBAJ&source=gbs_api","authors":["Harihara Subramanian","Pethuru Raj"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-_KBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design data-intensive Application with Python 3","description":"Architect scalable, reliable, and maintainable applications for enterprises with Python Key Features Explore various Python design patterns used for enterprise software development Apply best practices for testing and performance optimization to build stable applications Learn about different attacking strategies used on enterprise applications and how to avoid them Book Description Dynamically typed languages like Python are continuously improving. With the addition of exciting new features and a wide selection of modern libraries and frameworks, Python has emerged as an ideal language for developing enterprise applications. Hands-On Enterprise Application Development with Python will show you how to build effective applications that are stable, secure, and easily scalable. The book is a detailed guide to building an end-to-end enterprise-grade application in Python. You will learn how to effectively implement Python features and design patterns that will positively impact your application lifecycle. The book also covers advanced concurrency techniques that will help you build a RESTful application with an optimized frontend. Given that security and stability are the foundation for an enterprise application, you’ll be trained on effective testing, performance analysis, and security practices, and understand how to embed them in your codebase during the initial phase. You’ll also be guided in how to move on from a monolithic architecture to one that is service oriented, leveraging microservices and serverless deployment techniques. By the end of the book, you will have become proficient at building efficient enterprise applications in Python. What you will learn Understand the purpose of design patterns and their impact on application lifecycle Build applications that can handle large amounts of data-intensive operations Uncover advanced concurrency techniques and discover how to handle a large number of requests in production Optimize frontends to improve the client-side experience of your application Effective testing and performance profiling techniques to detect issues in applications early in the development cycle Build applications with a focus on security Implement large applications as microservices to improve scalability Who this book is for If you’re a developer who wants to build enterprise-grade applications, this book is for you. Basic to intermediate-level of programming experience with Python and database systems is required to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789530636","title":"Hands-On Enterprise Application Development with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-_KBDwAAQBAJ&source=gbs_api","authors":["Saurabh Badhwar"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VutODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable, functional reactive microservices with Akka, Play, and Lagom","description":"Build fault-tolerant, robust, and distributed applications in Scala Key Features - Understand and use the concepts of reactive programming to build distributed systems running on multiple nodes. - Learn how reactive architecture reduces complexity throughout the development process. - Get to grips with functional reactive programming and Reactive Microservices. Book Description Reactive programming is a scalable, fast way to build applications, and one that helps us write code that is concise, clear, and readable. It can be used for many purposes such as GUIs, robotics, music, and others, and is central to many concurrent systems. This book will be your guide to getting started with Reactive programming in Scala. You will begin with the fundamental concepts of Reactive programming and gradually move on to working with asynchronous data streams. You will then start building an application using Akka Actors and extend it using the Play framework. You will also learn about reactive stream specifications, event sourcing techniques, and different methods to integrate Akka Streams into the Play Framework. This book will also take you one step forward by showing you the advantages of the Lagom framework while working with reactive microservices. You will also learn to scale applications using multi-node clusters and test, secure, and deploy your microservices to the cloud. By the end of the book, you will have gained the knowledge to build robust and distributed systems with Scala and Akka. What you will learn Understand the fundamental principles of Reactive and Functional programming Develop applications utilizing features of the Akka framework Explore techniques to integrate Scala, Akka, and Play together Learn about Reactive Streams with real-time use cases Develop Reactive Web Applications with Play, Scala, Akka, and Akka Streams Develop and deploy Reactive microservices using the Lagom framework and ConductR Who this book is for This book is for Scala developers who would like to build fault-tolerant, scalable distributed systems. No knowledge of Reactive programming is required.","language":"en","currency":"USD","id":"1787282872","title":"Scala Reactive Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VutODwAAQBAJ&source=gbs_api","authors":["Rambabu Posa"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Tackle Software Complexity with Domain-Driven Design and F#","description":"You want increased customer satisfaction, faster development cycles, and less wasted work. Domain-driven design (DDD) combined with functional programming is the innovative combo that will get you there. In this pragmatic, down-to-earth guide, you'll see how applying the core principles of functional programming can result in software designs that model real-world requirements both elegantly and concisely - often more so than an object-oriented approach. Practical examples in the open-source F# functional language, and examples from familiar business domains, show you how to apply these techniques to build software that is business-focused, flexible, and high quality. Domain-driven design is a well-established approach to designing software that ensures that domain experts and developers work together effectively to create high-quality software. This book is the first to combine DDD with techniques from statically typed functional programming. This book is perfect for newcomers to DDD or functional programming - all the techniques you need will be introduced and explained. Model a complex domain accurately using the F# type system, creating compilable code that is also readable documentation---ensuring that the code and design never get out of sync. Encode business rules in the design so that you have \"compile-time unit tests,\" and eliminate many potential bugs by making illegal states unrepresentable. Assemble a series of small, testable functions into a complete use case, and compose these individual scenarios into a large-scale design. Discover why the combination of functional programming and DDD leads naturally to service-oriented and hexagonal architectures. Finally, create a functional domain model that works with traditional databases, NoSQL, and event stores, and safely expose your domain via a website or API. Solve real problems by focusing on real-world requirements for your software. What You Need: The code in this book is designed to be run interactively on Windows, Mac and Linux.You will need a recent version of F# (4.0 or greater), and the appropriate .NET runtime for your platform.Full installation instructions for all platforms at fsharp.org.","language":"en","currency":"USD","id":"1680505491","title":"Domain Modeling Made Functional","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qA9QDwAAQBAJ&source=gbs_api","authors":["Scott Wlaschin"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E7q9BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is intended for users with some knowledge of the Elixir language syntax and basic data types\/structures. Although this is a cookbook and no sequential reading is required, the book’s structure will allow less advanced users who follow it to be gradually exposed to some of Elixir’s features and concepts specific to functional programming. To get the most out of this book, you need to be well versed with Erlang.","language":"en","currency":"USD","id":"1784393487","title":"Elixir Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E7q9BgAAQBAJ&source=gbs_api","authors":["Paulo A Pereira"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uYtcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build, operate, and orchestrate scalable microservices applications in the cloud This book combines a comprehensive guide to success with Microsoft Azure Service Fabric and a practical catalog of design patterns and best practices for microservices design, implementation, and operation. Haishi Bai brings together all the information you’ll need to deliver scalable and reliable distributed microservices applications on Service Fabric. He thoroughly covers the crucial DevOps aspects of utilizing Service Fabric, reviews its interactions with key cloud-based services, and introduces essential service integration mechanisms such as messaging systems and reactive systems. Leading Microsoft Azure expert Haishi Bai shows how to: Set up your Service Fabric development environment Program and deploy Service Fabric applications to a local or a cloud-based cluster Compare and use stateful services, stateless services, and the actor model Design Service Fabric applications to maximize availability, reliability, and scalability Improve management efficiency via scripting Configure network security and other advanced cluster settings Collect diagnostic data, and use Azure Operational Management Suite to interpret it Integrate microservices components developed in parallel Use containers to mobilize applications for failover, replication, scaling, and load balancing Streamline containerization with Docker in Linux and Windows environments Orchestrate containers to schedule workloads and maintain services at desired states Implement proven design patterns for common cloud application workloads Balance throughput, latency, scalability, and cost","language":"en","currency":"USD","id":"1509307117","title":"Programming Microsoft Azure Service Fabric","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uYtcDwAAQBAJ&source=gbs_api","authors":["Haishi Bai"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KXdvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"12th European Conference on Software Architecture, ECSA 2018, Madrid, Spain, September 24–28, 2018, Proceedings","description":"This book constitutes the refereed proceedings of the 12th European Conference on Software Architecture, ECSA 2018, held in Madrid, Spain, in September 2018. The 17 full papers presented together with 7 short papers were carefully reviewed and selected from 96 submissions. They are organized in topical sections as follows: Self-Adaptive Architectures, IoT Architectures, Embedded and Cyber-Physical Systems, Microservices Architectures, Service-Oriented Architectures, Architectural Design Decisions, Software Architecture in Practice.","language":"en","currency":"USD","id":"3030007618","title":"Software Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KXdvDwAAQBAJ&source=gbs_api","authors":["Carlos E. Cuesta","David Garlan","Jennifer Pérez"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Design, develop, and deploy highly adaptable, scalable, and secure RESTful web APIs","description":"Build effective RESTful APIs for enterprise with design patterns and REST framework’s out-of-the-box capabilities Key Features Understand advanced topics such as API gateways, API securities, and cloud Implement patterns programmatically with easy-to-follow examples Modernize legacy codebase using API connectors, layers, and microservices Book Description This book deals with the Representational State Transfer (REST) paradigm, which is an architectural style that allows networked devices to communicate with each other over the internet. With the help of this book, you’ll explore the concepts of service-oriented architecture (SOA), event-driven architecture (EDA), and resource-oriented architecture (ROA). This book covers why there is an insistence for high-quality APIs toward enterprise integration. It also covers how to optimize and explore endpoints for microservices with API gateways and touches upon integrated platforms and Hubs for RESTful APIs. You’ll also understand how application delivery and deployments can be simplified and streamlined in the REST world. The book will help you dig deeper into the distinct contributions of RESTful services for IoT analytics and applications. Besides detailing the API design and development aspects, this book will assist you in designing and developing production-ready, testable, sustainable, and enterprise-grade APIs. By the end of the book, you’ll be empowered with all that you need to create highly flexible APIs for next-generation RESTful services and applications. What you will learn Explore RESTful concepts, including URI, HATEOAS, and Code on Demand Study core patterns like Statelessness, Pagination, and Discoverability Optimize endpoints for linked microservices with API gateways Delve into API authentication, authorization, and API security implementations Work with Service Orchestration to craft composite and process-aware services Expose RESTful protocol-based APIs for cloud computing Who this book is for This book is primarily for web, mobile, and cloud services developers, architects, and consultants who want to build well-designed APIs for creating and sustaining enterprise-class applications. You’ll also benefit from this book if you want to understand the finer details of RESTful APIs and their design techniques along with some tricks and tips.","language":"en","currency":"USD","id":"1788998588","title":"Hands-On RESTful API Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGSGDwAAQBAJ&source=gbs_api","authors":["Harihara Subramanian","Pethuru Raj"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x_IwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Get up to speed quickly with this comprehensive guide toSpring Beginning Spring is the complete beginner's guide toJava's most popular framework. Written with an eye towardreal-world enterprises, the book covers all aspects of applicationdevelopment within the Spring Framework. Extensive samples withineach chapter allow developers to get up to speed quickly byproviding concrete references for experimentation, building askillset that drives successful application development byexploiting the full capabilities of Java's latest advances. Spring provides the exact toolset required to build anenterprise application, and has become the standard within thefield. This book covers Spring 4.0, which contains support for Java8 and Java EE 7. Readers begin with the basics of the framework,then go on to master the most commonly used tools and fundamentalconcepts inherent in any Spring project. The book emphasizespracticality and real-world application by addressing needs such asmeeting customer demand and boosting productivity, and by providingactionable information that helps developers get the most out ofthe framework. Topics include: Dependency Injection and Inversion of Control Unit testing Spring enabled Web Applications Data Access using Spring JDBC and ORM support along withTransaction Management Building Web Applications and RESTful Web Services with SpringMVC Securing Web Applications using Spring Security Spring Expression Language with its Extensive Features Aspect Oriented Programming Facilities Provided by SpringAOP Caching with 3rd Party Cache Providers’ Support The Best of the Breed: Spring 4.0 The information is organized and structured an ideal way forstudents and corporate training programs, and explanations aboutinner workings of the framework make it a handy desk reference evenfor experienced developers. For novices, Beginning Spring isinvaluable as a comprehensive guide to the real-world functionalityof Spring.","language":"en","currency":"USD","id":"1118893034","title":"Beginning Spring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x_IwBgAAQBAJ&source=gbs_api","authors":["Mert Caliskan","Kenan Sevindik"]},{"pageCount":558,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9XHnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Best Practices for Designing, Implementing, and Maintaining Systems","description":"Can a system be considered truly reliable if it isn't fundamentally secure? Or can it be considered secure if it's unreliable? Security is crucial to the design and operation of scalable systems in production, as it plays an important part in product quality, performance, and availability. In this book, experts from Google share best practices to help your organization design scalable and reliable systems that are fundamentally secure. Two previous O’Reilly books from Google—Site Reliability Engineering and The Site Reliability Workbook—demonstrated how and why a commitment to the entire service lifecycle enables organizations to successfully build, deploy, monitor, and maintain software systems. In this latest guide, the authors offer insights into system design, implementation, and maintenance from practitioners who specialize in security and reliability. They also discuss how building and adopting their recommended best practices requires a culture that’s supportive of such change. You’ll learn about secure and reliable systems through: Design strategies Recommendations for coding, testing, and debugging practices Strategies to prepare for, respond to, and recover from incidents Cultural best practices that help teams across your organization collaborate effectively","language":"en","currency":"USD","id":"1492083070","title":"Building Secure and Reliable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9XHnDwAAQBAJ&source=gbs_api","authors":["Heather Adkins","Betsy Beyer","Paul Blankinship","Piotr Lewandowski","Ana Oprea","Adam Stubblefield"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QEm4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Explore the latest features of Rust 2018 for building fast and secure apps","description":"Practical solutions to overcome challenges in creating console and web applications and working with systems-level and embedded code, network programming, deep neural networks, and much more. Key Features Work through recipes featuring advanced concepts such as concurrency, unsafe code, and macros to migrate your codebase to the Rust programming language Learn how to run machine learning models with Rust Explore error handling, macros, and modularization to write maintainable code Book Description Rust 2018, Rust's first major milestone since version 1.0, brings more advancement in the Rust language. The Rust Programming Cookbook is a practical guide to help you overcome challenges when writing Rust code. This Rust book covers recipes for configuring Rust for different environments and architectural designs, and provides solutions to practical problems. It will also take you through Rust's core concepts, enabling you to create efficient, high-performance applications that use features such as zero-cost abstractions and improved memory management. As you progress, you'll delve into more advanced topics, including channels and actors, for building scalable, production-grade applications, and even get to grips with error handling, macros, and modularization to write maintainable code. You will then learn how to overcome common roadblocks when using Rust for systems programming, IoT, web development, and network programming. Finally, you'll discover what Rust 2018 has to offer for embedded programmers. By the end of the book, you'll have learned how to build fast and safe applications and services using Rust. What you will learn Understand how Rust provides unique solutions to solve system programming language problems Grasp the core concepts of Rust to develop fast and safe applications Explore the possibility of integrating Rust units into existing applications for improved efficiency Discover how to achieve better parallelism and security with Rust Write Python extensions in Rust Compile external assembly files and use the Foreign Function Interface (FFI) Build web applications and services using Rust for high performance Who this book is for The Rust cookbook is for software developers looking to enhance their knowledge of Rust and leverage its features using modern programming practices. Familiarity with Rust language is expected to get the most out of this book.","language":"en","currency":"USD","id":"1789531748","title":"Rust Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QEm4DwAAQBAJ&source=gbs_api","authors":["Claus Matzinger"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-_KBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design data-intensive Application with Python 3","description":"Architect scalable, reliable, and maintainable applications for enterprises with Python Key Features Explore various Python design patterns used for enterprise software development Apply best practices for testing and performance optimization to build stable applications Learn about different attacking strategies used on enterprise applications and how to avoid them Book Description Dynamically typed languages like Python are continuously improving. With the addition of exciting new features and a wide selection of modern libraries and frameworks, Python has emerged as an ideal language for developing enterprise applications. Hands-On Enterprise Application Development with Python will show you how to build effective applications that are stable, secure, and easily scalable. The book is a detailed guide to building an end-to-end enterprise-grade application in Python. You will learn how to effectively implement Python features and design patterns that will positively impact your application lifecycle. The book also covers advanced concurrency techniques that will help you build a RESTful application with an optimized frontend. Given that security and stability are the foundation for an enterprise application, you’ll be trained on effective testing, performance analysis, and security practices, and understand how to embed them in your codebase during the initial phase. You’ll also be guided in how to move on from a monolithic architecture to one that is service oriented, leveraging microservices and serverless deployment techniques. By the end of the book, you will have become proficient at building efficient enterprise applications in Python. What you will learn Understand the purpose of design patterns and their impact on application lifecycle Build applications that can handle large amounts of data-intensive operations Uncover advanced concurrency techniques and discover how to handle a large number of requests in production Optimize frontends to improve the client-side experience of your application Effective testing and performance profiling techniques to detect issues in applications early in the development cycle Build applications with a focus on security Implement large applications as microservices to improve scalability Who this book is for If you’re a developer who wants to build enterprise-grade applications, this book is for you. Basic to intermediate-level of programming experience with Python and database systems is required to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789530636","title":"Hands-On Enterprise Application Development with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-_KBDwAAQBAJ&source=gbs_api","authors":["Saurabh Badhwar"]},{"pageCount":510,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kVjHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Design production-ready, testable, and flexible RESTful APIs for web applications and microservices","description":"Get up to speed with the latest features of C# 8, ASP.NET Core 3 and .NET Core 3.1 LTS to create robust and maintainable web services Key Features Apply design patterns and techniques to achieve a reactive, scalable web service Document your web services using the OpenAPI standard and test them using Postman Explore mechanisms to implement a secure web service using client-side SSL and token authentication Book Description In recent times, web services have evolved to play a prominent role in web development. Applications are now designed to be compatible with any device and platform, and web services help us keep their logic and UI separate. Given its simplicity and effectiveness in creating web services, the RESTful approach has gained popularity, and this book will help you build RESTful web services using ASP.NET Core. This REST book begins by introducing you to the basics of the REST philosophy, where you'll study the different stages of designing and implementing enterprise-grade RESTful web services. You'll also gain a thorough understanding of ASP.NET Core's middleware approach and learn how to customize it. The book will later guide you through improving API resilience, securing your service, and applying different design patterns and techniques to achieve a scalable web service. In addition to this, you'll learn advanced techniques for caching, monitoring, and logging, along with implementing unit and integration testing strategies. In later chapters, you will deploy your REST web services on Azure and document APIs using Swagger and external tools such as Postman. By the end of this book, you will have learned how to design RESTful web services confidently using ASP.NET Core with a focus on code testability and maintainability. What you will learn Gain a comprehensive working knowledge of ASP.NET Core Integrate third-party tools and frameworks to build maintainable and efficient services Implement patterns using dependency injection to reduce boilerplate code and improve flexibility Use ASP.NET Core's out-of-the-box tools to test your applications Use Docker to run your ASP.NET Core web service in an isolated and self-contained environment Secure your information using HTTPS and token-based authentication Integrate multiple web services using resiliency patterns and messaging techniques Who this book is for This book is for anyone who wants to learn how to build RESTful web services with the ASP.NET Core framework to improve the scalability and performance of their applications. Basic knowledge of C# and .NET Core will help you make the best use of the code samples included in the book.","language":"en","currency":"USD","id":"1789539242","title":"Hands-On RESTful Web Services with ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kVjHDwAAQBAJ&source=gbs_api","authors":["Samuele Resca"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZXJiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A comprehensive guide to building smart and reusable code in Java","description":"Create various design patterns to master the art of solving problems using Java Key Features This book demonstrates the shift from OOP to functional programming and covers reactive and functional patterns in a clear and step-by-step manner All the design patterns come with a practical use case as part of the explanation, which will improve your productivity Tackle all kinds of performance-related issues and streamline your development Book Description Having a knowledge of design patterns enables you, as a developer, to improve your code base, promote code reuse, and make the architecture more robust. As languages evolve, new features take time to fully understand before they are adopted en masse. The mission of this book is to ease the adoption of the latest trends and provide good practices for programmers. We focus on showing you the practical aspects of smarter coding in Java. We'll start off by going over object-oriented (OOP) and functional programming (FP) paradigms, moving on to describe the most frequently used design patterns in their classical format and explain how Java’s functional programming features are changing them. You will learn to enhance implementations by mixing OOP and FP, and finally get to know about the reactive programming model, where FP and OOP are used in conjunction with a view to writing better code. Gradually, the book will show you the latest trends in architecture, moving from MVC to microservices and serverless architecture. We will finish off by highlighting the new Java features and best practices. By the end of the book, you will be able to efficiently address common problems faced while developing applications and be comfortable working on scalable and maintainable projects of any size. What you will learn Understand the OOP and FP paradigms Explore the traditional Java design patterns Get to know the new functional features of Java See how design patterns are changed and affected by the new features Discover what reactive programming is and why is it the natural augmentation of FP Work with reactive design patterns and find the best ways to solve common problems using them See the latest trends in architecture and the shift from MVC to serverless applications Use best practices when working with the new features Who this book is for This book is for those who are familiar with Java development and want to be in the driver’s seat when it comes to modern development techniques. Basic OOP Java programming experience and elementary familiarity with Java is expected.","language":"en","currency":"USD","id":"1786469014","title":"Design Patterns and Best Practices in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZXJiDwAAQBAJ&source=gbs_api","authors":["Kamalmeet Singh","Adrian Ianculescu","Lucian-Paul Torje"]},{"pageCount":211,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1fzKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Second International Workshop, DEVOPS 2019, Château de Villebrumier, France, May 6–8, 2019, Revised Selected Papers","description":"This book constitutes revised selected papers of the Second International Workshop on Software Engineering Aspects of Continuous Development and New Paradigms of Software Production and Deployment, DEVOPS 2019, held at the Château de Villebrumier, France, in May 2019. The 15 papers presented in this volume were carefully reviewed and selected from 19 submissions. They cover a wide range of problems arising from DevOps and related approaches: current tools, rapid development-deployment processes, modeling frameworks, anomaly detection in software releases, DevDataOps, microservices, and related topics.","language":"en","currency":"USD","id":"3030393062","title":"Software Engineering Aspects of Continuous Development and New Paradigms of Software Production and Deployment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1fzKDwAAQBAJ&source=gbs_api","authors":["Jean-Michel Bruel","Manuel Mazzara","Bertrand Meyer"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WlIlDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.75,"subtitle":null,"description":"マイクロサービス、IoT、Azureという三本柱を使って継続的デリバリプロセスの導入する具体的な手法とはいかなるものなのか。 本書はマイクロサービスの実用的な定義を示し、これまで主流であった階層型アプローチと対比しつつ、その方法をコンパクトに提示します。 内容は、家庭用医療機器ベンダーを想定し、そこで提示された仕様に基づき、横断的なビジネスサービスやIoTで利用される各種デバイスに対するマイクロサービスやオートメーション機能を、Azureが持つさまざまなPaaSサービスを使って実現していくという、リアルなシナリオに沿ったものです。そこで提示される「要望」と「現実」ギャップをいかにしてコードで埋めるか、すでにあるサービスをいかに活用するか、などを詳解します。 クラウドベースでの開発・運用を目論むSIerはもちろん、これまで以上のスケーラビリティとアベイラビリティを追求する開発者にとって、必読の1冊と言えるでしょう。 ※本電子書籍は同名出版物を底本として作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)","language":"ja","currency":"USD","id":"4798148180","title":"Microservices on Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WlIlDAAAQBAJ&source=gbs_api","authors":["ボブ・ファミリア"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2EeS9Qs5wGgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Create your own Drupal 7 modules from scratch.","language":"en","currency":"USD","id":"1849511179","title":"Drupal 7 Module Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2EeS9Qs5wGgC&source=gbs_api","authors":["Matt Butcher","Larry Garfield","John Wilkins"]},{"pageCount":379,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eq6tDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Using Jakarta EE, Eclipse MicroProfile, Spring Boot, and the Axon Framework","description":"See how Domain-Driven Design (DDD) combines with Jakarta EE MicroProfile or Spring Boot to offer a complete suite for building enterprise-grade applications. In this book you will see how these all come together in one of the most efficient ways to develop complex software. Practical Domain-Driven Design in Enterprise Java starts by building out the Cargo Tracker reference application as a monolithic application using the Jakarta EE platform. By doing so, you will map concepts of DDD (bounded contexts, language, and aggregates) to the corresponding available tools (CDI, JAX-RS, and JPA) within the Jakarta EE platform. Once you have completed the monolithic application, you will walk through the complete conversion of the monolith to a microservices-based architecture, again mapping the concepts of DDD and the corresponding available tools within the MicroProfile platform (config, discovery, and fault tolerance). To finish this section, you will examine the same microservices architecture on the Spring Boot platform. The final set of chapters looks at what the application would be like if you used the CQRS and event sourcing patterns. Here you’ll use the Axon framework as the base framework. What You Will Learn Discover the DDD architectural principles and use the DDD design patterns Use the new Eclipse Jakarta EE platform Work with the Spring Boot framework Implement microservices design patterns, including context mapping, logic design, entities, integration, testing, and security Carry out event sourcing Apply CQRS Who This Book Is For Junior developers intending to start working on enterprise Java; senior developers transitioning from monolithic- to microservices-based architectures; and architects transitioning to a DDD philosophy of building applications.","language":"en","currency":"USD","id":"1484245431","title":"Practical Domain-Driven Design in Enterprise Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eq6tDwAAQBAJ&source=gbs_api","authors":["Vijay Nair"]},{"pageCount":775,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XMy-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"20th International Conference, PROFES 2019, Barcelona, Spain, November 27–29, 2019, Proceedings","description":"This book constitutes the refereed proceedings of the 20th International Conference on Product-Focused Software Process Improvement, PROFES 2019, held in Barcelona, Spain, in November 2019. The 24 revised full papers 4 industry papers, and 11 short papers presented were carefully reviewed and selected from 104 submissions. The papers cover a broad range of topics related to professional software development and process improvement driven by product and service quality needs. They are organized in topical sections on testing, software development, technical debt, estimations, continuous delivery, agile, project management, microservices, and continuous experimentation. This book also includes papers from the co-located events: 10 project papers, 8 workshop papers, and 4 tutorial summaries.","language":"en","currency":"USD","id":"3030353338","title":"Product-Focused Software Process Improvement","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XMy-DwAAQBAJ&source=gbs_api","authors":["Xavier Franch","Tomi Männistö","Silverio Martínez-Fernández"]},{"pageCount":650,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DurNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"The organization pursuing digital transformation must embrace new ways to use and deploy integration technologies, so they can move quickly in a manner appropriate to the goals of multicloud, decentralization, and microservices. The integration layer must transform to allow organizations to move boldly in building new customer experiences, rather than forcing models for architecture and development that pull away from maximizing the organization's productivity. Many organizations have started embracing agile application techniques, such as microservice architecture, and are now seeing the benefits of that shift. This approach complements and accelerates an enterprise's API strategy. Businesses should also seek to use this approach to modernize their existing integration and messaging infrastructure to achieve more effective ways to manage and operate their integration services in their private or public cloud. This IBM® Redbooks® publication explores the merits of what we refer to as agile integration; a container-based, decentralized, and microservice-aligned approach for integration solutions that meets the demands of agility, scalability, and resilience required by digital transformation. It also discusses how the IBM Cloud Pak for Integration marks a significant leap forward in integration technology by embracing both a cloud-native approach and container technology to achieve the goals of agile integration. The target audiences for this book are cloud integration architects, IT specialists, and application developers.","language":"en","currency":"USD","id":"0738458368","title":"Accelerating Modernization with Agile Integration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DurNDwAAQBAJ&source=gbs_api","authors":["Adeline SE Chun","Aiden Gallagher","Amar A Shah","Callum Jackson","Claudio Tagliabue","Iliya Dimitrov","James Blackburn","Joel Gomez","Kim Clark","Lee Gavin","Maria Menendez","Martin Evans","Mohammed Alreedi","Murali Sitaraman","Nick Glowacki","Shishir Narain","Timothy Quigly","Tony Curcio","Ulas Cubuk","Vasfi Gucer","IBM Redbooks"]},{"pageCount":239,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aC02DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"6th IFIP WG 2.14 European Conference, ESOCC 2017, Oslo, Norway, September 27-29, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 6th IFIP WG 2.14 European Conference on Service-Oriented and Cloud Computing, ESOCC 2017, held in Oslo, Norway, in September 2017. The 6 short and 10 full papers presented in this volume were carefully reviewed and selected from 37 submissions. The volume also contains one invited talk in full paper length. The contributions were organized in topical sections named: microservices and containers; security; cloud resources; services; internet of things and data streams; and industrial applications of service and cloud computing.","language":"en","currency":"USD","id":"3319672622","title":"Service-Oriented and Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aC02DwAAQBAJ&source=gbs_api","authors":["Flavio De Paoli","Stefan Schulte","Einar Broch Johnsen"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A1WsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Configuring DNS for Cloud Native Environments","description":"Until recently, learning CoreDNS required reading the code or combing through the skimpy documentation on the website. No longer. With this practical book, developers and operators working with Docker or Linux containers will learn how to use this standard DNS server with Kubernetes. John Belamaric, senior staff software engineer at Google, and Cricket Liu, chief DNS architect at Infoblox, show you how to configure CoreDNS using real-world configuration examples to achieve specific purposes. You’ll learn the basics of DNS, including how it functions as a location broker in container environments and how it ties into Kubernetes. Dive into DNS theory: the DNS namespace, domain names, domains, and zones Learn how to configure your CoreDNS server Manage and serve basic and advanced zone data with CoreDNS Configure CoreDNS service discovery with etcd and Kubernetes Learn one of the most common use cases for CoreDNS: the integration with Kubernetes Manipulate queries and responses as they flow through the plug-in chain Monitor and troubleshoot the availability and performance of your DNS service Build custom versions of CoreDNS and write your own plug-ins","language":"en","currency":"USD","id":"1492047910","title":"Learning CoreDNS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A1WsDwAAQBAJ&source=gbs_api","authors":["John Belamaric","Cricket Liu"]},{"pageCount":296,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sJIREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Understand modern architectures, migration best practices, and the new features in .NET 5","description":"This book is a practical guide to .NET 5 for experienced developers and software architects, featuring step-by-step explanations of essential concepts and practical examples. You’ll also explore a comparison of .NET 5 with legacy technologies, why it is beneficial, and how the platform can be leveraged in real-world scenarios.","language":"en","currency":"USD","id":"180056984X","title":"Adopting .NET 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sJIREAAAQBAJ&source=gbs_api","authors":["Hammad Arif","Habib Qureshi"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-uiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Fully updated coverage of every topic on the current version of the GSEC exam Get complete coverage of all the objectives on Global Information Assurance Certification’s Security Essentials (GSEC) exam inside this comprehensive resource. GSEC GIAC Security Essentials Certification All-in-One Exam Guide, Second Edition provides learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this authoritative resource also serves as an essential on-the-job reference. Covers all exam topics, including: •Networking fundamentals •Network design •Cloud computing •Authentication and access control •Unix\/Linux •Windows •Encryption •Risk management •Virtual machines •Vulnerability control •Malware •Incident response •Wireless technologies •Log Management •IoT and embedded devices Online content features: •Two practice exams •Test engine that provides full-length practice exams and customizable quizzes •Author videos","language":"en","currency":"USD","id":"1260453219","title":"GSEC GIAC Security Essentials Certification All-in-One Exam Guide, Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-uiDwAAQBAJ&source=gbs_api","authors":["Ric Messier"]},{"pageCount":1007,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L2vDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Study Guide Using Spring Framework 5","description":"Pass the Pivotal Certified Professional exam for Core Spring, based on the latest Spring Framework 5, using source code examples, study summaries, and mock exams. This book now includes WebFlux, reactive programming, and more found in Spring 5. You'll find a descriptive overview of certification-related Spring modules and a single example application demonstrating the use of all required Spring modules. Furthermore, in Pivotal Certified Professional Core Spring 5 Developer Exam, Second Edition, each chapter contains a brief study summary and question set, and the book’s free downloadable source code package includes one mock exam (50 questions – like a real exam). After using this study guide, you will be ready to take and pass the Pivotal Certified Professional exam. When you become Pivotal Certified, you will have one of the most valuable credentials in Java. Pivotal certification helps you advance your skills and your career, and get the maximum benefit from Spring. Passing the exam demonstrates your understanding of Spring and validates your familiarity with: container-basics, aspect oriented programming (AOP), data access and transactions, Spring Security, Spring Boot, microservices, and Spring model-view-controller (MVC). Good luck! What You Will Learn Understand the core principles of Spring Framework 5 Use dependency injection Work with aspects in Spring and do AOP (aspect oriented programming) Control transactional behavior and work with SQL and NoSQL databases Create and secure web applications based on Spring MVC Get to know the format of the exam and the type of questions in it Create Spring microservices applications Who This Book Is For Spring developers who have taken the Pivotal Core Spring class are eligible to take the Pivotal Certified Professional exam.","language":"en","currency":"USD","id":"1484251369","title":"Pivotal Certified Professional Core Spring 5 Developer Exam","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L2vDDwAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina"]},{"pageCount":277,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sSjoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Building Web Applications in .NET","description":"Build web applications in C# and Microsoft .NET that run in any modern browser. This second edition is updated to work with the release version of Blazor and covers Blazor’s use in creating both server-side and WebAssembly Blazor applications. Developers are able to use all their experience in .NET along with thousands of existing libraries, right in the browser. There is important new coverage in this edition on the new and improved Razor syntax, how to easily validate user input with Blazor validation, and how to build complex interacting components with Cascading Properties and Templated Components. You will learn how to build user interfaces and present data to a user for display and modification, capturing the user’s changes via data binding. The book shows you how to access a rich library of .NET functionality such as a component model for building a composable user interface, including how to develop reusable components that can be used across many pages and websites. Also covered is data exchange with a server, giving you access to microservices and database services. Blazor provides a fresh take on web development by eliminating the need for you to learn different languages and frameworks for client- and server-side development. Blazor allows C# and .NET to be used on all sides, providing a robust feature set that is well suited toward scalable, enterprise-level applications. This book gets you started using this important new toolkit for web application development. What You Will Learn Build user interfaces and display data for users to edit Capture the user’s changes via data binding Transfer data back and forth between server and client Communicate with microservices and database services Develop reusable components and assemble them into bigger components Use routing to build single-page applications (SPAs) Build Blazor libraries that are reusable across applications Who This Book Is For Experienced .NET developers who want to apply their existing skills toward building professional-quality, client-side web applications that run in any browser. The book is for web developers who want to step away from JavaScript and its complexities, and instead use a proven technology (.NET) that is robust toward creating enterprise-quality applications that scale and are reliable, that provide good user experience.","language":"en","currency":"USD","id":"1484259289","title":"Microsoft Blazor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sSjoDwAAQBAJ&source=gbs_api","authors":["Peter Himschoot"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d2dmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":"Design scalable applications and microservices that effortlessly adapt to the requirements of your customers","description":"Migrating your application to a cloud-based serverless architecture doesn’t have to be difficult. Reduce complexity and minimize the time you spend administering servers or worrying about availability with this comprehensive guide to serverless applications on Azure. Key Features Provides information on integration of Azure products Plan and implement your own serverless backend to meet tried-and-true development standards Includes step-by-step instructions to help you navigate advanced concepts and application integrations Book Description Many businesses are rapidly adopting a microservices-first approach to development, driven by the availability of new commercial services like Azure Functions and AWS Lambda. In this book, we’ll show you how to quickly get up and running with your own serverless development on Microsoft Azure. We start by working through a single function, and work towards integration with other Azure services like App Insights and Cosmos DB to handle common user requirements like analytics and highly performant distributed storage. We finish up by providing you with the context you need to get started on a larger project of your own choosing, leaving you equipped with everything you need to migrate to a cloud-first serverless solution. What you will learn Identify the key advantages and disadvantages of serverless development Build a fully-functioning serverless application and utilize a wide variety of Azure services Create, deploy, and manage your own Azure Functions in the cloud Implement core design principles for writing effective serverless code Who this book is for This book is ideal for back-end developers or engineers who want a quick hands-on introduction to developing serverless applications within the Microsoft ecosystem.","language":"en","currency":"USD","id":"1789531179","title":"Beginning Serverless Architectures with Microsoft Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d2dmDwAAQBAJ&source=gbs_api","authors":["Daniel Bass"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=r9RLtcp_1rsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Designing, Theming, Scripting","description":"“For Drupal to succeed, we need books like this.” –Dries Buytaert, Drupal founder and project lead “Drupal faces a common problem on the Web–the relative lack of new, high quality themes. Front End Drupal tackles this problem directly and is designed to help both experienced designers and rank novices get an understanding of how Drupal theming works. In fact, I’ll be the first to admit I learned a lot from this book.” – Dries Buytaert, Drupal founder and project lead The Practical, Complete Guide to Customizing Drupal Sites with Behaviors, Themes, and Templates Drupal is now the world’s #1 open source content management system: Thousands of individuals and organizations are using it to build and update Web sites of virtually every kind. As Web designers and developers adopt Drupal, they need ways to quickly customize the visuals and interactivity of their sites. Drupal offers powerful tools for doing so, but little guidance on using them effectively. Front End Drupal is the solution. In this book, two expert Drupal developers cover everything you need to know to create great visual designs and state-of-the-art interactivity with Drupal’s behaviors, themes, and templates. Front End Drupal is 100% focused on issues of site design, behavior, usability, and management. The authors show how to style Drupal sites, make the most of Drupal’s powerful templating system, build sophisticated community sites, streamline site management, and build more portable, flexible themes. You’ll also gain hands-on experience through several case studies that walk you through the customization of everything from page templates to Web site forums. Prepare and organize content so it’s easier to integrate into Drupal Web sites Structure Drupal page templates that are easy to work with Configure Drupal with the modules and browser tools you need to customize your site Utilize Drupal’s Starter Themes and themes converted from WordPress, Joomla!™, and Drupal 5.x Maximize the power and usability of Drupal’s content editing forms Build usable community sites with user profiles, comments, and user-generated content Use JavaScript™ to make your themes interactive and to enhance usability Create powerful animations and AJAX callbacks with jQuery, Drupal’s JavaScript library About the Web Site The accompanying site, frontenddrupal.com, contains all sample code and themes presented in this book.","language":"en","currency":"USD","id":"0132703033","title":"Front End Drupal","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=r9RLtcp_1rsC&source=gbs_api","authors":["Konstantin Käfer","Emma Jane Hogbin"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hkFPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Continuous Integration and Continuous Deployment using AWS services","description":"Automate release processes, deployment, and continuous integration of your application as well as infrastructure automation with the powerful services offered by AWS About This Book Accelerate your infrastructure's productivity by implementing a continuous delivery pipeline within your environment Leverage AWS services and Jenkins 2.0 to perform complete application deployments on Linux servers This recipe-based guide that will help you minimize application deployment downtime Who This Book Is For This book is for developers and system administrators who are responsible for hosting their application and managing instances in AWS. It's also ideal for DevOps engineers looking to provide continuous integration, deployment, and delivery. A basic understanding of AWS, Jenkins, and some scripting knowledge is needed. What You Will Learn Build a sample Maven and NodeJS Application using CodeBuild Deploy the application in EC2\/Auto Scaling and see how CodePipeline helps you integrate AWS services Build a highly scalable and fault tolerant CI\/CD pipeline Achieve the CI\/CD of a microservice architecture application in AWS ECS using CodePipeline, CodeBuild, ECR, and CloudFormation Automate the provisioning of your infrastructure using CloudFormation and Ansible Automate daily tasks and audit compliance using AWS Lambda Deploy microservices applications on Kubernetes using Jenkins Pipeline 2.0 In Detail AWS CodeDeploy, AWS CodeBuild, and CodePipeline are scalable services offered by AWS that automate an application's build and deployment pipeline. In order to deliver tremendous speed and agility, every organization is moving toward automating an entire application pipeline. This book will cover all the AWS services required to automate your deployment to your instances. You'll begin by setting up and using one of the AWS services for automation – CodeCommit. Next, you'll learn how to build a sample Maven and NodeJS Application using CodeBuild. After you've built the application, you'll see how to use CodeDeploy to deploy the application in EC2\/Autoscaling. You'll also build a highly scalable and fault tolerant continuous integration (CI)\/continuous deployment (CD) pipeline using some easy-to-follow recipes. Following this, you'll achieve CI\/CD for Microservices application and reduce the risk within your software development lifecycle. You'll also learn to set up an infrastructure using CloudFormation Template and Ansible, and see how to automate AWS resources using AWS Lambda. Finally, you'll learn to automate instances in AWS and automate the deployment lifecycle of applications.By the end of this book, you'll be able to minimize application downtime and implement CI\/CD, gaining total control over your software development lifecycle. Style and approach This book takes a \"How to do it\" approach, providing with easy solutions to automate common maintenance and deployment tasks.","language":"en","currency":"USD","id":"1788392116","title":"AWS Automation Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hkFPDwAAQBAJ&source=gbs_api","authors":["Nikit Swaraj"]},{"pageCount":642,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y52BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Easy solutions to common and everyday JavaScript development problems","description":"Over 90 recipes to help you write clean code, solve common JavaScript problems, and work on popular use cases like SPAs, microservices, native mobile development with Node, React, React Native and Electron. Key Features Over 90 practical recipes to help you write clean and maintainable JavaScript codes with the latest ES8 Leverage the power of leading web frameworks like Node and React to build modern web apps Features comprehensive coverage of tools and techniques needed to create multi-platform apps with JavaScript Book Description JavaScript has evolved into a language that you can use on any platform. Modern JavaScript Web Development Cookbook is a perfect blend of solutions for traditional JavaScript development and modern areas that developers have lately been exploring with JavaScript. This comprehensive guide teaches you how to work with JavaScript on servers, browsers, mobile phones and desktops. You will start by exploring the new features of ES8. You will then move on to learning the use of ES8 on servers (with Node.js), with the objective of producing services and microservices and dealing with authentication and CORS. Once you get accustomed to ES8, you will learn to apply it to browsers using frameworks, such as React and Redux, which interact through Ajax with services. You will then understand the use of a modern framework to develop the UI. In addition to this, development for mobile devices with React Native will walk you through the benefits of creating native apps, both for Android and iOS. Finally, you’ll be able to apply your new-found knowledge of server-side and client-side tools to develop applications with Electron. What you will learn Use the latest features of ES8 and learn new ways to code with JavaScript Develop server-side services and microservices with Node.js Learn to do unit testing and to debug your code Build client-side web applications using React and Redux Create native mobile applications for Android and iOS with React Native Write desktop applications with Electron Who this book is for This book is for developers who want to explore the latest JavaScript features, frameworks, and tools for building complete mobile, desktop and web apps, including server and client-side code. You are expected to have working knowledge of JavaScript to get the most out of this book.","language":"en","currency":"USD","id":"1788992350","title":"Modern JavaScript Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y52BDwAAQBAJ&source=gbs_api","authors":["Federico Kereki"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aBDYCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":46.36,"subtitle":"A Bell Labs Perspective","description":"We are at the dawn of an era in networking that has the potential to define a new phase of human existence. This era will be shaped by the digitization and connection of everything and everyone with the goal of automating much of life, effectively creating time by maximizing the efficiency of everything we do and augmenting our intelligence with knowledge that expedites and optimizes decision-making and everyday routines and processes. The Future X Network: A Bell Labs Perspective outlines how Bell Labs sees this future unfolding and the key technological breakthroughs needed at both the architectural and systems levels. Each chapter of the book is dedicated to a major area of change and the network and systems innovation required to realize the technological revolution that will be the essential product of this new digital future.","language":"en","currency":"USD","id":"1498779158","title":"The Future X Network","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aBDYCwAAQBAJ&source=gbs_api","authors":["Marcus K. Weldon"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xBZyDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Design, Build and Integrate with REST, JSON, XML and JAX-RS","description":"Discover the RESTful technologies, including REST, JSON, XML, JAX-RS web services, SOAP and more, for building today's microservices, big data applications, and web service applications. This book is based on a course the Oracle-based author is teaching for UC Santa Cruz Silicon Valley which covers architecture, design best practices and coding labs. Pro RESTful APIs: Design gives you all the fundamentals from the top down: from the top (architecture) through the middle (design) to the bottom (coding). This book is a must have for any microservices or web services developer building applications and services. What You'll Learn Discover the key RESTful APIs, including REST, JSON, XML, JAX, SOAP and more Use these for web services and data exchange, especially in today's big data context Harness XML, JSON, REST, and JAX-RS in examples and case studies Apply best practices to your solutions’ architecture Who This Book Is For Experienced web programmers and developers.","language":"en","currency":"USD","id":"1484226658","title":"Pro RESTful APIs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xBZyDgAAQBAJ&source=gbs_api","authors":["Sanjay Patni"]},{"pageCount":126,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xBZyDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Design, Build and Integrate with REST, JSON, XML and JAX-RS","description":"Discover the RESTful technologies, including REST, JSON, XML, JAX-RS web services, SOAP and more, for building today's microservices, big data applications, and web service applications. This book is based on a course the Oracle-based author is teaching for UC Santa Cruz Silicon Valley which covers architecture, design best practices and coding labs. Pro RESTful APIs: Design gives you all the fundamentals from the top down: from the top (architecture) through the middle (design) to the bottom (coding). This book is a must have for any microservices or web services developer building applications and services. What You'll Learn Discover the key RESTful APIs, including REST, JSON, XML, JAX, SOAP and more Use these for web services and data exchange, especially in today's big data context Harness XML, JSON, REST, and JAX-RS in examples and case studies Apply best practices to your solutions’ architecture Who This Book Is For Experienced web programmers and developers.","language":"en","currency":"USD","id":"1484226658","title":"Pro RESTful APIs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xBZyDgAAQBAJ&source=gbs_api","authors":["Sanjay Patni"]},{"pageCount":201,"thumbnail":"http:\/\/books.google.com\/books\/content?id=m8hqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"4th International Symposium, SETTA 2018, Beijing, China, September 4-6, 2018, Proceedings","description":"This book constitutes the proceedings of the Third International Symposium on Dependable Software Engineering: Theories, Tools, and Applications, SETTA 2018, held in Beijing, China, in September 2018. The 9 full papers presented together with 3 short papers were carefully reviewed and selected from 22 submissions. The purpose of SETTA is to provide an international forum for researchers and practitioners to share cutting-edge advancements and strengthen collaborations in the field of formal methods and its interoperability with software engineering for building reliable, safe, secure, and smart systems.","language":"en","currency":"USD","id":"3319999338","title":"Dependable Software Engineering. Theories, Tools, and Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=m8hqDwAAQBAJ&source=gbs_api","authors":["Xinyu Feng","Markus Müller-Olm","Zijiang Yang"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AxVBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Real-World Applications Using Domain Specific Languages","description":"Build domain specific languages (DSLs) using Java's most popular functional programming language: Scala. This book introduces the basics of Scala and DSLs using a series of practical examples. In Practical Scala DSLs, you’ll learn to create pragmatic and complete code examples that explain the actual use of DSLs with Scala: a web API and microservices; a custom language; a mobile app; a Forex system; a game; and cloud applications. At the end of this unique book, you’ll be able to describe the differences between external and internal DSLs; understand when and how to apply DSLs; create DSLs using Scala; and even create a DSL using another programming language. What You'll Learn Build DSLs in Scala Write a web API and microservices Create a custom language Apply DSLs to mobile apps development, a Forex trading system, game development, and more Discover the role of DSLs in cloud development Integrate DSLs as part of a DevOps program or structure Build internal and external DSLs Who This Book Is For Experienced Java coders with at least some prior experience with Scala. You may be new to DSLs.","language":"en","currency":"USD","id":"1484230361","title":"Practical Scala DSLs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AxVBDwAAQBAJ&source=gbs_api","authors":["Pierluigi Riti"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AjqPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Design and develop scalable RESTful APIs for your applications","description":"A step-by-step guide that will help you design, develop, scale, and deploy RESTful APIs with TypeScript 3 and Node.js Key Features Gain in-depth knowledge of OpenAPI and Swagger to build scalable web services Explore a variety of test frameworks and test runners such as Stryker, Mocha, and Chai Create a pipeline by Dockerizing your environment using Travis CI, Google Cloud Platform, and GitHub Book Description In the world of web development, leveraging data is the key to developing comprehensive applications, and RESTful APIs help you to achieve this systematically. This book will guide you in designing and developing web services with the power of TypeScript 3 and Node.js. You'll design REST APIs using best practices for request handling, validation, authentication, and authorization. You'll also understand how to enhance the capabilities of your APIs with ODMs, databases, models and views, as well as asynchronous callbacks. This book will guide you in securing your environment by testing your services and initiating test automation with different testing approaches. Furthermore, you'll get to grips with developing secure, testable, and more efficient code, and be able to scale and deploy TypeScript 3 and Node.js-powered RESTful APIs on cloud platforms such as the Google Cloud Platform. Finally, the book will help you explore microservices and give you an overview of what GraphQL can allow you to do. By the end of this book, you will be able to use RESTful web services to create your APIs for mobile and web apps and other platforms. What you will learn Explore various methods to plan your services in a scalable way Understand how to handle different request types and the response status code Get to grips with securing web services Delve into error handling and logging your web services for improved debugging Uncover the microservices architecture and GraphQL Create automated CI\/CD pipelines for release and deployment strategies Who this book is for If you’re a developer who has a basic understanding of REST concepts and want to learn how to design and develop RESTful APIs, this book is for you. Prior knowledge of TypeScript will help you make the most out of this book.","language":"en","currency":"USD","id":"1789955017","title":"Hands-On RESTful Web Services with TypeScript 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AjqPDwAAQBAJ&source=gbs_api","authors":["Biharck Muniz Araújo"]},{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SOg0DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Quickly and productively develop complex Spring applications and microservices - out of the box - with minimal fuss on things like configurations. This book will show you how to fully leverage the Spring Boot productivity suite of tools and how to apply them through the use of case studies. Pro Spring Boot is your authoritative hands-on practical guide for increasing your Spring Framework-based enterprise Java and cloud application productivity while decreasing development time using the Spring Boot productivity suite of tools. It's a no nonsense guide with case studies of increasing complexity throughout the book. This book is written by Felipe Gutierrez, a Spring expert consultant who works with Pivotal, the company behind the popular Spring Framework. What You Will Learn Write your first Spring Boot application Configure Spring Boot Use the Spring Boot Actuator Carry out web development with Spring Boot Build microservices with Spring Boot Handle databases and messaging with Spring Boot Test and deploy with Spring Boot Extend Spring Boot and its available plug-ins Who This Book Is For Experienced Spring and Java developers seeking increased productivity gains and decreased complexity and development time in their applications and software services.","language":"en","currency":"USD","id":"1484214315","title":"Pro Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SOg0DAAAQBAJ&source=gbs_api","authors":["Felipe Gutierrez"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=znc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn how to use the Akka framework to build effective applications in Scala About This Book Covers a discussion on Lagom—the newest launched Akka framework that is built to create complex microservices easily The recipe approach of the book allows the reader to know important and independent concepts of Scala and Akka in a seamless manner Provides a comprehensive understanding of the Akka actor model and implementing it to create reactive web applications Who This Book Is For If you are a Scala developer who wants to build scalable and concurrent applications, then this book is for you. Basic knowledge of Akka will help you take advantage of this book. What You Will Learn Control an actor using the ContolAware mailbox Test a fault-tolerant application using the Akka test kit Create a parallel application using futures and agents Package and deploy Akka application inside Docker Deploy remote actors programmatically on different nodes Integrate Streams with Akka actors Install Lagom and create a Lagom project In Detail Akka is an open source toolkit that simplifies the construction of distributed and concurrent applications on the JVM. This book will teach you how to develop reactive applications in Scala using the Akka framework. This book will show you how to build concurrent, scalable, and reactive applications in Akka. You will see how to create high performance applications, extend applications, build microservices with Lagom, and more. We will explore Akka's actor model and show you how to incorporate concurrency into your applications. The book puts a special emphasis on performance improvement and how to make an application available for users. We also make a special mention of message routing and construction. By the end of this book, you will be able to create a high-performing Scala application using the Akka framework. Style and approach This highly practical recipe-based approach will allow you to build scalable, robust, and reactive applications using the Akka framework.","language":"en","currency":"USD","id":"1785288369","title":"Akka Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=znc5DwAAQBAJ&source=gbs_api","authors":["Hector Veiga Ortiz","Piyush Mishra"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NGsdDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Create complex websites quickly and easily using the building blocks of Drupal 8, the most powerful version of Drupal yet About This Book Build complete, complex websites with no prior knowledge of web development entirely using the intuitive Drupal user interface Follow a practical case study chapter-by-chapter to construct a complete website as you progress Ensure your sites are modern, responsive and mobile-friendly through utilizing the full features available in Drupal 8 Who This Book Is For If you want to learn to use Drupal 8 for the first time, or you are transitioning over from a previous version of Drupal, this is the book for you. No knowledge of PHP, MySQL, or HTML is assumed or required What You Will Learn Set up a local “stack” development environment and install your first Drupal 8 site Find out what is available in Drupal 8 core Define content types and taxonomies—and find out when you should do so Use the powerful Views module Get hands-on with image and media handling Extend Drupal using custom community modules Develop the look and feel of your website using Drupal themes Manage site users and permissions In Detail Drupal 8 sets a new standard for ease of use, while offering countless new ways to tailor and deploy your content to the Web. Drupal 8 allows user to easily customize data structures, listings, and pages, and take advantage of new capabilities for displaying data on mobile devices, building APIs, and adapting to multilingual needs. The book takes you step by step through building a Drupal 8 website. Start with the basics, such as setting up a local “stack” development environment and installing your first Drupal 8 site, then move on to image and media handling, and extending Drupal modules. Push your knowledge by getting to grips with the modular nature of Drupal, and learning to extend it by adding new functionalities to create your new modules. By the end of the book, you will be able to develop and manage a modern and responsive website using Drupal. Style and approach This is an absolute beginners' guide, providing step-by-step instructions to help you learn Drupal 8 from scratch.","language":"en","currency":"USD","id":"1782168761","title":"Learning Drupal 8","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NGsdDAAAQBAJ&source=gbs_api","authors":["Nick Abbott","Richard Jones"]},{"pageCount":362,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lBnADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A practical guide to building and deploying enterprise-grade serverless applications using Azure Functions","description":"Become an expert in implementing Azure Functions to work seamlessly with your serverless applications Key Features Develop scalable, robust multi-tier apps without worrying about infrastructure needs Deploy and manage cost-effective and highly available serverless apps using Azure Functions Accelerate enterprise-level application development by seamlessly integrating different cloud services with Azure Functions Book Description Application development has evolved from traditional monolithic app development to using serverless options and microservices. This book is designed to guide you through using Microsoft's Azure Functions to process data, integrate systems, and build simple APIs and microservices. You will discover how to apply serverless computing to speed up deployment and reduce downtime. You'll also explore Azure Functions, including its core functionalities and essential tools, along with understanding how to debug and even customize Azure Functions. In addition to this, the book will take you through how you can effectively implement DevOps and automation in your working environment. Toward the concluding chapters, you'll cover some quick tips, troubleshooting techniques, and real-world serverless use cases that will help you make the most of serverless computing. By the end of this book, you will have gained the skills you need to develop and deliver cost-effective Azure serverless solutions. What you will learn Create and deploy advanced Azure Functions Learn to extend the runtime of Azure Functions Orchestrate your logic through code or a visual workflow Add caching, security, routing, and filtering to your APIs Use serverless technologies in real-world scenarios Understand how to apply DevOps and automation to your working environment Who this book is for This book is designed for cloud administrators, architects, and developers interested in building scalable systems and deploying serverless applications with Azure Functions. Prior knowledge of core Microsoft Azure services and Azure Functions is necessary to understand the topics covered in this book.","language":"en","currency":"USD","id":"1789952050","title":"Mastering Azure Serverless Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lBnADwAAQBAJ&source=gbs_api","authors":["Lorenzo Barbieri","Massimo Bonanni"]},{"pageCount":410,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AkahDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Write clean and maintainable code by using reusable solutions to common software design problems","description":"Apply design patterns to solve problems in software architecture and programming using C# 7.x and .NET Core 2 Key Features Enhance your programming skills by implementing efficient design patterns for C# and .NET Explore design patterns for functional and reactive programming to build robust and scalable applications Discover how to work effectively with microservice and serverless architectures Book Description Design patterns are essentially reusable solutions to common programming problems. When used correctly, they meet crucial software requirements with ease and reduce costs. This book will uncover effective ways to use design patterns and demonstrate their implementation with executable code specific to both C# and .NET Core. Hands-On Design Patterns with C# and .NET Core begins with an overview of object-oriented programming (OOP) and SOLID principles. It provides an in-depth explanation of the Gang of Four (GoF) design patterns such as creational, structural, and behavioral. The book then takes you through functional, reactive, and concurrent patterns, helping you write better code with streams, threads, and coroutines. Toward the end of the book, you’ll learn about the latest trends in architecture, exploring design patterns for microservices, serverless, and cloud native applications. You’ll even understand the considerations that need to be taken into account when choosing between different architectures such as microservices and MVC. By the end of the book, you will be able to write efficient and clear code and be comfortable working on scalable and maintainable projects of any size. What you will learn Make your code more flexible by applying SOLID principles Follow the Test-driven development (TDD) approach in your .NET Core projects Get to grips with efficient database migration, data persistence, and testing techniques Convert a console application to a web application using the right MVP Write asynchronous, multithreaded, and parallel code Implement MVVM and work with RxJS and AngularJS to deal with changes in databases Explore the features of microservices, serverless programming, and cloud computing Who this book is for If you have a basic understanding of C# and the .NET Core framework, this book will help you write code that is easy to reuse and maintain with the help of proven design patterns that you can implement in your code.","language":"en","currency":"USD","id":"1789138434","title":"Hands-On Design Patterns with C# and .NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AkahDwAAQBAJ&source=gbs_api","authors":["Gaurav Aroraa","Jeffrey Chilberto"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vKKqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Using Containers, Functions, and Data to Build Next-Generation Applications","description":"Developers often struggle when first encountering the cloud. Learning about distributed systems, becoming familiar with technologies such as containers and functions, and knowing how to put everything together can be daunting. With this practical guide, you’ll get up to speed on patterns for building cloud native applications and best practices for common tasks such as messaging, eventing, and DevOps. Authors Boris Scholl, Trent Swanson, and Peter Jausovec describe the architectural building blocks for a modern cloud native application. You’ll learn how to use microservices, containers, serverless computing, storage types, portability, and functions. You’ll also explore the fundamentals of cloud native applications, including how to design, develop, and operate them. Explore the technologies you need to design a cloud native application Distinguish between containers and functions, and learn when to use them Architect applications for data-related requirements Learn DevOps fundamentals and practices for developing, testing, and operating your applications Use tips, techniques, and best practices for building and managing cloud native applications Understand the costs and trade-offs necessary to make an application portable","language":"en","currency":"USD","id":"1492053775","title":"Cloud Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vKKqDwAAQBAJ&source=gbs_api","authors":["Boris Scholl","Trent Swanson","Peter Jausovec"]},{"pageCount":498,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H-l1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A comprehensive guide covering functional and reactive programming with Scala 2.13, Akka, and Lagom","description":"A step-by-step guide in building high-performance scalable applications with the latest features of Scala. Key Features Develop a strong foundation in functional programming and Scala's Standard Library (STL) Get a detailed coverage of Lightbend Lagom—the latest microservices framework from Lightbend Understand the Akka framework and learn event-based Programming with Scala Book Description The second version of Scala has undergone multiple changes to support features and library implementations. Scala 2.13, with its main focus on modularizing the standard library and simplifying collections, brings with it a host of updates. Learn Scala Programming addresses both technical and architectural changes to the redesigned standard library and collections, along with covering in-depth type systems and first-level support for functions. You will discover how to leverage implicits as a primary mechanism for building type classes and look at different ways to test Scala code. You will also learn about abstract building blocks used in functional programming, giving you sufficient understanding to pick and use any existing functional programming library out there. In the concluding chapters, you will explore reactive programming by covering the Akka framework and reactive streams. By the end of this book, you will have built microservices and learned to implement them with the Scala and Lagom framework. What you will learn Acquaint yourself with the new standard library of Scala 2.13 Get to grips with the Grok functional paradigms Get familiar with type system to express domain constraints Understand the actor model and different Akka libraries Grasp the concept of building microservices using Lagom framework Deep dive into property-based testing and its practical applications Who this book is for This book is for beginner to intermediate level Scala developers who would like to advance and gain knowledge of the intricacies of the Scala language, expand their functional programming tools, and explore actor-based concurrency models.","language":"en","currency":"USD","id":"1788830997","title":"Learn Scala Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H-l1DwAAQBAJ&source=gbs_api","authors":["Slava Schmidt"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CIzLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Messaging APIs for Enterprise and Integration Solutions","description":"Build messaging applications using the power of Spring Boot; use Spring application events over the Web; use WebSocket, SockJS, and STOMP messaging with Spring MVC; and use Spring JMS, Redis Pub\/Sub and Spring AMQP for reliable messaging solutions. This book covers all the Spring Messaging APIs using Spring Boot. Written by a Pivotal engineer, Spring Boot Messaging is an authoritative guide to the many messaging APIs and how to use these for creating enterprise and integration solutions. You will learn and integrate these messaging APIs with more complex enterprise and cloud applications: for example, you will see how to use Spring Cloud Stream for creating message-driven and cloud native microservices. In addition, you’ll discover the new Spring Integration DSL and use it with Spring Cloud Stream to build integration solutions using every enterprise integration pattern. Finally, you’ll see Spring Reactor and Spring Cloud to take your application to the next level. “\/p> After reading this book, you will come away with a case study application walk-through and will be able to use it as a template for building your own Spring messaging applications or messaging features within your enterprise or cloud application. What You'll Learn Use the main Spring messaging APIs with Spring Framework 5 Build messaging applications over the Web Use WebSocket, SockJS, and STOMP messaging Integrate Spring JMS and Spring AMQP into your applications Work with Spring Cloud Stream and microservices Who This Book Is For Enterprise Java developers who have at least some previous experience with the Spring Framework and\/or the Spring platform.","language":"en","currency":"USD","id":"148421224X","title":"Spring Boot Messaging","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CIzLDgAAQBAJ&source=gbs_api","authors":["Felipe Gutierrez"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aWYOGXQShegC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Drupal is the premier open source content management system available. It is used for high profile sites such as TheOnion.com and has been deployed by organizations such as NASA. Utilizing Drupal, you can create your own personal blog, a community driven site like Slashdot, or any other content oriented web site you can imagine. Pro Drupal Development is a book geared to professionals that need to deploy and customize Drupal. This book deeply delves into the internals of the Drupal system and teaches the reader everything they will need to know to deploy a highly customized and optimized Drupal installation.","language":"en","currency":"USD","id":"9781430201908","title":"Pro Drupal Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aWYOGXQShegC&source=gbs_api","authors":["John VanDyk","Matt Westgate"]},{"pageCount":542,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Secure your web applications, RESTful services, and microservice architectures","description":"Learn how to secure your Java applications from hackers using Spring Security 4.2 About This Book Architect solutions that leverage the full power of Spring Security while remaining loosely coupled. Implement various scenarios such as supporting existing user stores, user sign up, authentication, and supporting AJAX requests, Integrate with popular Microservice and Cloud services such as Zookeeper, Eureka, and Consul, along with advanced techniques, including OAuth, JSON Web Token's (JWS), Hashing, and encryption algorithms Who This Book Is For This book is intended for Java Web and\/or RESTful webservice developers and assumes a basic understanding of creating Java 8, Java Web and\/or RESTful webservice applications, XML, and the Spring Framework. You are not expected to have any previous experience with Spring Security. What You Will Learn Understand common security vulnerabilities and how to resolve them Learn to perform initial penetration testing to uncover common security vulnerabilities Implement authentication and authorization Learn to utilize existing corporate infrastructure such as LDAP, Active Directory, Kerberos, CAS, OpenID, and OAuth Integrate with popular frameworks such as Spring, Spring-Boot, Spring-Data, JSF, Vaaden, jQuery, and AngularJS. Gain deep understanding of the security challenges with RESTful webservices and microservice architectures Integrate Spring with other security infrastructure components like LDAP, Apache Directory server and SAML In Detail Knowing that experienced hackers are itching to test your skills makes security one of the most difficult and high-pressured concerns of creating an application. The complexity of properly securing an application is compounded when you must also integrate this factor with existing code, new technologies, and other frameworks. Use this book to easily secure your Java application with the tried and trusted Spring Security framework, a powerful and highly customizable authentication and access-control framework. The book starts by integrating a variety of authentication mechanisms. It then demonstrates how to properly restrict access to your application. It also covers tips on integrating with some of the more popular web frameworks. An example of how Spring Security defends against session fixation, moves into concurrency control, and how you can utilize session management for administrative functions is also included. It concludes with advanced security scenarios for RESTful webservices and microservices, detailing the issues surrounding stateless authentication, and demonstrates a concise, step-by-step approach to solving those issues. And, by the end of the book, readers can rest assured that integrating version 4.2 of Spring Security will be a seamless endeavor from start to finish. Style and approach This practical step-by-step tutorial has plenty of example code coupled with the necessary screenshots and clear narration so that grasping content is made easier and quicker.","language":"en","currency":"USD","id":"1787126463","title":"Spring Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MkBPDwAAQBAJ&source=gbs_api","authors":["Mick Knutson","Robert Winch","Peter Mularien"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fB6s_Z6g0gIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"WORK EFFECT LEG CODE _p1","description":"Get more out of your legacy systems: more performance, functionality, reliability, and manageability Is your code easy to change? Can you get nearly instantaneous feedback when you do change it? Do you understand it? If the answer to any of these questions is no, you have legacy code, and it is draining time and money away from your development efforts. In this book, Michael Feathers offers start-to-finish strategies for working more effectively with large, untested legacy code bases. This book draws on material Michael created for his renowned Object Mentor seminars: techniques Michael has used in mentoring to help hundreds of developers, technical managers, and testers bring their legacy systems under control. The topics covered include Understanding the mechanics of software change: adding features, fixing bugs, improving design, optimizing performance Getting legacy code into a test harness Writing tests that protect you against introducing new problems Techniques that can be used with any language or platform—with examples in Java, C++, C, and C# Accurately identifying where code changes need to be made Coping with legacy systems that aren't object-oriented Handling applications that don't seem to have any structure This book also includes a catalog of twenty-four dependency-breaking techniques that help you work with program elements in isolation and make safer changes.","language":"en","currency":"USD","id":"0132931753","title":"Working Effectively with Legacy Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fB6s_Z6g0gIC&source=gbs_api","authors":["Michael Feathers"]},{"pageCount":1112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8I7IT0COId0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"The Definitive Guide to Drupal 7 is the most comprehensive book for getting sites done using the powerful and extensible Drupal content management system. Written by a panel of expert authors, the book covers every aspect of Drupal, from planning a successful project all the way up to making a living from designing Drupal sites and to contributing to the Drupal community yourself. With this book you will: Follow practical approaches to solving many online communication needs with Drupal with real examples. Learn how to keep learning about Drupal: administration, development, theming, design, and architecture. Go beyond the code to engage with the Drupal community as a contributing member and to do Drupal sustainably as a business. The Definitive Guide to Drupal 7 was written by the following team of expert Drupal authors: Benjamin Melançon, Jacine Luisi, Károly Négyesi, Greg Anderson, Bojhan Somers, Stéphane Corlosquet, Stefan Freudenberg, Michelle Lauer, Ed Carlevale, Florian Lorétan, Dani Nordin, Ryan Szrama, Susan Stewart, Jake Strawn, Brian Travis, Dan Hakimzadeh, Amye Scavarda, Albert Albala, Allie Micka, Robert Douglass, Robin Monks, Roy Scholten, Peter Wolanin, Kay VanValkenburgh, Greg Stout, Kasey Qynn Dolin, Mike Gifford, Claudina Sarahe, Sam Boyer, and Forest Mars, with contributions from George Cassie, Mike Ryan, Nathaniel Catchpole, and Dmitri Gaskin. For more information, check out the Drupaleasy podcast #63, in which author Benjamin Melançon discusses The Definitive Guide to Drupal 7 in great detail: http:\/\/drupaleasy.com\/podcast\/2011\/08\/drupaleasy-podcast-63-epic","language":"en","currency":"USD","id":"143023136X","title":"The Definitive Guide to Drupal 7","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8I7IT0COId0C&source=gbs_api","authors":["Benjamin Melancon","Allie Micka","Amye Scavarda","Benjamin Doherty","Bojhan Somers","Jacine Rodriguez","Karoly Negyesi","Moshe Weitzman","Roy Scholten","Ryan Szrama","Sam Boyer","Stephane Corlosquet","Amanda Miller-Johnson","Andrew Grice","Dan Hakimzadeh","Kasey Dolin","Stefan Freudenberg"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iC59DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build dynamic web apps by leveraging two popular Swift web frameworks: Vapor 3.0 and Kitura 2.5","description":"Take advantage of using the same programming language for both server and client-side with this hands-on book for building web applications with Swift. Key Features Build a full-stack iOS and web applications using Swift, Vapor, and Kitura Framework Leverage ORM abstraction drivers to make queries to SQL database Develop your very own containerized microservices with Swift, Docker and Kubernetes Book Description This book is about building professional web applications and web services using Swift 4.0 and leveraging two popular Swift web frameworks: Vapor 3.0 and Kitura 2.5. In the first part of this book, we’ll focus on the creation of basic web applications from Vapor and Kitura boilerplate projects. As the web apps start out simple, more useful techniques, such as unit test development, debugging, logging, and the build and release process, will be introduced to readers. In the second part, we’ll learn different aspects of web application development with server-side Swift, including setting up routes and controllers to process custom client requests, working with template engines such as Leaf and Stencil to create dynamic web content, beautifying the content with Bootstrap, managing user access with authentication framework, and leveraging the Object Relational Mapping (ORM) abstraction layer (Vapor’s Fluent and Kitura’s Kuery) to perform database operations. Finally, in the third part, we’ll develop web services in Swift and build our API Gateway, microservices and database backend in a three-tier architecture design. Readers will learn how to design RESTful APIs, work with asynchronous processes, and leverage container technology such as Docker in deploying microservices to cloud hosting services such as Vapor Cloud and IBM Cloud. What you will learn Build simple web apps using Vapor 3.0 and Kitura 2.5 Test, debug, build, and release server-side Swift applications Design routes and controllers for custom client requests Work with server-side template engines Deploy web apps to a host in the cloud Enhance web content with Bootstrap Manage user access using authentication framework Design for API gateway Develop an iPhone app to work with web services Deploy your app as a microservice in a cluster Deploy Swift web services with a RESTful API design Who this book is for This book is about building professional web applications and web services using Swift and leveraging two popular Swift web frameworks: Vapor 3.0 and Kitura 2.5. We assume the readers to have some working knowledge of Swift programming language. The readers could be beginners of Swift programming, seasonal iOS or macOS developers, or software developers who want to work on practical Swift applications while learning the language itself. By the end of the book, you would be able to successfully create your own web applications and web services by leveraging the powerful ecosystem of Swift.","language":"en","currency":"USD","id":"1789345863","title":"Hands-On Server-Side Web Development with Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iC59DwAAQBAJ&source=gbs_api","authors":["Angus Yeung"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0OikDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design and deliver valuable business APIs","description":"A strategy and implementation guide for building, deploying, and managing APIs Key Features Comprehensive, end-to-end guide to business-driven enterprise APIs Distills years of experience with API and microservice strategies Provides detailed guidance on implementing API-led architectures in any business Book Description APIs are the cornerstone of modern, agile enterprise systems. They enable access to enterprise services from a wide variety of devices, act as a platform for innovation, and open completely new revenue streams. Enterprise API Management shows how to define the right architecture, implement the right patterns, and define the right organization model for business-driven APIs. Drawing on his experience of developing API and microservice strategies for some of the world's largest companies, Luis Weir explains how APIs deliver value across an enterprise. The book explores the architectural decisions, implementation patterns, and management practices for successful enterprise APIs, as well as providing clear, actionable advice on choosing and executing the right API strategy in your enterprise. With a relentless focus on creating business value, Luis Weir reveals an effective method for planning, building, and running business products and services with APIs. What you will learn Create API strategies to deliver business value Monetize APIs, promoting them through public marketplaces and directories Develop API-led architectures, applying best practice architecture patterns Choose between REST, GraphQL, and gRPC-style API architectures Manage APIs and microservices through the complete life cycle Deploy APIs and business products, as well as Target Operating Models Lead product-based organizations to embrace DevOps and focus on delivering business capabilities Who this book is for Architects, developers, and technology executives who want to deliver successful API strategies that bring business value.","language":"en","currency":"USD","id":"1787285618","title":"Enterprise API Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0OikDwAAQBAJ&source=gbs_api","authors":["Luis Weir"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CwBwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Create real-time server-side applications with this practical, step-by-step guide About This Book Learn about server-side JavaScript with Node.js and Node modules through the most up-to-date book on Node.js web development Understand website development both with and without the Connect\/Express web application framework Develop both HTTP server and client applications Who This Book Is For This book is for anybody looking for an alternative to the \"P\" languages (Perl, PHP, and Python), or anyone looking for a new paradigm of server-side application development. You should have at least a rudimentary understanding of JavaScript and web application development. What You Will Learn Install and use Node.js for both development and deployment Use the Express application framework Configure Bootstrap for mobile-first theming Use data storage engines such as MySQL, SQLITE3, and MongoDB Understand user authentication methods, including OAuth, with third-party services Deploy Node.js to live servers, including microservice development with Docker Perform unit testing with Mocha Perform functional testing of the web application with CasperJS In Detail Node.js is a server-side JavaScript platform using an event driven, non-blocking I\/O model allowing users to build fast and scalable data-intensive applications running in real time. Node.js Web Development shows JavaScript is not just for browser-side applications. It can be used for server-side web application development, real-time applications, microservices, and much more. This book gives you an excellent starting point, bringing you straight to the heart of developing web applications with Node.js. You will progress from a rudimentary knowledge of JavaScript and server-side development to being able to create and maintain your own Node.js application. With this book you'll learn how to use the HTTP Server and Client objects, data storage with both SQL and MongoDB databases, real-time applications with Socket.IO, mobile-first theming with Bootstrap, microservice deployment with Docker, authenticating against third-party services using OAuth, and much more. Style and Approach This book is a practical guide for anyone looking to develop striking and robust web applications using Node.js.","language":"en","currency":"USD","id":"1785885413","title":"Node.js Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CwBwDQAAQBAJ&source=gbs_api","authors":["David Herron"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KM10DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With Docker, Jenkins, and Kubernetes","description":"Use DevOps principles with Google Cloud Platform (GCP) to develop applications and services. This book builds chapter by chapter to a complete real-life scenario, explaining how to build, monitor, and maintain a complete application using DevOps in practice. Starting with core DevOps concepts, continuous integration, and continuous delivery, you’ll cover common tools including Jenkins, Docker, and Kubernetes in the context of a real microservices application to deploy in the cloud. You will also create a monitor for your cloud and see how to use its data to prevent errors and improve the stability of the system. By the end of Pro DevOps with Google Cloud Platform, you will be able to deploy, maintain, and monitor a real application with GCP. What You Will Learn Build and deploy applications and services using DevOps on Google Cloud Platform Maintain a complete continuous integration (CI) and continuous delivery (CD) pipeline Use containerization with Docker and Kubernetes Carry out CD with GCP and Jenkins Create microservices with Jenkins, Docker, and Kubernetes Monitor your newly deployed application and its deployment and performance Set up security and manage your network with GCP Who This Book Is For Developers and software architects who want to implement DevOps in practice. Some prior programming experience is recommended as well as a basic knowledge of a Linux command-line environment.","language":"en","currency":"USD","id":"1484238974","title":"Pro DevOps with Google Cloud Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KM10DwAAQBAJ&source=gbs_api","authors":["Pierluigi Riti"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x08oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Familiarize yourself with all of Kotlin's features with this in-depth guide About This Book Get a thorough introduction to Kotlin Learn to use Java code alongside Kotlin without any hiccups Get a complete overview of null safety, Generics, and many more interesting features Who This Book Is For The book is for existing Java developers who want to learn more about an alternative JVM language. If you want to see what Kotlin has to offer, this book is ideal for you. What You Will Learn Use new features to write structured and readable object-oriented code Find out how to use lambdas and higher order functions to write clean, reusable, and simple code Write unit tests and integrate Kotlin tests with Java code in a transitioning code base Write real-world production code in Kotlin in the style of microservices Leverage Kotlin's extensions to the Java collections library Use destructuring expressions and find out how to write your own Write code that avoids null pointer errors and see how Java-nullable code can integrate with features in a Kotlin codebase Discover how to write functions in Kotlin, see the new features available, and extend existing libraries Learn to write an algebraic data types and figure out when they should be used In Detail Kotlin has been making waves ever since it was open sourced by JetBrains in 2011; it has been praised by developers across the world and is already being adopted by companies. This book provides a detailed introduction to Kotlin that shows you all its features and will enable you to write Kotlin code to production. We start with the basics: get you familiar with running Kotlin code, setting up, tools, and instructions that you can use to write basic programs. Next, we cover object oriented code: functions, lambdas, and properties – all while using Kotlin's new features. Then, we move on to null safety aspects and type parameterization. We show you how to destructure expressions and even write your own. We also take you through important topics like testing, concurrency, microservices, and a whole lot more. By the end of this book you will be able to compose different services and build your own applications. Style and approach An easy to follow guide that covers the full set of features in Kotlin programming.","language":"en","currency":"USD","id":"1787122654","title":"Programming Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x08oDwAAQBAJ&source=gbs_api","authors":["Stephen Samuel","Stefan Bocutiu"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t1TbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"An introductory guide to creating intuitive cross-platform user interfaces using Swift 5","description":"Get to grips with Apple’s new SwiftUI framework for creating robust UIs for iOS and iPadOS using Swift programming Key Features Use SwiftUI for building dynamic apps for Apple devices from scratch Understand declarative syntax in cross-platform development and how states work within SwiftUI Learn to develop watchOS apps by reusing SwiftUI code Book Description SwiftUI is the new and powerful interface toolkit that lets you design and build iOS, iPadOS, and macOS apps using declarative syntax. It is a powerful way to develop the UI elements of applications, which would normally be tightly coupled to application logic. Learn SwiftUI will get you up to speed with the framework and cross-device UI development in no time. Complete with detailed explanations and practical examples, this easy-to-follow guide will teach you the fundamentals of the SwiftUI toolkit. You'll learn how to build a powerful iOS and iPadOS application that can be reused for deployment on watchOS. As you progress, you'll delve into UI and unit testing in iOS apps, along with learning how to test your SwiftUI code for multiple devices. The book will also show you how to integrate SwiftUI features such as data binding and network requests into your current application logic. By the end of this book, you will have learned how to build a cross-device application using the SwiftUI framework and Swift programming. What you will learn Explore the fundamentals of SwiftUI and compare it with existing UI frameworks Write SwiftUI syntax and understand what should and shouldn't be included in SwiftUI's layer Add text and images to a SwiftUI view and decorate them using SwiftUI's modifiers Create basic forms, and use camera and photo library functions to add images to them Understand the core concepts of Maps in iOS apps and add a MapView in SwiftUI Design extensions within your existing apps to run them on watchOS Handle networking calls in SwiftUI to retrieve data from external sources Who this book is for This SwiftUI book helps any mobile app developer looking to understand the fundamentals of the new SwiftUI framework along with the benefits of cross-device development. A solid understanding of iOS and macOS app development, along with some knowledge of the Swift programming language, will be beneficial. Basic programming knowledge is essential to grasp the concepts covered in the book effectively.","language":"en","currency":"USD","id":"1839210877","title":"Learn SwiftUI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t1TbDwAAQBAJ&source=gbs_api","authors":["Chris Barker"]},{"pageCount":628,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5UEwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Quick solutions to common programming problems with the latest features of C# 7.0, .NET Core 1.1, and Visual Studio 2017 About This Book Easy-to-follow recipes to get you up-and-running with the new features of C# 7 and .NET Core 1.1 Practical solutions to assist you with microservices and serverless computing in C# Explore the new Visual Studio environment and write more secure code in it Who This Book Is For The book will appeal to C# and .NET developers who have a basic familiarity with C# and the Visual Studio 2015 environment What You Will Learn Writing better and less code to achieve the same result as in previous versions of C# Working with analyzers in Visual Studio Working with files, streams, and serialization Writing high-performant code in C# and understanding multi-threading Demystifying the Rx library using Reactive extensions Exploring .Net Core 1.1 and ASP.NET MVC Securing your applications and learning new debugging techniques Designing and building a microservice architecture Using Azure and AWS for serverless computing with C# In Detail C# has recently been open-sourced and C# 7 comes with a host of new features for building powerful, cross-platform applications. This book will be your solution to some common programming problems that you come across with C# and will also help you get started with .NET Core 1.1. Through a recipe-based approach, this book will help you overcome common programming challenges and get your applications ready to face the modern world. We start by running you through new features in C# 7, such as tuples, pattern matching, and so on, giving you hands-on experience with them. Moving forward, you will work with generics and the OOP features in C#. You will then move on to more advanced topics, such as reactive extensions, Regex, code analyzers, and asynchronous programming. This book will also cover new, cross-platform .NET Core 1.1 features and teach you how to utilize .NET Core on macOS. Then, we will explore microservices as well as serverless computing and how these benefit modern developers. Finally, you will learn what you can do with Visual Studio 2017 to put mobile application development across multiple platforms within the reach of any developer. Style and approach A unique recipe-based guide that will help you gain a solid understanding of the new concepts in C# 7.0 and Visual Studio 2017","language":"en","currency":"USD","id":"1787289206","title":"C# 7 and .NET Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5UEwDwAAQBAJ&source=gbs_api","authors":["Dirk Strauss"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YCyWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Deep dive into the latest edition of the Swift programming language, 5th Edition","description":"Harness the power of the latest edition with this in-depth and comprehensive guide to the Swift language Key Features Fifth edition of this bestselling book, improved and updated to cover the latest version of the Swift 5 programming language Get to grips with popular and modern design techniques to write easy-to-manage Swift code Learn how to use core Swift features such as concurrency, generics, and copy-on-write in your code Book Description Over the years, the Mastering Swift book has established itself amongst developers as a popular choice as an in-depth and practical guide to the Swift programming language. The latest edition is fully updated and revised to cover the new version: Swift 5. Inside this book, you'll find the key features of Swift 5 easily explained with complete sets of examples. From the basics of the language to popular features such as concurrency, generics, and memory management, this definitive guide will help you develop your expertise and mastery of the Swift language. Mastering Swift 5, Fifth Edition will give you an in-depth knowledge of some of the most sophisticated elements in Swift development, including protocol extensions, error handling, and closures. It will guide you on how to use and apply them in your own projects. Later, you'll see how to leverage the power of protocol-oriented programming to write flexible and easier-to-manage code. You will also see how to add the copy-on-write feature to your custom value types and how to avoid memory management issues caused by strong reference cycles. What you will learn Understand core Swift components, including operators, collections, control flows, and functions Learn how and when to use classes, structures, and enumerations Understand how to use protocol-oriented design with extensions to write easier-to-manage code Use design patterns with Swift, to solve commonly occurring design problems Implement copy-on-write for you custom value types to improve performance Add concurrency to your applications using Grand Central Dispatch and Operation Queues Implement generics to write flexible and reusable code Who this book is for This book is for developers who want to delve into the newest version of Swift. If you are a developer and learn best by looking at and working with code, then this book is for you. A basic understanding of Apple's tools would be beneficial but not mandatory. All examples should work on the Linux platform as well.","language":"en","currency":"USD","id":"1789132738","title":"Mastering Swift 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YCyWDwAAQBAJ&source=gbs_api","authors":["Jon Hoffman"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QGZ-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This fully updated study guide delivers 100% coverage of every topic on the CompTIA ITF+ IT Fundamentals exam Take the CompTIA ITF+ IT Fundamentals exam with complete confidence using this bestselling and effective self-study system. Written by CompTIA certification and training experts, this authoritative guide explains foundational computer technologies in full detail. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations throughout. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Also includes a voucher coupon for a 10% discount on your CompTIA exams! Covers all exam topics, including: • Computer basics • System hardware • I\/O ports and peripherals • Data storage and sharing • PC setup and configuration • Understanding operating systems • Working with applications and files • Setting up and configuring a mobile device • Connecting to networks and the Internet • Handling local and online security threats • Computer maintenance and management • Troubleshooting and problem solving • Understanding databases • Software development and implementation Online content includes: • 130 practice exam questions in a customizable test engine • Link to over an hour of free video training from Mike Meyers","language":"en","currency":"USD","id":"1260441881","title":"ITF+ CompTIA IT Fundamentals All-in-One Exam Guide, Second Edition (Exam FC0-U61)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QGZ-DwAAQBAJ&source=gbs_api","authors":["Mike Meyers","Scott Jernigan","Daniel Lachance"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Uncover essential patterns in the most indispensable realm of enterprise architecture","description":"Learn the importance of architectural and design patterns in producing and sustaining next-generation IT and business-critical applications with this guide. Key Features Use patterns to tackle communication, integration, application structure, and more Implement modern design patterns such as microservices to build resilient and highly available applications Choose between the MVP, MVC, and MVVM patterns depending on the application being built Book Description Enterprise Architecture (EA) is typically an aggregate of the business, application, data, and infrastructure architectures of any forward-looking enterprise. Due to constant changes and rising complexities in the business and technology landscapes, producing sophisticated architectures is on the rise. Architectural patterns are gaining a lot of attention these days. The book is divided in three modules. You'll learn about the patterns associated with object-oriented, component-based, client-server, and cloud architectures. The second module covers Enterprise Application Integration (EAI) patterns and how they are architected using various tools and patterns. You will come across patterns for Service-Oriented Architecture (SOA), Event-Driven Architecture (EDA), Resource-Oriented Architecture (ROA), big data analytics architecture, and Microservices Architecture (MSA). The final module talks about advanced topics such as Docker containers, high performance, and reliable application architectures. The key takeaways include understanding what architectures are, why they're used, and how and where architecture, design, and integration patterns are being leveraged to build better and bigger systems. What you will learn Understand how several architectural and design patterns work to systematically develop multitier web, mobile, embedded, and cloud applications Learn object-oriented and component-based software engineering principles and patterns Explore the frameworks corresponding to various architectural patterns Implement domain-driven, test-driven, and behavior-driven methodologies Deploy key platforms and tools effectively to enable EA design and solutioning Implement various patterns designed for the cloud paradigm Who this book is for This book will empower and enrich IT architects (such as enterprise architects, software product architects, and solution and system architects), technical consultants, evangelists, and experts.","language":"en","currency":"USD","id":"178728834X","title":"Architectural Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RvNFDwAAQBAJ&source=gbs_api","authors":["Pethuru Raj Chelliah","Harihara Subramanian","Anupama Murali"]},{"pageCount":596,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Develop, test, and troubleshoot Java Enterprise applications rapidly with Eclipse, 3rd Edition","description":"Develop and deploy fully functional applications and microservices utilising Tomcat, Glassfish servers, Cloud and docker in Java EE 8 Key Features Explore the complete workflow of developing enterprise Java applications Develop microservices with Docker Container and deploy it in cloud Simplify Java EE application development Book Description Java EE is one of the most popular tools for enterprise application design and development. With recent changes to Java EE 8 specifications, Java EE application development has become a lot simpler with the new specifications, some of which compete with the existing specifications. This guide provides a complete overview of developing highly performant, robust and secure enterprise applications with Java EE with Eclipse. The book begins by exploring different Java EE technologies and how to use them (JSP, JSF, JPA, JDBC, EJB, and more), along with suitable technologies for different scenarios. You will learn how to set up the development environment for Java EE applications and understand Java EE specifications in detail, with an emphasis on examples. The book takes you through deployment of an application in Tomcat, GlassFish Servers, and also in the cloud. It goes beyond the basics and covers topics like debugging, testing, deployment, and securing your Java EE applications. You'll also get to know techniques to develop cloud-ready microservices in Java EE. What you will learn Set up Eclipse, Tomcat, and Glassfish servers for Java EE application development Use JSP, Servlet, JSF, and EJBs to create a user interface and write business logic Create Java EE database applications using JDBC and JPA Handle asynchronous messages using MDBs for better scalability Deploy and debug Java EE applications and create SOAP and REST web services Write unit tests and calculate code coverage Use Eclipse MAT (Memory Analysis Tool) to debug memory issues Create and deploy microservices Who this book is for If you are a Java developer with little or no experience in Java EE application development, or if you have experience in Java EE technology but are looking for tips to simplify and accelerate your development process, then this book is for you.","language":"en","currency":"USD","id":"1788833880","title":"Java EE 8 Development with Eclipse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SMNiDwAAQBAJ&source=gbs_api","authors":["Ram Kulkarni"]},{"pageCount":652,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UHFdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"Building Applications with Enterprise JavaBeans","description":"Build powerful back-end business logic and complex Enterprise JavaBeans (EJB)-based applications using Java EE 8, Eclipse Enterprise for Java (EE4J), Web Tools Project (WTP), and the Microprofile platform. Targeted at Java and Java EE developers, with or without prior EJB experience, this book is packed with practical insights, strategy tips, and code examples. As each chapter unfolds, you'll see how you can apply the new EJB spec to your own applications through specific examples. Beginning EJB in Java EE 8 serves not only as a reference, but also as a how-to guide and repository of practical examples to which you can refer as you build your own applications. It will help you harness the power of EJBs and take your Java EE 8 development to the next level. You'll gain the knowledge and skills you’ll need to create the complex enterprise applications that run today's transactions and more. What You'll Learn Build applications with Enterprise JavaBeans (EJBs) in the new Java EE 8 platform Discover when to use EJBs over contexts and dependency injection Use message-driven beans to do tasks asynchronously Integrate EJBs with microservices using the new Eclipse Microprofile project Manage complex enterprise transactions and much more Who This Book Is For Java programmers new to enterprise development and for those who may have experience with EJBs but are new to Java EE 8, EE4J, and related Eclipse projects.","language":"en","currency":"USD","id":"1484235738","title":"Beginning EJB in Java EE 8","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UHFdDwAAQBAJ&source=gbs_api","authors":["Jonathan Wetherbee","Massimo Nardone","Chirag Rathod","Raghu Kodali"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hC59DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Distributed data caching and processing made easy","description":"Build efficient, high-performance & scalable systems to process large volumes of data with Apache Ignite Key Features Understand Apache Ignite's in-memory technology Create High-Performance app components with Ignite Build a real-time data streaming and complex event processing system Book Description Apache Ignite is a distributed in-memory platform designed to scale and process large volume of data. It can be integrated with microservices as well as monolithic systems, and can be used as a scalable, highly available and performant deployment platform for microservices. This book will teach you to use Apache Ignite for building a high-performance, scalable, highly available system architecture with data integrity. The book takes you through the basics of Apache Ignite and in-memory technologies. You will learn about installation and clustering Ignite nodes, caching topologies, and various caching strategies, such as cache aside, read and write through, and write behind. Next, you will delve into detailed aspects of Ignite’s data grid: web session clustering and querying data. You will learn how to process large volumes of data using compute grid and Ignite’s map-reduce and executor service. You will learn about the memory architecture of Apache Ignite and monitoring memory and caches. You will use Ignite for complex event processing, event streaming, and the time-series predictions of opportunities and threats. Additionally, you will go through off-heap and on-heap caching, swapping, and native and Spring framework integration with Apache Ignite. By the end of this book, you will be confident with all the features of Apache Ignite 2.x that can be used to build a high-performance system architecture. What you will learn Use Apache Ignite’s data grid and implement web session clustering Gain high performance and linear scalability with in-memory distributed data processing Create a microservice on top of Apache Ignite that can scale and perform Perform ACID-compliant CRUD operations on an Ignite cache Retrieve data from Apache Ignite’s data grid using SQL, Scan and Lucene Text query Explore complex event processing concepts and event streaming Integrate your Ignite app with the Spring framework Who this book is for The book is for Big Data professionals who want to learn the essentials of Apache Ignite. Prior experience in Java is necessary.","language":"en","currency":"USD","id":"1789344069","title":"Apache Ignite Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hC59DwAAQBAJ&source=gbs_api","authors":["Sujoy Acharya"]},{"pageCount":658,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7Ld9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"STAF 2018 Collocated Workshops, Toulouse, France, June 25-29, 2018, Revised Selected Papers","description":"This book contains the thoroughly refereed technical papers presented in eight workshops collocated with the International Conference on Software Technologies: Applications and Foundations, STAF 2018, held in Toulouse, France, in June 2018. The 65 full papers presented were carefully reviewed and selected from 120 submissions. The events whose papers are included in this volume are: CoSim-CPS 2018: 2nd International Workshop on Formal Co-Simulation of Cyber-Physical Systems DataMod 2018: 7th International Symposium From Data to Models and Back FMIS 2018: 7th International Workshop on Formal Methods for Interactive Systems FOCLASA 2018: 16th International Workshop on Foundations of Coordination Languages and Self-adaptative Systems GCM 2018: 9th International Workshop on Graph Computation Models MDE@DeRun 2018: 1st International Workshop on Model-Driven Engineering for Design-Runtime Interaction in Complex Systems MSE 2018: 3rd International Workshop on Microservices: Science and Engineering SecureMDE 2018: 1st International Workshop on Security for and by Model-Driven Engineering","language":"en","currency":"USD","id":"3030047717","title":"Software Technologies: Applications and Foundations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7Ld9DwAAQBAJ&source=gbs_api","authors":["Manuel Mazzara","Iulian Ober","Gwen Salaün"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NiqzCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book is for everybody who would like to learn modern Java web development based on PrimeFaces and is looking for a quick introduction to this matter. Prerequisites for this book are basic JSF, jQuery, and CSS skills.","language":"en","currency":"USD","id":"1784396834","title":"PrimeFaces Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NiqzCQAAQBAJ&source=gbs_api","authors":["Mert Çalışkan","Oleg Varaksin"]},{"pageCount":247,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zHuGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Building Web Applications in .NET","description":"Build web applications in Microsoft .NET that run in any modern browser, helping you to transfer your .NET experience and skills to a new environment and build browser-based applications using a robust and type-safe language and runtime. Developing a web site with rich client-side behavior means most developers need to learn a transpiled language like JavaScript or TypeScript. But today you can also develop rich browser applications using the .NET runtime and C# using Blazor. With Blazor you can use all that experience you have amassed over the years, and can use thousands of already existing libraries, right in the browser. Blazor Revealed will allow you to create a rich web site experience in no time. You will learn how to build user interfaces, and present data to a user for display and modification, capturing the user’s changes via data binding. The book shows you how to access a rich library of .NET functionality such as a component model for building a composable user interface, including how to develop reusable components that can be used across many pages and web sites. Also covered is data exchange with a server, giving you access to microservices and database services. Blazor provides a fresh take on web development by eliminating the need for you to learn different languages and frameworks for client- and server-side development. Blazor allows C# and .NET to be used on all sides, providing a robust feature set that is well suited toward scalable, enterprise-level applications. Blazor Revealed gets you started in using this important new toolkit for web application development. What You'll Learn Build user interfaces and display data for users to edit Capture the user’s changes via data binding Transfer data back and forth between server and client Communicate with microservices and database services Develop reusable components and assemble them into bigger components Use routing to build single page applications (SPAs) Build Blazor libraries that are reusable across applications Who This Book Is For Experienced .NET developers who want to apply their existing skills to building professional quality, client-side web applications that run in any browser. The book is for web developers who want to step away from JavaScript and its complexities, and instead use a proven technology (.NET) that is robust toward creating enterprise-quality applications that scale and are reliable and that provide good user experience. The book is for intermediate to advanced .NET web developers with no experience using Blazor.","language":"en","currency":"USD","id":"1484243439","title":"Blazor Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zHuGDwAAQBAJ&source=gbs_api","authors":["Peter Himschoot"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_95YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build highly performant, multi-threaded, and concurrent applications using C# 7 and .NET Core 2.0","description":"Improve the speed of your code and optimize the performance of your apps Key Features Understand the common performance pitfalls and improve your application’s performance Get to grips with multi-threaded and asynchronous programming in C# Develop highly performant applications on .NET Core using microservice architecture Book Description While writing an application, performance is paramount. Performance tuning for realworld applications often involves activities geared toward fnding bottlenecks; however, this cannot solve the dreaded problem of slower code. If you want to improve the speed of your code and optimize an application's performance, then this book is for you. C# 7 and .NET Core 2.0 High Performance begins with an introduction to the new features of what?explaining how they help in improving an application's performance. Learn to identify the bottlenecks in writing programs and highlight common performance pitfalls, and learn strategies to detect and resolve these issues early. You will explore multithreading and asynchronous programming with .NET Core and learn the importance and effcient use of data structures. This is followed with memory management techniques and design guidelines to increase an application’s performance. Gradually, the book will show you the importance of microservices architecture for building highly performant applications and implementing resiliency and security in .NET Core. After reading this book, you will learn how to structure and build scalable, optimized, and robust applications in C#7 and .NET. What you will learn Measure application performance using BenchmarkDotNet Explore the techniques to write multithreaded applications Leverage TPL and PLinq libraries to perform asynchronous operations Get familiar with data structures to write optimized code Understand design techniques to increase your application’s performance Learn about memory management techniques in .NET Core Develop a containerized application based on microservices architecture Learn tools and techniques to monitor application performance Who this book is for This book is for .NET developers looking at improving the speed of their code or simply wanting to take their skills to the next level. Basic C# knowledge is assumed.","language":"en","currency":"USD","id":"1788474600","title":"C# 7 and .NET Core 2.0 High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_95YDwAAQBAJ&source=gbs_api","authors":["Ovais Mehboob Ahmed Khan"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-BPBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Securing APIs with OAuth 2.0, OpenID Connect, JWS, and JWE","description":"Advanced API Security is a complete reference to the next wave of challenges in enterprise security--securing public and private APIs. API adoption in both consumer and enterprises has gone beyond predictions. It has become the ‘coolest’ way of exposing business functionalities to the outside world. Both your public and private APIs, need to be protected, monitored and managed. Security is not an afterthought, but API security has evolved a lot in last five years. The growth of standards, out there, has been exponential. That's where AdvancedAPI Security comes in--to wade through the weeds and help you keep the bad guys away while realizing the internal and external benefits of developing APIs for your services. Our expert author guides you through the maze of options and shares industry leading best practices in designing APIs for rock-solid security. The book will explain, in depth, securing APIs from quite traditional HTTP Basic Authentication to OAuth 2.0 and the standards built around it. Build APIs with rock-solid security today with Advanced API Security. Takes you through the best practices in designing APIs for rock-solid security. Provides an in depth tutorial of most widely adopted security standards for API security. Teaches you how to compare and contrast different security standards\/protocols to find out what suits your business needs the best.","language":"en","currency":"USD","id":"1430268174","title":"Advanced API Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-BPBAAAQBAJ&source=gbs_api","authors":["Prabath Siriwardena"]},{"pageCount":225,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KW48DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book provides an effective overview of the state-of-the art in software engineering, with a projection of the future of the discipline. It includes 13 papers, written by leading researchers in the respective fields, on important topics like model-driven software development, programming language design, microservices, software reliability, model checking and simulation. The papers are edited and extended versions of the presentations at the PAUSE symposium, which marked the completion of 14 years of work at the Chair of Software Engineering at ETH Zurich. In this inspiring context, some of the greatest minds in the field extensively discussed the past, present and future of software engineering. It guides readers on a voyage of discovery through the discipline of software engineering today, offering unique food for thought for researchers and professionals, and inspiring future research and development.","language":"en","currency":"USD","id":"3319674250","title":"Present and Ulterior Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KW48DwAAQBAJ&source=gbs_api","authors":["Manuel Mazzara","Bertrand Meyer"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GedDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build cloud native applications in Python About This Book This is the only reliable resource that showcases the tools and techniques you need build robust and resilient cloud native applications in Python Learn how to architect your application on both, the AWS and Azure clouds for high availability Assess, monitor, and troubleshoot your applications in the cloud Who This Book Is For This book is ideal for developers with a basic knowledge of Python who want to learn to build, test, and scale their Python-based applications. No prior experience of writing microservices in Python is required. What You Will Learn Get to know “the way of the cloud”, including why developing good cloud software is fundamentally about mindset and discipline Know what microservices are and how to design them Create reactive applications in the cloud with third-party messaging providers Build massive-scale, user-friendly GUIs with React and Flux Secure cloud-based web applications: the do's, don'ts, and options Plan cloud apps that support continuous delivery and deployment In Detail Businesses today are evolving so rapidly that having their own infrastructure to support their expansion is not feasible. As a result, they have been resorting to the elasticity of the cloud to provide a platform to build and deploy their highly scalable applications. This book will be the one stop for you to learn all about building cloud-native architectures in Python. It will begin by introducing you to cloud-native architecture and will help break it down for you. Then you'll learn how to build microservices in Python using REST APIs in an event driven approach and you will build the web layer. Next, you'll learn about Interacting data services and building Web views with React, after which we will take a detailed look at application security and performance. Then, you'll also learn how to Dockerize your services. And finally, you'll learn how to deploy the application on the AWS and Azure platforms. We will end the book by discussing some concepts and techniques around troubleshooting problems that might occur with your applications after you've deployed them. This book will teach you how to craft applications that are built as small standard units, using all the proven best practices and avoiding the usual traps. It's a practical book: we're going to build everything using Python 3 and its amazing tooling ecosystem. The book will take you on a journey, the destination of which, is the creation of a complete Python application based on microservices over the cloud platform Style and approach Filled with examples, this book takes a step-by-step approach to teach you each and every configuration you need to make your application highly available and fault tolerant.","language":"en","currency":"USD","id":"1787129543","title":"Cloud Native Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GedDDwAAQBAJ&source=gbs_api","authors":["Manish Sethi"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8JoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build enterprise-ready scalable applications with architectural design patterns","description":"Get the deep insights you need to master efficient architectural design considerations and solve common design problems in your enterprise applications. Key Features The benefits and applicability of using different design patterns in JAVA EE Learn best practices to solve common design and architectural challenges Choose the right patterns to improve the efficiency of your programs Book Description Patterns are essential design tools for Java developers. Java EE Design Patterns and Best Practices helps developers attain better code quality and progress to higher levels of architectural creativity by examining the purpose of each available pattern and demonstrating its implementation with various code examples. This book will take you through a number of patterns and their Java EE-specific implementations. In the beginning, you will learn the foundation for, and importance of, design patterns in Java EE, and then will move on to implement various patterns on the presentation tier, business tier, and integration tier. Further, you will explore the patterns involved in Aspect-Oriented Programming (AOP) and take a closer look at reactive patterns. Moving on, you will be introduced to modern architectural patterns involved in composing microservices and cloud-native applications. You will get acquainted with security patterns and operational patterns involved in scaling and monitoring, along with some patterns involved in deployment. By the end of the book, you will be able to efficiently address common problems faced when developing applications and will be comfortable working on scalable and maintainable projects of any size. What you will learn Implement presentation layers, such as the front controller pattern Understand the business tier and implement the business delegate pattern Master the implementation of AOP Get involved with asynchronous EJB methods and REST services Involve key patterns in the adoption of microservices architecture Manage performance and scalability for enterprise-level applications Who this book is for Java developers who are comfortable with programming in Java and now want to learn how to implement design patterns to create robust, reusable and easily maintainable apps.","language":"en","currency":"USD","id":"1788837738","title":"Java EE 8 Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8JoDwAAQBAJ&source=gbs_api","authors":["Rhuan Rocha","João Purificação"]}]