[{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bOWYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Second International Conference, ICETCE 2019, Jaipur, India, February 1–2, 2019, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the Second International Conference on Emerging Technologies in Computer Engineering: Microservices in Big Data Analytics, ICETCE 2019, held in Jaipur, India, in February 2019. The 28 revised full papers along with 1 short paper presented were carefully reviewed and selected from 253 submissions. ICETCE conference aims to showcase advanced technologies, techniques, innovations and equipments in computer engineering. It provides a platform for researchers, scholars, experts, technicians, government officials and industry personnel from all over the world to discuss and share their valuable ideas and experiences.","language":"en","currency":"USD","id":"9811383006","title":"Emerging Technologies in Computer Engineering: Microservices in Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bOWYDwAAQBAJ&source=gbs_api","authors":["Arun K. Somani","Seeram Ramakrishna","Anil Chaudhary","Chothmal Choudhary","Basant Agarwal"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pZd2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Docker Across Microservices","description":"Discover how a software engineer can leverage Docker in order to expedite development velocity. This book focuses on the fundamental concepts this program is built upon and explores how it can help you get your services up and running inside Docker containers. You'll also review tips on how to debug microservices applications that run inside Docker containers. Tech companies are now developing complex softwares that are comprised of multiple services running on different platforms, and Docker has become an essential part of coordinating the communication between these services and platforms. This book addresses problems caused by drifting microservices, debugging across services, inconsistent environments across machines, and coordinating development of machine learning systems between a team of developers, etc. Accelerating Development Velocity Using Docker puts you on the path to transforming your complex systems into more efficient ones. What You'll Learn Setup Docker and employ quick solutions to road blocks Review challenges associated with debugging microservices that sit behind a complex application Leverage Docker features to seamlessly get multiple microservices up and running Debug inside a Docker container Review advanced use cases of Docker that can help consistency of development environments· Who This Book Is For Ideal for new to mid-level infrastructure engineers who want to learn how to make their development environments efficient across their and cross teams, or for students who aspire to learn basics of how to debug distributed systems and how to develop efficient applications.","language":"en","currency":"USD","id":"1484239369","title":"Accelerating Development Velocity Using Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pZd2DwAAQBAJ&source=gbs_api","authors":["Kinnary Jangla"]},{"pageCount":380,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_YLoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Practical recipes for enterprise Java developers to deliver large scale applications with Jakarta EE, 2nd Edition","description":"An enterprise Java developer's guide to learning JAX-RS, context and dependency injection, JavaServer Faces (JSF), and microservices with Eclipse MicroProfile using the latest features of Jakarta EE Key Features Explore Jakarta EE's latest features and API specifications and discover their benefits Build and deploy microservices using Jakarta EE 8 and Eclipse MicroProfile Build robust RESTful web services for various enterprise scenarios using the JAX-RS, JSON-P, and JSON-B APIs Book Description Jakarta EE is widely used around the world for developing enterprise applications for a variety of domains. With this book, Java professionals will be able to enhance their skills to deliver powerful enterprise solutions using practical recipes. This second edition of the Jakarta EE Cookbook takes you through the improvements introduced in its latest version and helps you get hands-on with its significant APIs and features used for server-side development. You'll use Jakarta EE for creating RESTful web services and web applications with the JAX-RS, JSON-P, and JSON-B APIs and learn how you can improve the security of your enterprise solutions. Not only will you learn how to use the most important servers on the market, but you'll also learn to make the best of what they have to offer for your project. From an architectural point of view, this Jakarta book covers microservices, cloud computing, and containers. It allows you to explore all the tools for building reactive applications using Jakarta EE and core Java features such as lambdas. Finally, you'll discover how professionals can improve their projects by engaging with and contributing to the community. By the end of this book, you'll have become proficient in developing and deploying enterprise applications using Jakarta EE. What you will learn Work with Jakarta EE's most commonly used APIs and features for server-side development Enable fast and secure communication in web applications with the help of HTTP2 Build enterprise applications with reusable components Break down monoliths into microservices using Jakarta EE and Eclipse MicroProfile Improve your enterprise applications with multithreading and concurrency Run applications in the cloud with the help of containers Get to grips with continuous delivery and deployment for shipping your applications effectively Who this book is for This book is for Java EE developers who want to build enterprise applications or update their legacy apps with Jakarta EE's latest features and specifications. Some experience of working with Java EE and knowledge of web and cloud computing will assist with understanding the concepts covered in this book.","language":"en","currency":"USD","id":"1838640320","title":"Jakarta EE Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_YLoDwAAQBAJ&source=gbs_api","authors":["Elder Moraes"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9pY3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Applications and Microservices with the Spring Framework","description":"Learn Spring Boot and how to build Java-based enterprise, web, and microservice applications with it. In this book, you'll see how to work with relational and NoSQL databases, build your first microservice, enterprise, or web application, and enhance that application with REST APIs. You'll also learn how to build reactive web applications using Spring Boot along with Spring Web Reactive. Then you’ll secure your Spring Boot-created application or service before testing and deploying it. After reading and learning with Beginning Spring Boot 2, you'll have the skills and techniques to start building your first Spring Boot applications and microservices with confidence to take the next steps in your career journey. What You'll Learn Use Spring Boot autoconfiguration Work with relational and NoSQL databases Build web applications with Spring Boot Apply REST APIs using Spring Boot Create reactive web applications using Spring Web Reactive Secure your Spring Boot applications or web services Test and deploy your Spring Boot applications Who This Book Is For Experienced Java and Spring Framework developers who are new to the new Spring Boot micro-framework.","language":"en","currency":"USD","id":"1484229312","title":"Beginning Spring Boot 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9pY3DwAAQBAJ&source=gbs_api","authors":["K. Siva Prasad Reddy"]},{"pageCount":418,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3vjJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Attain expert-level proficiency with Git for enhanced productivity and efficient collaboration by mastering advanced distributed version control features About This Book Set up Git for solo and collaborative development Harness the full power of Git version control system to customize Git behavior, manipulate history, integrate external tools and explore platform shortcuts A detailed guide, which explains how to apply advanced Git techniques and workflows and ways to handle submodules Who This Book Is For If you are a Git user with reasonable knowledge of Git and familiarity with basic concepts such as branching, merging, staging, and workflows, this is the book for you. Basic knowledge of installing Git and software configuration management concepts is essential. What You Will Learn Explore project history, find revisions using different criteria, and filter and format how history looks Manage your working directory and staging area for commits and interactively create new revisions and amend them Set up repositories and branches for collaboration Submit your own contributions and integrate contributions from other developers via merging or rebasing Customize Git behavior system-wide, on a per-user, per-repository, and per-file basis Take up the administration and set up of Git repositories, configure access, find and recover from repository errors, and perform repository maintenance Chose a workflow and configure and set up support for the chosen workflow In Detail Git is one of the most popular types of Source Code Management (SCM) and Distributed Version Control System (DVCS). Despite the powerful and versatile nature of the tool enveloping strong support for nonlinear development and the ability to handle large projects efficiently, it is a complex tool and often regarded as “user-unfriendly”. Getting to know the ideas and concepts behind the architecture of Git will help you make full use of its power and understand its behavior. Learning the best practices and recommended workflows should help you to avoid problems and ensure trouble-free development. The book scope is meticulously designed to help you gain deeper insights into Git's architecture, its underlying concepts, behavior, and best practices. Mastering Git starts with a quick implementation example of using Git for a collaborative development of a sample project to establish the foundation knowledge of Git operational tasks and concepts. Furthermore, as you progress through the book, the tutorials provide detailed descriptions of various areas of usage: from archaeology, through managing your own work, to working with other developers. This book also helps augment your understanding to examine and explore project history, create and manage your contributions, set up repositories and branches for collaboration in centralized and distributed version control, integrate work from other developers, customize and extend Git, and recover from repository errors. By exploring advanced Git practices, you will attain a deeper understanding of Git's behavior, allowing you to customize and extend existing recipes and write your own. Style and approach Step-by-step instructions and useful information make this book the ultimate guide to understanding and mastering Git. This book will show road to mastery example by example, while explaining mental model of Git. The Introduction section covers the 'Essentials' just for refreshing the basics. The main highlight is that the concepts are based on HOW the technology\/framework works and not just practical 'WHAT to do'.","language":"en","currency":"USD","id":"1783553766","title":"Mastering Git","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3vjJDAAAQBAJ&source=gbs_api","authors":["Jakub Narebski"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xxYoCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Sustainable Architecture in an Agile and Cloud-Centric World","description":"Continuous Architecture provides a broad architectural perspective for continuous delivery, and describes a new architectural approach that supports and enables it. As the pace of innovation and software releases increases, IT departments are tasked to deliver value quickly and inexpensively to their business partners. With a focus on getting software into end-users hands faster, the ultimate goal of daily software updates is in sight to allow teams to ensure that they can release every change to the system simply and efficiently. This book presents an architectural approach to support modern application delivery methods and provide a broader architectural perspective, taking architectural concerns into account when deploying agile or continuous delivery approaches. The authors explain how to solve the challenges of implementing continuous delivery at the project and enterprise level, and the impact on IT processes including application testing, software deployment and software architecture. Covering the application of enterprise and software architecture concepts to the Agile and Continuous Delivery models Explains how to create an architecture that can evolve with applications Incorporates techniques including refactoring, architectural analysis, testing, and feedback-driven development Provides insight into incorporating modern software development when structuring teams and organizations","language":"en","currency":"USD","id":"0128032855","title":"Continuous Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xxYoCgAAQBAJ&source=gbs_api","authors":["Murat Erder","Pierre Pureur"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6lmfDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Managing Applications for Cloud, Mobile, IoT and eBusiness","description":"Application Performance Management (APM) in the Digital Enterprise enables IT professionals to be more successful in managing their company’s applications. It explores the fundamentals of application management, examines how the latest technological trends impact application management, and provides best practices for responding to these changes. The recent surge in the use of containers as a way to simplify management and deploy applications has created new challenges, and the convergence of containerization, cloud, mobile, virtualization, analytics, and automation is reshaping the requirements for application management. This book serves as a guide for understanding these dramatic changes and how they impact the management of applications, showing how to create a management strategy, define the underlying processes and standards, and how to select the appropriate tools to enable management processes. Offers a complete framework for implementing effective application management using clear tips and solutions for those responsible for application management Draws upon primary research to give technologists a current understanding of the latest technologies and processes needed to more effectively manage large-scale applications Includes real-world case studies and business justifications that support application management investments","language":"en","currency":"USD","id":"0128040815","title":"Application Performance Management (APM) in the Digital Enterprise","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6lmfDAAAQBAJ&source=gbs_api","authors":["Rick Sturm","Carol Pollard","Julie Craig"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A1AoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Master over 60 recipes to help you deliver complete, scalable, microservice-based solutions and see the improved business results immediately About This Book Adopt microservices-based architecture and deploy it at scale Build your complete microservice architecture using different recipes for different solutions Identify specific tools for specific scenarios and deliver immediate business results, correlate use cases, and adopt them in your team and organization Who This Book Is For This book is for developers, ops, and DevOps professionals who would like to put microservices to work and improve products, services, and operations. Those looking to build and deploy microservices will find this book useful, as well as managers and people at CXO level looking to adopt microservices in their organization. Prior knowledge of Java is expected. No prior knowledge of microservices is assumed. What You Will Learn Build microservices using Spring Boot, Wildfly Swarm, Dropwizard, and SparkJava Containerize your microservice using Docker Deploy microservices using Mesos\/Marathon and Kubernetes Implement service discovery and load balancing using Zookeeper, Consul, and Nginx Monitor microservices using Graphite and Grafana Write stream programs with Kafka Streams and Spark Aggregate and manage logs using Kafka Get introduced to DC\/OS, Docker Swarm, and YARN In Detail This book will help any team or organization understand, deploy, and manage microservices at scale. It is driven by a sample application, helping you gradually build a complete microservice-based ecosystem. Rather than just focusing on writing a microservice, this book addresses various other microservice-related solutions: deployments, clustering, load balancing, logging, streaming, and monitoring. The initial chapters offer insights into how web and enterprise apps can be migrated to scalable microservices. Moving on, you'll see how to Dockerize your application so that it is ready to be shipped and deployed. We will look at how to deploy microservices on Mesos and Marathon and will also deploy microservices on Kubernetes. Next, you will implement service discovery and load balancing for your microservices. We'll also show you how to build asynchronous streaming systems using Kafka Streams and Apache Spark. Finally, we wind up by aggregating your logs in Kafka, creating your own metrics, and monitoring the metrics for the microservice. Style and approach This book follows a recipe-driven approach and shows you how to plug and play with all the various pieces, putting them together to build a complete scalable microservice ecosystem. You do not need to study the chapters in order, as you can directly refer to the content you need for your situation.","language":"en","currency":"USD","id":"1786461315","title":"Microservices Deployment Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A1AoDwAAQBAJ&source=gbs_api","authors":["Vikram Murugesan"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=td7JDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn to develop efficient and scalable microservices for server-side programming in Node.js using this hands-on guide About This Book Real world example explained chapter after chapter with code examples. Useful concepts for other languages like Java or PHP Easy to follow by people with little to none experience in Node.js Node.js Version 0.12.2 and the latest compatible versions of Seneca and PM2 Who This Book Is For Node.js developer with basic server-side development knowledge - but no knowledge of implementing microservices in Node.js applications. Also useful for developers in other languages like Java or C#. What You Will Learn Identify where the microservice oriented architectures can tackle the most common problems in the software used by the big organisations. Re-architecture an existing monolithic system into a microservices oriented software. Build robust and scalable microservices using Seneca and Node.js. Testing of the microservices in insolation in order to create a solid system. Deploy and manage microservices using PM2 Monitoring the health of a microservice (CPU, memory, I\/O...) and how the degradation of the performance in one microservice could degrade the performance of full system. In Detail Microservices architecture is a style of software architecture. As the name suggests, microservicess refers to small services. For a large implementation, this means breaking the system into really small, independent services. Alternative to monolithic architecture (where the entire system is considered as a single big, interwoven segment), microservices approach is getting more and more popular with large, complex applications that have a very long lifecycle, which require changes at regular intervals. Microservices approach allows this type of changes with ease as only a part of the system undergoes changes and change control is easy. An example of such large system can be an online store—includes user interface, managing product catalog, processing orders, managing customer's account. In a microservices architecture each of these tasks will be divided and into smaller services. Also, these services will be further broken down into independent services—for user interface, there will be separate services for input, output, search bar management, and so on. Similarly, all other tasks can be divided in very small and simple services. Style and approach This book is a comprehensive guide to developing production-ready implementation of the microservices architecture with Node.js. Each chapter builds up on the earlier one creating a strong foundation on which you create your own microservice in a distributed environment.","language":"en","currency":"USD","id":"1785883194","title":"Developing Microservices with Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=td7JDAAAQBAJ&source=gbs_api","authors":["David Gonzalez"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q3jADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Right Your Software and Transform Your Career Righting Software presents the proven, structured, and highly engineered approach to software design that renowned architect Juval Löwy has practiced and taught around the world. Although companies of every kind have successfully implemented his original design ideas across hundreds of systems, these insights have never before appeared in print. Based on first principles in software engineering and a comprehensive set of matching tools and techniques, Löwy’s methodology integrates system design and project design. First, he describes the primary area where many software architects fail and shows how to decompose a system into smaller building blocks or services, based on volatility. Next, he shows how to flow an effective project design from the system design; how to accurately calculate the project duration, cost, and risk; and how to devise multiple execution options. The method and principles in Righting Software apply regardless of your project and company size, technology, platform, or industry. Löwy starts the reader on a journey that addresses the critical challenges of software development today by righting software systems and projects as well as careers—and possibly the software industry as a whole. Software professionals, architects, project leads, or managers at any stage of their career will benefit greatly from this book, which provides guidance and knowledge that would otherwise take decades and many projects to acquire. Register your book for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for details.","language":"en","currency":"USD","id":"0136524028","title":"Righting Software","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q3jADwAAQBAJ&source=gbs_api","authors":["Juval Löwy"]},{"pageCount":750,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w5QfDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":"","description":"A hands-on and introductory guide to the art of modern application and infrastructure monitoring and metrics. We start small and then build on what you learn to scale out to multi-site, multi-tier applications. The book is written for both developers and sysadmins. We focus on building monitored and measurable applications. We also use tools that are designed to handle the challenges of managing Cloud, containerised and distributed applications and infrastructure. In the book we'll deliver: * An introduction to monitoring, metrics and measurement. * A scalable framework for monitoring hosts (including Docker and containers), services and applications built on top of the Riemann event stream processor. * Graphing and metric storage using Graphite and Grafana. * Logging with Logstash. * A framework for high quality and useful notifications * Techniques for developing and building monitorable applications * A capstone that puts all the pieces together to monitor a multi-tier application.","language":"en","currency":"USD","id":"0988820242","title":"The Art of Monitoring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w5QfDAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Simplify the development of lightning fast applications based on microservices and reactive programming","description":"Use Spring Boot to build lightning-fast apps About This Book Get up to date with the defining characteristics of Spring Boot 2.0 in Spring Framework 5 Learn to perform Reactive programming with SpringBoot Learn about developer tools, AMQP messaging, WebSockets, security, MongoDB data access, REST, and more Who This Book Is For This book is designed for both novices and experienced Spring developers. It will teach you how to override Spring Boot's opinions and frees you from the need to define complicated configurations. What You Will Learn Create powerful, production-grade applications and services with minimal fuss Support multiple environments with one artifact, and add production-grade support with features Find out how to tweak your apps through different properties Use custom metrics to track the number of messages published and consumed Enhance the security model of your apps Make use of reactive programming in Spring Boot Build anything from lightweight unit tests to fully running embedded web container integration tests In Detail Spring Boot provides a variety of features that address today's business needs along with today's scalable requirements. In this book, you will learn how to leverage powerful databases and Spring Boot's state-of-the-art WebFlux framework. This practical guide will help you get up and running with all the latest features of Spring Boot, especially the new Reactor-based toolkit. The book starts off by helping you build a simple app, then shows you how to bundle and deploy it to the cloud. From here, we take you through reactive programming, showing you how to interact with controllers and templates and handle data access. Once you're done, you can start writing unit tests, slice tests, embedded container tests, and even autoconfiguration tests. We go into detail about developer tools, AMQP messaging, WebSockets, security, and deployment. You will learn how to secure your application using both routes and method-based rules. By the end of the book, you'll have built a social media platform from which to apply the lessons you have learned to any problem. If you want a good understanding of building scalable applications using the core functionality of Spring Boot, this is the book for you. Style and approach This book takes a tutorial-based approach to teach you all you need to know to get up and running with the latest version of Spring Boot. Filled with examples, you will gain hands-on experience of every area that Spring tackles.","language":"en","currency":"USD","id":"1786468204","title":"Learning Spring Boot 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EkBPDwAAQBAJ&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8RueQPUOPssC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"With Examples in C# and .NET","description":"Patterns, Domain-Driven Design (DDD), and Test-Driven Development (TDD) enable architects and developers to create systems that are powerful, robust, and maintainable. Now, there’s a comprehensive, practical guide to leveraging all these techniques primarily in Microsoft .NET environments, but the discussions are just as useful for Java developers. Drawing on seminal work by Martin Fowler (Patterns of Enterprise Application Architecture) and Eric Evans (Domain-Driven Design), Jimmy Nilsson shows how to create real-world architectures for any .NET application. Nilsson illuminates each principle with clear, well-annotated code examples based on C# 1.1 and 2.0. His examples and discussions will be valuable both to C# developers and those working with other .NET languages and any databases–even with other platforms, such as J2EE. Coverage includes · Quick primers on patterns, TDD, and refactoring · Using architectural techniques to improve software quality · Using domain models to support business rules and validation · Applying enterprise patterns to provide persistence support via NHibernate · Planning effectively for the presentation layer and UI testing · Designing for Dependency Injection, Aspect Orientation, and other new paradigms","language":"en","currency":"USD","id":"9780132797498","title":"Applying Domain-Driven Design and Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8RueQPUOPssC&source=gbs_api","authors":["Jimmy Nilsson"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bVqWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build a range of exciting projects by exploring cross-platform development and microservices","description":"Improve your Delphi programming skills by building robust applications for Android, iOS, and Windows platform Key Features Build responsive user interfaces (UIs) for desktop and mobile with FireMonkey Implement a microservices architecture using the Rapid Application Development(RAD) server Create clones of popular applications like Instagram and Facebook using Delphi 10.3 Book Description Delphi is a cross-platform programming language and software development kit that supports rapid application development for Microsoft Windows, Apple Mac OS X, Android, and iOS. With the help of seven practical projects, this book will guide you through the best practices, Delphi Run-Time Library (RTL) resources, and design patterns. Whether you use the Visual Component Library (VCL) or FireMonkey (FMX) framework, these design patterns will be implemented in the same way in Delphi, using Object Pascal. In the first few chapters, you will explore advanced features that will help you build rich applications using the same code base for both mobile and desktop projects. In addition to this, you’ll learn how to implement microservice architecture in Delphi. As you get familiar with the various aspects of Delphi, you will no longer need to maintain source code for similar projects, program business rules on screens, or fill your forms with data access components. By the end of this book, you will have gained an understanding of the principles of clean code and become proficient in building robust and scalable applications in Delphi. What you will learn Get to grips with the advanced features of RTL Understand how to deal with the paradigm change between multiplatform projects Build rich interfaces with Google's Material Design features Understand how to implement design patterns in Delphi Turn a mobile device into a remote controller with app tethering technology Build a multi-database system using VCL Who this book is for This book is for developers, programmers, and IT professionals who want to learn the best market practices by implementing practical projects. Prior knowledge of the Delphi language is a must.","language":"en","currency":"USD","id":"1789135230","title":"Delphi Programming Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bVqWDwAAQBAJ&source=gbs_api","authors":["William Duarte"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z306GUfFL5gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"Service Level Agreements for Cloud Computing provides a unique combination of business-driven application scenarios and advanced research in the area of service-level agreements for Clouds and service-oriented infrastructures. Current state-of-the-art research findings are presented in this book, as well as business-ready solutions applicable to Cloud infrastructures or ERP (Enterprise Resource Planning) environments. Service Level Agreements for Cloud Computing contributes to the various levels of service-level management from the infrastructure over the software to the business layer, including horizontal aspects like service monitoring. This book provides readers with essential information on how to deploy and manage Cloud infrastructures. Case studies are presented at the end of most chapters. Service Level Agreements for Cloud Computing is designed as a reference book for high-end practitioners working in cloud computing, distributed systems and IT services. Advanced-level students focused on computer science will also find this book valuable as a secondary text book or reference.","language":"en","currency":"USD","id":"1461416140","title":"Service Level Agreements for Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z306GUfFL5gC&source=gbs_api","authors":["Philipp Wieder","Joe M. Butler","Wolfgang Theilmann","Ramin Yahyapour"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PyjNCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.99,"subtitle":null,"description":"This book is an exploration of microservices and how to build it. It begins by explaining what they are, so as to help the reader better understand them. After reading this book you will know how and where microservices are used. The following topics have been discussed in this book: 1. Technology Heterogeneity, Resilience, Sealing, and Deployment – Hacks #1 and #2 2. Managing Complex Systems – Hacks #3 and #4 3. Checklists – Hack #5 4. Integration – Hacks #6 to #10 5. And much, much, more.. Download your copy of \" How To Build Microservices \" by scrolling up and clicking \"Buy Now With 1-Click\" button.","language":"en","currency":"USD","id":"8892510606","title":"How To Build Microservices: Top 10 Hacks To Modeling, Integrating & Deploying Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PyjNCgAAQBAJ&source=gbs_api","authors":["Scott Green"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=c3wzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Develop, Test, and Deploy Cross-Platform Services in the Cloud","description":"At a time when nearly every vertical, regardless of domain, seems to need software running in the cloud to make money, microservices provide the agility and drastically reduced time to market you require. This hands-on guide shows you how to create, test, compile, and deploy microservices, using the ASP.NET Core free and open-source framework. Along the way, you’ll pick up good, practical habits for building powerful and robust services. Building microservices isn’t about learning a specific framework or programming language; it’s about building applications that thrive in elastically scaling environments that don't have host affinity, and that can start and stop at a moment’s notice. This practical book guides you through the process. Learn test-driven and API-first development concepts Communicate with other services by creating and consuming backing services such as databases and queues Build a microservice that depends on an external data source Learn about event sourcing, the event-centric approach to persistence Use ASP.NET Core to build web applications designed to thrive in the cloud Build a service that consumes, or is consumed by, other services Create services and applications that accept external configuration Explore ways to secure ASP.NET Core microservices and applications","language":"en","currency":"USD","id":"1491961686","title":"Building Microservices with ASP.NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=c3wzDwAAQBAJ&source=gbs_api","authors":["Kevin Hoffman"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ys4GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you're a JavaScript developer interested in a deeper understanding of how to create and design Node.js applications, this is the book for you.","language":"en","currency":"USD","id":"1783287322","title":"Node.js Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ys4GBgAAQBAJ&source=gbs_api","authors":["Mario Casciaro"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FhEzifpEgM8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Creating Breakthrough Products Through Collaborative Play","description":"Innovation Through Understandingsm The toughest part of innovation? Accurately predicting what customers want, need, and will pay for. Even if you ask them, they often can’t explain what they want. Now, there’s a breakthrough solution: Innovation Games. Drawing on his software product strategy and product management consulting experience, Luke Hohmann has created twelve games that help you uncover your customers’ true, hidden needs and desires. You’ll learn what each game will accomplish, why it works, and how to play it with customers. Then, Hohmann shows how to integrate the results into your product development processes, helping you focus your efforts, reduce your costs, accelerate time to market, and deliver the right solutions, right from the start. Learn how your customers define success Discover what customers don’t like about your offerings Uncover unspoken needs and breakthrough opportunities Understand where your offerings fit into your customers’ operations Clarify exactly how and when customers will use your product or service Deliver the right new features, and make better strategy decisions Increase empathy for the customers’ experience within your organization Improve the effectiveness of the sales and service organizations Identify your most effective marketing messages and sellable features Innovation Games will be indispensable for anyone who wants to drive more successful, customer-focused product development: product and R&D managers, CTOs and development leaders, marketers, and senior business executives alike.","language":"en","currency":"USD","id":"0132702223","title":"Innovation Games","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FhEzifpEgM8C&source=gbs_api","authors":["Luke Hohmann"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxWhDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Building Web Applications and Microservices for the Cloud with Go and React","description":"The Complete Guide to Building Cloud-Based Services Cloud Native Go shows developers how to build massive cloud applications that meet the insatiable demands of today’s customers, and will dynamically scale to handle virtually any volume of data, traffic, or users. Kevin Hoffman and Dan Nemeth describe the modern cloud-native application in detail, illuminating factors, disciplines, and habits associated with rapid, reliable cloud-native development. They also introduce Go, a “simply elegant” high-performance language that is especially well-suited for cloud development. You’ll walk through creating microservices in Go, adding front-end web components using ReactJS and Flux, and mastering advanced Go-based cloud-native techniques. Hoffman and Nemeth show how to build a continuous delivery pipeline with tools like Wercker, Docker, and Dockerhub; automatically push apps to leading platforms; and systematically monitor app performance in production. Learn “The Way of the Cloud”: why developing good cloud software is fundamentally about mindset and discipline Discover why Go is ideal for cloud-native microservices development Plan cloud apps that support continuous delivery and deployment Design service ecosystems, and then build them in a test-first manner Push work-in-progress to a cloud Use Event Sourcing and CQRS patterns to react and respond to enormous volume and throughput Secure cloud-based web applications: do’s, don’ts, and options Create reactive applications in the cloud with third-party messaging providers Build massive-scale, cloud-friendly GUIs with React and Flux Monitor dynamic scaling, failover, and fault tolerance in the cloud","language":"en","currency":"USD","id":"0134505808","title":"Cloud Native Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxWhDQAAQBAJ&source=gbs_api","authors":["Kevin Hoffman","Dan Nemeth"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=D5jcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Instrumenting, Analyzing, and Debugging Microservices","description":"Most applications today are distributed in some fashion. Monitoring the health and performance of these distributed architectures requires a new approach. Enter distributed tracing, a method of profiling and monitoring applications—especially those that use microservice architectures. There’s just one problem: distributed tracing can be hard. But it doesn’t have to be. With this practical guide, you’ll learn what distributed tracing is and how to use it to understand the performance and operation of your software. Key players at Lightstep walk you through instrumenting your code for tracing, collecting the data that your instrumentation produces, and turning it into useful, operational insights. If you want to start implementing distributed tracing, this book tells you what you need to know. You’ll learn: The pieces of a distributed tracing deployment: Instrumentation, data collection, and delivering value Best practices for instrumentation (the methods for generating trace data from your service) How to deal with or avoid overhead, costs, and sampling How to work with spans (the building blocks of request-based distributed traces) and choose span characteristics that lead to valuable traces Where distributed tracing is headed in the future","language":"en","currency":"USD","id":"1492056588","title":"Distributed Tracing in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=D5jcDwAAQBAJ&source=gbs_api","authors":["Austin Parker","Daniel Spoonhower","Jonathan Mace","Ben Sigelman","Rebecca Isaacs"]},{"pageCount":396,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ExlKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Master efficient application development with patterns such as proxy, singleton, the template method, and more","description":"Learn various design patterns and best practices in Spring 5 and use them to solve common design problems. About This Book Explore best practices for designing an application Manage your code easily with Spring's Dependency Injection pattern Understand the benefits that the right design patterns can offer your toolkit Who This Book Is For This book is for developers who would like to use design patterns to address common problems while designing an app using the Spring Framework and Reactive Programming approach. A basic knowledge of the Spring Framework and Java is assumed. What You Will Learn Develop applications using dependency injection patterns Learn best practices to design enterprise applications Explore Aspect-Oriented Programming relating to transactions, security, and caching. Build web applications using traditional Spring MVC patterns Learn to configure Spring using XML, annotations, and Java. Implement caching to improve application performance. Understand concurrency and handle multiple connections inside a web server. Utilizing Reactive Programming Pattern to build Reactive web applications. In Detail Design patterns help speed up the development process by offering well tested and proven solutions to common problems. These patterns coupled with the Spring framework offer tremendous improvements in the development process. The book begins with an overview of Spring Framework 5.0 and design patterns. You will understand the Dependency Injection pattern, which is the main principle behind the decoupling process that Spring performs, thus making it easier to manage your code. You will learn how GoF patterns can be used in Application Design. You will then learn to use Proxy patterns in Aspect Oriented Programming and remoting. Moving on, you will understand the JDBC template patterns and their use in abstracting database access. Then, you will be introduced to MVC patterns to build Reactive web applications. Finally, you will move on to more advanced topics such as Reactive streams and Concurrency. At the end of this book, you will be well equipped to develop efficient enterprise applications using Spring 5 with common design patterns Style and approach The book takes a pragmatic approach, showing various design patterns and best-practice considerations, including the Reactive programming approach with the Spring 5 Framework and ways to solve common development and design problems for enterprise applications.","language":"en","currency":"USD","id":"1788299590","title":"Spring 5 Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ExlKDwAAQBAJ&source=gbs_api","authors":[", Dinesh Rajput"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tuL_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Create Web Applications Jakarta EE with Microservices, JNoSQL, Vaadin, Jmoordb, and MicroProfile easily","description":"Build Modern Web Apps with JakartaEE, Jmoordb, and Vaadins Key Features ● Learn about the Java Enterprise Edition\/Jakarta Enterprise Edition specifications. ● Learn how to create applications with frameworks such as Java Server Faces, Eclipse krazo and Vaadin. ● Get familiar with NoSQL databases and learn how to create Java applications that interact using Jakarta NoSQL and Jmoordb. ● Learn how to test and secure your application. ● Learn about Microprofile and how to create microservices with java. Description For many years, Java EE has been an important platform for mission-critical enterprise applications. To accelerate the development of enterprise applications for a cloud-native world, leading software vendors collaborated to transfer Java EE technologies to the Eclipse Foundation, where they will evolve under the Jakarta EE brand. This book will be your comprehensive guide to creating Jakarta EE applications and microservices with Microprofile. The book begins with an introduction to Jakarta EE and quickly goes on to teach you about the various databases and their advantages. After this, you will explore the JNoSQL and Jmoordb frameworks to understand how to build Jakarta EE applications with NoSQL databases. Moving forward, you'll explore Eclipse MicroProfile and see how it helps build microservices with Java. Also, you will learn about various development applications such as Java Server Faces, Eclipse Krazos, PrimeFaces, Vaadin, and understand how to integrate them with your backend. Towards the end, you will learn about security, testing, and understanding continuous integration. What will you learn ● Learn how to use the Jmoordb framework for Jakarta EE applications. ● Optimize Enterprise Java for microservices architecture using Eclipse MicroProfile. ● Create Web applications using Java Server Faces. ● Building a modern web application using Vaadin. ● Learn how to implement security using IdentityStore and JWT. ● Create CI\/CD pipelines for Jakarta EE applications. Who this book is for This book is for developers with no previous experience in creating business applications with Java and for those who want to know about APIs and new frameworks for the development of cloud-oriented applications. Table of Contents 1. Jakarta EE Platform 2. NoSQL 3. Jakarta NOSQL 4. Understanding JMoordb 5. Exploring Microprofile 6. Java Server Faces 7. Vaadin 8. Integration Vaadin, JMoordb and NoSQL 9. Eclipse Krazos and Security of Microservices 10. Testing and Continuous Integration","language":"en","currency":"USD","id":"9389423341","title":"Building Modern Web Applications With Jakarta EE, NoSQL Databases and Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tuL_DwAAQBAJ&source=gbs_api","authors":["Aristides Villarreal Bravo","Geovanny Mendoza González","Otávio Gonçalves de Santana"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2o-qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Effective Machine Learning Inspired by the Agile Manifesto","description":"Build resilient applied machine learning teams that deliver better data products through adapting the guiding principles of the Agile Manifesto. Bringing together talented people to create a great applied machine learning team is no small feat. With developers and data scientists both contributing expertise in their respective fields, communication alone can be a challenge. Agile Machine Learning teaches you how to deliver superior data products through agile processes and to learn, by example, how to organize and manage a fast-paced team challenged with solving novel data problems at scale, in a production environment. The authors’ approach models the ground-breaking engineering principles described in the Agile Manifesto. The book provides further context, and contrasts the original principles with the requirements of systems that deliver a data product. What You'll Learn Effectively run a data engineering team that is metrics-focused, experiment-focused, and data-focused Make sound implementation and model exploration decisions based on the data and the metrics Know the importance of data wallowing: analyzing data in real time in a group setting Recognize the value of always being able to measure your current state objectively Understand data literacy, a key attribute of a reliable data engineer, from definitions to expectations Who This Book Is For Anyone who manages a machine learning team, or is responsible for creating production-ready inference components. Anyone responsible for data project workflow of sampling data; labeling, training, testing, improving, and maintaining models; and system and data metrics will also find this book useful. Readers should be familiar with software engineering and understand the basics of machine learning and working with data.","language":"en","currency":"USD","id":"1484251075","title":"Agile Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2o-qDwAAQBAJ&source=gbs_api","authors":["Eric Carter","Matthew Hurst"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jnrNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"A Practitioner’s Guide to Design, Develop and Deploy Apps","description":"Guide to designing and developing cloud native applications in Azure DESCRIPTION The mainstreaming of Cloud Native Architecture as an enterprise discipline is well underway. According to the Forbes report in January 2018, 83% of the enterprise workloads will be in the cloud by 2020 and 41% of the enterprise workloads will run on public cloud platforms, while another 22% will be running on hybrid cloud platforms. Customers are embarking on the enterprise digital transformation journeys. Adopting cloud and cloud native architectures and microservices is an important aspect of the journey. This book starts with a brief introduction on the basics of cloud native applications, cloud native application patterns. Then it covers the cloud native options available in Azure. The objective of the book is to provide practical guidelines to an architect\/designer\/consultant\/developer, who is a part of the Cloud application definition Team. The book articulates a methodology that the implementation team needs to follow in a step-by-step manner and adopt them to fulfil the requirements for enablement of the Cloud Native application. It emphasizes on the interpersonal skills and techniques for organizing and directing the Cloud Native definition, leadership buy-in, leading the transition from planning to implementation. It also highlights the steps to be followed for performing the cloud native applications, cloud native patterns in the development of Cloud native applications, Cloud native options available in Azure, Developing BOT, Microservices based on Azure. It also covers how to develop simple IoT applications, Machine learning based applications, server less architecture, using Azure with a practical and pragmatic approach. This book embraces a structured approach organized around the following key themes, which represent the typical phases that an enterprise traverses during its Cloud Native application journey: ● Basics of Cloud Native Applications: It covers basics of cloud native applications using .NET core. ● Cloud Native Application Patterns: The reader will understand the patterns for developing Cloud Native Applications. ● Cloud Native Options available in Azure: The reader will understand the different options available in Azure. ● Developing a Simple BOT using .NET Core: The reader will understand the Azure BOT framework basics and will learn how to develop a simple BOT. ● Developing cloud native applications leveraging Microservices: The reader will understand the concepts of developing micro services using the Azure API Gateway Manager. ● Developing Integration capabilities using serverless architecture: The reader will understand the integration capabilities and various options available in Azure ● Developing a simple IoT application: The reader will understand the basics of developing IoT applications. ● Developing a simple ML based application: The reader will understand Machine Learning basics and how to develop a simple ML application ● Different enterprise use cases, which enable digital transformation using the Cloud Native Applications: The reader will learn about different use cases that can be built using cloud native applications KEY FEATURES (Add 5-7 key features only) ● Basics of Cloud Native Applications ● Designing Microservices ● Different cloud native options for developing Cloud Native Applications in Azure ● BOTs, Web Apps, Mobile Apps, Logic Apps, Service Bus, Azure Functions ● Azure IOT Applications ● Azure Machine Learning Basics ● Enterprise Digital Journeys WHAT WILL YOU LEARN This book aims to: ● Demonstrate the importance of a Cloud Native application in elevating the effectiveness of organizational transformation programs and digital enterprise journeys, using MS Azure ● Disseminate current advancements and thought leadership in the area of Cloud Native architecture, in the context of digital enterprises ● Provide initiatives with evidence-based, credible, field tested and practical guidance in crafting their respective architectures; and ● Showcase examples and experiences of the innovative use of Cloud Native Applications in enhancing transformation initiatives. WHO THIS BOOK IS FOR The book is intended for anyone looking for a career in Cloud technology, all aspiring Cloud Architects who want to learn Cloud Native Architectures, Microservices, IoT, BoT and Microsoft Azure platform and working professionals who want to switch their career in Cloud Technology. While no prior knowledge of Azure or related technologies is assumed, it will be helpful to have some .Net programming experience. In addition, the target audience of this book are, ● Business Leaders, Chief Architects, Analysts and Designers seeking better, quicker and easier approaches to respond to needs of their internal and external customers; ● CIOs\/CTOs of business software companies interested in incorporating Cloud Native architecture to differentiate their products and services offerings and increasing the value proposition to their customers; ● Consultants and practitioners desirous of new solutions and technologies to improve productivity of their clients; ● Academic and consulting researchers looking to uncover and characterize new research problems and programmes ● Practitioners and professionals involved with organizational technology strategic planning, technology procurement, management of technology projects, consulting and advising on technology issues and management of total cost of ownership. Table of Contents 1. Basics of Cloud Native Applications 2. Cloud Native Application Patterns 3. Cloud Native Options available in Azure – BOTs, Logic Apps, Service Bus, Azure Microservices, ML services 4. Developing a Simple BOT using .NET Core 5. Developing Cloud Native applications leveraging Microservices and Azure API Gateway 6. Developing Integration capabilities using serverless architecture 7. Developing a simple IoT application 8. Developing a simple ML based application 9. Different enterprise use cases which enable digital transformation using Cloud Native Applications","language":"en","currency":"USD","id":"9389328748","title":"Developing Cloud Native Applications in Azure using .NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jnrNDwAAQBAJ&source=gbs_api","authors":["Rekha Kodali","Dr. Gopala Krishna Behara","Sankara Narayanan Govindarajulu"]},{"pageCount":152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HsIrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Cloud Deployments Made Easy","description":"For many organizations, a big part of DevOps’ appeal is software automation using infrastructure-as-code techniques. This book presents developers, architects, and infra-ops engineers with a more practical option. You’ll learn how a container-centric approach from OpenShift, Red Hat’s cloud-based PaaS, can help your team deliver quality software through a self-service view of IT infrastructure. Three OpenShift experts at Red Hat explain how to configure Docker application containers and the Kubernetes cluster manager with OpenShift’s developer- and operational-centric tools. Discover how this infrastructure-agnostic container management platform can help companies navigate the murky area where infrastructure-as-code ends and application automation begins. Get an application-centric view of automation—and understand why it’s important Learn patterns and practical examples for managing continuous deployments such as rolling, A\/B, blue-green, and canary Implement continuous integration pipelines with OpenShift’s Jenkins capability Explore mechanisms for separating and managing configuration from static runtime software Learn how to use and customize OpenShift’s source-to-image capability Delve into management and operational considerations when working with OpenShift-based application workloads Install a self-contained local version of the OpenShift environment on your computer","language":"en","currency":"USD","id":"1491976616","title":"DevOps with OpenShift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HsIrDwAAQBAJ&source=gbs_api","authors":["Stefano Picozzi","Mike Hepburn","Noel O'Connor"]},{"pageCount":626,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Mg3aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Enhance, secure, and observe cloud-native applications with Istio, Linkerd, and Consul","description":"Understand how to use service mesh architecture to efficiently manage and safeguard microservices-based applications with the help of examples Key Features Manage your cloud-native applications easily using service mesh architecture Learn about Istio, Linkerd, and Consul – the three primary open source service mesh providers Explore tips, techniques, and best practices for building secure, high-performance microservices Book Description Although microservices-based applications support DevOps and continuous delivery, they can also add to the complexity of testing and observability. The implementation of a service mesh architecture, however, allows you to secure, manage, and scale your microservices more efficiently. With the help of practical examples, this book demonstrates how to install, configure, and deploy an efficient service mesh for microservices in a Kubernetes environment. You'll get started with a hands-on introduction to the concepts of cloud-native application management and service mesh architecture, before learning how to build your own Kubernetes environment. While exploring later chapters, you'll get to grips with the three major service mesh providers: Istio, Linkerd, and Consul. You'll be able to identify their specific functionalities, from traffic management, security, and certificate authority through to sidecar injections and observability. By the end of this book, you will have developed the skills you need to effectively manage modern microservices-based applications. What you will learn Compare the functionalities of Istio, Linkerd, and Consul Become well-versed with service mesh control and data plane concepts Understand service mesh architecture with the help of hands-on examples Work through hands-on exercises in traffic management, security, policy, and observability Set up secure communication for microservices using a service mesh Explore service mesh features such as traffic management, service discovery, and resiliency Who this book is for This book is for solution architects and network administrators, as well as DevOps and site reliability engineers who are new to the cloud-native framework. You will also find this book useful if you’re looking to build a career in DevOps, particularly in operations. Working knowledge of Kubernetes and building microservices that are cloud-native is necessary to get the most out of this book.","language":"en","currency":"USD","id":"1789611946","title":"Mastering Service Mesh","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Mg3aDwAAQBAJ&source=gbs_api","authors":["Anjali Khatri","Vikram Khatri"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eBDMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build full stack applications and microservices with Spring Boot and modern JavaScript frameworks, 2nd Edition","description":"Written by the core development team of JHipster and fully updated for JHipster 6, Java 11, and Spring Boot 2.1, this book will show you how to build modern web applications with real-world examples and best practices Key Features Build full stack applications with modern JavaScript frameworks such as Angular, React, and Vue.js Explore the JHipster microservices stack, which includes Spring Cloud, Netflix OSS, and the Elastic Stack Learn advanced local and cloud deployment strategies using Docker and Kubernetes Book Description JHipster is an open source development platform that allows you to easily create web apps and microservices from scratch without spending time on wiring and integrating different technologies. Updated to include JHipster 6, Java 11, Spring Boot 2.1, Vue.js, and Istio, this second edition of Full Stack Development with JHipster will help you build full stack applications and microservices seamlessly. You'll start by understanding JHipster and its associated tools, along with the essentials of full stack development, before building a monolithic web app. You'll then learn the JHipster Domain Language (JDL) with entity modeling using JDL-Studio. With this book, you'll create production-ready web apps using Spring Boot, Spring Framework, Angular, and Bootstrap, and run tests and set up continuous integration pipelines with Jenkins. As you advance, you'll learn how to convert your monoliths to microservices and how to package your application for production with various deployment options, including Heroku and Google Cloud. You'll also learn about Docker and Kubernetes, along with an introduction to the Istio service mesh. Finally, you'll build your client-side with React and Vue.js and discover JHipster's best practices. By the end of the book, you'll be able to leverage the best tools available to build modern web apps. What you will learn Create full stack apps from scratch using the latest features of JHipster 6 and Spring Boot 2.1 Build business logic by creating and developing entity models using JDL Understand how to convert a monolithic architecture into a full-fledged microservices architecture Build and package your apps for production using Docker Deploy your application to Google Cloud with Kubernetes Create continuous integration\/continuous delivery pipelines with Jenkins Create applications using Angular, React, and Vue.js client-side frameworks Who this book is for This book is for full stack developers who want to build web applications and microservices speedily without writing a lot of boilerplate code. If you’re a backend developer looking to learn full stack development with JavaScript frameworks and libraries such as Angular, React, and Vue.js, you’ll find this book useful. Experience in building Java web applications is required. Some exposure to the Spring Framework would be beneficial but not necessary to get the most out of this book.","language":"en","currency":"USD","id":"1838820248","title":"Full Stack Development with JHipster","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eBDMDwAAQBAJ&source=gbs_api","authors":["Deepu K Sasidharan","Sendil Kumar N"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZB9sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Refactor your legacy code base","description":"Getting the most out of Python to improve your codebase Key Features Save maintenance costs by learning to fix your legacy codebase Learn the principles and techniques of refactoring Apply microservices to your legacy systems by implementing practical techniques Book Description Python is currently used in many different areas such as software construction, systems administration, and data processing. In all of these areas, experienced professionals can find examples of inefficiency, problems, and other perils, as a result of bad code. After reading this book, readers will understand these problems, and more importantly, how to correct them. The book begins by describing the basic elements of writing clean code and how it plays an important role in Python programming. You will learn about writing efficient and readable code using the Python standard library and best practices for software design. You will learn to implement the SOLID principles in Python and use decorators to improve your code. The book delves more deeply into object oriented programming in Python and shows you how to use objects with descriptors and generators. It will also show you the design principles of software testing and how to resolve software problems by implementing design patterns in your code. In the final chapter we break down a monolithic application to a microservice one, starting from the code as the basis for a solid platform. By the end of the book, you will be proficient in applying industry approved coding practices to design clean, sustainable and readable Python code. What you will learn Set up tools to effectively work in a development environment Explore how the magic methods of Python can help us write better code Examine the traits of Python to create advanced object-oriented design Understand removal of duplicated code using decorators and descriptors Effectively refactor code with the help of unit tests Learn to implement the SOLID principles in Python Who this book is for This book will appeal to team leads, software architects and senior software engineers who would like to work on their legacy systems to save cost and improve efficiency. A strong understanding of Programming is assumed.","language":"en","currency":"USD","id":"1788837061","title":"Clean Code in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZB9sDwAAQBAJ&source=gbs_api","authors":["Mariano Anaya"]},{"pageCount":831,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L-U5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Solve all your Spring 5 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work over creating a project from scratch. The recipes in Spring 5 Recipes cover Spring fundamentals such as Spring IoC container, Spring AOP\/ AspectJ, and more. Other recipes include Spring enterprise solutions for topics such as Spring Java EE integration, Spring Integration, Spring Batch, Spring Remoting, messaging, transactions, and working with big data and the cloud using Hadoop and MongoDB. Finally, Spring web recipes cover Spring MVC, other dynamic scripting, integration with the popular Grails Framework (and Groovy), REST\/web services, and more. You’ll also see recipes on new topics such as Spring Framework 5, reactive Spring, Spring 5 microservices, the functional web framework and much more. This book builds upon the best-selling success of the previous editions and focuses on the latest Spring Framework features for building enterprise Java applications. What You'll Learn Get re-usable code recipes and snippets for core Spring, annotations and other development tools Access Spring MVC for web development Work with Spring REST and microservices for web services development and integration into your enterprise Java applications Use Spring Batch, NoSQL and big data for building and integrating various cloud computing services and resources Integrate Java Enterprise Edition and other Java APIs for use in Spring Use Grails code and much more Who This Book Is For Experienced Java and Spring programmers.","language":"en","currency":"USD","id":"1484227905","title":"Spring 5 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L-U5DwAAQBAJ&source=gbs_api","authors":["Marten Deinum","Daniel Rubio","Josh Long"]},{"pageCount":714,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nh0okI1a1sQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Code You Can Believe In","description":"This easy-to-use, fast-moving tutorial introduces you to functional programming with Haskell. You'll learn how to use Haskell in a variety of practical ways, from short scripts to large and demanding applications. Real World Haskell takes you through the basics of functional programming at a brisk pace, and then helps you increase your understanding of Haskell in real-world issues like I\/O, performance, dealing with data, concurrency, and more as you move through each chapter.","language":"en","currency":"USD","id":"9780596554309","title":"Real World Haskell","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nh0okI1a1sQC&source=gbs_api","authors":["Bryan O'Sullivan","John Goerzen","Donald Bruce Stewart"]},{"pageCount":247,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6ksiDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Writing PHP Microservices, REST and Web Service APIs","description":"Learn to write test-driven microservices, REST APIs, and web service APIs with PHP using the Lumen micro-framework, from the now popular Laravel family. This book shows you how testing APIs can help you write bullet-proof web application services and microservices. In the Lumen Programming Guide you will learn how to use Lumen—a micro-framework by Laravel—to write bullet-proof APIs. Lumen helps you write productive, maintainable APIs using modern application design. You will learn how to write fully-tested APIs and understand essential Lumen concepts used to build a solid foundation for writing API projects. What You Will Learn Maintain your API's database structure through built-in database migrations Write tests with factory data in a test database Respond with consistent data output in JSON Deal with PHP exceptions by using JSON responses Create, read, update, and delete REST resources Represent model associations in API responses Build a solid foundation for writing tests with PHPUnit and Mockery Validate data Who This Book Is For PHP developers with no Laravel experience. Only a basic understanding of HTTP and writing PHP applications is needed to get started.","language":"en","currency":"USD","id":"1484221877","title":"Lumen Programming Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6ksiDQAAQBAJ&source=gbs_api","authors":["Paul Redmond"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LZrT6eWf9NMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Concepts and Techniques for Record Linkage, Entity Resolution, and Duplicate Detection","description":"Data matching (also known as record or data linkage, entity resolution, object identification, or field matching) is the task of identifying, matching and merging records that correspond to the same entities from several databases or even within one database. Based on research in various domains including applied statistics, health informatics, data mining, machine learning, artificial intelligence, database management, and digital libraries, significant advances have been achieved over the last decade in all aspects of the data matching process, especially on how to improve the accuracy of data matching, and its scalability to large databases. Peter Christen’s book is divided into three parts: Part I, “Overview”, introduces the subject by presenting several sample applications and their special challenges, as well as a general overview of a generic data matching process. Part II, “Steps of the Data Matching Process”, then details its main steps like pre-processing, indexing, field and record comparison, classification, and quality evaluation. Lastly, part III, “Further Topics”, deals with specific aspects like privacy, real-time matching, or matching unstructured data. Finally, it briefly describes the main features of many research and open source systems available today. By providing the reader with a broad range of data matching concepts and techniques and touching on all aspects of the data matching process, this book helps researchers as well as students specializing in data quality or data matching aspects to familiarize themselves with recent research advances and to identify open research challenges in the area of data matching. To this end, each chapter of the book includes a final section that provides pointers to further background and research material. Practitioners will better understand the current state of the art in data matching as well as the internal workings and limitations of current systems. Especially, they will learn that it is often not feasible to simply implement an existing off-the-shelf data matching system without substantial adaption and customization. Such practical considerations are discussed for each of the major steps in the data matching process.","language":"en","currency":"USD","id":"3642311644","title":"Data Matching","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LZrT6eWf9NMC&source=gbs_api","authors":["Peter Christen"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mB4DEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"Patterns, um bestehende Systeme Schritt für Schritt umzugestalten","description":"Bestehende Systeme erfolgreich in eine Microservices-Architektur umgestalten Wie entflechtet man ein monolithisches System und überführt es in eine Microservices-Architektur? Und wie erhält man gleichzeitig den normalen Betrieb aufrecht? Sam Newman, Autor des viel beachteten Titels \"Building Microservices\", beschreibt Szenarien und erprobte Strategien, um bestehende Systeme erfolgreich zu migrieren: von der ersten Planung bis zum Zerlegen von Anwendung und Datenbank. Newman greift hierbei auf viele anschauliche Beispiele zurück, stellt aufschlussreiche Pattern für die Migration vor und gibt praktische Ratschläge. - Für Organisationen, die ihre Codebasis in Richtung einer Microservices-Architektur überführen und nicht komplett neu aufbauen wollen - Unterstützt Unternehmen bei der Frage, ob und wann sie migrieren und wo sie konkret beginnen sollten - Befasst sich mit der Integration und Migration von Legacy-Systemen und der Kommunikation mit diesen Systemen - Stellt Migrationspattern vor und beschreibt, wo und wie sie am besten eingesetzt werden - Bietet Beispiele für die Datenbankmigration und begleitende Synchronisationsstrategien - Beschreibt das Zerlegen von Anwendungen einschließlich einer Reihe von Refaktorisierungspattern","language":"de","currency":"USD","id":"3960104243","title":"Vom Monolithen zu Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mB4DEAAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wBQEp6ruIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":26.99,"subtitle":"From Journeyman to Master","description":"What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” —Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” —Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” —Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” —John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” —Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” —Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” —Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” —Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” —Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.","language":"en","currency":"USD","id":"013211917X","title":"The Pragmatic Programmer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wBQEp6ruIAC&source=gbs_api","authors":["Andrew Hunt","David Thomas"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dV4UAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Understanding Patterns of Project Behavior","description":"This is the digital version of the printed book (Copyright © 2008). Adrenaline junkies, dead fish, project sluts, true believers, Lewis and Clark, template zombies . . . Most developers, testers, and managers on IT projects are pretty good at recognizing patterns of behavior and gut-level hunches, as in, “I sense that this project is headed for disaster.” But it has always been more difficult to transform these patterns and hunches into a usable form, something a team can debate, refine, and use. Until now. In Adrenaline Junkies and Template Zombies, the six principal consultants of The Atlantic Systems Guild present the patterns of behavior they most often observe at the dozens of IT firms they transform each year, around the world. The result is a quick-read guide to identifying nearly ninety typical scenarios, drawing on a combined one-hundred-and-fifty years of project management experience. Project by project, you’ll improve the accuracy of your hunches and your ability to act on them. The patterns are presented in an easy-reference format, with names designed to ease communication with your teammates. In just a few words, you can describe what’s happening on your project. Citing the patterns of behavior can help you quickly move those above and below you to the next step on your project. You’ll find classic patterns such as these: News Improvement Management by Mood Ring Piling On Rattle Yer Dags Natural Authority Food++ Fridge Door and more than eighty more! Not every pattern will be evident in your organization, and not every pattern is necessarily good or bad. However, you’ll find many patterns that will apply to your current and future assignments, even in the most ambiguous circumstances. When you assess your situation and follow your next hunch, you'll have the collective wisdom of six world-class consultants at your side.","language":"en","currency":"USD","id":"0133492273","title":"Adrenaline Junkies and Template Zombies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dV4UAAAAQBAJ&source=gbs_api","authors":["Tom DeMarco","Peter Hruschka","Tim Lister","Steve McMenamin","James Robertson","Suzanne Robertson"]},{"pageCount":824,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ymLHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn to write clean, efficient code and build high-performance applications with Go","description":"The Go Workshop takes you from being a novice Go programmer to a confident developer who can leverage the key features of the language to build real-world applications. This book helps you cut through excessive theory and delve into the practical features and techniques that are commonly applied to design performant, scalable applications.","language":"en","currency":"USD","id":"1838640150","title":"The The Go Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ymLHDwAAQBAJ&source=gbs_api","authors":["Delio D'Anna","Andrew Hayes","Sam Hennessy","Jeremy Leasor","Gobin Sougrakpam","Dániel Szabó"]},{"pageCount":294,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DYC3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.01,"subtitle":null,"description":"Looking for Best Practices for RESTful APIs? This book is for you! Why? Because this book is packed with practical experience on what works best for RESTful API Design. You want to design APIs like a Pro? Use API description languages to both design APIs and develop APIs efficiently. The book introduces the two most common API description languages RAML, OpenAPI, and Swagger. Your company cares about its customers? Learn API product management with a customer-centric design and development approach for APIs. Learn how to manage APIs as a product and how to follow an API-first approach. Build APIs your customers love! You want to manage the complete API lifecycle? An API development methodology is proposed to guide you through the lifecycle: API inception, API design, API development, API publication, API evolution, and maintenance. You want to build APIs right? This book shows best practices for REST design, such as the correct use of resources, URIs, representations, content types, data formats, parameters, HTTP status codes, and HTTP methods. Your APIs connect to legacy systems? The book shows best practices for connecting APIs to existing backend systems. Your APIs connect to a mesh of microservices? The book shows the principles for designing APIs for scalable, autonomous microservices. You expect lots of traffic on your API? The book shows you how to achieve high performance, availability and maintainability. You want to build APIs that last for decades? We study API versioning, API evolution, backward- and forward-compatibility and show API design patterns for versioning. The API-University Series is a modular series of books on API-related topics. Each book focuses on a particular API topic, so you can select the topics within APIs, which are relevant for you.","language":"en","currency":"USD","id":"1514735164","title":"RESTful API Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DYC3DwAAQBAJ&source=gbs_api","authors":["Matthias Biehl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rJUFDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Start using Kubernetes in complex big data and enterprise applications, including Docker containers. Starting with installing Kubernetes on a single node, the book introduces Kubernetes with a simple Hello example and discusses using environment variables in Kubernetes. Next, Kubernetes Microservices with Docker discusses using Kubernetes with all major groups of technologies such as relational databases, NoSQL databases, and in the Apache Hadoop ecosystem. The book concludes with using multi container pods and installing Kubernetes on a multi node cluster. \/div \"a concise but clear introduction to containers, Docker and Kubernetes, using simple real-world examples to pass on the core concepts, via repetition, and is a very useful enabler.\" 10\/10 Dave Hay MBCS CITP: review for BCS, The Chartered Institute for IT (http:\/\/www.bcs.org\/content\/conWebDoc\/58512) What You Will Learn Install Kubernetes on a single node Set environment variables Create multi-container pods using Docker Use volumes Use Kubernetes with the Apache Hadoop ecosystem, NoSQL databases, and RDBMSs Install Kubernetes on a multi-node cluster Who This Book Is For Application developers including Apache Hadoop developers, database developers and NoSQL developers.","language":"en","currency":"USD","id":"1484219074","title":"Kubernetes Microservices with Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rJUFDAAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":594,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6EZsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Become a successful software architect by implementing effective architecture concepts","description":"A comprehensive guide to exploring software architecture concepts and implementing best practices Key Features Enhance your skills to grow your career as a software architect Design efficient software architectures using patterns and best practices Learn how software architecture relates to an organization as well as software development methodology Book Description The Software Architect’s Handbook is a comprehensive guide to help developers, architects, and senior programmers advance their career in the software architecture domain. This book takes you through all the important concepts, right from design principles to different considerations at various stages of your career in software architecture. The book begins by covering the fundamentals, benefits, and purpose of software architecture. You will discover how software architecture relates to an organization, followed by identifying its significant quality attributes. Once you have covered the basics, you will explore design patterns, best practices, and paradigms for efficient software development. The book discusses which factors you need to consider for performance and security enhancements. You will learn to write documentation for your architectures and make appropriate decisions when considering DevOps. In addition to this, you will explore how to design legacy applications before understanding how to create software architectures that evolve as the market, business requirements, frameworks, tools, and best practices change over time. By the end of this book, you will not only have studied software architecture concepts but also built the soft skills necessary to grow in this field. What you will learn Design software architectures using patterns and best practices Explore the different considerations for designing software architecture Discover what it takes to continuously improve as a software architect Create loosely coupled systems that can support change Understand DevOps and how it affects software architecture Integrate, refactor, and re-architect legacy applications Who this book is for The Software Architect’s Handbook is for you if you are a software architect, chief technical officer (CTO), or senior developer looking to gain a firm grasp of software architecture.","language":"en","currency":"USD","id":"1788627679","title":"Software Architect’s Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6EZsDwAAQBAJ&source=gbs_api","authors":["Joseph Ingeno"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GpoKZncgCxsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 150 recipes to design and optimize large scale Apache Cassandra deployments.","language":"en","currency":"USD","id":"1849515131","title":"Cassandra High Performance Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GpoKZncgCxsC&source=gbs_api","authors":["Edward Capriolo"]},{"pageCount":15,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G53RDXRwMw4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Have we entered the age of NoOps infrastructures? Hardly. Old-style system administrators may be disappearing in the face of automation and cloud computing, but operations have become more significant than ever. As this O’Reilly Radar Report explains, we’re moving into a more complex arrangement known as \"DevOps.\" Mike Loukides, O’Reilly’s VP of Content Strategy, provides an incisive look into this new world of operations, where IT specialists are becoming part of the development team. In an environment with thousands of servers, these specialists now write the code that maintains the infrastructure. Even applications that run in the cloud have to be resilient and fault tolerant, need to be monitored, and must adjust to huge swings in load. That was underscored by Amazon’s EBS outage last year. From the discussions at O’Reilly’s Velocity Conference, it’s evident that many operations specialists are quickly adapting to the DevOps reality. But as a whole, the industry has just scratched the surface. This report tells you why.","language":"en","currency":"USD","id":"1449339115","title":"What is DevOps?","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G53RDXRwMw4C&source=gbs_api","authors":["Mike Loukides"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnnlCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This invaluable roadmap for startup engineers reveals how to successfully handle web application scalability challenges to meet increasing product and traffic demands. Web Scalability for Startup Engineers shows engineers working at startups and small companies how to plan and implement a comprehensive scalability strategy. It presents broad and holistic view of infrastructure and architecture of a scalable web application. Successful startups often face the challenge of scalability, and the core concepts driving a scalable architecture are language and platform agnostic. The book covers scalability of HTTP-based systems (websites, REST APIs, SaaS, and mobile application backends), starting with a high-level perspective before taking a deep dive into common challenges and issues. This approach builds a holistic view of the problem, helping you see the big picture, and then introduces different technologies and best practices for solving the problem at hand. The book is enriched with the author's real-world experience and expert advice, saving you precious time and effort by learning from others' mistakes and successes. Language-agnostic approach addresses universally challenging concepts in Web development\/scalability—does not require knowledge of a particular language Fills the gap for engineers in startups and smaller companies who have limited means for getting to the next level in terms of accomplishing scalability Strategies presented help to decrease time to market and increase the efficiency of web applications","language":"en","currency":"USD","id":"0071843663","title":"Web Scalability for Startup Engineers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnnlCQAAQBAJ&source=gbs_api","authors":["Artur Ejsmont"]},{"pageCount":458,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_kWhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build modern and concurrent applications for Unix and Linux systems using Golang","description":"Explore the fundamentals of systems programming starting from kernel API and filesystem to network programming and process communications Key Features Learn how to write Unix and Linux system code in Golang v1.12 Perform inter-process communication using pipes, message queues, shared memory, and semaphores Explore modern Go features such as goroutines and channels that facilitate systems programming Book Description System software and applications were largely created using low-level languages such as C or C++. Go is a modern language that combines simplicity, concurrency, and performance, making it a good alternative for building system applications for Linux and macOS. This Go book introduces Unix and systems programming to help you understand the components the OS has to offer, ranging from the kernel API to the filesystem, and familiarize yourself with Go and its specifications. You'll also learn how to optimize input and output operations with files and streams of data, which are useful tools in building pseudo terminal applications. You'll gain insights into how processes communicate with each other, and learn about processes and daemon control using signals, pipes, and exit codes. This book will also enable you to understand how to use network communication using various protocols, including TCP and HTTP. As you advance, you'll focus on Go's best feature-concurrency helping you handle communication with channels and goroutines, other concurrency tools to synchronize shared resources, and the context package to write elegant applications. By the end of this book, you will have learned how to build concurrent system applications using Go What you will learn Explore concepts of system programming using Go and concurrency Gain insights into Golang's internals, memory models and allocation Familiarize yourself with the filesystem and IO streams in general Handle and control processes and daemons' lifetime via signals and pipes Communicate with other applications effectively using a network Use various encoding formats to serialize complex data structures Become well-versed in concurrency with channels, goroutines, and sync Use concurrency patterns to build robust and performant system applications Who this book is for If you are a developer who wants to learn system programming with Go, this book is for you. Although no knowledge of Unix and Linux system programming is necessary, intermediate knowledge of Go will help you understand the concepts covered in the book","language":"en","currency":"USD","id":"1789803365","title":"Hands-On System Programming with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_kWhDwAAQBAJ&source=gbs_api","authors":["Alex Guerrieri"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3crTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop elegant RESTful APIs with Golang for microservices and the cloud, 2nd Edition","description":"Design production-ready, testable, and maintainable RESTful web services for the modern web that scale easily Key Features Employ a combination of custom and open source solutions for application program interface (API) development Discover asynchronous API and API security patterns and learn how to deploy your web services to the cloud Apply design patterns and techniques to build reactive and scalable web services Book Description Building RESTful web services can be tough as there are countless standards and ways to develop API. In modern architectures such as microservices, RESTful APIs are common in communication, making idiomatic and scalable API development crucial. This book covers basic through to advanced API development concepts and supporting tools. You’ll start with an introduction to REST API development before moving on to building the essential blocks for working with Go. You’ll explore routers, middleware, and available open source web development solutions in Go to create robust APIs, and understand the application and database layers to build RESTful web services. You’ll learn various data formats like protocol buffers and JSON, and understand how to serve them over HTTP and gRPC. After covering advanced topics such as asynchronous API design and GraphQL for building scalable web services, you’ll discover how microservices can benefit from REST. You’ll also explore packaging artifacts in the form of containers and understand how to set up an ideal deployment ecosystem for web services. Finally, you’ll cover the provisioning of infrastructure using infrastructure as code (IaC) and secure your REST API. By the end of the book, you’ll have intermediate knowledge of web service development and be able to apply the skills you’ve learned in a practical way. What you will learn Explore the fundamentals of API development and web services Understand the various building blocks of API development in Go Use superior open source solutions for representational state transfer (REST) API development Scale a service using microservices and asynchronous design patterns Deliver containerized artifacts to the Amazon Web Services (AWS) Cloud Get to grips with API security and its implementation Who this book is for This book is for all the Go developers who are comfortable with the language and seeking to learn REST API development. Even senior engineers can enjoy this book, as it discusses many cutting-edge concepts, such as building microservices, developing API with GraphQL, using protocol buffers, asynchronous API design, and Infrastructure as a Code. Developers who are already familiar with REST concepts and stepping into the Go world from other platforms, such as Python and Ruby, can also benefit a lot.","language":"en","currency":"USD","id":"1838647546","title":"Hands-On RESTful Web Services with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3crTDwAAQBAJ&source=gbs_api","authors":["Naren Yellavula"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eF8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"Service Mesh für Microservices","description":"Praxiswissen Istio: Kontrolle über komplexe Microservices-Architekturen behalten Die Flexibilität von Microservices-Architekturen bietet enorme Vorteile. Es ist allerdings eine Herausforderung, die ständig zunehmende Komplexität unter Kontrolle zu behalten. Mit dem populären Service Mesh Istio verlagern Sie Logging, Monitoring und Tracing aus der Anwendungsschicht in eine Infrastrukturschicht. Sie verwalten den Datenverkehr, steuern und überwachen Zugriffe, erstellen Berichte, rufen Telemetriedaten ab, managen Kontingente, führen Traces durch und vieles mehr – und alles mit einer hohen Ausfallsicherheit für Ihre Microservices.","language":"de","currency":"USD","id":"396010412X","title":"Istio","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eF8LEAAAQBAJ&source=gbs_api","authors":["Lee Calcote","Zack Butcher"]},{"pageCount":218,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Use Forensic Techniques to Arrest Defects, Bottlenecks, and Bad Design in Your Programs","description":"Jack the Ripper and legacy codebases have more in common than you'd think. Inspired by forensic psychology methods, you'll learn strategies to predict the future of your codebase, assess refactoring direction, and understand how your team influences the design. With its unique blend of forensic psychology and code analysis, this book arms you with the strategies you need, no matter what programming language you use. Software is a living entity that's constantly changing. To understand software systems, we need to know where they came from and how they evolved. By mining commit data and analyzing the history of your code, you can start fixes ahead of time to eliminate broken designs, maintenance issues, and team productivity bottlenecks. In this book, you'll learn forensic psychology techniques to successfully maintain your software. You'll create a geographic profile from your commit data to find hotspots, and apply temporal coupling concepts to uncover hidden relationships between unrelated areas in your code. You'll also measure the effectiveness of your code improvements. You'll learn how to apply these techniques on projects both large and small. For small projects, you'll get new insights into your design and how well the code fits your ideas. For large projects, you'll identify the good and the fragile parts. Large-scale development is also a social activity, and the team's dynamics influence code quality. That's why this book shows you how to uncover social biases when analyzing the evolution of your system. You'll use commit messages as eyewitness accounts to what is really happening in your code. Finally, you'll put it all together by tracking organizational problems in the code and finding out how to fix them. Come join the hunt for better code! What You Need: You need Java 6 and Python 2.7 to run the accompanying analysis tools. You also need Git to follow along with the examples.","language":"en","currency":"USD","id":"1680505203","title":"Your Code as a Crime Scene","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lA9QDwAAQBAJ&source=gbs_api","authors":["Adam Tornhill"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xcaiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for both novice developers in general and experienced Spring developers. It will teach you how to override Spring Boot's opinions and frees you from the need to define complicated configurations.","language":"en","currency":"USD","id":"1784397482","title":"Learning Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xcaiBQAAQBAJ&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-OQVCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.94,"subtitle":"Konzeption und Design","description":"Feingranulare Systeme mit Microservices aufbauen Design, Entwicklung, Deployment, Testen und Monitoring Sicherheitsaspekte, Authentifizierung und Autorisierung Verteilte Systeme haben sich in den letzten Jahren stark verändert: Große monolithische Architekturen werden zunehmend in viele kleine, eigenständige Microservices aufgespalten. Aber die Entwicklung solcher Systeme bringt Herausforderungen ganz eigener Art mit sich. Dieses Buch richtet sich an Softwareentwickler, die sich über die zielführenden Aspekte von Microservice-Systemen wie Design, Entwicklung, Testen, Deployment und Monitoring informieren möchten. Sam Newman veranschaulicht und konkretisiert seine ganzheitliche Betrachtung der grundlegenden Konzepte von Microservice-Architekturen anhand zahlreicher praktischer Beispiele und Ratschläge. Er geht auf die Themen ein, mit denen sich Systemarchitekten und Administratoren bei der Einrichtung, Verwaltung und Entwicklung dieser Architekturen in jedem Fall auseinandersetzen müssen. Aus dem Inhalt: Vorteile von Microservices Gestaltung von Services Ausrichtung der Systemarchitektur an der Organisationsstruktur Möglichkeiten zur Integration von Services Schrittweise Aufspaltung einer monolithischen Codebasis Deployment einzelner Microservices mittels Continuous Integration Testen und Monitoring verteilter Systeme Sicherheitsaspekte Authentifizierung und Autorisierung zwischen Benutzer und Service bzw. zwischen Services untereinander Skalierung von Microservice-Architekturen »Microservice-Architekturen besitzen viele interessante Eigenschaften, allerdings sind bei der Umstellung so einige Fallstricke zu beachten. Dieses Buch wird Ihnen helfen herauszufinden, ob Microservices für Ihre Zwecke geeignet sind und zeigt Ihnen, wie Sie die Fallstricke umgehen können.« Martin Fowler, Chief Scientist, ThoughtWorks","language":"de","currency":"USD","id":"3958450830","title":"Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-OQVCgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y83aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.49,"subtitle":"Build powerful and reliable Python web applications from scratch, 3rd Edition","description":"Learn Django 3 with four end-to-end web projects Key Features Learn Django 3 by building real-world web applications from scratch in Python, using coding best practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Implement advanced functionalities like a full-text search engine, a user activity stream, or a recommendation engine Add real-time features with Django Channels and WebSockets Book Description If you want to learn the entire process of developing professional web applications with Python and Django, then this book is for you. In the process of building four professional Django projects, you will learn about Django 3 features, how to solve common web development problems, how to implement best practices, and how to successfully deploy your applications. In this book, you will build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Step-by-step guidance will teach you how to integrate popular technologies, enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. By the end of this book, you will have mastered Django 3 by building advanced web applications. What you will learn Build real-world web applications Learn Django essentials, including models, views, ORM, templates, URLs, forms, and authentication Implement advanced features such as custom model fields, custom template tags, cache, middleware, localization, and more Create complex functionalities, such as AJAX interactions, social authentication, a full-text search engine, a payment system, a CMS, a RESTful API, and more Integrate other technologies, including Redis, Celery, RabbitMQ, PostgreSQL, and Channels, into your projects Deploy Django projects in production using NGINX, uWSGI, and Daphne Who this book is for This book is intended for developers with Python knowledge who wish to learn Django in a pragmatic way. Perhaps you are completely new to Django, or you already know a little but you want to get the most out of it. This book will help you to master the most relevant areas of the framework by building practical projects from scratch. You need to have familiarity with programming concepts in order to read this book. Some previous knowledge of HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1838989323","title":"Django 3 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y83aDwAAQBAJ&source=gbs_api","authors":["Antonio Melé"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mWbMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.74,"subtitle":"Move beyond basic programming to design and build reliable software with clean code","description":"Explore software engineering methodologies, techniques, and best practices in Go programming to build easy-to-maintain software that can effortlessly scale on demand Key Features Apply best practices to produce lean, testable, and maintainable Go code to avoid accumulating technical debt Explore Go’s built-in support for concurrency and message passing to build high-performance applications Scale your Go programs across machines and manage their life cycle using Kubernetes Book Description Over the last few years, Go has become one of the favorite languages for building scalable and distributed systems. Its opinionated design and built-in concurrency features make it easy for engineers to author code that efficiently utilizes all available CPU cores. This Golang book distills industry best practices for writing lean Go code that is easy to test and maintain, and helps you to explore its practical implementation by creating a multi-tier application called Links ‘R’ Us from scratch. You’ll be guided through all the steps involved in designing, implementing, testing, deploying, and scaling an application. Starting with a monolithic architecture, you’ll iteratively transform the project into a service-oriented architecture (SOA) that supports the efficient out-of-core processing of large link graphs. You’ll learn about various cutting-edge and advanced software engineering techniques such as building extensible data processing pipelines, designing APIs using gRPC, and running distributed graph processing algorithms at scale. Finally, you’ll learn how to compile and package your Go services using Docker and automate their deployment to a Kubernetes cluster. By the end of this book, you’ll know how to think like a professional software developer or engineer and write lean and efficient Go code. What you will learn Understand different stages of the software development life cycle and the role of a software engineer Create APIs using gRPC and leverage the middleware offered by the gRPC ecosystem Discover various approaches to managing package dependencies for your projects Build an end-to-end project from scratch and explore different strategies for scaling it Develop a graph processing system and extend it to run in a distributed manner Deploy Go services on Kubernetes and monitor their health using Prometheus Who this book is for This Golang programming book is for developers and software engineers looking to use Go to design and build scalable distributed systems effectively. Knowledge of Go programming and basic networking principles is required.","language":"en","currency":"USD","id":"1838550240","title":"Hands-On Software Engineering with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mWbMDwAAQBAJ&source=gbs_api","authors":["Achilleas Anagnostopoulos"]},{"pageCount":425,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rufiBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.87,"subtitle":"The ultimate and most up-to-date guide to manage WildFly appication server","description":"WildFly is the most popular open-source Java application server. This book is an in-depth guide to the administration and management of the of the application server, covering all of the latest architectural and management changes such as: - How to achieve High Availability of your WildFly cluster - How to configure the newest subsystems (agroal, mp subsystems) - Delivering advanced and leak-proof Datasource configuration - Provisioning custom Server distributions with Galleon tool. - Using the Undertow Web server as front-end for mod_cluster and as Reverse Proxy Server - Migrating your older legacy configurations to WildFly newer subsystems - Securing the application server with Elytron Framework - Configuring a robust JMS cluster with Apache Artemis MQ - Running WildFly in the cloud with Openshift and CRC - Configuring Eclipse Micro Profiles and much more, with improved online examples!","language":"en","currency":"USD","id":"8894038920","title":"WildFly Administration Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rufiBAAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":406,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CulODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build microservice-based cloud-native applications that dynamically scale","description":"Highly available microservice-based web apps for Cloud with Java Key Features Take advantage of the simplicity of Spring to build a full-fledged application Let your applications run faster while generating smaller cloud service bills Integrate your application with various tools such as Docker and ElasticSearch and use specific tools in Azure and AWS Book Description Businesses today are evolving so rapidly that they are resorting to the elasticity of the cloud to provide a platform to build and deploy their highly scalable applications. This means developers now are faced with the challenge of building build applications that are native to the cloud. For this, they need to be aware of the environment, tools, and resources they’re coding against. If you’re a Java developer who wants to build secure, resilient, robust, and scalable applications that are targeted for cloud-based deployment, this is the book for you. It will be your one stop guide to building cloud-native applications in Java Spring that are hosted in On-prem or cloud providers - AWS and Azure The book begins by explaining the driving factors for cloud adoption and shows you how cloud deployment is different from regular application deployment on a standard data centre. You will learn about design patterns specific to applications running in the cloud and find out how you can build a microservice in Java Spring using REST APIs You will then take a deep dive into the lifecycle of building, testing, and deploying applications with maximum automation to reduce the deployment cycle time. Gradually, you will move on to configuring the AWS and Azure platforms and working with their APIs to deploy your application. Finally, you’ll take a look at API design concerns and their best practices. You’ll also learn how to migrate an existing monolithic application into distributed cloud native applications. By the end, you will understand how to build and monitor a scalable, resilient, and robust cloud native application that is always available and fault tolerant. What you will learn See the benefits of the cloud environment when it comes to variability, provisioning, and tooling support Understand the architecture patterns and considerations when developing on the cloud Find out how to perform cloud-native techniques\/patterns for request routing, RESTful service creation, Event Sourcing, and more Create Docker containers for microservices and set up continuous integration using Jenkins Monitor and troubleshoot an application deployed in the cloud environment Explore tools such as Docker and Kubernetes for containerization and the ELK stack for log aggregation and visualization Use AWS and Azure specific tools to design, develop, deploy, and manage applications Migrate from monolithic architectures to a cloud native deployment Who this book is for Java developers who want to build secure, resilient, robust and scalable applications that are targeted for cloud based deployment, will find this book helpful. Some knowledge of Java, Spring, web programming and public cloud providers (AWS, Azure) should be sufficient to get you through the book.","language":"en","currency":"USD","id":"1787128849","title":"Cloud-Native Applications in Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CulODwAAQBAJ&source=gbs_api","authors":["Ajay Mahajan","Munish Kumar Gupta","Shyam Sundar"]},{"pageCount":406,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZXDGAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Services for a Changing World","description":"The popularity of REST in recent years has led to tremendous growth in almost-RESTful APIs that don’t include many of the architecture’s benefits. With this practical guide, you’ll learn what it takes to design usable REST APIs that evolve over time. By focusing on solutions that cross a variety of domains, this book shows you how to create powerful and secure applications, using the tools designed for the world’s most successful distributed computing system: the World Wide Web. You’ll explore the concepts behind REST, learn different strategies for creating hypermedia-based APIs, and then put everything together with a step-by-step guide to designing a RESTful Web API. Examine API design strategies, including the collection pattern and pure hypermedia Understand how hypermedia ties representations together into a coherent API Discover how XMDP and ALPS profile formats can help you meet the Web API \"semantic challenge\" Learn close to two-dozen standardized hypermedia data formats Apply best practices for using HTTP in API implementations Create Web APIs with the JSON-LD standard and other the Linked Data approaches Understand the CoAP protocol for using REST in embedded systems","language":"en","currency":"USD","id":"1449359736","title":"RESTful Web APIs","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZXDGAAAAQBAJ&source=gbs_api","authors":["Leonard Richardson","Mike Amundsen","Sam Ruby"]},{"pageCount":335,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lqDSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"From Novice to Professional","description":"Discover the Ballerina programming language for next-generation microservices and native cloud application development. This book shows you that Ballerina is a cutting-edge programming language, which incorporates many of the latest technological advancements in programming language theory. You'll learn variables and types, modules and functions, flow control, error handling, concurrency, I\/O, cloud\/network programming, persistence and data access, security and more. Additionally, Beginning Ballerina Programming introduces many foundation computer science topics along the way and doesn’t assume much prior knowledge. For example, when introducing transport-level security, you will get a brief introduction to public-key cryptography, how it is different from private-key cryptography, and why we need it. This provides an added bonus for you to learn something new and general in computer science. After reading and using this book, you'll be proficient with Ballerina and cloud-first programming and apply these concepts and techniques to your next cloud application developments. What You'll Learn Start programming with Ballerina Gain the basics of network communication and programming Obtain a solid understanding of services\/API development and resilient communication Discover cloud-native technologies using Ballerina Deploy to the cloud using Ballerina Who This Book Is For Absolute beginners in computer programming: No prior experience with computer programming is expected. This can also be a reference book for experienced developers in other languages, who want to learn a modern programming language.","language":"en","currency":"USD","id":"1484251393","title":"Beginning Ballerina Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lqDSDwAAQBAJ&source=gbs_api","authors":["Anjana Fernando","Lakmal Warusawithana"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rvLHAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication provides best practices for planning, installing, maintaining, and monitoring the IBM PowerVM® Enterprise Edition virtualization features on IBM POWER7® processor technology-based servers. PowerVM is a combination of hardware, PowerVM Hypervisor, and software, which includes other virtualization features, such as the Virtual I\/O Server. This publication is intended for experienced IT specialists and IT architects who want to learn about PowerVM best practices, and focuses on the following topics: Planning and general best practices Installation, migration, and configuration Administration and maintenance Storage and networking Performance monitoring Security PowerVM advanced features This publication is written by a group of seven PowerVM experts from different countries around the world. These experts came together to bring their broad IT skills, depth of knowledge, and experiences from thousands of installations and configurations in different IBM client sites.","language":"en","currency":"USD","id":"0738437301","title":"IBM PowerVM Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rvLHAgAAQBAJ&source=gbs_api","authors":["Scott Vetter","Adriano de Almeida","Rafael Antonioli","Urban Biel","Sylvain Delabarre","Bartłomiej Grabowski","Kristian Milos","Fray L Rodríguez","IBM Redbooks"]},{"pageCount":449,"thumbnail":"http:\/\/books.google.com\/books\/content?id=47jEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"OAuth 2.0 and Beyond","description":"Prepare for the next wave of challenges in enterprise security. Learn to better protect, monitor, and manage your public and private APIs. Enterprise APIs have become the common way of exposing business functions to the outside world. Exposing functionality is convenient, but of course comes with a risk of exploitation. This book teaches you about TLS Token Binding, User Managed Access (UMA) 2.0, Cross Origin Resource Sharing (CORS), Incremental Authorization, Proof Key for Code Exchange (PKCE), and Token Exchange. Benefit from lessons learned from analyzing multiple attacks that have taken place by exploiting security vulnerabilities in various OAuth 2.0 implementations. Explore root causes, and improve your security practices to mitigate against similar future exploits. Security must be an integral part of any development project. This book shares best practices in designing APIs for rock-solid security. API security has evolved since the first edition of this book, and the growth of standards has been exponential. OAuth 2.0 is the most widely adopted framework that is used as the foundation for standards, and this book shows you how to apply OAuth 2.0 to your own situation in order to secure and protect your enterprise APIs from exploitation and attack. What You Will Learn Securely design, develop, and deploy enterprise APIs Pick security standards and protocols to match business needs Mitigate security exploits by understanding the OAuth 2.0 threat landscape Federate identities to expand business APIs beyond the corporate firewall Protect microservices at the edge by securing their APIs Develop native mobile applications to access APIs securely Integrate applications with SaaS APIs protected with OAuth 2.0 Who This Book Is For Enterprise security architects who are interested in best practices around designing APIs. The book is also for developers who are building enterprise APIs and integrating with internal and external applications.","language":"en","currency":"USD","id":"1484220501","title":"Advanced API Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=47jEDwAAQBAJ&source=gbs_api","authors":["Prabath Siriwardena"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d9GGCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"The Science of Our Information Infrastructure","description":"Quite soon, the world’s information infrastructure is going to reach a level of scale and complexity that will force scientists and engineers to approach it in an entirely new way. The familiar notions of command and control are being thwarted by realities of a faster, denser world of communication where choice, variety, and indeterminism rule. The myth of the machine that does exactly what we tell it has come to an end. What makes us think we can rely on all this technology? What keeps it together today, and how might it work tomorrow? Will we know how to build the next generation—or will we be lulled into a stupor of dependence brought about by its conveniences? In this book, Mark Burgess focuses on the impact of computers and information on our modern infrastructure by taking you from the roots of science to the principles behind system operation and design. To shape the future of technology, we need to understand how it works—or else what we don’t understand will end up shaping us. This book explores this subject in three parts: Part I, Stability: describes the fundamentals of predictability, and why we have to give up the idea of control in its classical meaning Part II, Certainty: describes the science of what we can know, when we don’t control everything, and how we make the best of life with only imperfect information Part III, Promises: explains how the concepts of stability and certainty may be combined to approach information infrastructure as a new kind of virtual material, restoring a continuity to human-computer systems so that society can rely on them.","language":"en","currency":"USD","id":"1491923369","title":"In Search of Certainty","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d9GGCAAAQBAJ&source=gbs_api","authors":["Mark Burgess"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zvPtDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":96,"subtitle":null,"description":"Software Architecture for Big Data and the Cloud is designed to be a single resource that brings together research on how software architectures can solve the challenges imposed by building big data software systems. The challenges of big data on the software architecture can relate to scale, security, integrity, performance, concurrency, parallelism, and dependability, amongst others. Big data handling requires rethinking architectural solutions to meet functional and non-functional requirements related to volume, variety and velocity. The book's editors have varied and complementary backgrounds in requirements and architecture, specifically in software architectures for cloud and big data, as well as expertise in software engineering for cloud and big data. This book brings together work across different disciplines in software engineering, including work expanded from conference tracks and workshops led by the editors. Discusses systematic and disciplined approaches to building software architectures for cloud and big data with state-of-the-art methods and techniques Presents case studies involving enterprise, business, and government service deployment of big data applications Shares guidance on theory, frameworks, methodologies, and architecture for cloud and big data","language":"en","currency":"USD","id":"0128093382","title":"Software Architecture for Big Data and the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zvPtDQAAQBAJ&source=gbs_api","authors":["Ivan Mistrik","Rami Bahsoon","Nour Ali","Maritta Heisel","Bruce Maxim"]},{"pageCount":186,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Xdp1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"Fundamental Issues and Recent Developments","description":"This book presents a comprehensive overview of fundamental issues and recent advances in graph data management. Its aim is to provide beginning researchers in the area of graph data management, or in fields that require graph data management, an overview of the latest developments in this area, both in applied and in fundamental subdomains. The topics covered range from a general introduction to graph data management, to more specialized topics like graph visualization, flexible queries of graph data, parallel processing, and benchmarking. The book will help researchers put their work in perspective and show them which types of tools, techniques and technologies are available, which ones could best suit their needs, and where there are still open issues and future research directions. The chapters are contributed by leading experts in the relevant areas, presenting a coherent overview of the state of the art in the field. Readers should have a basic knowledge of data management techniques as they are taught in computer science MSc programs.","language":"en","currency":"USD","id":"3319961934","title":"Graph Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Xdp1DwAAQBAJ&source=gbs_api","authors":["George Fletcher","Jan Hidders","Josep Lluís Larriba-Pey"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tYrPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.49,"subtitle":"How Google Runs Production Systems","description":"The overwhelming majority of a software system’s lifespan is spent in use, not in design or implementation. So, why does conventional wisdom insist that software engineers focus primarily on the design and development of large-scale computing systems? In this collection of essays and articles, key members of Google’s Site Reliability Team explain how and why their commitment to the entire lifecycle has enabled the company to successfully build, deploy, monitor, and maintain some of the largest software systems in the world. You’ll learn the principles and practices that enable Google engineers to make systems more scalable, reliable, and efficient—lessons directly applicable to your organization. This book is divided into four sections: Introduction—Learn what site reliability engineering is and why it differs from conventional IT industry practices Principles—Examine the patterns, behaviors, and areas of concern that influence the work of a site reliability engineer (SRE) Practices—Understand the theory and practice of an SRE’s day-to-day work: building and operating large distributed computing systems Management—Explore Google's best practices for training, communication, and meetings that your organization can use","language":"en","currency":"USD","id":"1491951176","title":"Site Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tYrPCwAAQBAJ&source=gbs_api","authors":["Niall Richard Murphy","Betsy Beyer","Chris Jones","Jennifer Petoff"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dupGDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.96,"subtitle":"Foundations and Service Models","description":"Mobile Cloud Computing: Foundations and Service Models combines cloud computing, mobile computing and wireless networking to bring new computational resources for mobile users, network operators and cloud computing providers. The book provides the latest research and development insights on mobile cloud computing, beginning with an exploration of the foundations of cloud computing, existing cloud infrastructures classifications, virtualization techniques and service models. It then examines the approaches to building cloud services using a bottom-up approach, describing data center design, cloud networking and software orchestration solutions, showing how these solutions support mobile devices and services. The book describes mobile cloud clouding concepts with a particular focus on a user-centric approach, presenting a distributed mobile cloud service model called POEM to manage mobile cloud resource and compose mobile cloud applications. It concludes with a close examination of the security and privacy issues of mobile clouds. Shows how to construct new mobile cloud based applications Contains detailed approaches to address security challenges in mobile cloud computing Includes a case study using vehicular cloud","language":"en","currency":"USD","id":"0128096446","title":"Mobile Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dupGDgAAQBAJ&source=gbs_api","authors":["Dijiang Huang","Huijun Wu"]},{"pageCount":840,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KVHZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Problem-Solution Approach","description":"Take a problem-solution approach to programming enterprise Java applications and microservices for cloud-based solutions, enterprise database applications, and even small business web applications. This book provides effective and proven code snippets that you can immediately use to accomplish just about any task that you may encounter. You can feel confident using the reliable solutions that are demonstrated in this book in your personal or corporate environment. Java EE was made open source under the Eclipse Foundation, and Jakarta EE is the new name for what used to be termed the Java Enterprise Edition Platform. This book helps you rejuvenate your Java expertise and put the platform’s latest capabilities to use in quickly developing robust applications. If you are new to Jakarta EE, this book will help you learn features of the platform, and benefit from one of the most widely used and powerful technologies available for application development today. Examples in Jakarta EE Recipes highlight Jakarta EE’s capabilities, helping you to build streamlined and reliable applications using the latest in Java technologies. The book takes a problem-solution approach in which each section introduces a common programming problem, showing you how to best solve that problem using the latest features in Jakarta EE. Solutions are presented in the form of working code examples that you can download and use immediately in your own projects. Clear descriptions are given so you can understand and learn to build further on the solutions that are provided. This is the ideal book for the code-focused programmer interested in keeping up with the future of enterprise development on the Java Platform. What You Will Learn Develop enterprise Java applications using the now open source Jakarta EE platform Create great-looking user interfaces using Jakarta Server Faces and the Eclipse Krazo framework Build database applications using Jakarta Enterprise Beans and Jakarta RESTFul web services Automate testing through cohesive test suites built on Arquillian for Jakarta EE applications Deploy microservices applications in cloud environments using Docker Secure applications utilizing the Jakarta EE Security API and JSON Web Tokens Who This Book Is For Java developers interested in quickly finding effective and proven solutions without reading through a lengthy manual and scrubbing for techniques","language":"en","currency":"USD","id":"1484255879","title":"Jakarta EE Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KVHZDwAAQBAJ&source=gbs_api","authors":["Josh Juneau"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k9zIDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.59,"subtitle":null,"description":"Domain-Driven Design (DDD) software modeling delivers powerful results in practice, not just in theory, which is why developers worldwide are rapidly moving to adopt it. Now, for the first time, there’s an accessible guide to the basics of DDD: What it is, what problems it solves, how it works, and how to quickly gain value from it. Concise, readable, and actionable, Domain-Driven Design Distilled never buries you in detail–it focuses on what you need to know to get results. Vaughn Vernon, author of the best-selling Implementing Domain-Driven Design, draws on his twenty years of experience applying DDD principles to real-world situations. He is uniquely well-qualified to demystify its complexities, illuminate its subtleties, and help you solve the problems you might encounter. Vernon guides you through each core DDD technique for building better software. You’ll learn how to segregate domain models using the powerful Bounded Contexts pattern, to develop a Ubiquitous Language within an explicitly bounded context, and to help domain experts and developers work together to create that language. Vernon shows how to use Subdomains to handle legacy systems and to integrate multiple Bounded Contexts to define both team relationships and technical mechanisms. Domain-Driven Design Distilled brings DDD to life. Whether you’re a developer, architect, analyst, consultant, or customer, Vernon helps you truly understand it so you can benefit from its remarkable power. Coverage includes What DDD can do for you and your organization–and why it’s so important The cornerstones of strategic design with DDD: Bounded Contexts and Ubiquitous Language Strategic design with Subdomains Context Mapping: helping teams work together and integrate software more strategically Tactical design with Aggregates and Domain Events Using project acceleration and management tools to establish and maintain team cadence","language":"en","currency":"USD","id":"0134434994","title":"Domain-Driven Design Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k9zIDAAAQBAJ&source=gbs_api","authors":["Vaughn Vernon"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oAE90y3_Df4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.99,"subtitle":null,"description":"What is this book about? Expert One-on-One J2EE Development without EJB shows Javadevelopers and architects how to build robust J2EE applicationswithout having to use Enterprise JavaBeans (EJB). This practical,code-intensive guide provides best practices for using simpler andmore effective methods and tools, including JavaServer pages,servlets, and lightweight frameworks. What does this book cover? The book begins by examining the limits of EJB technology— what it does well and not so well. Then the authors guideyou through alternatives to EJB that you can use to create higherquality applications faster and at lower cost — both agilemethods as well as new classes of tools that have evolved over thepast few years. They then dive into the details, showing solutions based on thelightweight framework they pioneered on SourceForge — one ofthe most innovative open source communities. They demonstrate howto leverage practical techniques and tools, including the popularopen source Spring Framework and Hibernate. This book also guidesyou through productive solutions to core problems, such astransaction management, persistence, remoting, and Web tier design.You will examine how these alternatives affect testing,performance, and scalability, and discover how lightweightarchitectures can slash time and effort on many projects. What will you learn from this book? Here are some details on what you'll find in this book: How to find the simplest and most maintainable architecture foryour application Effective transaction management without EJB How to solve common problems in enterprise software developmentusing AOP and Inversion of Control Web tier design and the place of the Web tier in awell-designed J2EE application Effective data access techniques for J2EE applications withJDBC, Hibernate, and JDO How to leverage open source products to improve productivityand reduce custom coding How to design for optimal performance and scalability","language":"en","currency":"USD","id":"076457390X","title":"Expert One-on-One J2EE Development without EJB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oAE90y3_Df4C&source=gbs_api","authors":["Rod Johnson"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W7_lBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Master Java EE design pattern implementation to improve yourdesign skills and your application’s architecture Professional Java EE Design Patterns is the perfectcompanion for anyone who wants to work more effectively with JavaEE, and the only resource that covers both the theory andapplication of design patterns in solving real-world problems. Theauthors guide readers through both the fundamental and advancedfeatures of Java EE 7, presenting patterns throughout, anddemonstrating how they are used in day-to-day problem solving. As the most popular programming language in community-drivenenterprise software, Java EE provides an API and runtimeenvironment that is a superset of Java SE. Written for the juniorand experienced Java EE developer seeking to improve design qualityand effectiveness, the book covers areas including: Implementation and problem-solving with design patterns Connection between existing Java SE design patterns and newJava EE concepts Harnessing the power of Java EE in design patterns Individually-based focus that fully explores each pattern Colorful war-stories showing how patterns were used in thefield to solve real-life problems Unlike most Java EE books that simply offer descriptions orrecipes, this book drives home the implementation of the pattern toreal problems to ensure that the reader learns how the patternsshould be used and to be aware of their pitfalls. For the programmer looking for a comprehensive guide that isactually useful in the everyday workflow, Professional Java EEDesign Patterns is the definitive resource on the market.","language":"en","currency":"USD","id":"1118843452","title":"Professional Java EE Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W7_lBQAAQBAJ&source=gbs_api","authors":["Murat Yener","Alex Theedom"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kQqqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.21,"subtitle":null,"description":"A hands-on practical guide disclosing all areas of Enterprise development, covering details about Jakarta EE with lots of examples to be run on the full distribution of WildFly application server or using WildFly Bootable Jar as a Microservice. The first part of the book covers everything from the foundation components (EJB, Servlets, CDI, JPA) to the new technology stack defined in Java Enterprise Edition (now Jakarta EE 8), including the new Batch API, JSON-P API, the Concurrency API,Web Sockets, the JMS 2.0 API, the core Web services stack (Jakarta REST Services, Jakarta SOAP Services). The testing area with Arquillian framework and the Security API is also fully covered in this part. At the end of this part, you will be able to create and deploy Enterprise applications on the top of Jakarta EE 8 runtimes (WildFly 21) and Jakarta EE 9 (WildFly 22 or newer). The second part of the book discusses how to integrate the Jakarta Enterprise API with the Microprofile specification, to provide essential services to develop robust microservices such as the Configuration API, the Health API, the Fault tolerance API, the OpenAPI and Tracing API, the Metrics API, JWT Authentication API and REST Client API. Finally, the third book covers how to build Microservices using WildFly Bootable jar technology and how to deploy them on the cloud with Red Hat OpenShift. What you will learn from this book: - Everything you need to know about Jakarta EE and MicroProfile API - How to set up your development environment to build Enterprise applications and Microservices on the top of WildFly. - How to use Maven plugin to simplify your project scaffolding - Learning the foundation components that constitute the backbone of your applications: EJB, CDI, JPA, JAX-RS, JAX-WS - Learn how to build loosely coupled applications using the straightforward JMS 2.0 API - Learn how to test your applications with Arquillian in a managed environment, remote environment and even on the cloud! - Discover how to develop Concurrent and Compliant Enterprise applications using the Concurrency API and how to define Batch Jobs for your tasks. - Secure applications (Web\/EJB) with standard and custom login modules. How to encrypt the communication of EJB applications and Web applications. - How to enhance your Jakarta EE stack with Microprofile API to build robust Microservices - How to turn your Jakarta EE applications in Microservices using WildFly bootable jar.","language":"en","currency":"USD","id":"8894038963","title":"Practical Enterprise Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kQqqDwAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vMm8DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Analysis and Design for Services and Microservices","description":"The Top-Selling, De Facto Guide to SOA--Now Updated with New Content and Coverage of Microservices! For more than a decade, Thomas Erl’s best-selling Service-Oriented Architecture: Concepts, Technology, and Design has been the definitive end-to-end tutorial on SOA, service-orientation, and service technologies. Now, Erl has thoroughly updated the industry’s de facto guide to SOA to reflect new practices, technologies, and strategies that have emerged through hard-won experience and creative innovation. This Second Edition officially introduces microservices and micro task abstraction as part of service-oriented architecture and its associated service layers. Updated case study examples and illustrations further explain and position the microservice model alongside and in relation to more traditional types of services. Coverage includes: • Easy-to-understand, plain English explanations of SOA and service-orientation fundamentals (as compiled from series titles) • Microservices, micro task abstraction, and containerization • Service delivery lifecycle and associated phases • Analysis and conceptualization of services and microservices • Service API design with REST services, web services, and microservices • Modern service API and contract versioning techniques for web services and REST services • Up-to-date appendices with service-orientation principles, REST constraints, and SOA patterns (including three new patterns) Service-Oriented Architecture: Analysis and Design for Services and Microservices, Second Edition, will be indispensable to application architects, enterprise architects, software developers, and any IT professionals interested in learning about or responsible for designing or implementing modern-day, service-oriented solutions. Chapter 1: Introduction Chapter 2: Case Study Backgrounds Part I: Fundamentals Chapter 3: Understanding Service-Orientation Chapter 4: Understanding SOA Chapter 5: Understanding Layers with Services and Microservices Part II: Service-Oriented Analysis and Design Chapter 6: Analysis and Modeling with Web Services and Microservices Chapter 7: Analysis and Modeling with REST Services and Microservices Chapter 8: Service API and Contract Design with Web Services Chapter 9: Service API and Contract Design with REST Services and Microservices Chapter 10: Service API and Contract Versioning with Web Services and REST Services Part III: Appendices Appendix A: Service-Orientation Principles Reference Appendix B: REST Constraints Reference Appendix C: SOA Design Patterns Reference Appendix D: The Annotated SOA Manifesto","language":"en","currency":"USD","id":"0133858693","title":"Service-Oriented Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vMm8DQAAQBAJ&source=gbs_api","authors":["Thomas Erl"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kQqqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.21,"subtitle":null,"description":"A hands-on practical guide disclosing all areas of Enterprise development, covering details about Jakarta EE with lots of examples to be run on the full distribution of WildFly application server or using WildFly Bootable Jar as a Microservice. The first part of the book covers everything from the foundation components (EJB, Servlets, CDI, JPA) to the new technology stack defined in Java Enterprise Edition (now Jakarta EE 8), including the new Batch API, JSON-P API, the Concurrency API,Web Sockets, the JMS 2.0 API, the core Web services stack (Jakarta REST Services, Jakarta SOAP Services). The testing area with Arquillian framework and the Security API is also fully covered in this part. At the end of this part, you will be able to create and deploy Enterprise applications on the top of Jakarta EE 8 runtimes (WildFly 21) and Jakarta EE 9 (WildFly 22 or newer). The second part of the book discusses how to integrate the Jakarta Enterprise API with the Microprofile specification, to provide essential services to develop robust microservices such as the Configuration API, the Health API, the Fault tolerance API, the OpenAPI and Tracing API, the Metrics API, JWT Authentication API and REST Client API. Finally, the third book covers how to build Microservices using WildFly Bootable jar technology and how to deploy them on the cloud with Red Hat OpenShift. What you will learn from this book: - Everything you need to know about Jakarta EE and MicroProfile API - How to set up your development environment to build Enterprise applications and Microservices on the top of WildFly. - How to use Maven plugin to simplify your project scaffolding - Learning the foundation components that constitute the backbone of your applications: EJB, CDI, JPA, JAX-RS, JAX-WS - Learn how to build loosely coupled applications using the straightforward JMS 2.0 API - Learn how to test your applications with Arquillian in a managed environment, remote environment and even on the cloud! - Discover how to develop Concurrent and Compliant Enterprise applications using the Concurrency API and how to define Batch Jobs for your tasks. - Secure applications (Web\/EJB) with standard and custom login modules. How to encrypt the communication of EJB applications and Web applications. - How to enhance your Jakarta EE stack with Microprofile API to build robust Microservices - How to turn your Jakarta EE applications in Microservices using WildFly bootable jar.","language":"en","currency":"USD","id":"8894038963","title":"Practical Enterprise Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kQqqDwAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vMm8DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Analysis and Design for Services and Microservices","description":"The Top-Selling, De Facto Guide to SOA--Now Updated with New Content and Coverage of Microservices! For more than a decade, Thomas Erl’s best-selling Service-Oriented Architecture: Concepts, Technology, and Design has been the definitive end-to-end tutorial on SOA, service-orientation, and service technologies. Now, Erl has thoroughly updated the industry’s de facto guide to SOA to reflect new practices, technologies, and strategies that have emerged through hard-won experience and creative innovation. This Second Edition officially introduces microservices and micro task abstraction as part of service-oriented architecture and its associated service layers. Updated case study examples and illustrations further explain and position the microservice model alongside and in relation to more traditional types of services. Coverage includes: • Easy-to-understand, plain English explanations of SOA and service-orientation fundamentals (as compiled from series titles) • Microservices, micro task abstraction, and containerization • Service delivery lifecycle and associated phases • Analysis and conceptualization of services and microservices • Service API design with REST services, web services, and microservices • Modern service API and contract versioning techniques for web services and REST services • Up-to-date appendices with service-orientation principles, REST constraints, and SOA patterns (including three new patterns) Service-Oriented Architecture: Analysis and Design for Services and Microservices, Second Edition, will be indispensable to application architects, enterprise architects, software developers, and any IT professionals interested in learning about or responsible for designing or implementing modern-day, service-oriented solutions. Chapter 1: Introduction Chapter 2: Case Study Backgrounds Part I: Fundamentals Chapter 3: Understanding Service-Orientation Chapter 4: Understanding SOA Chapter 5: Understanding Layers with Services and Microservices Part II: Service-Oriented Analysis and Design Chapter 6: Analysis and Modeling with Web Services and Microservices Chapter 7: Analysis and Modeling with REST Services and Microservices Chapter 8: Service API and Contract Design with Web Services Chapter 9: Service API and Contract Design with REST Services and Microservices Chapter 10: Service API and Contract Versioning with Web Services and REST Services Part III: Appendices Appendix A: Service-Orientation Principles Reference Appendix B: REST Constraints Reference Appendix C: SOA Design Patterns Reference Appendix D: The Annotated SOA Manifesto","language":"en","currency":"USD","id":"0133858693","title":"Service-Oriented Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vMm8DQAAQBAJ&source=gbs_api","authors":["Thomas Erl"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":849,"thumbnail":"http:\/\/books.google.com\/books\/content?id=N-U5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"An In-Depth Guide to the Spring Framework and Its Tools","description":"Master Spring basics and core topics, and share the authors’ insights and real–world experiences with remoting, Hibernate, and EJB. Beyond the basics, you'll learn how to leverage the Spring Framework to build the various tiers and parts of an enterprise Java application: transactions, web and presentation tiers, deployment, and much more. A full sample application allows you to apply many of the technologies and techniques covered in Pro Spring 5 and see how they work together. This book updates the perennial bestseller with the latest that the new Spring Framework 5 has to offer. Now in its fifth edition, this popular title is by far the most comprehensive and definitive treatment of Spring available. It covers the new functional web framework and interoperability with Java 9. After reading this definitive book, you'll be armed with the power of Spring to build complex Spring applications, top to bottom. The agile, lightweight, open-source Spring Framework continues to be the de facto leading enterprise Java application development framework for today's Java programmers and developers. It works with other leading open-source, agile, and lightweight Java technologies such as Hibernate, Groovy, MyBatis, and more. Spring now works with Java EE and JPA 2 as well. What You'll Learn Discover what’s new in Spring Framework 5 Use the Spring Framework with Java 9 Master data access and transactions Work with the new functional web framework Create microservices and other web services Who This Book Is For Experienced Java and enterprise Java developers and programmers. Some experience with Spring highly recommended.","language":"en","currency":"USD","id":"1484228081","title":"Pro Spring 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=N-U5DwAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina","Rob Harrop","Chris Schaefer","Clarence Ho"]},{"pageCount":1023,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.39,"subtitle":null,"description":"Leverage the power of Spring MVC, Spring Boot, Spring Cloud, and additional popular web frameworks. About This Book Discover key Spring Framework-related technology standards such as Spring core, Spring-AOP, Spring data access frameworks, and Spring testing to develop robust Java applications easily This course is packed with tips and tricks that demonstrate Industry best practices on developing a Spring-MVC-based application Learn how to efficiently build and implement microservices in Spring, and how to use Docker and Mesos to push the boundaries and explore new possibilities Who This Book Is For This course is intended for Java developers interested in building enterprise-level applications with Spring Framework. Prior knowledge of Java programming and web development concepts (and a basic knowledge of XML) is expected. What You Will Learn Understand the architecture of Spring Framework and how to set up the key components of the Spring Application Development Environment Configure Spring Container and manage Spring beans using XML and Annotation Practice Spring AOP concepts such as Aspect, Advice, Pointcut, and Introduction Integrate bean validation and custom validation Use error handling and exception resolving Get to grips with REST-based web service development and Ajax Use Spring Boot to develop microservices Find out how to avoid common pitfalls when developing microservices Get familiar with end-to-end microservices written in Spring Framework and Spring Boot In Detail This carefully designed course aims to get you started with Spring, the most widely adopted Java framework, and then goes on to more advanced topics such as building microservices using Spring Boot within Spring. With additional coverage of popular web frameworks such as Struts, WebWork, Java Server Faces, Tapestry, Docker, and Mesos, you'll have all the skills and expertise you need to build great applications. Starting with the Spring Framework architecture and setting up the key components of the Spring Application Development Environment, you will learn how to configure Spring Container and manage Spring beans using XML and Annotation. Next, you will delve into Spring MVC, which will help you build flexible and loosely coupled web applications. You'll also get to grips with testing applications for reliability. Moving on, this course will help you implement the microservice architecture in Spring Framework, Spring Boot, and Spring Cloud. Written to the latest specifications of Spring, this book will help you build modern, Internet-scale Java applications in no time. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Learning Spring Application Development by Ravi Kant Soni Spring MVC Beginner's Guide - Second Edition by Amuthan Ganeshan Spring Microservices by Rajesh RV Style and approach This is a step-by-step guide for building a complete application and developing scalable microservices using Spring Framework, Spring Boot, and a set of Spring Cloud components","language":"en","currency":"USD","id":"1787282228","title":"Spring: Developing Java Applications for the Enterprise","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SVQoDwAAQBAJ&source=gbs_api","authors":["Ravi Kant Soni","Amuthan Ganeshan","Rajesh RV"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fbHMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":145.6,"subtitle":null,"description":"The Digital Twin Paradigm for Smarter Systems and Environments: The Industry Use Cases, Volume 117, the latest volume in the Advances in Computers series, presents detailed coverage of new advancements in computer hardware, software, theory, design and applications. Chapters vividly illustrate how the emerging discipline of digital twin is strategically contributing to various digital transformation initiatives. Specific chapters cover Demystifying the Digital Twin Paradigm, Digital Twin Technology for \"Smarter Manufacturing\", The Fog Computing\/ Edge Computing to leverage Digital Twin, The industry use cases for the Digital Twin idea, Enabling Digital Twin at the Edge, The Industrial Internet of Things (IIOT), and much more. Provides in-depth descriptions of digital transformation technologies and tools Covers various research accomplishments in this flourishing field of relevance Includes many detailed industry use cases with all the right information","language":"en","currency":"USD","id":"0128187573","title":"The Digital Twin Paradigm for Smarter Systems and Environments: The Industry Use Cases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fbHMDwAAQBAJ&source=gbs_api","authors":[]},{"pageCount":732,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRrRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Full stack web development with .NET Core 3.1 and Angular 9, 3rd Edition","description":"This full-stack guide will help you become fluent in both frontend and backend web development by combining the impressive capabilities of ASP.NET Core 3.1 and Angular 9 from project setup right through the deployment. Furthermore, you will learn to add capabilities like security, testability, and scalability to your apps using expert techniques.","language":"en","currency":"USD","id":"1789611482","title":"ASP.NET Core 3 and Angular 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRrRDwAAQBAJ&source=gbs_api","authors":["Valerio De Sanctis"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fmd-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design and architect highly scalable and robust applications using Go","description":"Understand the principles of software architecture with coverage on SOA, distributed and messaging systems, and database modeling Key Features Gain knowledge of architectural approaches on SOA and microservices for architectural decisions Explore different architectural patterns for building distributed applications Migrate applications written in Java or Python to the Go language Book Description Building software requires careful planning and architectural considerations; Golang was developed with a fresh perspective on building next-generation applications on the cloud with distributed and concurrent computing concerns. Hands-On Software Architecture with Golang starts with a brief introduction to architectural elements, Go, and a case study to demonstrate architectural principles. You'll then move on to look at code-level aspects such as modularity, class design, and constructs specific to Golang and implementation of design patterns. As you make your way through the chapters, you'll explore the core objectives of architecture such as effectively managing complexity, scalability, and reliability of software systems. You'll also work through creating distributed systems and their communication before moving on to modeling and scaling of data. In the concluding chapters, you'll learn to deploy architectures and plan the migration of applications from other languages. By the end of this book, you will have gained insight into various design and architectural patterns, which will enable you to create robust, scalable architecture using Golang. What you will learn Understand architectural paradigms and deep dive into Microservices Design parallelism\/concurrency patterns and learn object-oriented design patterns in Go Explore API-driven systems architecture with introduction to REST and GraphQL standards Build event-driven architectures and make your architectures anti-fragile Engineer scalability and learn how to migrate to Go from other languages Get to grips with deployment considerations with CICD pipeline, cloud deployments, and so on Build an end-to-end e-commerce (travel) application backend in Go Who this book is for Hands-On Software Architecture with Golang is for software developers, architects, and CTOs looking to use Go in their software architecture to build enterprise-grade applications. Programming knowledge of Golang is assumed.","language":"en","currency":"USD","id":"1788625102","title":"Hands-On Software Architecture with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fmd-DwAAQBAJ&source=gbs_api","authors":["Jyotiswarup Raiturkar"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EtlfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Learn how to implement metrics-centric monitoring with Prometheus. This introductory book teaches you how to use Prometheus to monitor hosts, applications, and services. We cover installation, basic monitoring, service discovery, alerting, log monitoring, scaling, and visualization. Includes introducing you to monitoring basics, methodologies and approaches. Learn how to monitor in a metric-centric world including building dynamic thresholds, basic anomaly detection, monitoring aggregation, and federation. We'll look at how to apply modern patterns like Google's Four Golden Signals, the USE method, and the RED method. We cover monitoring Kubernetes, Docker containers, databases, and we look at instrumenting applications and integrating logging. We focus on the particular challenges of monitoring highly dynamic, transitory environments and new architectures like microservices. We focus on monitoring in the Cloud, including looking at service discovery and monitoring for Cloud platforms.","language":"en","currency":"USD","id":"0988820285","title":"Monitoring with Prometheus","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EtlfDwAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxvVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Professionalism, Pragmatism, Pride","description":"Be a Better Developer and Deliver Better Code Despite advanced tools and methodologies, software projects continue to fail. Why? Too many organizations still view software development as just another production line. Too many developers feel that way, too—and they behave accordingly. In The Software Craftsman: Professionalism, Pragmatism, Pride, Sandro Mancuso offers a better and more fulfilling path. If you want to develop software with pride and professionalism; love what you do and do it with excellence; and build a career with autonomy, mastery, and purpose, it starts with the recognition that you are a craftsman. Once you embrace this powerful mindset, you can achieve unprecedented levels of technical excellence and customer satisfaction. Mancuso helped found the world’s largest organization of software craftsmen; now, he shares what he’s learned through inspiring examples and pragmatic advice you can use in your company, your projects, and your career. You will learn Why agile processes aren’t enough and why craftsmanship is crucial to making them work How craftsmanship helps you build software right and helps clients in ways that go beyond code How and when to say “No” and how to provide creative alternatives when you do Why bad code happens to good developers and how to stop creating and justifying it How to make working with legacy code less painful and more productive How to be pragmatic—not dogmatic—about your practices and tools How to lead software craftsmen and attract them to your organization What to avoid when advertising positions, interviewing candidates, and hiring developers How developers and their managers can create a true culture of learning How to drive true technical change and overcome deep patterns of skepticism Sandro Mancuso has coded for startups, software houses, product companies, international consultancies, and investment banks. In October 2013, he cofounded Codurance, a consultancy based on Software Craftsmanship principles and values. His involvement with Software Craftsmanship began in 2010, when he founded the London Software Craftsmanship Community (LSCC), now the world’s largest and most active Software Craftsmanship community, with more than two thousand craftsmen. For the past four years, he has inspired and helped developers to organize Software Craftsmanship communities throughout Europe, the United States, and the rest of the world.","language":"en","currency":"USD","id":"0134052587","title":"The Software Craftsman","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxvVBQAAQBAJ&source=gbs_api","authors":["Sandro Mancuso"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iF2jDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Over 80 proven recipes and techniques for Python web development with Flask, 2nd Edition","description":"Build state-of-the-art web applications quickly and efficiently using Flask and related technologies with Python 3 Key Features Updated to Flask 1.0.3 and Python 3.7 with coverage of Microservices Get the most out of the powerful Flask framework and maintain the flexibility of your design choices Write cleaner and maintainable code with the help of sample apps Book Description Flask, the lightweight Python web framework, is popular due to its powerful modular design that lets you build scalable web apps. With this recipe-based guide, you’ll explore modern solutions and best practices for Flask web development. Updated to the latest version of Flask and Python 3, this second edition of Flask Framework Cookbook moves away from some of the old and obsolete libraries and introduces recipes on bleeding edge technologies. You’ll discover different ways of using Flask to create, deploy, and manage microservices. This Flask Python book starts by covering the different configurations that a Flask application can make use of, and then helps you work with templates and learn about the ORM and view layers. You’ll also be able to write an admin interface and get to grips with debugging and logging errors. Finally, you’ll grasp a variety of deployment and post-deployment techniques for platforms such as Apache, Tornado, and Heroku. By the end of this book, you’ll have gained all the knowledge you need to write Flask applications in the best possible way and scale them using standard industry practices. What you will learn Explore web application development in Flask, right from installation to post-deployment stages Make use of advanced templating and data modeling techniques Discover effective debugging, logging, and error handling techniques in Flask Integrate Flask with different technologies such as Redis, Sentry, and MongoDB Deploy and package Flask applications with Docker and Kubernetes Design scalable microservice architecture using AWS LambdaContinuous integration and Continuous deployment Who this book is for If you are a web developer who wants to learn more about developing scalable and production-ready applications in Flask, this is the book for you. You’ll also find this book useful if you are already aware of Flask's major extensions and want to use them for better application development. Basic Python programming experience along with basic understanding of Flask is assumed.","language":"en","currency":"USD","id":"1789953162","title":"Flask Framework Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iF2jDwAAQBAJ&source=gbs_api","authors":["Shalabh Aggarwal"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dOlODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build fast and resilient network servers and clients by leveraging Rust's memory-safety and concurrency features","description":"Learn to write servers and network clients using Rust’s low-level socket classes with this guide Key Features Build a solid foundation in Rust while also mastering important network programming details Leverage the power of a number of available libraries to perform network operations in Rust Develop a fully functional web server to gain the skills you need, fast Book Description Rust is low-level enough to provide fine-grained control over memory while providing safety through compile-time validation. This makes it uniquely suitable for writing low-level networking applications. This book is divided into three main parts that will take you on an exciting journey of building a fully functional web server. The book starts with a solid introduction to Rust and essential networking concepts. This will lay a foundation for, and set the tone of, the entire book. In the second part, we will take an in-depth look at using Rust for networking software. From client-server networking using sockets to IPv4\/v6, DNS, TCP, UDP, you will also learn about serializing and deserializing data using serde. The book shows how to communicate with REST servers over HTTP. The final part of the book discusses asynchronous network programming using the Tokio stack. Given the importance of security for modern systems, you will see how Rust supports common primitives such as TLS and public-key cryptography. After reading this book, you will be more than confident enough to use Rust to build effective networking software What you will learn Appreciate why networking is important in implementing distributed systems Write a non-asynchronous echo server over TCP that talks to a client over a network Parse JSON and binary data using parser combinators such as nom Write an HTTP client that talks to the server using reqwest Modify an existing Rust HTTTP server and add SSL to it Master asynchronous programming support in Rust Use external packages in a Rust project Who this book is for This book is for software developers who want to write networking software with Rust. A basic familiarity with networking concepts is assumed. Beginner-level knowledge of Rust will help but is not necessary.","language":"en","currency":"USD","id":"1788621719","title":"Network Programming with Rust","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dOlODwAAQBAJ&source=gbs_api","authors":["Abhishek Chanda"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9ebGBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Methods for managing complex software construction following the practices, principles and patterns of Domain-Driven Design with code examples in C# This book presents the philosophy of Domain-Driven Design (DDD) in a down-to-earth and practical manner for experienced developers building applications for complex domains. A focus is placed on the principles and practices of decomposing a complex problem space as well as the implementation patterns and best practices for shaping a maintainable solution space. You will learn how to build effective domain models through the use of tactical patterns and how to retain their integrity by applying the strategic patterns of DDD. Full end-to-end coding examples demonstrate techniques for integrating a decomposed and distributed solution space while coding best practices and patterns advise you on how to architect applications for maintenance and scale. Offers a thorough introduction to the philosophy of DDD for professional developers Includes masses of code and examples of concept in action that other books have only covered theoretically Covers the patterns of CQRS, Messaging, REST, Event Sourcing and Event-Driven Architectures Also ideal for Java developers who want to better understand the implementation of DDD","language":"en","currency":"USD","id":"1118714652","title":"Patterns, Principles, and Practices of Domain-Driven Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9ebGBwAAQBAJ&source=gbs_api","authors":["Scott Millett","Nick Tune"]},{"pageCount":162,"thumbnail":"http:\/\/books.google.com\/books\/content?id=knefDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"A Guide for Busy Developers","description":"Get an in-depth tour of OpenShift, the container-based software deployment and management platform from Red Hat that provides a secure multi-tenant environment for the enterprise. This practical guide describes in detail how OpenShift, building on Kubernetes, enables you to automate the way you create, ship, and run applications in a containerized environment. Author Graham Dumpleton provides the knowledge you need to make the best use of the OpenShift container platform to deploy not only your cloud-native applications, but also more traditional stateful applications. Developers and administrators will learn how to run, access, and manage containers in OpenShift, including how to orchestrate them at scale. Build application container images from source and deploy them Implement and extend application image builders Use incremental and chained builds to accelerate build times Automate builds by using a webhook to link OpenShift to a Git repository Add configuration and secrets to the container as project resources Make an application visible outside the OpenShift cluster Manage persistent storage inside an OpenShift container Monitor application health and manage the application lifecycle This book is a perfect follow-up to OpenShift for Developers: A Guide for Impatient Beginners (O’Reilly).","language":"en","currency":"USD","id":"1491957123","title":"Deploying to OpenShift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=knefDwAAQBAJ&source=gbs_api","authors":["Graham Dumpleton"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9K72DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Grundlagen, Konzepte und Rezepte","description":"Microservices haben viele Vorteile: Effizient mehr Features umsetzen, Software schneller in Produktion bringen, Robustheit und einfache Skalierbarkeit zählen dazu. Aber die Implementierung einer Microservices-Architektur und die Auswahl der notwendigen Technologien sind schwierige Herausforderungen. Dieses Buch zeigt Microservices-Rezepte, die Architekten anpassen und zu einem Microservices-Menü kombinieren können. So kann die Implementierung der Microservices individuell auf die Anforderungen im Projekt angepasst werden. Eberhard Wolff führt zunächst in Microservices, Self-contained Systems, Mikro- und Makro-Architektur und die Migration hin zu Microservices ein. Der zweite Teil zeigt die Microservices-Rezepte: Basis-Technologien wie Docker oder PaaS, Frontend-Integration mit Links, JavaScript oder ESI (Edge Side Includes). Es schließen sich asynchrone Microservices mit Apache Kafka oder REST Atom an. Bei den synchronen Ansätzen bespricht das Buch REST mit dem Netflix-Stack, Consul und Kubernetes. Zu jedem Rezept gibt es Hinweise zu Variations- und Kombinationsmöglichkeiten. Der Ausblick greift den Betrieb von Microservices auf und zeigt außerdem, wie der Leser ganz konkret mit Microservices beginnen kann. Das Buch bietet das technische Rüstzeug, um eine Microservices-Architektur umzusetzen. Demo-Projekte und Anregungen für die Vertiefung im Selbststudium runden das Buch ab.","language":"de","currency":"USD","id":"3960884613","title":"Das Microservices-Praxisbuch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9K72DwAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZZ_6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A deep dive into distributed ledgers, consensus protocols, smart contracts, DApps, cryptocurrencies, Ethereum, and more, 3rd Edition","description":"Mastering Blockchain, Third Edition is the blockchain bible to equip you with extensive knowledge of distributed ledgers, cryptocurrencies, smart contracts, consensus algorithms, cryptography and blockchain platforms such as Ethereum, Bitcoin, and many more.","language":"en","currency":"USD","id":"1839211377","title":"Mastering Blockchain","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZZ_6DwAAQBAJ&source=gbs_api","authors":["Imran Bashir"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JwDJBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":null,"description":"Network Function Virtualization provides an architectural, vendor-neutral level overview of the issues surrounding the large levels of data storage and transmission requirements needed for today's companies, also enumerating the benefits of NFV for the enterprise. Drawing upon years of practical experience, and using numerous examples and an easy-to-understand framework, authors Tom Nadeau and Ken Gary discuss the relevancy of NFV and how it can be effectively used to create and deploy new services. Readers will learn how to determine if network function virtualization is right for their enterprise network, be able to use hands-on, step-by-step guides to design, deploy, and manage NFV in an enterprise, and learn how to evaluate all relevant NFV standards, including ETSI, IETF, Openstack, and Open Daylight. Provides a comprehensive overview of Network Function Virtualization (NFV) Discusses how to determine if network function virtualization is right for an enterprise network Presents an ideal reference for those interested in NFV Network Service Chaining, NSC network address translation (NAT), firewalling, intrusion detection, domain name service (DNS), caching, and software defined networks Includes hands-on, step-by-step guides for designing, deploying, and managing NFV in the enterprise Explains, and contrasts, all relevant NFV standards, including ETSI, IETF, Openstack, and Open Daylight","language":"en","currency":"USD","id":"0128023430","title":"Network Function Virtualization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JwDJBAAAQBAJ&source=gbs_api","authors":["Ken Gray","Thomas D. Nadeau"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rsSoBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"With Isabelle\/HOL","description":"Part I of this book is a practical introduction to working with the Isabelle proof assistant. It teaches you how to write functional programs and inductive definitions and how to prove properties about them in Isabelle’s structured proof language. Part II is an introduction to the semantics of imperative languages with an emphasis on applications like compilers and program analysers. The distinguishing feature is that all the mathematics has been formalised in Isabelle and much of it is executable. Part I focusses on the details of proofs in Isabelle; Part II can be read even without familiarity with Isabelle’s proof language, all proofs are described in detail but informally. The book teaches the reader the art of precise logical reasoning and the practical use of a proof assistant as a surgical tool for formal proofs about computer science artefacts. In this sense it represents a formal approach to computer science, not just semantics. The Isabelle formalisation, including the proofs and accompanying slides, are freely available online, and the book is suitable for graduate students, advanced undergraduate students, and researchers in theoretical computer science and logic.","language":"en","currency":"USD","id":"3319105426","title":"Concrete Semantics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rsSoBQAAQBAJ&source=gbs_api","authors":["Tobias Nipkow","Gerwin Klein"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uzYGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Prepare for the CompTIA CySA+ certification exam with this fully updated self-study resource This highly effective self-study system provides complete coverage of every objective for the challenging CompTIA CySA+ Cybersecurity Analyst exam. You’ll find learning objectives at the beginning of each chapter, exam tips, in-depth explanations, and practice exam questions. All questions closely mirror those on the actual test in content, format, and tone. Designed to help you pass the CS0-002 exam with ease, this definitive guide also serves as an essential on-the-job reference. Covers all exam topics, including: Threat and vulnerability management Threat data and intelligence Vulnerability management, assessment tools, and mitigation Software and systems security Solutions for infrastructure management Software and hardware assurance best practices Security operations and monitoring Proactive threat hunting Automation concepts and technologies Incident response process, procedure, and analysis Compliance and assessment Data privacy and protection Support of organizational risk mitigation Online content includes: 200+ practice questions Interactive performance-based questions Test engine that provides full-length practice exams and customizable quizzes by exam objective","language":"en","currency":"USD","id":"1260464318","title":"CompTIA CySA+ Cybersecurity Analyst Certification All-in-One Exam Guide, Second Edition (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uzYGEAAAQBAJ&source=gbs_api","authors":["Brent Chapman","Fernando Maymi"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jz7EDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In order to remain competitive in today's world, companies need to be able to integrate internally and externally by connecting sensors, customers and partners with the information in their systems of record. In short, they need to integrate with everything. This IBM® Redbooks® publication describes how IBM Application Integration Suite and IBM Messaging portfolio can be used to satisfy the needs of core hybrid integration use cases, accelerating companies in their digital transformation journey. All concepts are explained within the context of these use cases: Joining the API economy Improving productivity Refactoring for innovation The target audience for this book is cloud and integration architects and specialists who are implementing hybrid integration solutions.","language":"en","currency":"USD","id":"0738442267","title":"An Architectural and Practical Guide to IBM Hybrid Integration Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jz7EDQAAQBAJ&source=gbs_api","authors":["Carsten Börnert","Kim Clark","Shahir Daya","Matthieu Debeaux","Gerd Diederichs","Vasfi Gucer","Shamim Hossain","Gary Kean","Carlo Marcoli","Shohei Matsumoto","Amar Shah","Johan Thole","IBM Redbooks"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2HvGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Build 12 real-world applications from scratch using React, React Native, and React 360","description":"Build cross-platform applications of varying complexity for the web, mobile, and VR devices using React tooling Key Features Build React applications at scale using effective React patterns and best practices Explore React features such as Hooks, the Context API, and the Suspense API Extend React’s integration with React Native for building cross-platform mobile apps and games Book Description Developed by Facebook, React is a popular library for building impressive user interfaces. React extends its capabilities to the mobile platform using the React Native framework and integrates with popular web and mobile tools to build scalable applications. React Projects is your guide to learning React development by using modern development patterns and integrating React with powerful web tools such as GraphQL, Expo, and React 360. You'll start building a real-world project right from the first chapter and get hands on with developing scalable applications as you advance to building more complex projects. Throughout the book, you'll use the latest versions of React and React Native to explore features such as Higher Order Components (HOC), Context, and Hooks on multiple platforms, which will help you build full stack web and mobile applications efficiently. Finally, you'll delve into unit testing with Jest to build test-driven apps. By the end of this React book, you'll have developed the skills necessary to start building scalable React apps across web and mobile platforms. What you will learn Create a wide range of applications using various modern React tools and frameworks Discover how React Hooks modernize state management for React apps Develop progressive web applications using React components Build test-driven React applications using the Jest and Enzyme frameworks Understand full stack development using React, Apollo, and GraphQL Perform server-side rendering using React and React Router Design gestures and animations for a cross-platform game using React Native Who this book is for The book is for JavaScript developers who want to explore React tooling and frameworks for building cross-platform applications. Basic knowledge of web development, ECMAScript, and React will assist with understanding key concepts covered in this book.","language":"en","currency":"USD","id":"1789953391","title":"React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2HvGDwAAQBAJ&source=gbs_api","authors":["Roy Derks"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Kez1TGNIBPIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Creating Evolvable Hypermedia Applications","description":"With this concise book, you’ll learn the art of building hypermedia APIs that don’t simply run on the Web, but that actually exist in the Web. You’ll start with the general principles and technologies behind this architectural approach, and then dive hands-on into three fully-functional API examples. Too many APIs rely on concepts rooted in desktop and local area network patterns that don’t scale well—costly solutions that are difficult to maintain over time. This book shows system architects and web developers how to design and implement human- and machine-readable web services that remain stable and flexible as they scale. Learn the H-Factors for representing application metadata across all media types and formats Understand the four basic design elements for authoring hypermedia types Convert a simple read-only XML-based media type into a successful API design Examine the challenges and advantages of designing a hypermedia type with JSON Use HTML5’s rich set of hypermedia controls in the API design process Learn the details of documenting, publishing, and registering media type designs and link-relation types","language":"en","currency":"USD","id":"1449324568","title":"Building Hypermedia APIs with HTML5 and Node","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Kez1TGNIBPIC&source=gbs_api","authors":["Mike Amundsen"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZX0WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":60,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Prepare for the challenging CySA+ certification exam with this money-saving, up-to-date study package Designed as a complete self-study program, this collection offers a variety of proven resources to use in preparation for the latest edition of the CompTIA Cybersecurity Analyst (CySA+) certification exam. Comprised of CompTIA CySA+ Cybersecurity Analyst Certification All-In-One Exam Guide, Second Edition (Exam CS0-002) and CompTIA CySA+ Cybersecurity Analyst Certification Practice Exams (Exam CS0-002), this bundle thoroughly covers every topic on the exam. CompTIA CySA+ Cybersecurity Analyst Certification Bundle, Second Edition (Exam CS0-002) contains more than 800 practice questions that match those on the live exam in content, difficulty, tone, and format. The collection includes detailed explanations of both multiple choice and performance-based questions. This authoritative, cost-effective bundle serves both as a study tool and a valuable on-the-job reference for computer security professionals. •This bundle is 25% cheaper than purchasing the books individually and includes a 10% off the exam voucher offer •Online content includes additional practice questions, a cybersecurity audit checklist, and a quick review guide •Written by a team of recognized cybersecurity experts","language":"en","currency":"USD","id":"1260473821","title":"CompTIA CySA+ Cybersecurity Analyst Certification Bundle (Exam CS0-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZX0WEAAAQBAJ&source=gbs_api","authors":["Brent Chapman","Fernando Maymi","Jeff T. Parker"]},{"pageCount":642,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZK7uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.74,"subtitle":"Level up your container orchestration skills with Kubernetes to build, run, secure, and observe large-scale distributed apps, 3rd Edition","description":"Go beyond simply learning Kubernetes fundamentals and its deployment, and explore more advanced concepts, including serverless computing and service meshes with the latest updates Key Features Master Kubernetes architecture and design to build and deploy secure distributed applications Learn advanced concepts like autoscaling, cluster federation, serverless computing, and service mesh integration for observability Explore Kubernetes 1.18 features and its rich ecosystem of tools like Kubectl, Knative, and Helm Book Description The third edition of Mastering Kubernetes is updated with the latest tools and code enabling you to learn Kubernetes 1.18’s latest features. This book primarily concentrates on diving deeply into complex concepts and Kubernetes best practices to help you master the skills of designing and deploying large clusters on various cloud platforms. The book trains you to run complex stateful microservices on Kubernetes including advanced features such as horizontal pod autoscaling, rolling updates, resource quotas, and persistent storage backend. With the two new chapters, you will gain expertise in serverless computing and utilizing service meshes. As you proceed through the chapters, you will explore different options for network configuration and learn to set up, operate, and troubleshoot Kubernetes networking plugins through real-world use cases. Furthermore, you will understand the mechanisms of custom resource development and its utilization in automation and maintenance workflows. By the end of this Kubernetes book, you will graduate from an intermediate to advanced Kubernetes professional. What you will learn Master the fundamentals of Kubernetes architecture and design Build and run stateful applications and complex microservices on Kubernetes Use tools like Kubectl, secrets, and Helm to manage resources and storage Master Kubernetes Networking with load balancing options like Ingress Achieve high-availability Kubernetes clusters Improve Kubernetes observability with tools like Prometheus, Grafana, and Jaeger Extend Kubernetes working with Kubernetes API, plugins, and webhooks Who this book is for If you are a system administrator or a cloud developer with working knowledge of Kubernetes and are keen to master its advanced features, along with learning everything from building microservices to utilizing service meshes, Mastering Kubernetes is for you. Basic familiarity with networking concepts will be helpful.","language":"en","currency":"USD","id":"1839213086","title":"Mastering Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZK7uDwAAQBAJ&source=gbs_api","authors":["Gigi Sayfan"]},{"pageCount":190,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qYI2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Support Constant Change","description":"The software development ecosystem is constantly changing, providing a constant stream of new tools, frameworks, techniques, and paradigms. Over the past few years, incremental developments in core engineering practices for software development have created the foundations for rethinking how architecture changes over time, along with ways to protect important architectural characteristics as it evolves. This practical guide ties those parts together with a new way to think about architecture and time.","language":"en","currency":"USD","id":"1491986328","title":"Building Evolutionary Architectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qYI2DwAAQBAJ&source=gbs_api","authors":["Neal Ford","Rebecca Parsons","Patrick Kua"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=au1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build production-grade reactive applications and microservices with Spring Boot","description":"Develop diverse real-life projects including most aspects of Spring Boot Key Features Run production-grade based applications using the Spring WebFlux framework Learn to develop high performance, asynchronous applications with Spring Boot Create robust microservice-based applications with Kotlin using Spring Boot Book Description Spring is one of the best tools available on the market for developing web, enterprise, and cloud-ready software. The goal of Spring Boot is to provide a set of tools for quickly building Spring applications that are easy to configure, and that make it easy to create and run production-grade Spring-based applications. Spring Boot 2.0 Projects will get you acquainted with important features of the latest version of this application-building tool and will cover basic, as well as advanced topics. The book starts off by teaching you how to create a web application using Spring Boot, followed by creating a Spring Boot-based simple blog management system that uses Elasticsearch as the data store. As you make your way through the chapters, you’ll build a RESTful web services application using Kotlin and the Spring WebFlux framework. Spring WebFlux is a new framework that helps in creating a reactive application in a functional way. Toward the end of the book, you will build a taxi-hailing API with reactive microservices using Spring Boot and a Twitter clone with a Spring Boot backend. Finally, you’ll learn how to build an asynchronous email formatter. What you will learn Learn the fundamental features of Spring Boot 2.0 Customize Spring Boot 2.0 applications Build a basic web application Use Redis to build a taxi-hailing API Create a simple blog management system and a Twitter clone Develop a reactive RESTful web service with Kotlin using Spring Boot Who this book is for This book is for competent Spring developers who wish to understand how to develop complex yet scalable applications with Spring Boot. You must have a good knowledge of Java programming and be familiar with the basics of Spring.","language":"en","currency":"USD","id":"1789134226","title":"Spring Boot 2.0 Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=au1mDwAAQBAJ&source=gbs_api","authors":["Mohamed Shazin Sadakath"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRl1CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Invoke TDD principles for end-to-end application development with Java About This Book Explore the most popular TDD tools and frameworks and become more proficient in building applications Create applications with better code design, fewer bugs, and higher test coverage, enabling you to get them to market quickly Implement test-driven programming methods into your development workflows Who This Book Is For If you're an experienced Java developer and want to implement more effective methods of programming systems and applications, then this book is for you. What You Will Learn Explore the tools and frameworks required for effective TDD development Perform the Red-Green-Refactor process efficiently, the pillar around which all other TDD procedures are based Master effective unit testing in isolation from the rest of your code Design simple and easily maintainable codes by implementing different techniques Use mocking frameworks and techniques to easily write and quickly execute tests Develop an application to implement behaviour-driven development in conjunction with unit testing Enable and disable features using Feature Toggles In Detail Test-driven development (TDD) is a development approach that relies on a test-first procedure that emphasises writing a test before writing the necessary code, and then refactoring the code to optimize it. The value of performing TDD with Java, one of the most established programming languages, is to improve the productivity of programmers, the maintainability and performance of code, and develop a deeper understanding of the language and how to employ it effectively. Starting with the basics of TDD and reasons why its adoption is beneficial, this book will take you from the first steps of TDD with Java until you are confident enough to embrace the practice in your day-to-day routine. You'll be guided through setting up tools, frameworks, and the environment you need, and will dive right in to hands-on exercises with the goal of mastering one practice, tool, or framework at a time. You'll learn about the Red-Green-Refactor procedure, how to write unit tests, and how to use them as executable documentation. With this book you'll also discover how to design simple and easily maintainable code, work with mocks, utilise behaviour-driven development, refactor old legacy code, and release a half-finished feature to production with feature toggles. You will finish this book with a deep understanding of the test-driven development methodology and the confidence to apply it to application programming with Java. Style and approach An easy-to-follow, hands-on guide to building applications through effective coding practices. This book covers practical examples by introducing different problems, each one designed as a learning exercise to help you understand each aspect of TDD.","language":"en","currency":"USD","id":"178398743X","title":"Test-Driven Java Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRl1CgAAQBAJ&source=gbs_api","authors":["Viktor Farcic","Alex Garcia"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sQh-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, test, and troubleshoot enterprise applications and microservices with Kotlin and Java EE","description":"Build Java Enterprise Applications and learn how Kotlin makes it easier to code them using components like JSF 2.3, Enterprise JavaBeans (EJB) 3.2, Contexts and Dependency Injection (CDI) 2.0, the Java API for WebSockets, JAX-RS 2.1, Servlet 4.0. Key Features An in-depth guide updated with all the latest features of Kotlin 1.2 and Java EE 8 Build microservices in Java EE with the help of Kotlin use cases Explore coroutines, garbage collection, multithreading, memory management and more Book Description Kotlin was developed with a view to solving programmers’ difficulties and operational challenges. This book guides you in making Kotlin and Java EE work in unison to build enterprise-grade applications. Together, they can be used to create services of any size with just a few lines of code and let you focus on the business logic. Kotlin for Enterprise Applications using Java EE begins with a brief tour of Kotlin and helps you understand what makes it a popular and reasonable choice of programming language for application development, followed by its incorporation in the Java EE platform. We will then learn how to build applications using the Java Persistence API (JPA) and Enterprise JavaBeans (EJB), as well as develop RESTful web services and MicroServices. As we work our way through the chapters, we’ll use various performance improvement and monitoring tools for your application and see how they optimize real-world applications. At each step along the way, we will see how easy it is to develop enterprise applications in Kotlin. By the end of this book, we will have learned design patterns and how to implement them using Kotlin. What you will learn Understand Kotlin syntax and appreciate why it’s gaining in popularity Explore the Java EE ecosystem and the APIs in Java EE Implement applications using Kotlin Overcome the challenges of developing the Java EE system using Kotlin Gain insights into Java Message Services (JMS) Build RESTful MicroServices and secure applications Optimize applications with performance and monitoring tools Understand design patterns and implement them Who this book is for Kotlin for Enterprise Applications using Java EE is for Java EE developers who want to build their enterprise project or application with Kotlin or migrate from Java to Kotlin. Basic knowledge of programming is necessary to understand the key concepts covered in this book.","language":"en","currency":"USD","id":"1788994396","title":"Kotlin for Enterprise Applications using Java EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sQh-DwAAQBAJ&source=gbs_api","authors":["Raghavendra Rao K"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fmDwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Securely orchestrate, scale, and manage your microservices in Kubernetes deployments","description":"Kubernetes is a widely used opensource orchestration platform for managing container applications. Developers are not yet aware of the pitfalls of a containerized environment. This book takes you through core security principles, best practices, and real-world use cases to learn mitigation or prevention strategies from known attacks and CVEs.","language":"en","currency":"USD","id":"1839212187","title":"Learn Kubernetes Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fmDwDwAAQBAJ&source=gbs_api","authors":["Kaizhe Huang","Pranjal Jumde"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1ZlUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop, deploy, and configure cloud-based, enterprise Java applications with WildFly Swarm and OpenShift","description":"Create microservices using Java EE technologies with WildFly Swarm,deploy them in the OpenShift cloud, make them resilient to network failures using Hystrix, configure continuous integration using Jenkins, and security using Keycloak. Key Features Create functional microservices with WildFly Swarm Use OpenShift to deploy your microservices in the cloud Make your application production-ready using Jenkins, Hystrix, and Keycloak Book Description The book starts by introducing you to WildFly Swarm—a tool that allows you to create runnable microservices from Java EE components. You’ll learn the basics of Swarm operation—creating microservices containing only the parts of enterprise runtime needed in a specific case. Later, you’ll learn how to configure and test those services. In order to deploy our services in the cloud, we’ll use OpenShift. You’ll get to know basic information on its architecture, features, and relationship to Docker and Kubernetes. Later, you’ll learn how to deploy and configure your services to run in the OpenShift cloud. In the last part of the book, you’ll see how to make your application production-ready. You’ll find out how to configure continuous integration for your services using Jenkins, make your application resistant to network failures using Hystrix, and how to secure them using Keycloak. By the end of the book, you’ll have a functional example application and will have practical knowledge of Java EE cloud development that can be used as a reference in your other projects. What you will learn Utilize Java EE technology to develop modern cloud-enabled applications Easily create microservices with WildFly Swarm using proven Java EE technologies See the benefits of OpenShift – easy deployment of your services, out of the box scalability and healing, and integration with Continuous Integration tools Integrate the sample application with Jenkins’ Continuous Integration server Utilize Hystrix to provide resilience​ to your application Provide security to your application using Keycloak Who this book is for If you're an experienced developer familiar with Java EE technologies and would like to learn how you can use those technologies in the cloud with WildFly and OpenShift, then this book is for you.","language":"en","currency":"USD","id":"1787283801","title":"Hands-On Cloud Development with WildFly","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1ZlUDwAAQBAJ&source=gbs_api","authors":["Tomasz Adamski"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uXoXN-ZhmqMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Principles, Patterns & Constraints for Building Enterprise Solutions with REST","description":"The Definitive Guide to Building Web-Centric SOA with REST The World Wide Web is based on the most successful technology architecture in history. It has changed how we view, access, and exchange information and, with the advent of REST, it has also provided us with compelling ways to build and improve automation solutions. REST provides a great deal of guidance to ensure that an architecture and its automation logic are technically sound, though it is still your responsibility to build services that actually add value to your business. SOA with REST is the first comprehensive tutorial and reference for designing and building RESTful services as part of service-oriented solutions and in conjunction with service-oriented architecture (SOA). This book demonstrates that REST is not only a suitable medium for building truly service-oriented solutions, but also that the service-oriented architectural model is a necessary foundation for REST technology architectures to realize their full business potential. The authors provide thorough mapping of REST constraints and architectural goals with service-orientation principles and SOA characteristics. Using real-world examples, they show how to leverage REST’s simplicity, flexibility, and low overhead without compromising the power or manageability of service-oriented solutions and architectures. This ebook will be valuable to IT architects, developers, and any practitioner seeking to use SOA and REST together.","language":"en","currency":"USD","id":"0132869918","title":"SOA with REST","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uXoXN-ZhmqMC&source=gbs_api","authors":["Thomas Erl","Benjamin Carlyle","Cesare Pautasso","Raj Balasubramanian","Herbj¿rn Wilhelmsen","David Booth"]}]