[{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ota_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Evolutionary Patterns to Transform Your Monolith","description":"How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture. With many illustrative examples, insightful migration patterns, and a bevy of practical advice to transition your monolith enterprise into a microservice operation, this practical guide covers multiple scenarios and strategies for a successful migration, from initial planning all the way through application and database decomposition. You’ll learn several tried and tested patterns and techniques that you can use as you migrate your existing architecture. Ideal for organizations looking to transition to microservices, rather than rebuild Helps companies determine whether to migrate, when to migrate, and where to begin Addresses communication, integration, and the migration of legacy systems Discusses multiple migration patterns and where they apply Provides database migration examples, along with synchronization strategies Explores application decomposition, including several architectural refactoring patterns Delves into details of database decomposition, including the impact of breaking referential and transactional integrity, new failure modes, and more","language":"en","currency":"USD","id":"1492047791","title":"Monolith to Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ota_DwAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zucwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Flexible Software Architecture","description":"The Most Complete, Practical, and Actionable Guide to Microservices Going beyond mere theory and marketing hype, Eberhard Wolff presents all the knowledge you need to capture the full benefits of this emerging paradigm. He illuminates microservice concepts, architectures, and scenarios from a technology-neutral standpoint, and demonstrates how to implement them with today’s leading technologies such as Docker, Java, Spring Boot, the Netflix stack, and Spring Cloud. The author fully explains the benefits and tradeoffs associated with microservices, and guides you through the entire project lifecycle: development, testing, deployment, operations, and more. You’ll find best practices for architecting microservice-based systems, individual microservices, and nanoservices, each illuminated with pragmatic examples. The author supplements opinions based on his experience with concise essays from other experts, enriching your understanding and illuminating areas where experts disagree. Readers are challenged to experiment on their own the concepts explained in the book to gain hands-on experience. Discover what microservices are, and how they differ from other forms of modularization Modernize legacy applications and efficiently build new systems Drive more value from continuous delivery with microservices Learn how microservices differ from SOA Optimize the microservices project lifecycle Plan, visualize, manage, and evolve architecture Integrate and communicate among microservices Apply advanced architectural techniques, including CQRS and Event Sourcing Maximize resilience and stability Operate and monitor microservices in production Build a full implementation with Docker, Java, Spring Boot, the Netflix stack, and Spring Cloud Explore nanoservices with Amazon Lambda, OSGi, Java EE, Vert.x, Erlang, and Seneca Understand microservices’ impact on teams, technical leaders, product owners, and stakeholders Managers will discover better ways to support microservices, and learn how adopting the method affects the entire organization. Developers will master the technical skills and concepts they need to be effective. Architects will gain a deep understanding of key issues in creating or migrating toward microservices, and exactly what it will take to transform their plans into reality.","language":"en","currency":"USD","id":"0134650409","title":"Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zucwDQAAQBAJ&source=gbs_api","authors":["Eberhard Wolff"]},{"pageCount":146,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gf2wDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Aligning Principles, Practices, and Culture","description":"Microservices can have a positive impact on your enterprise—just ask Amazon and Netflix—but you can fall into many traps if you don’t approach them in the right way. This practical guide covers the entire microservices landscape, including the principles, technologies, and methodologies of this unique, modular style of system building. You’ll learn about the experiences of organizations around the globe that have successfully adopted microservices. In three parts, this book explains how these services work and what it means to build an application the Microservices Way. You’ll explore a design-based approach to microservice architecture with guidance for implementing various elements. And you’ll get a set of recipes and practices for meeting practical, organizational, and cultural challenges to microservice adoption. Learn how microservices can help you drive business objectives Examine the principles, practices, and culture that define microservice architectures Explore a model for creating complex systems and a design process for building a microservice architecture Learn the fundamental design concepts for individual microservices Delve into the operational elements of a microservices architecture, including containers and service discovery Discover how to handle the challenges of introducing microservice architecture in your organization","language":"en","currency":"USD","id":"1491956224","title":"Microservice Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gf2wDAAAQBAJ&source=gbs_api","authors":["Irakli Nadareishvili","Ronnie Mitra","Matt McLarty","Mike Amundsen"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RfSeDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Building Standardized Systems Across an Engineering Organization","description":"One of the biggest challenges for organizations that have adopted microservice architecture is the lack of architectural, operational, and organizational standardization. After splitting a monolithic application or building a microservice ecosystem from scratch, many engineers are left wondering what’s next. In this practical book, author Susan Fowler presents a set of microservice standards in depth, drawing from her experience standardizing over a thousand microservices at Uber. You’ll learn how to design microservices that are stable, reliable, scalable, fault tolerant, performant, monitored, documented, and prepared for any catastrophe. Explore production-readiness standards, including: Stability and Reliability: develop, deploy, introduce, and deprecate microservices; protect against dependency failures Scalability and Performance: learn essential components for achieving greater microservice efficiency Fault Tolerance and Catastrophe Preparedness: ensure availability by actively pushing microservices to fail in real time Monitoring: learn how to monitor, log, and display key metrics; establish alerting and on-call procedures Documentation and Understanding: mitigate tradeoffs that come with microservice adoption, including organizational sprawl and technical debt","language":"en","currency":"USD","id":"1491965924","title":"Production-Ready Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RfSeDQAAQBAJ&source=gbs_api","authors":["Susan J. Fowler"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RJfnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Build Event-Driven Architectures with Event Sourcing and CQRS","description":"MVC and CRUD make software easier to write, but harder to change. Microservice-based architectures can help even the smallest of projects remain agile in the long term, but most tutorials meander in theory or completely miss the point of what it means to be microservice-based. Roll up your sleeves with real projects and learn the most important concepts of evented architectures. You'll have your own deployable, testable project and a direction for where to go next. Much ink has been spilled on the topic of microservices, but all of this writing fails to accurately identity what makes a system a monolith, define what microservices are, or give complete, practical examples, so you're probably left thinking they have nothing to offer you. You don't have to be at Google or Facebook scale to benefit from a microservice-based architecture. Microservices will keep even small and medium teams productive by keeping the pieces of your system focused and decoupled. Discover the basics of message-based architectures, render the same state in different shapes to fit the task at hand, and learn what it is that makes something a monolith (it has nothing to do with how many machines you deploy to). Conserve resources by performing background jobs with microservices. Deploy specialized microservices for registration, authentication, payment processing, e-mail, and more. Tune your services by defining appropriate service boundaries. Deploy your services effectively for continuous integration. Master debugging techniques that work across different services. You'll finish with a deployable system and skills you can apply to your current project. Add the responsiveness and flexibility of microservices to your project, no matter what the size or complexity. What You Need: While the principles of this book transcend programming language, the code examples are in Node.js because JavaScript, for better or worse, is widely read. You'll use PostgreSQL for data storage, so familiarity with it is a plus. The books does provide Docker images to make working with PostgreSQL a bit easier, but extensive Docker knowledge is not required.","language":"en","currency":"USD","id":"1680507796","title":"Practical Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RJfnDwAAQBAJ&source=gbs_api","authors":["Ethan Garofolo"]},{"pageCount":422,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qfd5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"Designing, Developing, and Deploying","description":"Understand the key challenges and solutions around building microservices in the enterprise application environment. This book provides a comprehensive understanding of microservices architectural principles and how to use microservices in real-world scenarios. Architectural challenges using microservices with service integration and API management are presented and you learn how to eliminate the use of centralized integration products such as the enterprise service bus (ESB) through the use of composite\/integration microservices. Concepts in the book are supported with use cases, and emphasis is put on the reality that most of you are implementing in a “brownfield” environment in which you must implement microservices alongside legacy applications with minimal disruption to your business. Microservices for the Enterprise covers state-of-the-art techniques around microservices messaging, service development and description, service discovery, governance, and data management technologies and guides you through the microservices design process. Also included is the importance of organizing services as core versus atomic, composite versus integration, and API versus edge, and how such organization helps to eliminate the use of a central ESB and expose services through an API gateway. What You'll Learn Design and develop microservices architectures with confidence Put into practice the most modern techniques around messaging technologies Apply the Service Mesh pattern to overcome inter-service communication challenges Apply battle-tested microservices security patterns to address real-world scenarios Handle API management, decentralized data management, and observability Who This Book Is For Developers and DevOps engineers responsible for implementing applications around a microservices architecture, and architects and analysts who are designing such systems","language":"en","currency":"USD","id":"1484238583","title":"Microservices for the Enterprise","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qfd5DwAAQBAJ&source=gbs_api","authors":["Kasun Indrasiri","Prabath Siriwardena"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WqjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":"Science and Engineering","description":"This book describes in contributions by scientists and practitioners the development of scientific concepts, technologies, engineering techniques and tools for a service-based society. The focus is on microservices, i.e cohesive, independent processes deployed in isolation and equipped with dedicated memory persistence tools, which interact via messages. The book is structured in six parts. Part 1 “Opening” analyzes the new (and old) challenges including service design and specification, data integrity, and consistency management and provides the introductory information needed to successfully digest the remaining parts. Part 2 “Migration” discusses the issue of migration from monoliths to microservices and their loosely coupled architecture. Part 3 “Modeling” introduces a catalog and a taxonomy of the most common microservices anti-patterns and identifies common problems. It also explains the concept of RESTful conversations and presents insights from studying and developing two further modeling approaches. Next , Part 4 is dedicated to various aspects of “Development and Deployment”. Part 5 then covers “Applications” of microservices, presenting case studies from Industry 4.0, Netflix, and customized SaaS examples. Eventually, Part 6 focuses on “Education” and reports on experiences made in special programs, both at academic level as a master program course and for practitioners in an industrial training. As only a joint effort between academia and industry can lead to the release of modern paradigm-based programming languages, and subsequently to the deployment of robust and scalable software systems, the book mainly targets researchers in academia and industry who develop tools and applications for microservices.","language":"en","currency":"USD","id":"3030316467","title":"Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WqjDDwAAQBAJ&source=gbs_api","authors":["Antonio Bucchiarone","Nicola Dragoni","Schahram Dustdar","Patricia Lago","Manuel Mazzara","Victor Rivera","Andrey Sadovykh"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eOZyCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. They communicate with each other using language-neutral protocols, such as Representational State Transfer (REST), or messaging applications, such as IBM® MQ Light. This IBM Redbooks® publication gives a broad understanding of this increasingly popular architectural style, and provides some real-life examples of how you can develop applications using the microservices approach with IBM BluemixTM. The source code for all of these sample scenarios can be found on GitHub (https:\/\/github.com\/). The book also presents some case studies from IBM products. We explain the architectural decisions made, our experiences, and lessons learned when redesigning these products using the microservices approach. Information technology (IT) professionals interested in learning about microservices and how to develop or redesign an application in Bluemix using microservices can benefit from this book.","language":"en","currency":"USD","id":"0738440817","title":"Microservices from Theory to Practice: Creating Applications in IBM Bluemix Using the Microservices Approach","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eOZyCgAAQBAJ&source=gbs_api","authors":["Shahir Daya","Nguyen Van Duy","Kameswara Eati","Carlos M Ferreira","Dejan Glozic","Vasfi Gucer","Manav Gupta","Sunil Joshi","Valerie Lampkin","Marcelo Martins","Shishir Narain","Ramratan Vennam","IBM Redbooks"]},{"pageCount":181,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i_onDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Hands-on Approach to Microservice Infrastructure and Tooling","description":"Use the many types of tools required to navigate and maintain a microservice ecosystem. This book examines what is normally a complex system of interconnected services and clarifies them one at a time, first examining theoretical requirements then looking at concrete tools, configuration, and workflows. Building out these systems includes many concerns such as containerization, container orchestration, build pipelines and continuous integration solutions, automated testing, service discovery, logging and analytics. You will examine each of these tools and understand how they can be combined within an organization. You will design an automated build pipeline from Pull Request to container deployment, understand how to achieve High Availability and monitor application health with Service Discovery, and learn how to collaborate with other teams, write documentation, and describe bugs. Covering use of Jenkins, Docker, Kubernetes, the ELK stack (Elasticsearch, Logstash, and Kibana), and StatsD and Grafana for analytics, you will build on your existing knowledge of Service-Oriented Architecture and gain an advanced, practical understanding of everything from infrastructure development to team collaboration. What You'll Learn Design an API to be convenient for developers to consume. Deploy dynamic instances of Microservices and allow then to discover each other. Track the health of a Microservice and be notified in case of degraded performance. Write effective documentation and communicate efficiently with other teams. Who This Book Is For Those who would like a better understanding of System Oriented Architecture. Those who would like to break a monolith into smaller Microservices. Those who are familiar with Microservices and would like a better understanding of peripheral technologies.","language":"en","currency":"USD","id":"1484228871","title":"Advanced Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i_onDwAAQBAJ&source=gbs_api","authors":["Thomas Hunter II"]},{"pageCount":668,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QFqxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build and deploy Java microservices using Spring Cloud, Istio, and Kubernetes","description":"Apply microservices patterns to build resilient and scalable distributed systems Key Features Understand the challenges of building large-scale microservice landscapes Build cloud-native production-ready microservices with this comprehensive guide Discover how to get the best out of Spring Cloud, Kubernetes, and Istio when used together Book Description Microservices architecture allows developers to build and maintain applications with ease, and enterprises are rapidly adopting it to build software using Spring Boot as their default framework. With this book, you’ll learn how to efficiently build and deploy microservices using Spring Boot. This microservices book will take you through tried and tested approaches to building distributed systems and implementing microservices architecture in your organization. Starting with a set of simple cooperating microservices developed using Spring Boot, you’ll learn how you can add functionalities such as persistence, make your microservices reactive, and describe their APIs using Swagger\/OpenAPI. As you advance, you’ll understand how to add different services from Spring Cloud to your microservice system. The book also demonstrates how to deploy your microservices using Kubernetes and manage them with Istio for improved security and traffic management. Finally, you’ll explore centralized log management using the EFK stack and monitor microservices using Prometheus and Grafana. By the end of this book, you’ll be able to build microservices that are scalable and robust using Spring Boot and Spring Cloud. What you will learn Build reactive microservices using Spring Boot Develop resilient and scalable microservices using Spring Cloud Use OAuth 2.0\/OIDC and Spring Security to protect public APIs Implement Docker to bridge the gap between development, testing, and production Deploy and manage microservices using Kubernetes Apply Istio for improved security, observability, and traffic management Who this book is for This book is for Java and Spring developers and architects who want to learn how to break up their existing monoliths into microservices and deploy them either on-premises or in the cloud using Kubernetes as a container orchestrator and Istio as a service Mesh. No familiarity with microservices architecture is required to get started with this book.","language":"en","currency":"USD","id":"1789613523","title":"Hands-On Microservices with Spring Boot and Spring Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QFqxDwAAQBAJ&source=gbs_api","authors":["Magnus Larsson"]},{"pageCount":294,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XHatDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.96,"subtitle":"Paradigms, Applications, and Techniques","description":"Microservices architecture (MSA) is increasingly popular with software architects and engineers as it accelerates software solution design, development, and deployment in a risk-free manner. Placing a software system into a production environment is elegantly simplified and sped up with the use of MSA development platforms, runtime environments, acceleration engines, design patterns, integrated frameworks, and related tools. The MSA ecosystem is expanding with third-party products that automate as many tasks as possible. MSA is being positioned as the enterprise-grade and agile-application design method. This book covers in-depth the features and facilities that make up the MSA ecosystem. Beginning with an overview of Service-Oriented Architecture (SOA) that covers the Common Object Request Broker Architecture (CORBA), Distributed Component Object Model (DCOM), and Remote Method Invocation (RMI), the book explains the basic essentials of MSA and the continuous delivery of applications to customers. The book gives software developers insight into: Current and emerging communication models Key architectural elements of MSA-based applications Designing efficient APIs for microservices MSA middleware platforms such as REST, SOAP, Apache Thrift, and gRPC Microservice discovery and the API gateway Service orchestration and choreography for composing individual services to achieve a useful business process Database transactions in MSA-centric applications Design, composition, security, and deployment patterns MSA security Modernizing legacy applications The book concludes with a chapter on composing and building powerful microservices. With the exponential growth of IoT devices, microservices are being developed and deployed on resource-constrained but resource-intensive devices in order to provide people-centric applications. The book discusses the challenges of these applications. Finally, the book looks at the role of microservices in smart environments and upcoming trends including ubiquitous yet disappearing microservices.","language":"en","currency":"USD","id":"1000617564","title":"Essentials of Microservices Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XHatDwAAQBAJ&source=gbs_api","authors":["Chellammal Surianarayanan","Gopinath Ganapathy","Raj Pethuru"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B-dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Your one-stop guide to the common patterns and practices, showing you how to apply these using the Go programming language About This Book This short, concise, and practical guide is packed with real-world examples of building microservices with Go It is easy to read and will benefit smaller teams who want to extend the functionality of their existing systems Using this practical approach will save your money in terms of maintaining a monolithic architecture and demonstrate capabilities in ease of use Who This Book Is For You should have a working knowledge of programming in Go, including writing and compiling basic applications. However, no knowledge of RESTful architecture, microservices, or web services is expected. If you are looking to apply techniques to your own projects, taking your first steps into microservice architecture, this book is for you. What You Will Learn Plan a microservice architecture and design a microservice Write a microservice with a RESTful API and a database Understand the common idioms and common patterns in microservices architecture Leverage tools and automation that helps microservices become horizontally scalable Get a grounding in containerization with Docker and Docker-Compose, which will greatly accelerate your development lifecycle Manage and secure Microservices at scale with monitoring, logging, service discovery, and automation Test microservices and integrate API tests in Go In Detail Microservice architecture is sweeping the world as the de facto pattern to build web-based applications. Golang is a language particularly well suited to building them. Its strong community, encouragement of idiomatic style, and statically-linked binary artifacts make integrating it with other technologies and managing microservices at scale consistent and intuitive. This book will teach you the common patterns and practices, showing you how to apply these using the Go programming language. It will teach you the fundamental concepts of architectural design and RESTful communication, and show you patterns that provide manageable code that is supportable in development and at scale in production. We will provide you with examples on how to put these concepts and patterns into practice with Go. Whether you are planning a new application or working in an existing monolith, this book will explain and illustrate with practical examples how teams of all sizes can start solving problems with microservices. It will help you understand Docker and Docker-Compose and how it can be used to isolate microservice dependencies and build environments. We finish off by showing you various techniques to monitor, test, and secure your microservices. By the end, you will know the benefits of system resilience of a microservice and the advantages of Go stack. Style and approach The step-by-step tutorial focuses on building microservices. Each chapter expands upon the previous one, teaching you the main skills and techniques required to be a successful microservice practitioner.","language":"en","currency":"USD","id":"1786469790","title":"Building Microservices with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B-dDDwAAQBAJ&source=gbs_api","authors":["Nic Jackson"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Transit from monolithic architectures to highly available, scalable, and fault-tolerant microservices About This Book Build your own applications based on event-driven microservices and set them up on a production server. Successfully transform any monolithic application into a microservice. Monitor the health of your application, prevent downtime, and reduce costs. Who This Book Is For PHP developers who want to build scalable, highly available, and secure applications will find this book useful. No knowledge of microservices is assumed. What You Will Learn Set up a development environment using the right strategies and tools. Learn about application design and structure to start implementing your application. Transform a monolithic application into microservices. Explore the best way to start implementing your application using testing. Understand how to monitor your microservices, handle errors, and debug the application. Deploy your finished application into a production environment and learn how to solve common problems. Know how to scale your application based on microservices once it is up–and-running. In Detail The world is moving away from bulky, unreliable, and high-maintenance PHP applications, to small, easy-to-maintain and highly available microservices and the pressing need is for PHP developers to understand the criticalities in building effective microservices that scale at large. This book will be a reliable resource, and one that will help you to develop your skills and teach you techniques for building reliable microservices in PHP. The book begins with an introduction to the world of microservices, and quickly shows you how to set up a development environment and build a basic platform using Docker and Vagrant. You will then get into the different design aspects to be considered while building microservices in your favorite framework and you will explore topics such as testing, securing, and deploying microservices. You will also understand how to migrate a monolithic application to the microservice architecture while keeping scalability and best practices in mind. Furthermore you will get into a few important DevOps techniques that will help you progress on to more complex domains such as native cloud development, as well as some interesting design patterns. By the end of this book you will be able to develop applications based on microservices in an organized and efficient way. You will also gain the knowledge to transform any monolithic applications into microservices. Style and approach Filled with code that you can start typing straightaway, this book will take you through building, testing, securing, and deploying microservices in the most practical way possible. The focus of the book is more inclined towards showing you how it's done, rather than with what to do, although you will get a good idea of those tools most widely used to build microservices.","language":"en","currency":"USD","id":"1787124037","title":"PHP Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLkrDwAAQBAJ&source=gbs_api","authors":["Carlos Perez Sanchez","Pablo Solar Vilarino"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A2dCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"A Practical Approach to RESTful Services using RabbitMQ, Eureka, Ribbon, Zuul and Cucumber","description":"Build a microservices architecture with Spring Boot, by evolving an application from a small monolith to an event-driven architecture composed of several services. This book follows an incremental approach to teach microservice structure, test-driven development, Eureka, Ribbon, Zuul, and end-to-end tests with Cucumber. Author Moises Macero follows a very pragmatic approach to explain the benefits of using this type of software architecture, instead of keeping you distracted with theoretical concepts. He covers some of the state-of-the-art techniques in computer programming, from a practical point of view. You’ll focus on what's important, starting with the minimum viable product but keeping the flexibility to evolve it. What You'll Learn Build microservices with Spring Boot Use event-driven architecture and messaging with RabbitMQ Create RESTful services with Spring Master service discovery with Eureka and load balancing with Ribbon Route requests with Zuul as your API gateway Write end-to-end rests for an event-driven architecture using Cucumber Carry out continuous integration and deployment Who This Book Is For Those with at least some prior experience with Java programming. Some prior exposure to Spring Boot recommended but not required.","language":"en","currency":"USD","id":"1484231651","title":"Learn Microservices with Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A2dCDwAAQBAJ&source=gbs_api","authors":["Moises Macero"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BxvUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Build microservices for mobile and web applications using Swift 5 and Vapor 4","description":"Learn to design and deploy fully functioning microservices for your applications from scratch using Swift, Docker, and AWS Key Features Understand server-side Swift development concepts for building your first microservice Build microservices using Vapor 4 and deploy them to the cloud using Docker Learn effective techniques for enhancing maintainability and stability of your Swift applications Book Description The capabilities of the Swift programming language are extended to server-side development using popular frameworks such as Vapor. This enables Swift programmers to implement the microservices approach to design scalable and easy-to-maintain architecture for iOS, macOS, iPadOS, and watchOS applications. This book is a complete guide to building microservices for iOS applications. You’ll start by examining Swift and Vapor as backend technologies and compare them to their alternatives. The book then covers the concept of microservices to help you get started with developing your first microservice. Throughout this book, you’ll work on a case study of writing an e-commerce backend as a microservice application. You’ll understand each microservice as it is broken down into details and written out as code throughout the book. You’ll also become familiar with various aspects of server-side development such as scalability, database options, and information flow for microservices that are unwrapped in the process. As you advance, you’ll get to grips with microservices testing and see how it is different from testing a monolith application. Along the way, you’ll explore tools such as Docker, Postman, and Amazon Web Services. By the end of the book, you’ll be able to build a ready-to-deploy application that can be used as a base for future applications. What you will learn Grasp server-side Swift development concepts using practical examples Understand the microservices approach and why Swift is a great choice for building microservices Design and structure mobile and web applications using microservices architecture Discover the available database options and understand which one to choose Scale and monitor your microservices Use Postman to automate testing for your microservices API Who this book is for The book is for iOS, iPadOS, and macOS developers and Swift programmers who want to understand how Swift can be used for building microservices. The book assumes familiarity with Swift programming and the fundamentals of the web, including how APIs work.","language":"en","currency":"USD","id":"1789534836","title":"Hands-On Swift 5 Microservices Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BxvUDwAAQBAJ&source=gbs_api","authors":["Ralph Kuepper"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oe-KDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":null,"description":"This book predominately covers Microservices architecture with real-world example which can help professionals with ease of adoption of this technology. Following the trend of modularity in real world, the idea behind Microservice by Examples is to allow developers to build their applications from various independent components which can be easily changed, removed or upgraded. Also, it is relevant now because of enterprises are moving towards DevOps\/ Modernization, this book will emphasize on containers and Dockers as well.","language":"en","currency":"USD","id":"9387284581","title":"Microservice by examples using .NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oe-KDwAAQBAJ&source=gbs_api","authors":["Pujarini Mohapatra, Biswa"]},{"pageCount":99998,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SJZRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Transition to Microservices and DevOps to Transform Your Software Development Effectiveness Thanks to the tech sector’s latest game-changing innovations—the Internet of Things (IoT), software-enabled networking, and software as a service (SaaS), to name a few—there is now a seemingly insatiable demand for platforms and architectures that can improve the process of application development and deployment. In Microservices and Containers, longtime systems architect and engineering team leader Parminder Kocher analyzes two of the hottest new technology trends: microservices and containers. Together, as Kocher demonstrates, microservices and Docker containers can bring unprecedented agility and scalability to application development and deployment, especially in large, complex projects where speed is crucial but small errors can be disastrous. Learn how to leverage microservices and Docker to drive modular architectural design, on-demand scalability, application performance and reliability, time-to-market, code reuse, and exponential improvements in DevOps effectiveness. Kocher offers detailed guidance and a complete roadmap for transitioning from monolithic architectures, as well as an in-depth case study that walks the reader through the migration of an enterprise-class SOA system. Understand how microservices enable you to organize applications into standalone components that are easier to manage, update, and scale Decide whether microservices and containers are worth your investment, and manage the organizational learning curve associated with them Apply best practices for interprocess communication among microservices Migrate monolithic systems in an orderly fashion Understand Docker containers, installation, and interfaces Network, orchestrate, and manage Docker containers effectively Use Docker to maximize scalability in microservices-based applications Apply your learning with an in-depth, hands-on case study Whether you are a software architect\/developer or systems professional looking to move on from older approaches or a manager trying to maximize the business value of these technologies, Microservices and Containers will be an invaluable addition to your library. Register your product at informit.com\/register for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134597451","title":"Microservices and Containers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SJZRDwAAQBAJ&source=gbs_api","authors":["Parminder Singh Kocher"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9szjCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Leveraging DevOps and Microservice Architecture to deliver SaaS Solutions","description":"This book provides practical guidance for adopting a high velocity, continuous delivery process to create reliable, scalable, Software-as-a-Service (SaaS) solutions that are designed and built using a microservice architecture, deployed to the Azure cloud, and managed through automation. Microservices, IoT, and Azure offers software developers, architects, and operations engineers’ step-by-step directions for building SaaS applications—applications that are available 24x7, work on any device, scale elastically, and are resilient to change--through code, script, exercises, and a working reference implementation. The book provides a working definition of microservices and contrasts this approach with traditional monolithic Layered Architecture. A fictitious, homebiomedical startup is used to demonstrate microservice architecture and automation capabilities for cross-cutting and business services as well as connected device scenarios for Internet of Things (IoT). Several Azure PaaS services are detailed including Storage, SQL Database, DocumentDb, Redis Cache, Cloud Services, Web API's, API Management, IoT Hub, IoT Suite, Event Hub, and Stream Analytics. Finally the book looks to the future and examines Service Fabric to see how microservices are becoming the de facto approach to building reliable software in the cloud. In this book, you’ll learn: What microservices are and why are they’re a compelling architecture pattern for SaaS applications How to design, develop, and deploy microservices using Visual Studio, PowerShell, and Azure Microservice patterns for cross-cutting concerns and business capabilities Microservice patterns for Internet of Things and big data analytics solutions using IoT Hub, Event Hub, and Stream Analytics Techniques for automating microservice provisioning, building, and deployment What Service Fabric is and how it’s the future direction for microservices on Microsoft Azure","language":"en","currency":"USD","id":"1484212754","title":"Microservices, IoT and Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9szjCgAAQBAJ&source=gbs_api","authors":["Bob Familiar"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bEGjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Designing, Developing, Deploying, and Monitoring","description":"Implement microservices starting with their architecture and moving on to their deployment, manageability, security, and monitoring. This book focuses on the key scenarios where microservices architecture is preferred over a monolithic architecture. Building Microservices Applications on Microsoft Azure begins with a survey of microservices architecture compared to monolithic architecture and covers microservices implementation in detail. You'll see the key scenarios where microservices architecture is preferred over a monolithic approach. From there, you will explore the critical components and various deployment options of microservices on platforms such as Microsoft Azure (public cloud) and Azure Stack (hybrid cloud). This includes in-depth coverage of developing, deploying, and monitoring microservices on containers and orchestrating with Azure Service Fabric and Azure Kubernetes Cluster (AKS). This book includes practical experience from large-scale enterprise deployments, therefore it can be a quick reference for solution architects and developers to understand the critical factors while designing a microservices application. What You Will Learn Explore the use cases of microservices and monolithic architecture Discover the architecture patterns to build scalable, agile, and secure microservices applications Develop and deploy microservices using Azure Service Fabric and Azure Kubernetes Service Secure microservices using the gateway pattern See the deployment options for Microservices on Azure Stack Implement database patterns to handle the complexities introduced by microservices Who This Book Is For Architects and consultants who work on Microsoft Azure and manage large-scale deployments.","language":"en","currency":"USD","id":"1484248287","title":"Building Microservices Applications on Microsoft Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bEGjDwAAQBAJ&source=gbs_api","authors":["Harsh Chawla","Hemant Kathuria"]},{"pageCount":436,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pwNwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build scalable microservices with Spring, Docker, and Mesos About This Book Learn how to efficiently build and implement microservices in Spring, and how to use Docker and Mesos to push the boundaries of what you thought possible Examine a number of real-world use cases and hands-on code examples. Distribute your microservices in a completely new way Who This Book Is For If you are a Spring developers and want to build cloud-ready, internet-scale applications to meet modern business demands, then this book is for you Developers will understand how to build simple Restful services and organically grow them to truly enterprise grade microservices ecosystems. What You Will Learn Get to know the microservices development lifecycle process See how to implement microservices governance Familiarize yourself with the microservices architecture and its benefits Use Spring Boot to develop microservices Find out how to avoid common pitfalls when developing microservices Be introduced to end-to-end microservices written in Spring Framework and Spring Boot In Detail The Spring Framework is an application framework and inversion of the control container for the Java platform. The framework's core features can be used by any Java application, but there are extensions to build web applications on top of the Java EE platform. This book will help you implement the microservice architecture in Spring Framework, Spring Boot, and Spring Cloud. Written to the latest specifications of Spring, you'll be able to build modern, Internet-scale Java applications in no time. We would start off with the guidelines to implement responsive microservices at scale. We will then deep dive into Spring Boot, Spring Cloud, Docker, Mesos, and Marathon. Next you will understand how Spring Boot is used to deploy autonomous services, server-less by removing the need to have a heavy-weight application server. Later you will learn how to go further by deploying your microservices to Docker and manage it with Mesos. By the end of the book, you'll will gain more clarity on how to implement microservices using Spring Framework and use them in Internet-scale deployments through real-world examples. Style and approach The book follows a step by step approach on how to develop microservices using Spring Framework, Spring Boot, and a set of Spring Cloud components that will help you scale your applications.","language":"en","currency":"USD","id":"1786464683","title":"Spring Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pwNwDQAAQBAJ&source=gbs_api","authors":["Rajesh RV"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4YOxDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Build robust and scalable software from the start","description":"Learn what a microservices architecture is, its advantages, and why you should consider using one when starting a new application. The book describes how taking a microservices approach from the start helps avoid the complexity and expense of moving to a service-oriented approach after applications reach a critical code base size or traffic load. Microservices from Day One discusses many of the decisions you face when adopting a service-oriented approach and defines a set of rules to follow for easily adopting microservices. The book provides simple guidelines and tips for dividing a problem domain into services. It also describes best practices for documenting and generating APIs and client libraries, testing applications with service dependencies, optimizing services for client performance, and much more. Throughout the book, you will follow the development of a sample project to see how to apply the best practices described. What You Will Learn: Apply guidelines and best practices for developing projects that use microservices Define a practical microservices architecture at the beginning of a project that allows for fast development Define and build APIs based on real-world best practices Build services that easily scale by using tools available in most programming languages Test applications in a distributed environment Who This Book is For: Software engineers and web developers who have heard about microservices, and want to either move the project\/applications they work on to a service-oriented environment, or want to start a new project knowing that building services helps with ease of scaling and maintainability. The book is a reference for developers who have a desire to build software in smaller, more focused and manageable chunks, but do not know how to get started.","language":"en","currency":"USD","id":"1484219376","title":"Microservices From Day One","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4YOxDQAAQBAJ&source=gbs_api","authors":["Cloves Carneiro Jr.","Tim Schmelmer"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JOHcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Structuring, Deploying and Managing the Microservices Architecture with Django","description":"A step-by-step that will help you build Microservices architecture using Django and Python KEY FEATURES - Understand in-depth the fundamentals of Microservices - Learn how to create and use Django APIs - Use web technology such as Nginx, Gunicorn, UWSGI, and Postgresql to deploy a Django project DESCRIPTION Microservices architectures solve the multiple problems of software architecture. Django is a full-stack development framework, written in python. This book includes everything necessary for web application development; from the user views to the information storage: model, persistence, relationships, controllers, forms, validations, rest API and a very useful back office. Furthermore, the book will show how to build production-ready microservices. It will help you create restful APIs and get familiar with Redis and Celery. Towards the end, the book will show how to secure these services and deploy these microservices using Django. Lastly, it will show how to scale our services. WHAT WILL YOU LEARN - Understand the basics of Python, Django, and Microservices - Learn how to deploy Microservices with Django - Get familiar with Microservices Architecture - Designing, Principles, and Requirements - Implement Asynchronous task, JWT API Authentication and AWS Serverless with Microservice architecture WHO THIS BOOK IS FOR This book is for those beginners who want to make their careers in software development. It starts from the basics of python and Django, takes the reader to the Microservices architecture. Table of Contents 1. Basic of Python 2. Major Pillars of OOPS with Python 3. Getting Started with Django 4. API Development with Django 5. Database Modeling with Django 6. First Django API Deployment on Web 7. Django Project Deployment on various web servers 8. What are Microservices 9. Designing Microservice Systems 10. Service Authentication 11. Microservices Deployment With Django 12. JWT Auth Service 13. Asynchronous Tasks 14. AWS Serverless 15. How to Adopt Microservices in Practice","language":"en","currency":"USD","id":"9389328799","title":"Designing Microservices Using Django","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JOHcDwAAQBAJ&source=gbs_api","authors":["Shayank Jain"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z8t1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A performance engineer’s guide to the continuous testing and monitoring of microservices","description":"Learn and implement various techniques related to testing, monitoring and optimization for microservices architecture. Key Features Learn different approaches for testing microservices to design and implement, robust and secure applications Become more efficient while working with microservices Explore Testing and Monitoring tools such as JMeter, Ready API,and AppDynamics Book Description Microservices are the latest \"right\" way of developing web applications. Microservices architecture has been gaining momentum over the past few years, but once you've started down the microservices path, you need to test and optimize the services. This book focuses on exploring various testing, monitoring, and optimization techniques for microservices. The book starts with the evolution of software architecture style, from monolithic to virtualized, to microservices architecture. Then you will explore methods to deploy microservices and various implementation patterns. With the help of a real-world example, you will understand how external APIs help product developers to focus on core competencies. After that, you will learn testing techniques, such as Unit Testing, Integration Testing, Functional Testing, and Load Testing. Next, you will explore performance testing tools, such as JMeter, and Gatling. Then, we deep dive into monitoring techniques and learn performance benchmarking of the various architectural components. For this, you will explore monitoring tools such as Appdynamics, Dynatrace, AWS CloudWatch, and Nagios. Finally, you will learn to identify, address, and report various performance issues related to microservices. What you will learn Understand the architecture of microservices and how to build services Establish how external APIs help to accelerate the development process Understand testing techniques, such as unit testing, integration testing, end-to-end testing, and UI\/functional testing Explore various tools related to the performance testing, monitoring, and optimization of microservices Design strategies for performance testing Identify performance issues and fine-tune performance Who this book is for This book is for developers who are involved with microservices architecture to develop robust and secure applications. Basic knowledge of microservices is essential in order to get the most out of this book.","language":"en","currency":"USD","id":"178913840X","title":"Hands-On Microservices – Monitoring and Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z8t1DwAAQBAJ&source=gbs_api","authors":["Dinesh Rajput"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KdSrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. This IBM® Redbooks® publication covers Microservices best practices for Java. It focuses on creating cloud native applications using the latest version of IBM WebSphere® Application Server Liberty, IBM Bluemix® and other Open Source Frameworks in the Microservices ecosystem to highlight Microservices best practices for Java.","language":"en","currency":"USD","id":"0738442275","title":"Microservices Best Practices for Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KdSrDQAAQBAJ&source=gbs_api","authors":["Michael Hofmann","Erin Schnabel","Katherine Stanley","IBM Redbooks"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X7DpD5g3VP8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":35.09,"subtitle":null,"description":"“For software developers of all experience levels looking to improve their results, and design and implement domain-driven enterprise applications consistently with the best current state of professional practice, Implementing Domain-Driven Design will impart a treasure trove of knowledge hard won within the DDD and enterprise application architecture communities over the last couple decades.” –Randy Stafford, Architect At-Large, Oracle Coherence Product Development “This book is a must-read for anybody looking to put DDD into practice.” –Udi Dahan, Founder of NServiceBus Implementing Domain-Driven Design presents a top-down approach to understanding domain-driven design (DDD) in a way that fluently connects strategic patterns to fundamental tactical programming tools. Vaughn Vernon couples guided approaches to implementation with modern architectures, highlighting the importance and value of focusing on the business domain while balancing technical considerations. Building on Eric Evans’ seminal book, Domain-Driven Design, the author presents practical DDD techniques through examples from familiar domains. Each principle is backed up by realistic Java examples–all applicable to C# developers–and all content is tied together by a single case study: the delivery of a large-scale Scrum-based SaaS system for a multitenant environment. The author takes you far beyond “DDD-lite” approaches that embrace DDD solely as a technical toolset, and shows you how to fully leverage DDD’s “strategic design patterns” using Bounded Context, Context Maps, and the Ubiquitous Language. Using these techniques and examples, you can reduce time to market and improve quality, as you build software that is more flexible, more scalable, and more tightly aligned to business goals. Coverage includes Getting started the right way with DDD, so you can rapidly gain value from it Using DDD within diverse architectures, including Hexagonal, SOA, REST, CQRS, Event-Driven, and Fabric\/Grid-Based Appropriately designing and applying Entities–and learning when to use Value Objects instead Mastering DDD’s powerful new Domain Events technique Designing Repositories for ORM, NoSQL, and other databases","language":"en","currency":"USD","id":"0133039889","title":"Implementing Domain-Driven Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X7DpD5g3VP8C&source=gbs_api","authors":["Vaughn Vernon"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ug9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Design and Deploy Production-Ready Software","description":"A single dramatic software failure can cost a company millions of dollars - but can be avoided with simple changes to design and architecture. This new edition of the best-selling industry standard shows you how to create systems that run longer, with fewer failures, and recover better when bad things happen. New coverage includes DevOps, microservices, and cloud-native architecture. Stability antipatterns have grown to include systemic problems in large-scale systems. This is a must-have pragmatic guide to engineering for production systems. If you're a software developer, and you don't want to get alerts every night for the rest of your life, help is here. With a combination of case studies about huge losses - lost revenue, lost reputation, lost time, lost opportunity - and practical, down-to-earth advice that was all gained through painful experience, this book helps you avoid the pitfalls that cost companies millions of dollars in downtime and reputation. Eighty percent of project life-cycle cost is in production, yet few books address this topic. This updated edition deals with the production of today's systems - larger, more complex, and heavily virtualized - and includes information on chaos engineering, the discipline of applying randomness and deliberate stress to reveal systematic problems. Build systems that survive the real world, avoid downtime, implement zero-downtime upgrades and continuous delivery, and make cloud-native applications resilient. Examine ways to architect, design, and build software - particularly distributed systems - that stands up to the typhoon winds of a flash mob, a Slashdotting, or a link on Reddit. Take a hard look at software that failed the test and find ways to make sure your software survives. To skip the pain and get the experience...get this book.","language":"en","currency":"USD","id":"1680504525","title":"Release It!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ug9QDwAAQBAJ&source=gbs_api","authors":["Michael T. Nygard"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Gj0LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":null,"description":"Microservices architectures offer faster change speeds, better scalability, and cleaner, evolvable system designs. But implementing your first microservices architecture is difficult. How do you make myriad choices, educate your team on all the technical details, and navigate the organization to a successful execution to maximize your chance of success? With this book, authors Ronnie Mitra and Irakli Nadareishvili provide step-by-step guidance for building an effective microservices architecture. Architects and engineers will follow an implementation journey based on techniques and architectures that have proven to work for microservices systems. You'll build an operating model, a microservices design, an infrastructure foundation, and two working microservices, then put those pieces together as a single implementation. For anyone tasked with building microservices or a microservices architecture, this guide is invaluable. Learn an effective and explicit end-to-end microservices system design Define teams, their responsibilities, and guidelines for working together Understand how to slice a big application into a collection of microservices Examine how to isolate and embed data into corresponding microservices Build a simple yet powerful CI\/CD pipeline for infrastructure changes Write code for sample microservices Deploy a working microservices application on Amazon Web Services","language":"en","currency":"USD","id":"149207540X","title":"Microservices: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Gj0LEAAAQBAJ&source=gbs_api","authors":["Ronnie Mitra","Irakli Nadareishvili"]},{"pageCount":700,"thumbnail":"http:\/\/books.google.com\/books\/content?id=smcREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.74,"subtitle":"Architecting software solutions using microservices, DevOps, and design patterns for Azure, 2nd Edition","description":"The book covers the best practices and approaches for software architects to follow when developing .NET and C# solutions, along with the most up to date cloud environments and tools to enable effective app development, delivery, and deployment.","language":"en","currency":"USD","id":"1800565178","title":"Software Architecture with C# 9 and .NET 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=smcREAAAQBAJ&source=gbs_api","authors":["Gabriel Baptista","Francesco Abbruzzese"]},{"pageCount":319,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cCeeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Persistence Made Easy Using Java EE8, JPA and Spring","description":"Gain all the essentials you need to create scalable microservices, which will help you solve real challenges when deploying services into production. This book will take you through creating a scalable data layer with polygot persistence. You’ll cover data access and query patterns in Spring and JPA in high-performance environments. As part of this topic, you’ll see the advantages of multiple persistence frameworks in Java and especially the easy persistence offered by NoSQL databases and reactive web solutions. The last few chapters present advanced concepts that are useful for very high-performance real-time applications: you’ll implement applications using Spring’s good support for Web sockets in their raw form as well as for connecting to message brokers such as RabbitMQ. This can be useful for applications such as navigation systems and gaming platforms. What You Will Learn Build end-to-end modern applications using microservices, persistence essentials, reactive web, and other high-performance concepts Master Spring’s configuration options Secure microservices efficiently Monitor your services post deployment Who This Book Is For Java developers and architects interested in microservices.","language":"en","currency":"USD","id":"1484244761","title":"Rapid Java Persistence and Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cCeeDwAAQBAJ&source=gbs_api","authors":["Raj Malhotra"]},{"pageCount":557,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vqTfNFDzzdIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":"Pattern Enterpr Applica Arch","description":"The practice of enterprise application development has benefited from the emergence of many new enabling technologies. Multi-tiered object-oriented platforms, such as Java and .NET, have become commonplace. These new tools and technologies are capable of building powerful applications, but they are not easily implemented. Common failures in enterprise applications often occur because their developers do not understand the architectural lessons that experienced object developers have learned. Patterns of Enterprise Application Architecture is written in direct response to the stiff challenges that face enterprise application developers. The author, noted object-oriented designer Martin Fowler, noticed that despite changes in technology--from Smalltalk to CORBA to Java to .NET--the same basic design ideas can be adapted and applied to solve common problems. With the help of an expert group of contributors, Martin distills over forty recurring solutions into patterns. The result is an indispensable handbook of solutions that are applicable to any enterprise application platform. This book is actually two books in one. The first section is a short tutorial on developing enterprise applications, which you can read from start to finish to understand the scope of the book's lessons. The next section, the bulk of the book, is a detailed reference to the patterns themselves. Each pattern provides usage and implementation information, as well as detailed code examples in Java or C#. The entire book is also richly illustrated with UML diagrams to further explain the concepts. Armed with this book, you will have the knowledge necessary to make important architectural decisions about building an enterprise application and the proven patterns for use when building them. The topics covered include · Dividing an enterprise application into layers · The major approaches to organizing business logic · An in-depth treatment of mapping between objects and relational databases · Using Model-View-Controller to organize a Web presentation · Handling concurrency for data that spans multiple transactions · Designing distributed object interfaces","language":"en","currency":"USD","id":"0133065219","title":"Fowler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vqTfNFDzzdIC&source=gbs_api","authors":["Martin Fowler"]},{"pageCount":542,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OhbRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Real-Time Scenarios with Oracle GoldenGate","description":"A step-by-step guide to practising Oracle GoldenGate High Availability (HA) options, Microservices, and Real-Time downstream techniques ﻿DESCRIPTION The book starts with a brief introduction about Oracle GoldenGate with Microservices and how to configure high availability using various methods. Oracle GoldenGate Microservices Architecture (MA) is a similar architecture based on REST APIs which enable us to configure, monitor, and manage Oracle GoldenGate services using a web-based user interface. Each module supports a specific business goal and uses a simple, lightweight, and well-defined interface to communicate with other sets of services. Oracle GoldenGate can interact with custom conflict-resolution routines that customers write to satisfy their business rules. KEY FEATURES - Understand how and when they're used classic Vs. Microservices - Learn how to use real-time downstream methods based on the environment - Learn how to solve Oracle GoldenGate (OGG) Conflict Detection and Resolution (CDR) in bi-directional, active replication - Learn how to implement high availability for mission-critical systems using Oracle GoldenGate – XAG components - Learn how to set up bi-directional replication between pluggable databases (PDBs) in a multi-tenant environment - Learn how to use differently typed of replicates in pluggable databases (PDBs) in a multi-tenant environment WHAT WILL YOU LEARN By the end of the book, you will come across a few case studies about how to use Microservices, Kubernetes, REST APIs in Oracle GoldenGate, and How to monitor Oracle GoldenGate processes in real-time environments. This book also helps how to use various file systems like ACFS, DBFS, and NFS in high availability for Oracle GoldenGate. WHO THIS BOOK IS FOR This book is intended for anyone looking for how to set up and configure Uni-directional, Bi-directional replication in mission-critical environments either using classic Oracle GoldenGate OR Oracle GoldenGate with Microservices. This book also helps various methods to implement real-time downstream techniques. Table of Contents 1. Introduction to Oracle GoldenGate HA - XAG Components 2. Extract and Replicat in Multitenant Environment 3. Consolidated and Cascaded Oracle GoldenGate 4. Introduction to Oracle GoldenGate Methodologies 5. Introduction to Oracle GoldenGate Utilities 6. Bi-Directional Replication with Conflict Detection and Resolution (CDR) 7. Bi-directional Replication with Pluggable Databases (PDBs) in Multitenant Environment 8. Real-Time Downstream Database with Multiple Scenarios 9. Oracle GoldenGate Microservices Architecture overview 10. Managing Oracle GoldenGate and Kubernetes 11. Automation Recipes Via Rest APIs 12. Oracle GoldenGate Tuning and Troubleshooting","language":"en","currency":"USD","id":"9389328489","title":"Oracle GoldenGate With Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OhbRDwAAQBAJ&source=gbs_api","authors":["Y. V. Ravi Kumar","Mariami Kupatadze","Konstantin Kerekovski","Tridib Das"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lng5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Architect your .NET applications by breaking them into really small pieces—microservices—using this practical, example-based guide About This Book Start your microservices journey and understand a broader perspective of microservices development Build, deploy, and test microservices using ASP.Net MVC, Web API, and Microsoft Azure Cloud Get started with reactive microservices and understand the fundamentals behind it Who This Book Is For This book is for .NET Core developers who want to learn and understand microservices architecture and implement it in their .NET Core applications. It's ideal for developers who are completely new to microservices or have just a theoretical understanding of this architectural approach and want to gain a practical perspective in order to better manage application complexity. What You Will Learn Compare microservices with monolithic applications and SOA Identify the appropriate service boundaries by mapping them to the relevant bounded contexts Define the service interface and implement the APIs using ASP.NET Web API Integrate the services via synchronous and asynchronous mechanisms Implement microservices security using Azure Active Directory, OpenID Connect, and OAuth 2.0 Understand the operations and scaling of microservices in .NET Core Understand the testing pyramid and implement consumer-driven contract using pact net core Understand what the key features of reactive microservices are and implement them using reactive extension In Detail Microservices is an architectural style that promotes the development of complex applications as a suite of small services based on business capabilities. This book will help you identify the appropriate service boundaries within the business. We'll start by looking at what microservices are, and what the main characteristics are. Moving forward, you will be introduced to real-life application scenarios, and after assessing the current issues, we will begin the journey of transforming this application by splitting it into a suite of microservices. You will identify the service boundaries, split the application into multiple microservices, and define the service contracts. You will find out how to configure, deploy, and monitor microservices, and configure scaling to allow the application to quickly adapt to increased demand in the future. With an introduction to the reactive microservices, you strategically gain further value to keep your code base simple, focusing on what is more important rather than the messy asynchronous calls. Style and approach This guide serves as a stepping stone that helps .NET Core developers in their microservices architecture. This book provides just enough theory to understand the concepts and apply the examples.","language":"en","currency":"USD","id":"1785884964","title":"Building Microservices with .NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lng5DwAAQBAJ&source=gbs_api","authors":["Gaurav Kumar Aroraa","Lalit Kale","Kanwar Manish"]},{"pageCount":366,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oyZKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Explore patterns like CQRS and event sourcing to create scalable, maintainable, and testable microservices","description":"Explore the concepts and tools you need to discover the world of microservices with various design patterns Key Features Get to grips with the microservice architecture and build enterprise-ready microservice applications Learn design patterns and the best practices while building a microservice application Obtain hands-on techniques and tools to create high-performing microservices resilient to possible fails Book Description Microservices are a hot trend in the development world right now. Many enterprises have adopted this approach to achieve agility and the continuous delivery of applications to gain a competitive advantage. This book will take you through different design patterns at different stages of the microservice application development along with their best practices. Microservice Patterns and Best Practices starts with the learning of microservices key concepts and showing how to make the right choices while designing microservices. You will then move onto internal microservices application patterns, such as caching strategy, asynchronism, CQRS and event sourcing, circuit breaker, and bulkheads. As you progress, you'll learn the design patterns of microservices. The book will guide you on where to use the perfect design pattern at the application development stage and how to break monolithic application into microservices. You will also be taken through the best practices and patterns involved while testing, securing, and deploying your microservice application. At the end of the book, you will easily be able to create interoperable microservices, which are testable and prepared for optimum performance. What you will learn How to break monolithic application into microservices Implement caching strategies, CQRS and event sourcing, and circuit breaker patterns Incorporate different microservice design patterns, such as shared data, aggregator, proxy, and chained Utilize consolidate testing patterns such as integration, signature, and monkey tests Secure microservices with JWT, API gateway, and single sign on Deploy microservices with continuous integration or delivery, Blue-Green deployment Who this book is for This book is for architects and senior developers who would like implement microservice design patterns in their enterprise application development. The book assumes some prior programming knowledge.","language":"en","currency":"USD","id":"1788471202","title":"Microservice Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oyZKDwAAQBAJ&source=gbs_api","authors":["Vinicius Feitosa Pacheco"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KdSrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. This IBM® Redbooks® publication covers Microservices best practices for Java. It focuses on creating cloud native applications using the latest version of IBM WebSphere® Application Server Liberty, IBM Bluemix® and other Open Source Frameworks in the Microservices ecosystem to highlight Microservices best practices for Java.","language":"en","currency":"USD","id":"0738442275","title":"Microservices Best Practices for Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KdSrDQAAQBAJ&source=gbs_api","authors":["Michael Hofmann","Erin Schnabel","Katherine Stanley","IBM Redbooks"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ueZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to implement the microservice architecture using Java About This Book Leverage the power of microservices to build a flexible and efficient system in Java See Docker and Spring Boot in practice to form easily deployable microservices Hands-on approach throughout the book in order to familiarize and grasp the details Who This Book Is For This book is for Java developers who want to get started with microservices and implement it in their workplace. No knowledge of microservice is necessary. What You Will Learn The role of a discovery service and externalized configuration in the overall architecture Use of message brokers for event driven microservices How to intermix data management strategies across components Implementing different types of tests in Spring Boot environment Applying CI to our microservices style architecture Walk through of monitoring and scaling the sample application In Detail A microservice architecture helps you build your application as a suite of different services. This approach has been widely adopted as it helps to easily scale up your application with reduced dependencies. This way if a part of your application is corrupted, it can be fixed easily thereby eliminating the possibility of completely shutting down your software. This book will teach you how to leverage Java to build scalable microservices. You will learn the fundamentals of this architecture and how to efficiently implement it practically. We start off with a brief introduction to the microservice architecture and how it fares with the other architectures. The book dives deep into essential microservice components and how to set up seamless communication between two microservice end points. You will create an effective data model and learn different ways to test and deploy a microservices. You will also learn the best way to migrate your software from a monolith to a microservice architecture. Finishing off with monitoring, scaling and troubleshooting, this book will set a solid foundation for you to start implementing microservices. Style and approach Starting with the fundamentals, this book explains all the essential concepts gradually with the help of numerous examples.","language":"en","currency":"USD","id":"1785880160","title":"Practical Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ueZDDwAAQBAJ&source=gbs_api","authors":["Umesh Ram Sharma"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bfOBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Learn how the various components of Java EE 8 can be used to implement the microservice architecture","description":"Build microservices-based enterprise applications with the latest version of Java EE Key Features Create microservices in Spring and deploy them with Docker and Mesos Examine a number of real-world use cases and hands-on code examples Develop distributed applications based on microservices architecture Book Description Cloud-based applications have been increasingly in demand, and this has caused a shift from monolithic to microservice applications. With the help of Java EE 8 Microservices, you‘ll get to grips with the components of Java EE 8 and understand how they are used to implement microservices. This book explains how a monolithic application is transformed into a microservice application, then helps you connect it in a traditional way and use advanced approaches for asynchronous communication. Once you have learned the basics, you’ll explore advanced topics to make your microservices robust, scalable, and secure. Microservices form distributed applications, and by the end of this book you’ll have discovered how to develop, pack, ship, and support distributed applications using Java EE. What you will learn Build microservices from the ground up with Java EE 8 Implement and deploy microservices with Spring Boot Develop reactive pipelines for asynchronous communication Use caching mechanisms and JSON Web Token (JWT) to create scalable and secure microservices Empower microservices with the Micro Profile effort and implement health checks, fault tolerance, and monitoring mechanisms Use containers to build and deploy microservices Create contract-first documentation with Swagger and API Blueprint Who this book is for Java EE 8 Microservices is for Java EE developers keen to build microservice-based enterprise applications.","language":"en","currency":"USD","id":"1788474961","title":"Java EE 8 Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bfOBDwAAQBAJ&source=gbs_api","authors":["Kamalmeet Singh","Mert Çalışkan","Ondrej Mihályi","Pavel Pscheidl"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build and optimize your microservice architecture with Java","description":"An effective guide to designing, building, and deploying enterprise Java microservices with Eclipse MicroProfile Key Features Create cloud-native microservices with ease using this detailed guide Avoid vendor lock-in when implementing microservices using Eclipse MicroProfile Discover why MicroProfile is a great specification for building microservices in multi-cloud environments Book Description Eclipse MicroProfile has gained momentum in the industry as a multi-vendor, interoperable, community-driven specification. It is a major disruptor that allows organizations with large investments in enterprise Java to move to microservices without spending a lot on retraining their workforce. This book is based on MicroProfile 2.2, however, it will guide you in running your applications in MicroProfile 3.0. You'll start by understanding why microservices are important in the digital economy and how MicroProfile addresses the need for enterprise Java microservices. You'll learn about the subprojects that make up a MicroProfile, its value proposition to organizations and developers, and its processes and governance. As you advance, the book takes you through the capabilities and code examples of MicroProfile’s subprojects - Config, Fault Tolerance, Health Check, JWT Propagation, Metrics, and OpenTracing. Finally, you’ll be guided in developing a conference application using Eclipse MicroProfile, and explore possible scenarios of what’s next in MicroProfile with Jakarta EE. By the end of this book, you'll have gained a clear understanding of Eclipse MicroProfile and its role in enterprise Java microservices. What you will learn Understand why microservices are important in the digital economy Analyze how MicroProfile addresses the need for enterprise Java microservices Test and secure your applications with Eclipse MicroProfile Get to grips with various MicroProfile capabilities such as OpenAPI and Typesafe REST Client Explore reactive programming with MicroProfile Stream and Messaging candidate APIs Discover and implement coding best practices using MicroProfile Who this book is for If you’re a Java developer who wants to create enterprise microservices, this book is for you. Familiarity with Java EE and the concept of microservices will help you get the most out of this book.","language":"en","currency":"USD","id":"1838644326","title":"Hands-On Enterprise Java Microservices with Eclipse MicroProfile","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l6isDwAAQBAJ&source=gbs_api","authors":["Cesar Saavedra","Heiko W. Rupp","Jeff Mesnil","Pavol Loffay","Antoine Sabot-Durand","Scott Stark"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KdSrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. This IBM® Redbooks® publication covers Microservices best practices for Java. It focuses on creating cloud native applications using the latest version of IBM WebSphere® Application Server Liberty, IBM Bluemix® and other Open Source Frameworks in the Microservices ecosystem to highlight Microservices best practices for Java.","language":"en","currency":"USD","id":"0738442275","title":"Microservices Best Practices for Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KdSrDQAAQBAJ&source=gbs_api","authors":["Michael Hofmann","Erin Schnabel","Katherine Stanley","IBM Redbooks"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PMhsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design and build independently deployable, modular services","description":"Quickly learn and employ practical methods for developing microservices Key Features Get to grips with microservice architecture to build enterprise-ready applications Adopt the best practices to find solutions to specific problems Monitor and manage your services in production Book Description Microservices have become a popular way to build distributed systems that power modern web and mobile apps. Deploying your application as a suite of independently deployable, modular, and scalable services has many benefits. In this book, you'll learn to employ microservices in order to make your application more fault-tolerant and easier to scale and change. Using an example-driven approach, Microservice Development Cookbook introduces you to the microservice architectural style. You'll learn how to transition from a traditional monolithic application to a suite of small services that interact to provide smooth functionality to your client applications. You'll also learn about the patterns used to organize services, so you can optimize request handling and processing and see how to handle service-to-service interactions. You'll then move on to understanding how to secure microservices and add monitoring in order to debug problems. This book also covers fault-tolerance and reliability patterns that help you use microservices to isolate failures in your applications. By the end of the book, you’ll be able to work with a team to break a large, monolithic codebase into independently deployable and scalable microservices. You'll also study how to efficiently and effortlessly manage a microservice-based architecture. What you will learn Learn how to design microservice-based systems Create services that fail without impacting users Monitor your services to perform debugging and create observable systems Manage the security of your services Create fast and reliable deployment pipelines Manage multiple environments for your services Simplify the local development of microservice-based systems Who this book is for Microservice Development Cookbook is for developers who would like to build effective and scalable microservices. Basic knowledge of the microservices architecture is assumed.","language":"en","currency":"USD","id":"1788476360","title":"Microservices Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PMhsDwAAQBAJ&source=gbs_api","authors":["Paul Osman"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xLyXPCxBhQUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Software Expert Kent Beck Presents a Catalog of Patterns Infinitely Useful for Everyday Programming Great code doesn’t just function: it clearly and consistently communicates your intentions, allowing other programmers to understand your code, rely on it, and modify it with confidence. But great code doesn’t just happen. It is the outcome of hundreds of small but critical decisions programmers make every single day. Now, legendary software innovator Kent Beck—known worldwide for creating Extreme Programming and pioneering software patterns and test-driven development—focuses on these critical decisions, unearthing powerful “implementation patterns” for writing programs that are simpler, clearer, better organized, and more cost effective. Beck collects 77 patterns for handling everyday programming tasks and writing more readable code. This new collection of patterns addresses many aspects of development, including class, state, behavior, method, collections, frameworks, and more. He uses diagrams, stories, examples, and essays to engage the reader as he illuminates the patterns. You’ll find proven solutions for handling everything from naming variables to checking exceptions.","language":"en","currency":"USD","id":"9780132702553","title":"Implementation Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xLyXPCxBhQUC&source=gbs_api","authors":["Kent Beck"]},{"pageCount":446,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kKGKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build enterprise microservices with Spring Boot 2.0, Spring Cloud, and Angular, 3rd Edition","description":"Master the art of implementing scalable and reactive microservices in your production environment with Java 11 Key Features Use domain-driven designs to build microservices Explore various microservices design patterns such as service discovery, registration, and API Gateway Use Kafka, Avro, and Spring Streams to implement event-based microservices Book Description Microservices are key to designing scalable, easy-to-maintain applications. This latest edition of Mastering Microservices with Java, works on Java 11. It covers a wide range of exciting new developments in the world of microservices, including microservices patterns, interprocess communication with gRPC, and service orchestration. This book will help you understand how to implement microservice-based systems from scratch. You'll start off by understanding the core concepts and framework, before focusing on the high-level design of large software projects. You'll then use Spring Security to secure microservices and test them effectively using REST Java clients and other tools. You will also gain experience of using the Netflix OSS suite, comprising the API Gateway, service discovery and registration, and Circuit Breaker. Additionally, you'll be introduced to the best patterns, practices, and common principles of microservice design that will help you to understand how to troubleshoot and debug the issues faced during development. By the end of this book, you'll have learned how to build smaller, lighter, and faster services that can be implemented easily in a production environment. What you will learn Use domain-driven designs to develop and implement microservices Understand how to implement microservices using Spring Boot Explore service orchestration and distributed transactions using the Sagas Discover interprocess communication using REpresentational State Transfer (REST) and events Gain knowledge of how to implement and design reactive microservices Deploy and test various microservices Who this book is for This book is designed for Java developers who are familiar with microservices architecture and now want to effectively implement microservices at an enterprise level. Basic knowledge and understanding of core microservice elements and applications is necessary.","language":"en","currency":"USD","id":"178953125X","title":"Mastering Microservices with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kKGKDwAAQBAJ&source=gbs_api","authors":["Sourabh Sharma"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zplGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design, build, and run Microservices using Scala elegantly About This Book Build robust microservices using Play Framework and Lagom Model your data for highly interactive applications and scale using Event Sourcing & CQRS Build applications that are resilient to failures by using Message Passing for communication Deploy and manage Scala Microservices for scale by using docker containers with Kubernetes for orchestration Who This Book Is For It is assumed that the reader knows Scala or is proficient in a competent programming language such as Java, C#, Ruby, and so on, with some exposure to Scala. Some experience with writing web services would also be ideal but not mandatory. What You Will Learn Learn the essentials behind Microservices, the advantages and perils associated with them Build low latency, high throughput applications using Play and Lagom Dive deeper with being asynchronous and understand the superiority it provides Model your complex domain data for scale and simplicity with CQRS and Event Sourcing Be resilient to failures by using message passing Look at best practices of version control workflow, testing, continuous integration and deployments Understand operating system level virtualization using Linux Containers. Docker is used to explain how containers work Automate your infrastructure with kubernetes In Detail In this book we will learn what it takes to build great applications using Microservices, the pitfalls associated with such a design and the techniques to avoid them. We learn to build highly performant applications using Play Framework. You will understand the importance of writing code that is asynchronous and nonblocking and how Play leverages this paradigm for higher throughput. The book introduces Reactive Manifesto and uses Lagom Framework to implement the suggested paradigms. Lagom teaches us to: build applications that are scalable and resilient to failures, and solves problems faced with microservices like service gateway, service discovery, communication and so on. Message Passing is used as a means to achieve resilience and CQRS with Event Sourcing helps us in modelling data for highly interactive applications. The book also shares effective development processes for large teams by using good version control workflow, continuous integration and deployment strategies. We introduce Docker containers and Kubernetes orchestrator. Finally, we look at end to end deployment of a set of scala microservices in kubernetes with load balancing, service discovery and rolling deployments. Style and approach The book will step through each of the core microservice concepts in Scala, building an overall picture of their capabilities. This book adopts a systematic approach, allowing you to build upon what you've learnt in previous chapters. By the end of this book you'll have an understanding of the complex aspects of building microservices in Scala and will be able to take that knowledge with you into further projects.ng of the complex aspects of building Microservices in Scala and will be able to take that knowledge with you onto whatever project calls for it","language":"en","currency":"USD","id":"1786460130","title":"Scala Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zplGDwAAQBAJ&source=gbs_api","authors":["Jatin Puri","Selvam Palanimalai"]},{"pageCount":16,"thumbnail":"http:\/\/books.google.com\/books\/content?id=50SGCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architecture style, in which large complex software applications are composed of one ore more microservices. Each microservice focuses on doing one task representing a small business capability. These microservices can be developed in any programming language and communicate with each other using language-agnostic APIs such as REST or messaging applications such as IBM MQ Light. This IBM Redbooks Solution Guide gives a broad understanding of this increasingly popular architectural style and show how you can develop applications using the microservices approach with IBM Bluemix.","language":"en","currency":"USD","id":"0738454478","title":"Creating Applications in Bluemix Using the Microservices Approach","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=50SGCgAAQBAJ&source=gbs_api","authors":["Vasfi Gucer","Shishir Narain","IBM Redbooks"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tNRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build reactive and cloud-native microservices with Kotlin using Spring 5 and Spring Boot 2.0","description":"Build smart, efficient, and fast enterprise-grade web implementation of the microservices architecture that can be easily scaled. Key Features Write easy-to-maintain lean and clean code with Kotlin for developing better microservices Scale your Microserivces in your own cloud with Docker and Docker Swarm Explore Spring 5 functional reactive web programming with Spring WebFlux Book Description With Google's inclusion of first-class support for Kotlin in their Android ecosystem, Kotlin's future as a mainstream language is assured. Microservices help design scalable, easy-to-maintain web applications; Kotlin allows us to take advantage of modern idioms to simplify our development and create high-quality services. With 100% interoperability with the JVM, Kotlin makes working with existing Java code easier. Well-known Java systems such as Spring, Jackson, and Reactor have included Kotlin modules to exploit its language features. This book guides the reader in designing and implementing services, and producing production-ready, testable, lean code that's shorter and simpler than a traditional Java implementation. Reap the benefits of using the reactive paradigm and take advantage of non-blocking techniques to take your services to the next level in terms of industry standards. You will consume NoSQL databases reactively to allow you to create high-throughput microservices. Create cloud-native microservices that can run on a wide range of cloud providers, and monitor them. You will create Docker containers for your microservices and scale them. Finally, you will deploy your microservices in OpenShift Online. What you will learn Understand microservice architectures and principles Build microservices in Kotlin using Spring Boot 2.0 and Spring Framework 5.0 Create reactive microservices that perform non-blocking operations with Spring WebFlux Use Spring Data to get data reactively from MongoDB Test effectively with JUnit and Kotlin Create cloud-native microservices with Spring Cloud Build and publish Docker images of your microservices Scaling microservices with Docker Swarm Monitor microservices with JMX Deploy microservices in OpenShift Online Who this book is for If you are a Kotlin developer with a basic knowledge of microservice architectures and now want to effectively implement these services on enterprise-level web applications, then this book is for you","language":"en","currency":"USD","id":"1788473493","title":"Hands-On Microservices with Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tNRJDwAAQBAJ&source=gbs_api","authors":["Juan Antonio Medina Iglesias"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tKb5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"In a microservices architecture, the whole is indeed greater than the sum of its parts. But in practice, individual microservices can inadvertently impact others and alter the end user experience. Effective microservices architectures require standardization on an organizational level with the help of a platform engineering team. This practical book provides a series of progressive steps that platform engineers can apply technically and organizationally to achieve highly resilient Java applications. Author Jonathan Schneider covers many effective SRE practices from companies leading the way in microservices adoption. You’ll examine several patterns discovered through much trial and error in recent years, complete with Java code examples. Chapters are organized according to specific patterns, including: Application metrics: Monitoring for availability with Micrometer Debugging with observability: Logging and distributed tracing; failure injection testing Charting and alerting: Building effective charts; KPIs for Java microservices Safe multicloud delivery: Spinnaker, deployment strategies, and automated canary analysis Source code observability: Dependency management, API utilization, and end-to-end asset inventory Traffic management: Concurrency of systems; platform, gateway, and client-side load balancing","language":"en","currency":"USD","id":"1492073873","title":"SRE with Java Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tKb5DwAAQBAJ&source=gbs_api","authors":["Jonathan Schneider"]},{"pageCount":540,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YSDCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Practical Patterns for Innovation","description":"In the past few years, going cloud native has been a big advantage for many companies. But it’s a tough technique to get right, especially for enterprises with critical legacy systems. This practical hands-on guide examines effective architecture, design, and cultural patterns to help you transform your organization into a cloud native enterprise—whether you’re moving from older architectures or creating new systems from scratch. By following Wealth Grid, a fictional company, you’ll understand the challenges, dilemmas, and considerations that accompany a move to the cloud. Technical managers and architects will learn best practices for taking on a successful company-wide transformation. Cloud migration consultants Pini Reznik, Jamie Dobson, and Michelle Gienow draw patterns from the growing community of expert practitioners and enterprises that have successfully built cloud native systems. You’ll learn what works and what doesn’t when adopting cloud native—including how this transition affects not just your technology but also your organizational structure and processes. You’ll learn: What cloud native means and why enterprises are so interested in it Common barriers and pitfalls that have affected other companies (and how to avoid them) Context-specific patterns for a successful cloud native transformation How to implement a safe, evolutionary cloud native approach How companies addressed root causes and misunderstandings that hindered their progress Case studies from real-world companies that have succeeded with cloud native transformations","language":"en","currency":"USD","id":"1492048852","title":"Cloud Native Transformation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YSDCDwAAQBAJ&source=gbs_api","authors":["Pini Reznik","Jamie Dobson","Michelle Gienow"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1D24-cGQRdsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Hypermedia and Systems Architecture","description":"Why don't typical enterprise projects go as smoothly as projects you develop for the Web? Does the REST architectural style really present a viable alternative for building distributed systems and enterprise-class applications? In this insightful book, three SOA experts provide a down-to-earth explanation of REST and demonstrate how you can develop simple and elegant distributed hypermedia systems by applying the Web's guiding principles to common enterprise computing problems. You'll learn techniques for implementing specific Web technologies and patterns to solve the needs of a typical company as it grows from modest beginnings to become a global enterprise. Learn basic Web techniques for application integration Use HTTP and the Web’s infrastructure to build scalable, fault-tolerant enterprise applications Discover the Create, Read, Update, Delete (CRUD) pattern for manipulating resources Build RESTful services that use hypermedia to model state transitions and describe business protocols Learn how to make Web-based solutions secure and interoperable Extend integration patterns for event-driven computing with the Atom Syndication Format and implement multi-party interactions in AtomPub Understand how the Semantic Web will impact systems design","language":"en","currency":"USD","id":"9781449396923","title":"REST in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1D24-cGQRdsC&source=gbs_api","authors":["Jim Webber","Savas Parastatidis","Ian Robinson"]},{"pageCount":532,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The truth about DevOps by the people on the front line","description":"Discover DevOps secrets from leading experts. Viktor Farcic interviews DevOps industries voices including Mike Kail, Greg Bledsoe, Jeff Sussna, James Turnbull, Kohsuke Kawaguchi, Liz Keogh, and more. Key Features Leading DevOps experts share their insights into modern DevOps practice Engage with the real-world challenges of putting DevOps to work Strengthen your DevOps practices now and prepare for future DevOps trends Book Description DevOps promises to break down silos, uniting organizations to deliver high quality output in a cross-functional way. In reality it often results in confusion and new silos: pockets of DevOps practitioners fight the status quo, senior decision-makers demand DevOps paint jobs without committing to true change. Even a clear definition of what DevOps is remains elusive. In DevOps Paradox, top DevOps consultants, industry leaders, and founders reveal their own approaches to all aspects of DevOps implementation and operation. Surround yourself with expert DevOps advisors. Viktor Farcic draws on experts from across the industry to discuss how to introduce DevOps to chaotic organizations, align incentives between teams, and make use of the latest tools and techniques. With each expert offering their own opinions on what DevOps is and how to make it work, you will be able to form your own informed view of the importance and value of DevOps as we enter a new decade. If you want to see how real DevOps experts address the challenges and resolve the paradoxes, this book is for you. What you will learn Expert opinions on: Introducing DevOps into real-world, chaotic business environments Deciding between adopting cutting edge tools or sticking with tried-and-tested methods Initiating necessary business change without positional power Managing and overcoming fear of change in DevOps implementations Anticipating future trends in DevOps and how to prepare for them Getting the most from Kubernetes, Docker, Puppet, Chef, and Ansible Creating the right incentives for DevOps success across an organization The impact of new techniques, such as Lambda, serverless, and schedulers, on DevOps practice Who this book is for Anybody interested in DevOps will gain a lot from this book. If you want to get beyond the simplistic ideals and engage with the deep challenges of putting DevOps to work in the real world, this book is for you.","language":"en","currency":"USD","id":"1789138809","title":"DevOps Paradox","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6isDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WsxPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build domain-driven microservice-based applications with Spring, Spring Cloud, and Angular","description":"Master the art of implementing scalable microservices in your production environment with ease About This Book Use domain-driven design to build microservices Use Spring Cloud to use Service Discovery and Registeration Use Kafka, Avro and Spring Streams for implementing event based microservices Who This Book Is For This book is for Java developers who are familiar with the microservices architecture and now wants to take a deeper dive into effectively implementing microservices at an enterprise level. A reasonable knowledge level and understanding of core microservice elements and applications is expected. What You Will Learn Use domain-driven design to design and implement microservices Secure microservices using Spring Security Learn to develop REST service development Deploy and test microservices Troubleshoot and debug the issues faced during development Learning best practices and common principals about microservices In Detail Microservices are the next big thing in designing scalable, easy-to-maintain applications. It not only makes app development easier, but also offers great flexibility to utilize various resources optimally. If you want to build an enterprise-ready implementation of the microservices architecture, then this is the book for you! Starting off by understanding the core concepts and framework, you will then focus on the high-level design of large software projects. You will gradually move on to setting up the development environment and configuring it before implementing continuous integration to deploy your microservice architecture. Using Spring security, you will secure microservices and test them effectively using REST Java clients and other tools like RxJava 2.0. We'll show you the best patterns, practices and common principals of microservice design and you'll learn to troubleshoot and debug the issues faced during development. We'll show you how to design and implement reactive microservices. Finally, we'll show you how to migrate a monolithic application to microservices based application. By the end of the book, you will know how to build smaller, lighter, and faster services that can be implemented easily in a production environment. Style and approach This book starts from the basics, including environment setup and provides easy-to-follow steps to implement the sample project using microservices.","language":"en","currency":"USD","id":"1787282414","title":"Mastering Microservices with Java 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WsxPDwAAQBAJ&source=gbs_api","authors":["Sourabh Sharma"]},{"pageCount":1065,"thumbnail":"http:\/\/books.google.com\/books\/content?id=srkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":57.59,"subtitle":null,"description":"Master the art of predictive modeling About This Book Load, wrangle, and analyze your data using the world's most powerful statistical programming language Familiarize yourself with the most common data mining tools of R, such as k-means, hierarchical regression, linear regression, Naive Bayes, decision trees, text mining and so on. We emphasize important concepts, such as the bias-variance trade-off and over-fitting, which are pervasive in predictive modeling Who This Book Is For If you work with data and want to become an expert in predictive analysis and modeling, then this Learning Path will serve you well. It is intended for budding and seasoned practitioners of predictive modeling alike. You should have basic knowledge of the use of R, although it's not necessary to put this Learning Path to great use. What You Will Learn Get to know the basics of R's syntax and major data structures Write functions, load data, and install packages Use different data sources in R and know how to interface with databases, and request and load JSON and XML Identify the challenges and apply your knowledge about data analysis in R to imperfect real-world data Predict the future with reasonably simple algorithms Understand key data visualization and predictive analytic skills using R Understand the language of models and the predictive modeling process In Detail Predictive analytics is a field that uses data to build models that predict a future outcome of interest. It can be applied to a range of business strategies and has been a key player in search advertising and recommendation engines. The power and domain-specificity of R allows the user to express complex analytics easily, quickly, and succinctly. R offers a free and open source environment that is perfect for both learning and deploying predictive modeling solutions in the real world. This Learning Path will provide you with all the steps you need to master the art of predictive modeling with R. We start with an introduction to data analysis with R, and then gradually you'll get your feet wet with predictive modeling. You will get to grips with the fundamentals of applied statistics and build on this knowledge to perform sophisticated and powerful analytics. You will be able to solve the difficulties relating to performing data analysis in practice and find solutions to working with “messy data”, large data, communicating results, and facilitating reproducibility. You will then perform key predictive analytics tasks using R, such as train and test predictive models for classification and regression tasks, score new data sets and so on. By the end of this Learning Path, you will have explored and tested the most popular modeling techniques in use on real-world data sets and mastered a diverse range of techniques in predictive analytics. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Data Analysis with R, Tony Fischetti Learning Predictive Analytics with R, Eric Mayor Mastering Predictive Analytics with R, Rui Miguel Forte Style and approach Learn data analysis using engaging examples and fun exercises, and with a gentle and friendly but comprehensive \"learn-by-doing\" approach. This is a practical course, which analyzes compelling data about life, health, and death with the help of tutorials. It offers you a useful way of interpreting the data that's specific to this course, but that can also be applied to any other data. This course is designed to be both a guide and a reference for moving beyond the basics of predictive modeling.","language":"en","currency":"USD","id":"1788290852","title":"R: Predictive Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=srkrDwAAQBAJ&source=gbs_api","authors":["Tony Fischetti","Eric Mayor","Rui Miguel Forte"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7eruDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"Organizations today often struggle to balance business requirements with ever-increasing volumes of data. Additionally, the demand for leveraging large-scale, real-time data is growing rapidly among the most competitive digital industries. Conventional system architectures may not be up to the task. With this practical guide, you’ll learn how to leverage large-scale data usage across the business units in your organization using the principles of event-driven microservices. Author Adam Bellemare takes you through the process of building an event-driven microservice-powered organization. You’ll reconsider how data is produced, accessed, and propagated across your organization. Learn powerful yet simple patterns for unlocking the value of this data. Incorporate event-driven design and architectural principles into your own systems. And completely rethink how your organization delivers value by unlocking near-real-time access to data at scale. You’ll learn: How to leverage event-driven architectures to deliver exceptional business value The role of microservices in supporting event-driven designs Architectural patterns to ensure success both within and between teams in your organization Application patterns for developing powerful event-driven microservices Components and tooling required to get your microservice ecosystem off the ground","language":"en","currency":"USD","id":"1492057843","title":"Building Event-Driven Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7eruDwAAQBAJ&source=gbs_api","authors":["Adam Bellemare"]},{"pageCount":648,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fZAwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry","description":"What separates the traditional enterprise from the likes of Amazon, Netflix, and Etsy? Those companies have refined the art of cloud native development to maintain their competitive edge and stay well ahead of the competition. This practical guide shows Java\/JVM developers how to build better software, faster, using Spring Boot, Spring Cloud, and Cloud Foundry. Many organizations have already waded into cloud computing, test-driven development, microservices, and continuous integration and delivery. Authors Josh Long and Kenny Bastani fully immerse you in the tools and methodologies that will help you transform your legacy application into one that is genuinely cloud native. In four sections, this book takes you through: The Basics: learn the motivations behind cloud native thinking; configure and test a Spring Boot application; and move your legacy application to the cloud Web Services: build HTTP and RESTful services with Spring; route requests in your distributed system; and build edge services closer to the data Data Integration: manage your data with Spring Data, and integrate distributed services with Spring’s support for event-driven, messaging-centric architectures Production: make your system observable; use service brokers to connect stateful services; and understand the big ideas behind continuous delivery","language":"en","currency":"USD","id":"144937459X","title":"Cloud Native Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fZAwDwAAQBAJ&source=gbs_api","authors":["Josh Long","Kenny Bastani"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":321,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qBvCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Manage Microservices in Kubernetes","description":"Build an in-depth understanding of the Istio service mesh and see why a service mesh is required for a distributed application. This book covers the Istio architecture and its features using a hands-on approach with language-neutral examples. To get your Istio environment up and running, you will go through its setup and learn the concepts of control plane and data plane. You will become skilled with the new concepts and apply them with best practices to continuously deliver applications. What You Will Learn Discover the Istio architecture components and the Envoy proxy Master traffic management for service routing and application deployment Build application resiliency using timeout, circuit breakers, and connection pools Monitor using Prometheus and Grafana Configure application security Who This Book Is For Developers and project managers who are trying to run their application using Kubernetes. The book is not specific for any programming language even though all examples will be in Java or Python.","language":"en","currency":"USD","id":"1484254589","title":"Getting Started with Istio Service Mesh","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qBvCDwAAQBAJ&source=gbs_api","authors":["Rahul Sharma","Avinash Singh"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U5LUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Enabling Test-Driven Development, Domain-Driven Design, and Event-Driven Microservices","description":"As Python continues to grow in popularity, projects are becoming larger and more complex. Many Python developers are taking an interest in high-level software design patterns such as hexagonal\/clean architecture, event-driven architecture, and the strategic patterns prescribed by domain-driven design (DDD). But translating those patterns into Python isn’t always straightforward. With this hands-on guide, Harry Percival and Bob Gregory from MADE.com introduce proven architectural design patterns to help Python developers manage application complexity—and get the most value out of their test suites. Each pattern is illustrated with concrete examples in beautiful, idiomatic Python, avoiding some of the verbosity of Java and C# syntax. Patterns include: Dependency inversion and its links to ports and adapters (hexagonal\/clean architecture) Domain-driven design’s distinction between Entities, Value Objects, and Aggregates Repository and Unit of Work patterns for persistent storage Events, commands, and the message bus Command-query responsibility segregation (CQRS) Event-driven architecture and reactive microservices","language":"en","currency":"USD","id":"1492052159","title":"Architecture Patterns with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U5LUDwAAQBAJ&source=gbs_api","authors":["Harry Percival","Bob Gregory"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hKvODAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"A Guide for Impatient Beginners","description":"Keen to build web applications for the cloud? Get a quick hands-on introduction to OpenShift, the open source Platform as a Service (PaaS) offering from Red Hat. With this practical guide, you’ll learn the steps necessary to build, deploy, and host a complete real-world application on OpenShift without having to slog through long, detailed explanations of the technologies involved. OpenShift enables you to use Docker application containers and the Kubernetes cluster manager to automate the way you create, ship, and run applications. Through the course of the book, you’ll learn how to use OpenShift and the Wildfly application server to build and then immediately deploy a Java application online. Learn about OpenShift’s core technology, including Docker-based containers and Kubernetes Use a virtual machine with OpenShift installed and configured on your local environment Create and deploy your first application on the OpenShift platform Add language runtime dependencies and connect to a database Trigger an automatic rebuild and redeployment when you push changes to the repository Get a working environment up in minutes with application templates Use commands to check and debug your application Create and build Docker-based images for your application","language":"en","currency":"USD","id":"1491961392","title":"OpenShift for Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hKvODAAAQBAJ&source=gbs_api","authors":["Grant Shipley","Graham Dumpleton"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]},{"pageCount":21,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rEP-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Domain-Driven Design (DDD) concept was introduced by first Eric Evans in 2003. The concept of microservices did not exist at that time. So basically DDD was introduced to solve the problem of a large monolithic code base. In the monolithic world, once the codebase starts growing with the growth of the business, it becomes difficult to maintain the code organized and structured as it was originally designed. Monolithic applications designed using MVC architecture have good separation between the business layer and the presentation layer. But in the absence of the strict architectural guidelines, the business layer does not provide specific rules to maintain responsibility boundaries between different modules and classes. That’s why as the code base grows it increases the risk of logic breakdown, responsibility leakage between the different components of the application.","language":"en","currency":"USD","id":"8194292646","title":"Domain-Driven Design and Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rEP-DwAAQBAJ&source=gbs_api","authors":["Nitesh Malviya"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t_xvDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Master the art of implementing microservices in your production environment with ease About This Book Build, deploy, and test microservices from scratch with ease Design and implement sample projects using domain-driven design Confidently resolve the issues faced during development and deployment Who This Book Is For If you are a Java developer who is familiar with the microservices architecture and now wants to take a deeper dive into effectively implementing microservices at an enterprise level, then this book is for you. A reasonable knowledge level and understanding of core microservice elements and applications is expected. What You Will Learn Use domain-driven design to design and implement microservices Secure microservices using Spring Security Deploy and test microservices Troubleshoot and debug the issues faced during development Consume microservices using a JavaScript web application Learning best practices and common principals about microservices In Detail With the introduction of the cloud, enterprise application development moved from monolithic applications to small lightweight process-driven components called microservices. Microservices are the next big thing in designing scalable, easy-to-maintain applications. It not only makes app development easier, but also offers great flexibility to utilize various resources optimally. If you want to build an enterprise-ready implementation of the microservices architecture, then this is the book for you! Starting off by understanding the core concepts and framework, you will then focus on the high-level design of large software projects. You will gradually move on to setting up the development environment and configuring it before implementing continuous integration to deploy your microservice architecture. Using Spring security, you will secure microservices and test it effectively using REST Java clients and other tools. Finally, we'll show you the best practices and common principals of microservice design and you'll learn to troubleshoot and debug the issues faced during development. By the end of the book, you will know how to build smaller, lighter, and faster services that can be implemented easily in a production environment. Style and approach This book starts from the basics, including environment setup and provides easy-to-follow steps to implement the sample project using microservices. It gives you the complete lifecycle of enterprise app development from designing and developing to deploying, testing, and security. Each topic is explained and placed in context, and for the more inquisitive, there are more details of the concepts used.","language":"en","currency":"USD","id":"1783558644","title":"Mastering Microservices with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t_xvDQAAQBAJ&source=gbs_api","authors":["Sourabh Sharma"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7XxCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":"Reusable Object Models","description":"This innovative book recognizes the need within the object-oriented community for a book that goes beyond the tools and techniques of the typical methodology book. In Analysis Patterns: Reusable Object Models, Martin Fowler focuses on the end result of object-oriented analysis and design—the models themselves. He shares with you his wealth of object modeling experience and his keen eye for identifying repeating problems and transforming them into reusable models. Analysis Patterns provides a catalogue of patterns that have emerged in a wide range of domains including trading, measurement, accounting and organizational relationships. Recognizing that conceptual patterns cannot exist in isolation, the author also presents a series of \"support patterns\" that discuss how to turn conceptual models into software that in turn fits into an architecture for a large information system. Included in each pattern is the reasoning behind their design, rules for when they should and should not be used, and tips for implementation. The examples presented in this book comprise a cookbook of useful models and insight into the skill of reuse that will improve analysis, modeling and implementation.","language":"en","currency":"USD","id":"0134271424","title":"Analysis Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7XxCgAAQBAJ&source=gbs_api","authors":["Martin Fowler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.39,"subtitle":"Elements of Reusable Object-Oriented Software (Adobe Reader)","description":"Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.","language":"en","currency":"USD","id":"9780321700698","title":"Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6oHuKQe3TjQC&source=gbs_api","authors":["Erich Gamma","Richard Helm","Ralph Johnson","John Vlissides"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j86PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A complete guide to building, testing, and deploying microservices using serverless computing on AWS","description":"A practical guide for developing end-to-end serverless microservices in Python for developers, DevOps, and architects. Key Features Create a secure, cost-effective, and scalable serverless data API Use identity management and authentication for a user-specific and secure web application Go beyond traditional web hosting to explore the full range of cloud hosting options Book Description Over the last few years, there has been a massive shift from monolithic architecture to microservices, thanks to their small and independent deployments that allow increased flexibility and agile delivery. Traditionally, virtual machines and containers were the principal mediums for deploying microservices, but they involved a lot of operational effort, configuration, and maintenance. More recently, serverless computing has gained popularity due to its built-in autoscaling abilities, reduced operational costs, and increased productivity. Building Serverless Microservices in Python begins by introducing you to serverless microservice structures. You will then learn how to create your first serverless data API and test your microservice. Moving on, you'll delve into data management and work with serverless patterns. Finally, the book introduces you to the importance of securing microservices. By the end of the book, you will have gained the skills you need to combine microservices with serverless computing, making their deployment much easier thanks to the cloud provider managing the servers and capacity planning. What you will learn Discover what microservices offer above and beyond other architectures Create a serverless application with AWS Gain secure access to data and resources Run tests on your configuration and code Create a highly available serverless microservice data API Build, deploy, and run your serverless configuration and code Who this book is for If you are a developer with basic knowledge of Python and want to learn how to build, test, deploy, and secure microservices, then this book is for you. No prior knowledge of building microservices is required.","language":"en","currency":"USD","id":"1789533422","title":"Building Serverless Microservices in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j86PDwAAQBAJ&source=gbs_api","authors":["Richard Takashi Freeman"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Collective Wisdom from the Experts","description":"If you want to push your Java skills to the next level, this book provides expert advice from Java leaders and practitioners. You’ll be encouraged to look at problems in new ways, take broader responsibility for your work, stretch yourself by learning new techniques, and become as good at the entire craft of development as you possibly can. Edited by Kevlin Henney and Trisha Gee, 97 Things Every Java Programmer Should Know reflects lifetimes of experience writing Java software and living with the process of software development. Great programmers share their collected wisdom to help you rethink Java practices, whether working with legacy code or incorporating changes since Java 8. A few of the 97 things you should know: \"Behavior Is Easy, State Is Hard\"—Edson Yanaga “Learn Java Idioms and Cache in Your Brain”—Jeanne Boyarsky “Java Programming from a JVM Performance Perspective”—Monica Beckwith \"Garbage Collection Is Your Friend\"—Holly K Cummins “Java's Unspeakable Types”—Ben Evans \"The Rebirth of Java\"—Sander Mak “Do You Know What Time It Is?”—Christin Gorman","language":"en","currency":"USD","id":"1491952644","title":"97 Things Every Java Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvbkDwAAQBAJ&source=gbs_api","authors":["Kevlin Henney","Trisha Gee"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GswOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A developer's guide to building cloud-native applications using the Dapr event-driven runtime","description":"Discover the powerful capabilities of Dapr by implementing a sample application with microservices leveraging the actor model to foster its strengths. Find out how Dapr helps you simplify the creation of resilient and portable microservices with this book.","language":"en","currency":"USD","id":"1800564260","title":"Practical Microservices with Dapr and .NET","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GswOEAAAQBAJ&source=gbs_api","authors":["Davide Bedin"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sjflCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build fault tolerant concurrent and distributed applications with Akka About This Book Build networked applications that self-heal Scale out your applications to handle more traffic faster An easy-to-follow guide with a number of examples to ensure you get the best start with Akka Who This Book Is For This book is intended for beginner to intermediate Java or Scala developers who want to build applications to serve the high-scale user demands in computing today. If you need your applications to handle the ever-growing user bases and datasets with high performance demands, then this book is for you. Learning Akka will let you do more for your users with less code and less complexity, by building and scaling your networked applications with ease. What You Will Learn Use Akka to overcome the challenges of concurrent programming Resolve the issues faced in distributed computing with the help of Akka Scale applications to serve a high number of concurrent users Make your system fault-tolerant with self-healing applications Provide a timely response to users with easy concurrency Reduce hardware costs by building more efficient multi-user applications Maximise network efficiency by scaling it In Detail Software today has to work with more data, more users, more cores, and more servers than ever. Akka is a distributed computing toolkit that enables developers to build correct concurrent and distributed applications using Java and Scala with ease, applications that scale across servers and respond to failure by self-healing. As well as simplifying development, Akka enables multiple concurrency development patterns with particular support and architecture derived from Erlang's concept of actors (lightweight concurrent entities). Akka is written in Scala, which has become the programming language of choice for development on the Akka platform. Learning Akka aims to be a comprehensive walkthrough of Akka. This book will take you on a journey through all the concepts of Akka that you need in order to get started with concurrent and distributed applications and even build your own. Beginning with the concept of Actors, the book will take you through concurrency in Akka. Moving on to networked applications, this book will explain the common pitfalls in these difficult problem areas while teaching you how to use Akka to overcome these problems with ease. The book is an easy to follow example-based guide that will strengthen your basic knowledge of Akka and aid you in applying the same to real-world scenarios. Style and approach An easy-to-follow, example-based guide that will take you through building several networked-applications that work together while you are learning concurrent and distributed computing concepts. Each topic is explained while showing you how to design with Akka and how it is used to overcome common problems in applications. By showing Akka in context to the problems, it will help you understand what the common problems are in distributed applications and how to overcome them.","language":"en","currency":"USD","id":"1784393541","title":"Learning Akka","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sjflCwAAQBAJ&source=gbs_api","authors":["Jason Goodwin"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H-ykCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Scalable Web Architecture, Processes, and Organizations for the Modern Enterprise","description":"The Comprehensive, Proven Approach to IT Scalability–Updated with New Strategies, Technologies, and Case Studies In The Art of Scalability, Second Edition, leading scalability consultants Martin L. Abbott and Michael T. Fisher cover everything you need to know to smoothly scale products and services for any requirement. This extensively revised edition reflects new technologies, strategies, and lessons, as well as new case studies from the authors’ pioneering consulting practice, AKF Partners. Writing for technical and nontechnical decision-makers, Abbott and Fisher cover everything that impacts scalability, including architecture, process, people, organization, and technology. Their insights and recommendations reflect more than thirty years of experience at companies ranging from eBay to Visa, and Salesforce.com to Apple. You’ll find updated strategies for structuring organizations to maximize agility and scalability, as well as new insights into the cloud (IaaS\/PaaS) transition, NoSQL, DevOps, business metrics, and more. Using this guide’s tools and advice, you can systematically clear away obstacles to scalability–and achieve unprecedented IT and business performance. Coverage includes • Why scalability problems start with organizations and people, not technology, and what to do about it • Actionable lessons from real successes and failures • Staffing, structuring, and leading the agile, scalable organization • Scaling processes for hyper-growth environments • Architecting scalability: proprietary models for clarifying needs and making choices–including 15 key success principles • Emerging technologies and challenges: data cost, datacenter planning, cloud evolution, and customer-aligned monitoring • Measuring availability, capacity, load, and performance","language":"en","currency":"USD","id":"0134031385","title":"The Art of Scalability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H-ykCQAAQBAJ&source=gbs_api","authors":["Martin L. Abbott","Michael T. Fisher"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q9B5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Making the Right Decisions in an Evolving Landscape","description":"A lot of work is required to release an API, but the effort doesn’t always pay off. Overplanning before an API matures is a wasted investment, while underplanning can lead to disaster. This practical guide provides maturity models for individual APIs and multi-API landscapes to help you invest the right human and company resources for the right maturity level at the right time. How do you balance the desire for agility and speed with the need for robust and scalable operations? Four experts from the API Academy show software architects, program directors, and product owners how to maximize the value of their APIs by managing them as products through a continuous life cycle. Learn which API decisions you need to govern and how and where to do so Design, deploy, and manage APIs using an API-as-a-product (AaaP) approach Examine ten pillars that form the foundation of API product work Learn how the continuous improvement model governs changes throughout an API’s lifetime Explore the five stages of a complete API product life cycle Delve into team roles needed to design, build, and maintain your APIs Learn how to manage your API landscape—the set of APIs published by your organization","language":"en","currency":"USD","id":"1492043508","title":"Continuous API Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q9B5DwAAQBAJ&source=gbs_api","authors":["Mehdi Medjaoui","Erik Wilde","Ronnie Mitra","Mike Amundsen"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q9B5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Making the Right Decisions in an Evolving Landscape","description":"A lot of work is required to release an API, but the effort doesn’t always pay off. Overplanning before an API matures is a wasted investment, while underplanning can lead to disaster. This practical guide provides maturity models for individual APIs and multi-API landscapes to help you invest the right human and company resources for the right maturity level at the right time. How do you balance the desire for agility and speed with the need for robust and scalable operations? Four experts from the API Academy show software architects, program directors, and product owners how to maximize the value of their APIs by managing them as products through a continuous life cycle. Learn which API decisions you need to govern and how and where to do so Design, deploy, and manage APIs using an API-as-a-product (AaaP) approach Examine ten pillars that form the foundation of API product work Learn how the continuous improvement model governs changes throughout an API’s lifetime Explore the five stages of a complete API product life cycle Delve into team roles needed to design, build, and maintain your APIs Learn how to manage your API landscape—the set of APIs published by your organization","language":"en","currency":"USD","id":"1492043508","title":"Continuous API Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q9B5DwAAQBAJ&source=gbs_api","authors":["Mehdi Medjaoui","Erik Wilde","Ronnie Mitra","Mike Amundsen"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4AuLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.49,"subtitle":"Analyzing performance in microservices and complex systems","description":"Understand how to apply distributed tracing to microservices-based architectures Key Features A thorough conceptual introduction to distributed tracing An exploration of the most important open standards in the space A how-to guide for code instrumentation and operating a tracing infrastructure Book Description Mastering Distributed Tracing will equip you to operate and enhance your own tracing infrastructure. Through practical exercises and code examples, you will learn how end-to-end tracing can be used as a powerful application performance management and comprehension tool. The rise of Internet-scale companies, like Google and Amazon, ushered in a new era of distributed systems operating on thousands of nodes across multiple data centers. Microservices increased that complexity, often exponentially. It is harder to debug these systems, track down failures, detect bottlenecks, or even simply understand what is going on. Distributed tracing focuses on solving these problems for complex distributed systems. Today, tracing standards have developed and we have much faster systems, making instrumentation less intrusive and data more valuable. Yuri Shkuro, the creator of Jaeger, a popular open-source distributed tracing system, delivers end-to-end coverage of the field in Mastering Distributed Tracing. Review the history and theoretical foundations of tracing; solve the data gathering problem through code instrumentation, with open standards like OpenTracing, W3C Trace Context, and OpenCensus; and discuss the benefits and applications of a distributed tracing infrastructure for understanding, and profiling, complex systems. What you will learn How to get started with using a distributed tracing system How to get the most value out of end-to-end tracing Learn about open standards in the space Learn about code instrumentation and operating a tracing infrastructure Learn where distributed tracing fits into microservices as a core function Who this book is for Any developer interested in testing large systems will find this book very revealing and in places, surprising. Every microservice architect and developer should have an insight into distributed tracing, and the book will help them on their way. System administrators with some development skills will also benefit. No particular programming language skills are required, although an ability to read Java, while non-essential, will help with the core chapters.","language":"en","currency":"USD","id":"1788627598","title":"Mastering Distributed Tracing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4AuLDwAAQBAJ&source=gbs_api","authors":["Yuri Shkuro"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AEahDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build, deploy, and manage scalable microservices on Kubernetes","description":"Enhance your skills in building scalable infrastructure for your cloud-based applications Key Features Learn to design a scalable architecture by building continuous integration (CI) pipelines with Kubernetes Get an in-depth understanding of role-based access control (RBAC), continuous deployment (CD), and observability Monitor a Kubernetes cluster with Prometheus and Grafana Book Description Kubernetes is among the most popular open-source platforms for automating the deployment, scaling, and operations of application containers across clusters of hosts, providing a container-centric infrastructure. Hands-On Microservices with Kubernetes starts by providing you with in-depth insights into the synergy between Kubernetes and microservices. You will learn how to use Delinkcious, which will serve as a live lab throughout the book to help you understand microservices and Kubernetes concepts in the context of a real-world application. Next, you will get up to speed with setting up a CI\/CD pipeline and configuring microservices using Kubernetes ConfigMaps. As you cover later chapters, you will gain hands-on experience in securing microservices, and implementing REST, gRPC APIs, and a Delinkcious data store. In addition to this, you’ll explore the Nuclio project, run a serverless task on Kubernetes, and manage and implement data-intensive tests. Toward the concluding chapters, you’ll deploy microservices on Kubernetes and learn to maintain a well-monitored system. Finally, you’ll discover the importance of service meshes and how to incorporate Istio into the Delinkcious cluster. By the end of this book, you’ll have gained the skills you need to implement microservices on Kubernetes with the help of effective tools and best practices. What you will learn Understand the synergy between Kubernetes and microservices Create a complete CI\/CD pipeline for your microservices on Kubernetes Develop microservices on Kubernetes with the Go kit framework using best practices Manage and monitor your system using Kubernetes and open-source tools Expose your services through REST and gRPC APIs Implement and deploy serverless functions as a service Externalize authentication, authorization and traffic shaping using a service mesh Run a Kubernetes cluster in the cloud on Google Kubernetes Engine Who this book is for This book is for developers, DevOps engineers, or anyone who wants to develop large-scale microservice-based systems on top of Kubernetes. If you are looking to use Kubernetes on live production projects or want to migrate existing systems to a modern containerized microservices system, then this book is for you. Coding skills, together with some knowledge of Docker, Kubernetes, and cloud concepts will be useful.","language":"en","currency":"USD","id":"1789809738","title":"Hands-On Microservices with Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AEahDwAAQBAJ&source=gbs_api","authors":["Gigi Sayfan"]},{"pageCount":285,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HorJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Gain a strong foundation of core WSO2 ESB concepts and acquire a proven set of guidelines designed to get you started with WSO2 ESB quickly and efficiently. This book focuses on the various enterprises integration capabilities of WSO2 ESB along with a broad range of examples that you can try out. From beginning to the end, Beginning WSO2 ESB effectively guides you in gradually building expertise in enterprise integration with WSO2 ESB for your SOA infrastructure. Nowadays successful enterprises rely heavily on how well the underlying software applications and services work together to produce a unified business functionality. This enterprise integration is facilitated by an Enterprise Service Bus (ESB). This book provides comprehensive coverage of the fundamentals of the WSO2 ESB and its capabilities, through real-world enterprise integration use cases. What You'll Learn Get started with WSO2 ESB Discover message processing techniques with WSO2 ESB Integrate REST and SOAP services Use enterprise messaging techniques: JMS, AMQP, MQTT Manage file-based integration and integrate with proprietary systems such as SAP Extend and administrate WSO2 ESB Who This Book Is For: All levels of IT professionals from developers to integration architects who are interested in using WSO2 ESB for their SOA infrastructure.","language":"en","currency":"USD","id":"1484223438","title":"Beginning WSO2 ESB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HorJDQAAQBAJ&source=gbs_api","authors":["Kasun Indrasiri"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nPBZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Master the art of container management by using the power of Kubernetes, 2nd Edition","description":"Exploit design, deployment, and management of large-scale containers Key Features Explore the latest features available in Kubernetes 1.10 Ensure that your clusters are always available, scalable, and up to date Master the skills of designing and deploying large clusters on various cloud platforms Book Description Kubernetes is an open source system that is used to automate the deployment, scaling, and management of containerized applications. If you are running more containers or want automated management of your containers, you need Kubernetes at your disposal. To put things into perspective, Mastering Kubernetes walks you through the advanced management of Kubernetes clusters. To start with, you will learn the fundamentals of both Kubernetes architecture and Kubernetes design in detail. You will discover how to run complex stateful microservices on Kubernetes including advanced features such as horizontal pod autoscaling, rolling updates, resource quotas, and persistent storage backend. Using real-world use cases, you will explore the options for network configuration, and understand how to set up, operate, and troubleshoot various Kubernetes networking plugins. In addition to this, you will get to grips with custom resource development and utilization in automation and maintenance workflows. To scale up your knowledge of Kubernetes, you will encounter some additional concepts based on the Kubernetes 1.10 release, such as Promethus, Role-based access control, API aggregation, and more. By the end of this book, you’ll know everything you need to graduate from intermediate to advanced level of understanding Kubernetes. What you will learn Architect a robust Kubernetes cluster for long-time operation Discover the advantages of running Kubernetes on GCE, AWS, Azure, and bare metal Understand the identity model of Kubernetes, along with the options for cluster federation Monitor and troubleshoot Kubernetes clusters and run a highly available Kubernetes Create and configure custom Kubernetes resources and use third-party resources in your automation workflows Enjoy the art of running complex stateful applications in your container environment Deliver applications as standard packages Who this book is for Mastering Kubernetes is for you if you are a system administrator or a developer who has an intermediate understanding of Kubernetes and wish to master its advanced features. Basic knowledge of networking would also be helpful. In all, this advanced-level book provides a smooth pathway to mastering Kubernetes.","language":"en","currency":"USD","id":"1788999975","title":"Mastering Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nPBZDwAAQBAJ&source=gbs_api","authors":["Gigi Sayfan"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gnteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, deploy, and secure Microservices using TypeScript combined with Node.js","description":"Build robust microservice-based applications that are distributed, fault tolerant, and always available Key Features Learn to build message-driven services for effective communication Design microservices API using Reactive programming design patterns Deploy, scale and monitor microservices for consistent high performance Book Description In the last few years or so, microservices have achieved the rock star status and right now are one of the most tangible solutions in enterprises to make quick, effective, and scalable applications. The apparent rise of Typescript and long evolution from ES5 to ES6 has seen lots of big companies move to ES6 stack. If you want to learn how to leverage the power of microservices to build robust architecture using reactive programming and Typescript in Node.js, then this book is for you. Typescript Microservices is an end-to-end guide that shows you the implementation of microservices from scratch; right from starting the project to hardening and securing your services. We will begin with a brief introduction to microservices before learning to break your monolith applications into microservices. From here, you will learn reactive programming patterns and how to build APIs for microservices. The next set of topics will take you through the microservice architecture with TypeScript and communication between services. Further, you will learn to test and deploy your TypeScript microservices using the latest tools and implement continuous integration. Finally, you will learn to secure and harden your microservice. By the end of the book, you will be able to build production-ready, scalable, and maintainable microservices using Node.js and Typescript. What you will learn Get acquainted with the fundamentals behind microservices. Explore the behavioral changes needed for moving from monolithic to microservices. Dive into reactive programming, Typescript and Node.js to learn its fundamentals in microservices Understand and design a service gateway and service registry for your microservices. Maintain the state of microservice and handle dependencies. Perfect your microservice with unit testing and Integration testing Develop a microservice, secure it, deploy it, and then scale it Who this book is for This book is for JavaScript developers seeking to utilize their Node.js and Typescript skills to build microservices and move away from the monolithic architecture. Prior knowledge of TypeScript and Node.js is assumed.","language":"en","currency":"USD","id":"1788836855","title":"TypeScript Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gnteDwAAQBAJ&source=gbs_api","authors":["Parth Ghiya"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CedDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"A practical, comprehensive, and user-friendly approach to building microservices in Spring About This Book Update existing applications to integrate reactive streams released as a part of Spring 5.0 Learn how to use Docker and Mesos to push the boundaries and build successful microservices Upgrade the capability model to implement scalable microservices Who This Book Is For This book is ideal for Spring developers who want to build cloud-ready, Internet-scale applications, and simple RESTful services to meet modern business demands. What You Will Learn Familiarize yourself with the microservices architecture and its benefits Find out how to avoid common challenges and pitfalls while developing microservices Use Spring Boot and Spring Cloud to develop microservices Handle logging and monitoring microservices Leverage Reactive Programming in Spring 5.0 to build modern cloud native applications Manage internet-scale microservices using Docker, Mesos, and Marathon Gain insights into the latest inclusion of Reactive Streams in Spring and make applications more resilient and scalable In Detail The Spring Framework is an application framework and inversion of the control container for the Java platform. The framework's core features can be used by any Java application, but there are extensions to build web applications on top of the Java EE platform. This book will help you implement the microservice architecture in Spring Framework, Spring Boot, and Spring Cloud. Written to the latest specifications of Spring that focuses on Reactive Programming, you'll be able to build modern, internet-scale Java applications in no time. The book starts off with guidelines to implement responsive microservices at scale. Next, you will understand how Spring Boot is used to deploy serverless autonomous services by removing the need to have a heavyweight application server. Later, you'll learn how to go further by deploying your microservices to Docker and managing them with Mesos. By the end of the book, you will have gained more clarity on the implementation of microservices using Spring Framework and will be able to use them in internet-scale deployments through real-world examples. Style and approach The book takes a step-by-step approach on developing microservices using Spring Framework, Spring Boot, and a set of Spring Cloud components that will help you scale your applications.","language":"en","currency":"USD","id":"1787120511","title":"Spring 5.0 Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CedDDwAAQBAJ&source=gbs_api","authors":["Rajesh R V"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hnKhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":5,"subtitle":null,"description":"Microservices cannot be simply ‘wired up’ with some basic technical knowledge about what constitutes a Microservice Architecture. There is more to a Microservice Architecture than developing isolated and unique services with a blueprint like set of architectural artifacts. Successfully understanding microservices requires a paradigm shift no less radical than moving from a procedural to an object oriented programming language. Microservice Architecture is not just technical but also a new business philosophy rooted in antifragility, employee empowerment, and flattened power structures. This book will take you on an expedition to a yet to be fully explored ‘planet’ with a divergent philosophical underpinning that is completely alien to some technologists. Our voyage of discovery will be traveling through a landscape that is unrecognizable. If it were not for the historical map that explains the origins of this empowering technical perspective most would be disoriented at the outset of the voyage. New conceptualizations are found throughout the book. For instance, a Thought Leader within an Agile\/Open Source horizontally defined organizational power structure will be someone who has the business, marketing, technical, inspirational, entrepreneurial, and innovative abilities to help guide an organization's fused business and technical direction. That's right, the large lethargic organization will eventually shift from a hierarchical to a horizontal power structure with the resulting outcome being the elimination of many useless layers of bureaucracy and procedures. We are moving from the age of the monolith both technical and business into a world of nimble employee empowered organizations. Essentially, the new Enterprise Architect or whatever we end up calling this position will be a thought leader for the firm, having the insight across many disciplines to contemplatively drive the company into the 21st Century. In a flattened firm all the previously siloed departments like marketing, finance, leadership, technology, and... are united into cross discipline teams similar to how we utilize Agile in technology. The entire firm is Agilized - not a word yet but maybe it should be. Traveling to this new land of freedom requires that explorers not take any neat and tidy preconceptions with them - come along without any baggage. This book will challenge how you view technology to the core of your being. When you have finished this journey all that you believe and cherish from a technical standpoint will be cast aside.","language":"en","currency":"USD","id":"1096943581","title":"The Road to Microservice Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hnKhDwAAQBAJ&source=gbs_api","authors":["Raymond Pairan"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YmSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable and reactive microservices with Docker, Kubernetes, and OpenShift","description":"Discover how cloud-native microservice architecture helps you to build dynamically scalable applications by using the most widely used and adopted runtime environments Key Features Build robust cloud-native applications using a variety of tools Understand how to configure both Amazon Web Services (AWS) and Docker clouds for high availability Explore common design patterns used in building and deploying microservices architecture. Book Description Businesses today are evolving rapidly, and developers now face the challenge of building applications that are resilient, flexible, and native to the cloud. To achieve this, you'll need to be aware of the environment, tools, and resources that you're coding against. The book will begin by introducing you to cloud-native architecture and simplifying the major concepts. You'll learn to build microservices in Jakarta EE using MicroProfile with Thorntail and Narayana LRA. You'll then delve into cloud-native application x-rays, understanding the MicroProfile specification and the implementation\/testing of microservices. As you progress further, you'll focus on continuous integration and continuous delivery, in addition to learning how to dockerize your services. You'll also cover concepts and techniques relating to security, monitoring, and troubleshooting problems that might occur with applications after you've written them. By the end of this book, you will be equipped with the skills you need to build highly resilient applications using cloud-native microservice architecture. What you will learn Integrate reactive principles in MicroProfile microservices architecture Explore the 12-factors-app paradigm and its implications Get the best out of Java versions 8 and 9 to implement a microservice based on Thorntail Understand what OpenShift is and why it is so important for an elastic architecture Build a Linux container image using Docker and scale the application using Kubernetes Implement various patterns such as, Circuit Breaker and bulkheads Get to grips with the DevOps methodology using continuous integration (CI) and continuous deployment (CD) Who this book is for This book is for developers with basic knowledge of Java EE and HTTP-based application principles who want to learn how to build, test and scale Java EE microservices. No prior experience of writing microservices in Java EE is required.","language":"en","currency":"USD","id":"1788834429","title":"Hands-On Cloud-Native Microservices with Jakarta EE","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YmSGDwAAQBAJ&source=gbs_api","authors":["Luigi Fugaro","Mauro Vocale"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8c3LDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Cloud Native Applications with Go and Java for Docker and Kubernetes","description":"Get a comprehensive understanding of gRPC fundamentals through real-world examples. With this practical guide, you’ll learn how this high-performance interprocess communication protocol is capable of connecting polyglot services in microservices architecture, while providing a rich framework for defining service contracts and data types. Complete with hands-on examples written in Go, Java, Node, and Python, this book also covers the essential techniques and best practices to use gRPC in production systems. Authors Kasun Indrasiri and Danesh Kuruppu discuss the importance of gRPC in the context of microservices development.","language":"en","currency":"USD","id":"1492058289","title":"gRPC: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8c3LDwAAQBAJ&source=gbs_api","authors":["Kasun Indrasiri","Danesh Kuruppu"]},{"pageCount":149,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aSmsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"By Example","description":"Migrate your existing microservice cluster from ASP .NET to ASP .NET Core. While improved performance and cross-platform support are evident, this book helps you cut through the noise to determine how, when, and to what extent a migration is needed. Microsoft’s introduction of .NET Core has created a lot of excitement, but also a lot of confusion for developers accustomed to ASP applications and services. This book gives you specific steps to embark on a partial or full SaaS microservices system migration, factoring in limited resources, time, and finances. In addition to practical advice and real-world examples, many mishaps will be shared, providing you with a complete 360-degree view of a migration. As a developer intimately familiar with the migration process, author Iris Classon shares prescriptive guidance on every part of the system—from code, dependencies, editors, integration, and the deployment pipeline to a distribution model. You will come away with all the information you need to plan and prepare your migration to ASP.NET Core. What You’ll Learn Conduct an in-depth, pre-migration analysis of your system Know the differences between ASP .NET and ASP .NET Core Plan for and execute a full or partial migration to ASP .NET Core Understand the continuous integration and deployment process Gain insight on tools and templates that will accelerate and facilitate the migration process Leverage a real-world migration example, complete with genuine challenges Migrate specific components such as logging, authentication, data access, and more Who This Book Is For Developers who are considering or are tasked with migrating an existing microservice cluster from ASP.NET to ASP.NET Core. Experience with C#, Web API, ASP.NET, Visual Studio, and PowerShell is helpful.","language":"en","currency":"USD","id":"1484243277","title":"Migrating ASP.NET Microservices to ASP.NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aSmsDwAAQBAJ&source=gbs_api","authors":["Iris Classon"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bT_ADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"Second International, ICETCE 2019, Rajasthan, India, February 1st-2nd 2019, Revised Selected Papers","description":"These proceedings gather cutting-edge papers exploring the principles, techniques, and applications of Microservices in Big Data Analytics. The ICETCE-2019 is the latest installment in a successful series of annual conferences that began in 2011. Every year since, it has significantly contributed to the research community in the form of numerous high-quality research papers. This year, the conference’s focus was on the highly relevant area of Microservices in Big Data Analytics.","language":"en","currency":"USD","id":"9811501289","title":"Microservices in Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bT_ADwAAQBAJ&source=gbs_api","authors":["Anil Chaudhary","Chothmal Choudhary","Mukesh Kumar Gupta","Chhagan Lal","Tapas Badal"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CHg5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Architect enterprise-grade, Microservice-based solutions using Microsoft Azure Service Fabric. About This Book Explore architectural patterns for building modern day Microservice-based systems Learn about Microsoft Service Fabric as a platform to host distributed Microservices Discover multiple options for hosting Microservices on heterogeneous, cross-platform environments Learn to configure Azure Service Fabric clusters for enterprise-grade service deployments Who This Book Is For The book is aimed at IT architects, system administrators, and DevOps engineers who have a basic knowledge of the Microsoft Azure platform and are working on, or are curious about, the concepts of Microservices and Microservice architecture. What You Will Learn Understand the basics of Microservices and how Microsoft Azure fits into the equation Master Azure Service Fabric architecture and services Explore Azure Service Fabric application programming models Comprehensive study of various architecture patterns for building enterprise-grade Microservices Manage and deploy Microservices on Azure Service Fabric An insight into the future of Microservices with containers and serverless computing In Detail Microsoft Azure is rapidly evolving and is widely used as a platform on which you can build Microservices that can be deployed on-premise and on-cloud heterogeneous environments through Microsoft Azure Service Fabric. This book will help you understand the concepts of Microservice application architecture and build highly maintainable and scalable enterprise-grade applications using the various services in Microsoft Azure Service Fabric. We will begin by understanding the intricacies of the Microservices architecture and its advantages over the monolithic architecture and Service Oriented Architecture (SOA) principles. We will present various scenarios where Microservices should be used and walk you through the architectures of Microservice-based applications. Next, you will take an in-depth look at Microsoft Azure Service Fabric, which is the best–in-class platform for building Microservices. You will explore how to develop and deploy sample applications on Microsoft Azure Service Fabric to gain a thorough understanding of it. Building Microservice-based application is complicated. Therefore, we will take you through several design patterns that solve the various challenges associated with realizing the Microservices architecture in enterprise applications. Each pattern will be clearly illustrated with examples that you can keep referring to when designing applications. Finally, you will be introduced to advanced topics such as Serverless computing and DevOps using Service Fabric, to help you undertake your next venture with confidence. Style and approach This book introduces its readers to the concept of Microservices and Microsoft Azure Service Fabric as a distributed platform to host enterprise-grade Microservices. It then addresses common architectural challenges associated with the Microservice architecture, using proven architectural patterns.","language":"en","currency":"USD","id":"1787123480","title":"Microservices with Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CHg5DwAAQBAJ&source=gbs_api","authors":["Namit Tanasseri","Rahul Rai"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g5AwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Simple Solutions to Difficult Problems in Java 8 and 9","description":"The introduction of functional programming concepts in Java SE 8 was a drastic change for this venerable object-oriented language. Lambda expressions, method references, and streams fundamentally changed the idioms of the language, and many developers have been trying to catch up ever since. This cookbook will help. With more than 70 detailed recipes, author Ken Kousen shows you how to use the newest features of Java to solve a wide range of problems. For developers comfortable with previous Java versions, this guide covers nearly all of Java SE 8, and includes a chapter focused on changes coming in Java 9. Need to understand how functional idioms will change the way you write code? This cookbook—chock full of use cases—is for you. Recipes cover: The basics of lambda expressions and method references Interfaces in the java.util.function package Stream operations for transforming and filtering data Comparators and Collectors for sorting and converting streaming data Combining lambdas, method references, and streams Creating instances and extract values from Java’s Optional type New I\/O capabilities that support functional streams The Date-Time API that replaces the legacy Date and Calendar classes Mechanisms for experimenting with concurrency and parallelism","language":"en","currency":"USD","id":"1491973129","title":"Modern Java Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g5AwDwAAQBAJ&source=gbs_api","authors":["Ken Kousen"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Transitioning monolithic architectures using microservices with .NET Core 2.0 using C# 7.0, 2nd Edition","description":"Architect your .NET applications by breaking them into really small pieces - microservices -using this practical, example-based guide. Key Features Start your microservices journey and get a broader perspective on microservices development using C# 7.0 with .NET Core 2.0 Build, deploy, and test microservices using ASP.Net Core, ASP.NET Core API, and Microsoft Azure Cloud Get the basics of reactive microservices Book Description The microservices architectural style promotes the development of complex applications as a suite of small services based on business capabilities. This book will help you identify the appropriate service boundaries within your business. We'll start by looking at what microservices are and their main characteristics. Moving forward, you will be introduced to real-life application scenarios; after assessing the current issues, we will begin the journey of transforming this application by splitting it into a suite of microservices using C# 7.0 with .NET Core 2.0. You will identify service boundaries, split the application into multiple microservices, and define service contracts. You will find out how to configure, deploy, and monitor microservices, and configure scaling to allow the application to quickly adapt to increased demand in the future. With an introduction to reactive microservices, you’ll strategically gain further value to keep your code base simple, focusing on what is more important rather than on messy asynchronous calls. What you will learn Get acquainted with Microsoft Azure Service Fabric Compare microservices with monolithic applications and SOA Learn Docker and Azure API management Define a service interface and implement APIs using ASP.NET Core 2.0 Integrate services using a synchronous approach via RESTful APIs with ASP.NET Core 2.0 Implement microservices security using Azure Active Directory, OpenID Connect, and OAuth 2.0 Understand the operation and scaling of microservices in .NET Core 2.0 Understand the key features of reactive microservices and implement them using reactive extensions Who this book is for This book is for .NET Core developers who want to learn and understand the microservices architecture and implement it in their .NET Core applications. It’s ideal for developers who are completely new to microservices or just have a theoretical understanding of this architectural approach and want to gain a practical perspective in order to better manage application complexities.","language":"en","currency":"USD","id":"178839996X","title":"Building Microservices with .NET Core 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PvNFDwAAQBAJ&source=gbs_api","authors":["Gaurav Aroraa"]},{"pageCount":380,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_flqhFxlekQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39,"subtitle":"Patterns for High-Capability Internet-based Systems","description":"A practical, nuts-and-bolts guide to architectural solutions that describes step-by-step how to design robustness and flexibility into an Internet-based system Based on real-world problems and systems, and illustrated with a running case study Enables software architects and project managers to ensure that nonfunctional requirements are met so that the system won't fall over, that it can be maintained and upgraded without being switched off, and that it can deal with security, scalability, and performance demands Platform and vendor independence will empower architects to challenge product-dictated limitations","language":"en","currency":"USD","id":"0470855878","title":"Architecting Enterprise Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_flqhFxlekQC&source=gbs_api","authors":["Paul Dyson","Andrew Longshaw"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6JVCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"In OBJECT THINKING, esteemed object technologist David West contends that the mindset makes the programmer—not the tools and techniques. Delving into the history, philosophy, and even politics of object-oriented programming, West reveals how the best programmers rely on analysis and conceptualization—on thinking—rather than formal process and methods. Both provocative and pragmatic, this book gives form to what’s primarily been an oral tradition among the field’s revolutionary thinkers—and it illustrates specific object-behavior practices that you can adopt for true object design and superior results. Gain an in-depth understanding of: Prerequisites and principles of object thinking. Object knowledge implicit in eXtreme Programming (XP) and Agile software development. Object conceptualization and modeling. Metaphors, vocabulary, and design for object development. Learn viable techniques for: Decomposing complex domains in terms of objects. Identifying object relationships, interactions, and constraints. Relating object behavior to internal structure and implementation design. Incorporating object thinking into XP and Agile practice.","language":"en","currency":"USD","id":"0735637512","title":"Object Thinking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6JVCAwAAQBAJ&source=gbs_api","authors":["David West"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F8RiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Designing a real-world, enterprise-grade microservice ecosystem with the efficiency of C# 7","description":"Build enterprise-grade microservice ecosystems with intensive case studies using C# Key Features Learn to build message-based microservices Packed with case studies to explain the intricacies of large-scale microservices Build scalable, modular, and robust architectures with C# Book Description C# is a powerful language when it comes to building applications and software architecture using rich libraries and tools such as .NET. This book will harness the strength of C# in developing microservices architectures and applications. This book shows developers how to develop an enterprise-grade, event-driven, asynchronous, message-based microservice framework using C#, .NET, and various open source tools. We will discuss how to send and receive messages, how to design many types of microservice that are truly usable in a corporate environment. We will also dissect each case and explain the code, best practices, pros and cons, and more. Through our journey, we will use many open source tools, and create file monitors, a machine learning microservice, a quantitative financial microservice that can handle bonds and credit default swaps, a deployment microservice to show you how to better manage your deployments, and memory, health status, and other microservices. By the end of this book, you will have a complete microservice ecosystem you can place into production or customize in no time. What you will learn Explore different open source tools within the context of designing microservices Learn to provide insulation to exception-prone function calls Build common messages used between microservices for communication Learn to create a microservice using our base class and interface Design a quantitative financial machine microservice Learn to design a microservice that is capable of using Blockchain technology Who this book is for C# developers, software architects, and professionals who want to master the art of designing the microservice architecture that is scalable based on environment. Developers should have a basic understanding of.NET application development using C# and Visual Studio","language":"en","currency":"USD","id":"1789533767","title":"Hands-On Microservices with C#","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F8RiDwAAQBAJ&source=gbs_api","authors":["Matt R. Cole"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Develop microservice-based high performance web apps for the cloud with Go","description":"Discover practical techniques to build cloud-native apps that are scalable, reliable, and always available. Key Features Build well-designed and secure microservices. Enrich your microservices with continous integration and monitoring. Containerize your application with Docker Deploy your application to AWS. Learn how to utilize the powerful AWS services from within your application Book Description Awarded as one of the best books of all time by BookAuthority, Cloud Native Programming with Golang will take you on a journey into the world of microservices and cloud computing with the help of Go. Cloud computing and microservices are two very important concepts in modern software architecture. They represent key skills that ambitious software engineers need to acquire in order to design and build software applications capable of performing and scaling. Go is a modern cross-platform programming language that is very powerful yet simple; it is an excellent choice for microservices and cloud applications. Go is gaining more and more popularity, and becoming a very attractive skill. This book starts by covering the software architectural patterns of cloud applications, as well as practical concepts regarding how to scale, distribute, and deploy those applications. You will also learn how to build a JavaScript-based front-end for your application, using TypeScript and React. From there, we dive into commercial cloud offerings by covering AWS. Finally, we conclude our book by providing some overviews of other concepts and technologies that you can explore, to move from where the book leaves off. What you will learn Understand modern software applications architectures Build secure microservices that can effectively communicate with other services Get to know about event-driven architectures by diving into message queues such as Kafka, Rabbitmq, and AWS SQS. Understand key modern database technologies such as MongoDB, and Amazon’s DynamoDB Leverage the power of containers Explore Amazon cloud services fundamentals Know how to utilize the power of the Go language to access key services in the Amazon cloud such as S3, SQS, DynamoDB and more. Build front-end applications using ReactJS with Go Implement CD for modern applications Who this book is for This book is for developers who want to begin building secure, resilient, robust, and scalable Go applications that are cloud native. Some knowledge of the Go programming language should be sufficient.To build the front-end application, you will also need some knowledge of JavaScript programming.","language":"en","currency":"USD","id":"1787127966","title":"Cloud Native Programming with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvNFDwAAQBAJ&source=gbs_api","authors":["Mina Andrawos","Martin Helmich"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-izOiCEIABQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.19,"subtitle":"Refactoring Test Code","description":"Automated testing is a cornerstone of agile development. An effective testing strategy will deliver new functionality more aggressively, accelerate user feedback, and improve quality. However, for many developers, creating effective automated tests is a unique and unfamiliar challenge. xUnit Test Patterns is the definitive guide to writing automated tests using xUnit, the most popular unit testing framework in use today. Agile coach and test automation expert Gerard Meszaros describes 68 proven patterns for making tests easier to write, understand, and maintain. He then shows you how to make them more robust and repeatable--and far more cost-effective. Loaded with information, this book feels like three books in one. The first part is a detailed tutorial on test automation that covers everything from test strategy to in-depth test coding. The second part, a catalog of 18 frequently encountered \"test smells,\" provides trouble-shooting guidelines to help you determine the root cause of problems and the most applicable patterns. The third part contains detailed descriptions of each pattern, including refactoring instructions illustrated by extensive code samples in multiple programming languages.","language":"en","currency":"USD","id":"0132797461","title":"xUnit Test Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-izOiCEIABQC&source=gbs_api","authors":["Gerard Meszaros"]},{"pageCount":390,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build modern, cloud-native, and distributed systems using Spring Boot","description":"Learn to develop, test, and deploy your Spring Boot distributed application and explore various best practices. Key Features Build and deploy your microservices architecture in the cloud Build event-driven resilient systems using Hystrix and Turbine Explore API management tools such as KONG and API documentation tools such as Swagger Book Description Spring is one of the best frameworks on the market for developing web, enterprise, and cloud ready software. Spring Boot simplifies the building of complex software dramatically by reducing the amount of boilerplate code, and by providing production-ready features and a simple deployment model. This book will address the challenges related to power that come with Spring Boot's great configurability and flexibility. You will understand how Spring Boot configuration works under the hood, how to overwrite default configurations, and how to use advanced techniques to prepare Spring Boot applications to work in production. This book will also introduce readers to a relatively new topic in the Spring ecosystem – cloud native patterns, reactive programming, and applications. Get up to speed with microservices with Spring Boot and Spring Cloud. Each chapter aims to solve a specific problem or teach you a useful skillset. By the end of this book, you will be proficient in building and deploying your Spring Boot application. What you will learn Build logically structured and highly maintainable Spring Boot applications Configure RESTful microservices using Spring Boot Make the application production and operation-friendly with Spring Actuator Build modern, high-performance distributed applications using cloud patterns Manage and deploy your Spring Boot application to the cloud (AWS) Monitor distributed applications using log aggregation and ELK Who this book is for The book is targeted at experienced Spring and Java developers who have a basic knowledge of working with Spring Boot. The reader should be familiar with Spring Boot basics, and aware of its benefits over traditional Spring Framework-based applications.","language":"en","currency":"USD","id":"1787125149","title":"Mastering Spring Boot 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JHxeDwAAQBAJ&source=gbs_api","authors":["Dinesh Rajput"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gYY1DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Creating Asynchronous, Event-Based Applications","description":"In today’s app-driven era, when programs are asynchronous and responsiveness is so vital, reactive programming can help you write code that’s more reliable, easier to scale, and better-performing. With this practical book, Java developers will first learn how to view problems in the reactive way, and then build programs that leverage the best features of this exciting new programming paradigm. Authors Tomasz Nurkiewicz and Ben Christensen include concrete examples that use the RxJava library to solve real-world performance issues on Android devices as well as the server. You’ll learn how RxJava leverages parallelism and concurrency to help you solve today’s problems. This book also provides a preview of the upcoming 2.0 release. Write programs that react to multiple asynchronous sources of input without descending into \"callback hell\" Get to that aha! moment when you understand how to solve problems in the reactive way Cope with Observables that produce data too quickly to be consumed Explore strategies to debug and to test programs written in the reactive style Efficiently exploit parallelism and concurrency in your programs Learn about the transition to RxJava version 2","language":"en","currency":"USD","id":"1491931604","title":"Reactive Programming with RxJava","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gYY1DQAAQBAJ&source=gbs_api","authors":["Tomasz Nurkiewicz","Ben Christensen"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IthcDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Book + Content Update Program “Beyond just describing the basics, this book dives into best practices every aspiring microservices developer or architect should know.” —Foreword by Corey Sanders, Partner Director of Program Management, Azure Microservice-based applications enable unprecedented agility and ease of management, and Docker containers are ideal for building them. Microsoft Azure offers all the foundational technology and higher-level services you need to develop and run any microservices application. Microservices with Docker on Microsoft Azure brings together essential knowledge for creating these applications from the ground up, or incrementally deconstructing monolithic applications over time. The authors draw on their pioneering experience helping to develop Azure’s microservices features and collaborating with Microsoft product teams who’ve relied on microservices architectures for years. They illuminate the benefits and challenges of microservices development and share best practices all developers and architects should know. You’ll gain hands-on expertise through a detailed sample application, downloadable at github.com\/flakio\/flakio.github.io. Step by step, you’ll walk through working with services written in Node.js, Go, and ASP.NET 5, using diverse data stores (mysql, elasticsearch, block storage). The authors guide you through using Docker Hub as a service registry, and Microsoft Azure Container service for cluster management and service orchestration. Coverage includes: Recognizing how microservices architectures are different, and when they make sense Understanding Docker containers in the context of microservices architectures Building, pulling, and layering Docker images Working with Docker volumes, containers, images, tags, and logs Using Docker Swarm, Docker Compose, and Docker Networks Creating Docker hosts using the Azure portal, Azure Resource Manager, the command line, docker-machine, or locally via Docker toolbox Establishing development and DevOps environments to support microservices applications Making the most of Docker’s continuous delivery options Using Azure’s cluster and container orchestration capabilities to operate and scale containerized microservices applications with maximum resilience Monitoring microservices applications with Azure Diagnostics, Visual Studio Application Insights, and Microsoft Operations Management Suite Developing microservices applications faster and more effectively with Azure Service Fabric An extensive sample application demonstrating the microservices concepts discussed throughout the book is available online In addition, this book is part of InformIT’s exciting new Content Update Program, which provides content updates for major technology improvements! As significant updates are made to Docker and Azure, sections of this book will be updated or new sections will be added to match the updates to the technologies. As updates become available, they will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection. To learn more, visit informit.com\/cup. How to access the Web Edition: Follow the instructions inside to learn how to register your book to access the FREE Web Edition.","language":"en","currency":"USD","id":"0134218612","title":"Microservices with Docker on Microsoft Azure (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IthcDAAAQBAJ&source=gbs_api","authors":["Boris Scholl","Trent Swanson","Daniel Fernandez"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Kd9YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build self-healing, microservices-based, distributed systems using Spring Cloud","description":"Learn how to build, test, secure, deploy, and efficiently consume services across distributed systems. Key Features - Explore the wealth of options provided by Spring Cloud for wiring service dependencies in microservice systems. - Create microservices utilizing Spring Cloud's Netflix OSS - Architect your cloud-native data using Spring Cloud. Book Description Developing, deploying, and operating cloud applications should be as easy as local applications. This should be the governing principle behind any cloud platform, library, or tool. Spring Cloud–an open-source library–makes it easy to develop JVM applications for the cloud. In this book, you will be introduced to Spring Cloud and will master its features from the application developer's point of view. This book begins by introducing you to microservices for Spring and the available feature set in Spring Cloud. You will learn to configure the Spring Cloud server and run the Eureka server to enable service registration and discovery. Then you will learn about techniques related to load balancing and circuit breaking and utilize all features of the Feign client. The book now delves into advanced topics where you will learn to implement distributed tracing solutions for Spring Cloud and build message-driven microservice architectures. Before running an application on Docker container s, you will master testing and securing techniques with Spring Cloud. What you will learn - Abstract Spring Cloud's feature set - Create microservices utilizing Spring Cloud's Netflix OSS - Create synchronous API microservices based on a message-driven architecture. - Explore advanced topics such as distributed tracing, security, and contract testing. - Manage and deploy applications on the production environment Who this book is for This book appeals to developers keen to take advantage of Spring cloud, an open source library which helps developers quickly build distributed systems. Knowledge of Java and Spring Framework will be helpful, but no prior exposure to Spring Cloud is required.","language":"en","currency":"USD","id":"1788477243","title":"Mastering Spring Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Kd9YDwAAQBAJ&source=gbs_api","authors":["Piotr Mińkowski"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=utRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Develop event-driven, scalable, and reactive microservices with real-time monitoring","description":"The common patterns and practices of the microservice architecture and their application using the Clojure programming language. Key Features Relevance of the microservice architecture and benefits of Clojure's functional and simple features to implement it. Learn best practices and common principles to avoid common pitfalls while developing microservices. Learn how to use Pedestal to build your next microservices, secure them using JWT, and monitor them using the ELK stack Book Description The microservice architecture is sweeping the world as the de facto pattern with which to design and build scalable, easy-tomaintain web applications. This book will teach you common patterns and practices, and will show you how to apply these using the Clojure programming language. This book will teach you the fundamental concepts of architectural design and RESTful communication, and show you patterns that provide manageable code that is supportable in development and at scale in production. We will provide you with examples of how to put these concepts and patterns into practice with Clojure. This book will explain and illustrate, with practical examples, how teams of all sizes can start solving problems with microservices. You will learn the importance of writing code that is asynchronous and non-blocking and how Pedestal helps us do this. Later, the book explains how to build Reactive microservices in Clojure that adhere to the principles underlying the Reactive Manifesto. We finish off by showing you various ways to monitor, test, and secure your microservices. By the end, you will be fully capable of setting up, modifying, and deploying a microservice with Clojure and Pedestal. What you will learn Explore the pros and cons of monolithic and microservice architectures Use Clojure to effectively build a reallife application using Microservices Gain practical knowledge of the Clojure Pedestal framework and how to use it to build Microservices Explore various persistence patterns and learn how to use Apache Kafka to build event-driven microservice architectures Secure your Microservices using JWT Monitor Microservices at scale using the ELK stack Deploy Microservices at scale using container orchestration platforms such as Kubernetes Who this book is for You should have a working knowledge of programming in Clojure. However, no knowledge of RESTful architecture, microservices, or web services is expected. If you are looking to apply techniques to your own projects, taking your first steps into microservice architecture, this book is for you.","language":"en","currency":"USD","id":"1788626311","title":"Microservices with Clojure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=utRJDwAAQBAJ&source=gbs_api","authors":["Anuj Kumar"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8YLoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Mitigate exploits, malware, phishing, and other social engineering attacks","description":"After scrutinizing numerous cybersecurity strategies, Microsoft’s former Global Chief Security Advisor provides unique insights on the evolution of the threat landscape and how enterprises can address modern cybersecurity challenges. Key Features Protect your organization from cybersecurity threats with field-tested strategies by the former most senior security advisor at Microsoft Discover the most common ways enterprises initially get compromised Measure the effectiveness of your organization’s current cybersecurity program against cyber attacks Book Description Cybersecurity Threats, Malware Trends, and Strategies shares numerous insights about the threats that both public and private sector organizations face and the cybersecurity strategies that can mitigate them. The book provides an unprecedented long-term view of the global threat landscape by examining the twenty-year trend in vulnerability disclosures and exploitation, nearly a decade of regional differences in malware infections, the socio-economic factors that underpin them, and how global malware has evolved. This will give you further perspectives into malware protection for your organization. It also examines internet-based threats that CISOs should be aware of. The book will provide you with an evaluation of the various cybersecurity strategies that have ultimately failed over the past twenty years, along with one or two that have actually worked. It will help executives and security and compliance professionals understand how cloud computing is a game changer for them. By the end of this book, you will know how to measure the effectiveness of your organization’s cybersecurity strategy and the efficacy of the vendors you employ to help you protect your organization and yourself. What you will learn Discover cybersecurity strategies and the ingredients critical to their success Improve vulnerability management by reducing risks and costs for your organization Learn how malware and other threats have evolved over the past decade Mitigate internet-based threats, phishing attacks, and malware distribution sites Weigh the pros and cons of popular cybersecurity strategies of the past two decades Implement and then measure the outcome of a cybersecurity strategy Learn how the cloud provides better security capabilities than on-premises IT environments Who this book is for This book is for senior management at commercial sector and public sector organizations, including Chief Information Security Officers (CISOs) and other senior managers of cybersecurity groups, Chief Information Officers (CIOs), Chief Technology Officers (CTOs) and senior IT managers who want to explore the entire spectrum of cybersecurity, from threat hunting and security risk management to malware analysis. Governance, risk, and compliance professionals will also benefit. Cybersecurity experts that pride themselves on their knowledge of the threat landscape will come to use this book as a reference.","language":"en","currency":"USD","id":"1800205899","title":"Cybersecurity Threats, Malware Trends, and Strategies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8YLoDwAAQBAJ&source=gbs_api","authors":["Tim Rains"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oVmmDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Microservices is an architectural style in which large, complex software applications are composed of one or more smaller services. Each of these microservices focuses on completing one task that represents a small business capability. These microservices can be developed in any programming language. This IBM® Redbooks® publication shows how to break out a traditional Java EE application into separate microservices and provides a set of code projects that illustrate the various steps along the way. These code projects use the IBM WebSphere® Application Server Liberty, IBM API ConnectTM, IBM Bluemix®, and other Open Source Frameworks in the microservices ecosystem. The sample projects highlight the evolution of monoliths to microservices with Java and Node.","language":"en","currency":"USD","id":"0783442114","title":"Evolve the Monolith to Microservices with Java and Node","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oVmmDQAAQBAJ&source=gbs_api","authors":["Sandro De Santis","Luis Florez","Duy V Nguyen","Eduardo Rosa","IBM Redbooks"]},{"pageCount":139,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NZRRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build and deploy microservices with Spring Boot","description":"Unlock the power of Spring Boot to build and deploy production-ready microservices Key Features Get to know the advanced features of Spring Boot in order to develop and monitor applications Use Spring cloud to deploy and manage microservices on the cloud Look at embedded servers and deploy a test application to a PaaS Cloud platform Embedded with assessments that will help you revise the concepts you have learned in this book Book Description Microservices helps in decomposing applications into small services and move away from a single monolithic artifact. It helps in building systems that are scalable, flexible, and high resilient. Spring Boot helps in building REST-oriented, production-grade microservices. This book is a quick learning guide on how to build, monitor, and deploy microservices with Spring Boot. You'll be first familiarized with Spring Boot before delving into building microservices. You will learn how to document your microservice with the help of Spring REST docs and Swagger documentation. You will then learn how to secure your microservice with Spring Security and OAuth2. You will deploy your app using a self-contained HTTP server and also learn to monitor a microservice with the help of Spring Boot actuator. This book is ideal for Java developers who knows the basics of Spring programming and want to build microservices with Spring Boot. This book is embedded with useful assessments that will help you revise the concepts you have learned in this book. What you will learn Use Spring Initializr to create a basic spring project Build a basic microservice with Spring Boot Implement caching and exception handling Secure your microservice with Spring security and OAuth2 Deploy microservices using self-contained HTTP server Monitor your microservices with Spring Boot actuator Learn to develop more effectively with developer tools Who this book is for This book is aimed at Java developers who knows the basics of Spring programming and want to build microservices with Spring Boot.","language":"en","currency":"USD","id":"1789137896","title":"Spring: Microservices with Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NZRRDwAAQBAJ&source=gbs_api","authors":["Ranga Rao Karanam"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mkQJvjR2sX0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":null,"description":"The Definitive Guide to Service Engineering The key to succeeding with service-oriented architecture (SOA) is in comprehending the meaning and significance of its most fundamental building block: the service. It is through an understanding of service design that truly “service-oriented” solution logic can be created in support of achieving the strategic goals associated with SOA and service-oriented computing. Bestselling SOA author Thomas Erl guides you through a comprehensive, insightful, and visually rich exploration of the service-orientation design paradigm, revealing exactly how services should and should not be designed for real-world SOA.","language":"en","currency":"USD","id":"013271583X","title":"SOA Principles of Service Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mkQJvjR2sX0C&source=gbs_api","authors":["Thomas Erl"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Veb7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.If you are a .NET oriented web developer who is curious to find out what lies beyond the Microsoft provided frameworks, then this book is for you! It’s beneficial to have a good knowledge of C# and .NET, as well as a basic working knowledge of HTTP. If testability is important to you, and you’re looking for a lightweight, code focused approach to building web applications, this book offers you all the guidance that you will need.","language":"en","currency":"USD","id":"1783283920","title":"Instant Nancy Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Veb7AAAAQBAJ&source=gbs_api","authors":["Christian Horsdal"]},{"pageCount":275,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9qR5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Creating Reusable Software Components","description":"Apply design principles to your classes, preparing them for reuse. You will use package design principles to create packages that are just right in terms of cohesion and coupling, and are user- and maintainer-friendly at the same time. The first part of this book walks you through the five SOLID principles that will help you improve the design of your classes. The second part introduces you to the best practices of package design, and covers both package cohesion principles and package coupling principles. Cohesion principles show you which classes should be put together in a package, when to split packages, and if a combination of classes may be considered a \"package\" in the first place. Package coupling principles help you choose the right dependencies and prevent wrong directions in the dependency graph of your packages. What You'll Learn Apply the SOLID principles of class design Determine if classes belong in the same package Know whether it is safe for packages to depend on each other Who This Book Is For Software developers with a broad range of experience in the field, who are looking for ways to reuse,share, and distribute their code","language":"en","currency":"USD","id":"1484241193","title":"Principles of Package Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9qR5DwAAQBAJ&source=gbs_api","authors":["Matthias Noback"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JNCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Master design patterns of the Spring framework to build smart, efficient microservices","description":"Learn and use the design patterns and best practices in Spring to solve common design problems and build user-friendly microservices Key Features Study the benefits of using the right design pattern in your toolkit Manage your code easily with Spring's dependency injection pattern Explore the features of Docker and Mesos to build successful microservices Book Description Getting Started with Spring Microservices begins with an overview of the Spring Framework 5.0, its design patterns, and its guidelines that enable you to implement responsive microservices at scale. You will learn how to use GoF patterns in application design. You will understand the dependency injection pattern, which is the main principle behind the decoupling process of the Spring Framework and makes it easier to manage your code. Then, you will learn how to use proxy patterns in aspect-oriented programming and remoting. Moving on, you will understand the JDBC template patterns and their use in abstracting database access. After understanding the basics, you will move on to more advanced topics, such as reactive streams and concurrency. Written to the latest specifications of Spring that focuses on Reactive Programming, the Learning Path teaches you how to build modern, internet-scale Java applications in no time. Next, you will understand how Spring Boot is used to deploying serverless autonomous services by removing the need to have a heavyweight application server. You’ll also explore ways to deploy your microservices to Docker and managing them with Mesos. By the end of this Learning Path, you will have the clarity and confidence for implementing microservices using Spring Framework. This Learning Path includes content from the following Packt products: Spring 5 Microservices by Rajesh R V Spring 5 Design Patterns by Dinesh Rajput What you will learn Develop applications using dependency injection patterns Build web applications using traditional Spring MVC patterns Utilize the reactive programming pattern to build reactive web apps Learn concurrency and handle multiple connections inside a web server Use Spring Boot and Spring Cloud to develop microservices Leverage reactive programming to build cloud-native applications Who this book is for Getting Started with Spring Microservices is ideal for Spring developers who want to use design patterns to solve common design problems and build cloud-ready, Internet-scale applications, and simple RESTful services.","language":"en","currency":"USD","id":"1789958180","title":"Building Microservices with Spring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JNCBDwAAQBAJ&source=gbs_api","authors":["Dinesh Rajput","Rajesh R V"]},{"pageCount":511,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S8l-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"An Authoritative Guide to Building Microservices, Web and Enterprise Applications, and Best Practices","description":"Quickly and productively develop complex Spring applications and microservices out of the box, with minimal concern over things like configurations. This revised book will show you how to fully leverage the Spring Boot 2 technology and how to apply it to create enterprise ready applications that just work. It will also cover what's been added to the new Spring Boot 2 release, including Spring Framework 5 features like WebFlux, Security, Actuator and the new way to expose Metrics through Micrometer framework, and more. This book is your authoritative hands-on practical guide for increasing your enterprise Java and cloud application productivity while decreasing development time. It's a no nonsense guide with case studies of increasing complexity throughout the book. The author, a senior solutions architect and Principal Technical instructor with Pivotal, the company behind the Spring Framework, shares his experience, insights and first-hand knowledge about how Spring Boot technology works and best practices. Pro Spring Boot 2 is an essential book for your Spring learning and reference library. What You Will Learn Configure and use Spring Boot Use non-functional requirements with Spring Boot Actuator Carry out web development with Spring Boot Persistence with JDBC, JPA and NoSQL Databases Messaging with JMS, RabbitMQ and WebSockets Test and deploy with Spring Boot A quick look at the Spring Cloud projects Microservices and deployment to the Cloud Extend Spring Boot by creating your own Spring Boot Starter and @Enable feature Who This Book Is For Experienced Spring and Java developers seeking increased productivity gains and decreased complexity and development time in their applications and software services.","language":"en","currency":"USD","id":"1484236769","title":"Pro Spring Boot 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S8l-DwAAQBAJ&source=gbs_api","authors":["Felipe Gutierrez"]},{"pageCount":143,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ryDqYwURjqUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.5,"subtitle":"Integrated Rule-Oriented Data System","description":"Policy-based data management enables the creation of community-specific collections. Every collection is created for a purpose. The purpose defines the set of properties that will be associated with the collection. The properties are enforced by management policies that control the execution of procedures that are applied whenever data are ingested or accessed. The procedures generate state information that defines the outcome of enforcing the management policy. The state information can be queried to validate assessment criteria and verify that the required collection properties have been conserved. The integrated Rule-Oriented Data System implements the data management framework required to support policy-based data management. Policies are turned into computer actionable Rules. Procedures are composed from a Micro-service-oriented architecture. The result is a highly extensible and tunable system that can enforce management policies, automate administrative tasks, and periodically validate assessment criteria. Table of Contents: Introduction \/ Integrated Rule-Oriented Data System \/ iRODS Architecture \/ Rule-Oriented Programming \/ The iRODS Rule System \/ iRODS Micro-services \/ Example Rules \/ Extending iRODS \/ Appendix A: iRODS Shell Commands \/ Appendix B: Rulegen Grammar \/ Appendix C: Exercises \/ Author Biographies","language":"en","currency":"USD","id":"1608453332","title":"IRODS Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ryDqYwURjqUC&source=gbs_api","authors":["Arcot Rajasekar","Reagan Moore","Chen-Yi Hou"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Max Kanat-Alexander on simplicity, coding, and how to suck less as a programmer","description":"Software legend Max Kanat-Alexander shows you how to succeed as a developer by embracing simplicity, with forty-three essays that will help you really understand the software you work with. About This Book Read and enjoy the superlative writing and insights of the legendary Max Kanat-Alexander Learn and reflect with Max on how to bring simplicity to your software design principles Discover the secrets of rockstar programmers and how to also just suck less as a programmer Who This Book Is For Understanding Software is for every programmer, or anyone who works with programmers. If life is feeling more complex than it should be, and you need to touch base with some clear thinking again, this book is for you. If you need some inspiration and a reminder of how to approach your work as a programmer by embracing some simplicity in your work again, this book is for you. If you're one of Max's followers already, this book is a collection of Max's thoughts selected and curated for you to enjoy and reflect on. If you're new to Max's work, and ready to connect with the power of simplicity again, this book is for you! What You Will Learn See how to bring simplicity and success to your programming world Clues to complexity - and how to build excellent software Simplicity and software design Principles for programmers The secrets of rockstar programmers Max's views and interpretation of the Software industry Why Programmers suck and how to suck less as a programmer Software design in two sentences What is a bug? Go deep into debugging In Detail In Understanding Software, Max Kanat-Alexander, Technical Lead for Code Health at Google, shows you how to bring simplicity back to computer programming. Max explains to you why programmers suck, and how to suck less as a programmer. There's just too much complex stuff in the world. Complex stuff can't be used, and it breaks too easily. Complexity is stupid. Simplicity is smart. Understanding Software covers many areas of programming, from how to write simple code to profound insights into programming, and then how to suck less at what you do! You'll discover the problems with software complexity, the root of its causes, and how to use simplicity to create great software. You'll examine debugging like you've never done before, and how to get a handle on being happy while working in teams. Max brings a selection of carefully crafted essays, thoughts, and advice about working and succeeding in the software industry, from his legendary blog Code Simplicity. Max has crafted forty-three essays which have the power to help you avoid complexity and embrace simplicity, so you can be a happier and more successful developer. Max's technical knowledge, insight, and kindness, has earned him code guru status, and his ideas will inspire you and help refresh your approach to the challenges of being a developer. Style and approach Understanding Software is a new selection of carefully chosen and crafted essays from Max Kanat-Alexander's legendary blog call Code Simplicity. Max's writing and thoughts are great to sit and read cover to cover, or if you prefer you can drop in and see what you discover new every single time!","language":"en","currency":"USD","id":"1788628349","title":"Understanding Software","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4plGDwAAQBAJ&source=gbs_api","authors":["Max Kanat-Alexander"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bOWYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Second International Conference, ICETCE 2019, Jaipur, India, February 1–2, 2019, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the Second International Conference on Emerging Technologies in Computer Engineering: Microservices in Big Data Analytics, ICETCE 2019, held in Jaipur, India, in February 2019. The 28 revised full papers along with 1 short paper presented were carefully reviewed and selected from 253 submissions. ICETCE conference aims to showcase advanced technologies, techniques, innovations and equipments in computer engineering. It provides a platform for researchers, scholars, experts, technicians, government officials and industry personnel from all over the world to discuss and share their valuable ideas and experiences.","language":"en","currency":"USD","id":"9811383006","title":"Emerging Technologies in Computer Engineering: Microservices in Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bOWYDwAAQBAJ&source=gbs_api","authors":["Arun K. Somani","Seeram Ramakrishna","Anil Chaudhary","Chothmal Choudhary","Basant Agarwal"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pZd2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Docker Across Microservices","description":"Discover how a software engineer can leverage Docker in order to expedite development velocity. This book focuses on the fundamental concepts this program is built upon and explores how it can help you get your services up and running inside Docker containers. You'll also review tips on how to debug microservices applications that run inside Docker containers. Tech companies are now developing complex softwares that are comprised of multiple services running on different platforms, and Docker has become an essential part of coordinating the communication between these services and platforms. This book addresses problems caused by drifting microservices, debugging across services, inconsistent environments across machines, and coordinating development of machine learning systems between a team of developers, etc. Accelerating Development Velocity Using Docker puts you on the path to transforming your complex systems into more efficient ones. What You'll Learn Setup Docker and employ quick solutions to road blocks Review challenges associated with debugging microservices that sit behind a complex application Leverage Docker features to seamlessly get multiple microservices up and running Debug inside a Docker container Review advanced use cases of Docker that can help consistency of development environments· Who This Book Is For Ideal for new to mid-level infrastructure engineers who want to learn how to make their development environments efficient across their and cross teams, or for students who aspire to learn basics of how to debug distributed systems and how to develop efficient applications.","language":"en","currency":"USD","id":"1484239369","title":"Accelerating Development Velocity Using Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pZd2DwAAQBAJ&source=gbs_api","authors":["Kinnary Jangla"]}]