[{"pageCount":225,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KW48DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book provides an effective overview of the state-of-the art in software engineering, with a projection of the future of the discipline. It includes 13 papers, written by leading researchers in the respective fields, on important topics like model-driven software development, programming language design, microservices, software reliability, model checking and simulation. The papers are edited and extended versions of the presentations at the PAUSE symposium, which marked the completion of 14 years of work at the Chair of Software Engineering at ETH Zurich. In this inspiring context, some of the greatest minds in the field extensively discussed the past, present and future of software engineering. It guides readers on a voyage of discovery through the discipline of software engineering today, offering unique food for thought for researchers and professionals, and inspiring future research and development.","language":"en","currency":"USD","id":"3319674250","title":"Present and Ulterior Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KW48DwAAQBAJ&source=gbs_api","authors":["Manuel Mazzara","Bertrand Meyer"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q8JoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build enterprise-ready scalable applications with architectural design patterns","description":"Get the deep insights you need to master efficient architectural design considerations and solve common design problems in your enterprise applications. Key Features The benefits and applicability of using different design patterns in JAVA EE Learn best practices to solve common design and architectural challenges Choose the right patterns to improve the efficiency of your programs Book Description Patterns are essential design tools for Java developers. Java EE Design Patterns and Best Practices helps developers attain better code quality and progress to higher levels of architectural creativity by examining the purpose of each available pattern and demonstrating its implementation with various code examples. This book will take you through a number of patterns and their Java EE-specific implementations. In the beginning, you will learn the foundation for, and importance of, design patterns in Java EE, and then will move on to implement various patterns on the presentation tier, business tier, and integration tier. Further, you will explore the patterns involved in Aspect-Oriented Programming (AOP) and take a closer look at reactive patterns. Moving on, you will be introduced to modern architectural patterns involved in composing microservices and cloud-native applications. You will get acquainted with security patterns and operational patterns involved in scaling and monitoring, along with some patterns involved in deployment. By the end of the book, you will be able to efficiently address common problems faced when developing applications and will be comfortable working on scalable and maintainable projects of any size. What you will learn Implement presentation layers, such as the front controller pattern Understand the business tier and implement the business delegate pattern Master the implementation of AOP Get involved with asynchronous EJB methods and REST services Involve key patterns in the adoption of microservices architecture Manage performance and scalability for enterprise-level applications Who this book is for Java developers who are comfortable with programming in Java and now want to learn how to implement design patterns to create robust, reusable and easily maintainable apps.","language":"en","currency":"USD","id":"1788837738","title":"Java EE 8 Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q8JoDwAAQBAJ&source=gbs_api","authors":["Rhuan Rocha","João Purificação"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0i1EDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Explore the concept of continuous delivery and integrate it with data science concepts","description":"Transform yourself into a specialist in DevOps adoption for Big Data on cloud About This Book Learn the concepts of Bigdata and Devops and Implement them Get Acquainted with DevOps Frameworks Methodologies and Tools A practical approach to build and work efficiently with your big data cluster Get introduced to multiple flavors of tools and platforms from vendors on Hadoop, Cloud, Containers and IoT Offerings In-Depth Technology understanding on Data Sciences, Microservices, Bigdata Who This Book Is For If you are a Big Data Architects, solutions provider, or any stakeholder working in big data environment and wants to implement the strategy of DevOps, then this book is for you. What You Will Learn Learn about the DevOps culture, its frameworks, maturity, and design patterns Get acquainted with multiple niche technologies microservices, containers, kubernetes, IoT, and cloud Build big data clusters, enterprise applications and data science models Apply DevOps concepts for continuous integration, delivery, deployment and monitoring Get introduced to Open source tools, service offerings from multiple vendors Start digital journey to apply DevOps concepts to migrate big data, cloud, microservices, IoT, security, ERP systems In Detail DevOps strategies have really become an important factor for big data environments. This book initially provides an introduction to big data, DevOps, and Cloud computing along with the need for DevOps strategies in big data environments. We move on to explore the adoption of DevOps frameworks and business scenarios. We then build a big data cluster, deploy it on the cloud, and explore DevOps activities such as CI\/CD and containerization. Next, we cover big data concepts such as ETL for data sources, Hadoop clusters, and their applications. Towards the end of the book, we explore ERP applications useful for migrating to DevOps frameworks and examine a few case studies for migrating big data and prediction models. By the end of this book, you will have mastered implementing DevOps tools and strategies for your big data clusters. Style and approach A clear, concise, and straightforward book that will enable you to use and implement DevOps on big data to improve the efficiency.","language":"en","currency":"USD","id":"1788476042","title":"Hands-on DevOps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0i1EDwAAQBAJ&source=gbs_api","authors":["Sricharan Vadapalli"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AulODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Grasp the fundamentals of Spring 5.0 to build modern, robust, and scalable Java applications","description":"Discover the real power of Spring Framework 5.0 and learn to create powerful applications in its newest version Key Features Learn reactive programming by implementing a reactive application with Spring Webflux Create a robust and scalable messaging application with Spring messaging support Apply your knowledge to build three real-world projects in Spring Book Description With growing demands, organizations are looking for systems that are robust and scalable. Therefore, the Spring Framework has become the most popular framework for Java development. It not only simplifies software development but also improves developer productivity. This book covers effective ways to develop robust applications in Java using Spring. The book has three parts, where each one covers the building of a comprehensive project in Java and Spring. In the first part, you will construct a CMS Portal using Spring's support for building REST APIs. You will also learn to integrate these APIs with AngularJS and later develop this application in a reactive fashion using Project Reactor, Spring WebFlux, and Spring Data. In the second part, you’ll understand how to build a messaging application, which will consume the Twitter API and perform filtering and transformations. Here, you will also learn about server-sent events and explore Spring’s support for Kotlin, which makes application development quick and efficient. In the last part, you will build a real microservice application using the most important techniques and patterns such as service discovery, circuit breakers, security, data streams, monitoring, and a lot more from this architectural style. By the end of the book, you will be confident about using Spring to build your applications. What you will learn Implement REST APIs with Spring REST support Introduce the Spring Boot and understand how it makes creating robust applications extremely simple Understand how Spring Data helps us add persistence in MongoDB and SQL databases Introduce Reactive Programming and use this with Spring Webflux Implement a Reactive REST client and learn how it can create asynchronous applications Create a robust, scalable, and fault tolerant application with Spring Messaging Implement a websocket to add interactive behaviors in your applications Introduce the Spring Cloud projects Who this book is for If you’re a developer starting out with Spring, then this book will help you learn about the new Spring 5.0 framework concepts followed by their implementation in Java and Kotlin. The book will also help experienced Spring developers gain insights into the new features added in Spring 5.0.","language":"en","currency":"USD","id":"1788628020","title":"Spring 5.0 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AulODwAAQBAJ&source=gbs_api","authors":["Claudio Eduardo de Oliveira"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":28,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XO1So8BTj2wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"DevOps is as much about culture as it is about tools When people talk about DevOps, they often emphasize configuration management systems, source code repositories, and other tools. But, as Mandi Walls explains in this Velocity report, DevOps is really about changing company culture—replacing traditional development and operations silos with collaborative teams of people from both camps. The DevOps movement has produced some efficient teams turning out better products faster. The tough part is initiating the change. This report outlines strategies for managers looking to go beyond tools to build a DevOps culture among their technical staff. Topics include: Documenting reasons for changing to DevOps before you commit Defining meaningful and achievable goals Finding a technical leader to be an evangelist, tools and process expert, and shepherd Starting with a non-critical but substantial pilot project Facilitating open communication among developers, QA engineers, marketers, and other professionals Realigning your team’s responsibilities and incentives Learning when to mediate disagreements and conflicts Download this free report and learn how to the DevOps approach can help you create a supportive team environment built on communication, respect, and trust. Mandi Walls is a Senior Consultant with Opscode.","language":"en","currency":"USD","id":"1449368360","title":"Building a DevOps Culture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XO1So8BTj2wC&source=gbs_api","authors":["Mandi Walls"]},{"pageCount":494,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qO_CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Re-architect and rebuild your applications using cloud-native technologies","description":"Modernize your apps with Microsoft Azure by moving web, desktop, and mobile apps to the cloud Key Features Decide which migration strategy is most suitable for your organization and create a migration roadmap Move existing infrastructure to Azure and learn strategies to reduce cost, increase storage, and improve ROI Design secure, scalable, and cost-effective solutions with the help of practical examples Book Description Whether you are trying to re-architect a legacy app or build a cloud-ready app from scratch, using the Azure ecosystem with .NET and Java technologies helps you to strategize and plan your app modernization process effectively. With this book, you’ll learn how to modernize your applications by using Azure for containerization, DevOps, microservices, and serverless solutions to reduce development time and costs, while also making your applications robust, secure, and scalable. You will delve into improving application efficiency by using container services such as Azure Container Service, Azure Kubernetes Service (AKS), and more. Next, you will learn to modernize your application by implementing DevOps throughout your application development life cycle. You will then focus on increasing the scalability and performance of your overall application with microservices, before learning how to add extra functionality to your application with Azure serverless solutions. Finally, you’ll get up to speed with monitoring and troubleshooting techniques. By the end of this book, you will have learned how to use the Azure ecosystem to refactor, re-architect, and rebuild your web, mobile, and desktop applications. What you will learn Use DevOps and containerization technologies to modernize your applications and infrastructure Build microservices using Azure Service Fabric Develop scalable applications using Azure Functions Manage and deploy your application code and database connectivity Secure and monitor your applications in Azure effectively Design for high availability and disaster recovery Who this book is for This book is for.NET and Java developers who want to modernize their applications using Azure. Solution architects and experienced developers interested in modernizing legacy applications using Azure will also find this book useful. Some prior understanding of cloud computing concepts will be beneficial.","language":"en","currency":"USD","id":"1839214031","title":"Migrating Applications to the Cloud with Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qO_CDwAAQBAJ&source=gbs_api","authors":["Sjoukje Zaal","Amit Malik","Sander Rossel","Jason Marston","Mohamed Wali","Stefano Demiliani"]},{"pageCount":309,"thumbnail":"http:\/\/books.google.com\/books\/content?id=38msDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Analyze and Reduce Technical Debt","description":"Today's programmers don't develop software systems from scratch. instead, they spend their time fixing, extending, modifying, and enhancing existing software. Legacy systems often turn into an unwieldy mess that becomes increasingly difficult to modify, and with architecture that continually accumulates technical debt. Carola Lilienthal has analyzed more than 300 software systems written in Java, C#, C++, PHP, ABAP, and TypeScript and, together with her teams, has successfully refactored them. This book condenses her experience with monolithic systems, architectural and design patterns, layered architectures, domain-driven design, and microservices. With more than 200 color images from real-world systems, good and sub-optimal sample solutions are presented in a comprehensible and thorough way, while recommendations and suggestions based on practical projects allow the reader to directly apply the author's knowledge to their daily work. \"Throughout the book, Dr. Lilienthal has provided sound advice on diagnosing, understanding, disentangling, and ultimately preventing the issues that make software systems brittle and subject to breakage. In addition to the technical examples that you'd expect in a book on software architecture, she takes the time to dive into the behavioral and human aspects that impact sustainability and, in my experience, are inextricably linked to the health of a codebase. She also expertly zooms out, exploring architecture concepts such as domains and layers, and then zooms in to the class level where your typical developer works day-to-day. This holistic approach is crucial for implementing long-lasting change.\" From the Foreword of Andrea Goulet CEO, Corgibytes, Founder, Legacy Code Rocks","language":"en","currency":"USD","id":"3960887817","title":"Sustainable Software Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=38msDwAAQBAJ&source=gbs_api","authors":["Carola Lilienthal"]},{"pageCount":436,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Viktor Farcic's latest book, The DevOps 2.1 Toolkit: Docker Swarm, shows you how to successfully integrate Docker Swarm into your DevOps toolset. About This Book Expand your DevOps Toolkit with the DevOps thought leader, Viktor Farcic Build, test, deploy, and monitor services inside Docker Swarm clusters Translate your understanding to different hosting providers like AWS, Azure, and DigitalOcean Go beyond simple deployment to explore how to create a continuous deployment process Extend the deep understanding you gained from Viktor's DevOps 2.0 Toolkit book Who This Book Is For This book is for professionals interested in the full microservices life cycle combined with continuous deployment and containers. Target audience could be architects who want to know how to design their systems around microservices. It could be DevOps wanting to know how to apply modern configuration management practices and continuously deploy applications packed in containers. It is for developers who would like to take the process back into their hands as well as for managers who would like to gain a better understanding of the process used to deliver software from the beginning to the end. This book is for everyone wanting to know more about the software development life cycle starting from requirements and design, through the development and testing all the way until deployment and post-deployment phases. We'll create the processes taking into account the best practices developed by and for some of the biggest companies. What You Will Learn Learn all aspects of Docker Swarm from building, testing, deploying, and monitoring services inside Docker Swarm clusters, available since Docker 1.12. Master the deeper logic of DevOps with Viktor, so that you can successfully apply that logic across any specific set of tools you're working with. Translate a deep understanding to different hosting providers like AWS, Azure, DigitalOcean, among others. You'll go beyond simple deployment: you will explore with Viktor how to create a continuous deployment process. Accomplish zero-downtime deployments, and what to do in case of a failover. Know how to run services at scale, how to monitor the systems, and how to make it heal itself. In Detail Viktor Farcic's latest book, The DevOps 2.1 Toolkit: Docker Swarm, takes you deeper into one of the major subjects of his international best seller, The DevOps 2.0 Toolkit, and shows you how to successfully integrate Docker Swarm into your DevOps toolset. Viktor shares with you his expert knowledge in all aspects of building, testing, deploying, and monitoring services inside Docker Swarm clusters. You'll go through all the tools required for running a cluster. You'll travel through the whole process with clusters running locally on a laptop. Once you're confident with that outcome, Viktor shows you how to translate your experience to different hosting providers like AWS, Azure, and DigitalOcean. Viktor has updated his DevOps 2.0 framework in this book to use the latest and greatest features and techniques introduced in Docker. We'll go through many practices and even more tools. While there will be a lot of theory, this is a hands-on book. You won't be able to complete it by reading it on the metro on your way to work. You'll have to read this book while in front of the computer and get your hands dirty. Style and approach We'll go through many practices and even more tools. While there will be a lot of theory, this is a hands-on book. You'll have to read this book while in front of the computer and get your hands dirty. The goal is not to master one particular set of tools, but to learn the logic behind them so that you can apply it to your job in various contexts.","language":"en","currency":"USD","id":"1787280608","title":"The DevOps 2.1 Toolkit: Docker Swarm","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hHc5DwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uq-pBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Learning Journeys for the Whole Team","description":"Janet Gregory and Lisa Crispin pioneered the agile testing discipline with their previous work, Agile Testing. Now, in More Agile Testing, they reflect on all they’ve learned since. They address crucial emerging issues, share evolved agile practices, and cover key issues agile testers have asked to learn more about. Packed with new examples from real teams, this insightful guide offers detailed information about adapting agile testing for your environment; learning from experience and continually improving your test processes; scaling agile testing across teams; and overcoming the pitfalls of automated testing. You’ll find brand-new coverage of agile testing for the enterprise, distributed teams, mobile\/embedded systems, regulated environments, data warehouse\/BI systems, and DevOps practices. You’ll come away understanding • How to clarify testing activities within the team • Ways to collaborate with business experts to identify valuable features and deliver the right capabilities • How to design automated tests for superior reliability and easier maintenance • How agile team members can improve and expand their testing skills • How to plan “just enough,” balancing small increments with larger feature sets and the entire system • How to use testing to identify and mitigate risks associated with your current agile processes and to prevent defects • How to address challenges within your product or organizational context • How to perform exploratory testing using “personas” and “tours” • Exploratory testing approaches that engage the whole team, using test charters with session- and thread-based techniques • How to bring new agile testers up to speed quickly–without overwhelming them The eBook edition of More Agile Testing also is available as part of a two-eBook collection, The Agile Testing Collection (9780134190624).","language":"en","currency":"USD","id":"0133749568","title":"More Agile Testing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uq-pBAAAQBAJ&source=gbs_api","authors":["Janet Gregory","Lisa Crispin"]},{"pageCount":422,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UbQSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop maintainable and efficient code, 2nd Edition","description":"This Python coding book will help you understand the problems that arise due to inefficient code, demonstrating to you how to correct them.","language":"en","currency":"USD","id":"1800562098","title":"Clean Code in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UbQSEAAAQBAJ&source=gbs_api","authors":["Mariano Anaya"]},{"pageCount":253,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CNWyDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":119.2,"subtitle":"Proceedings of the 25th International Conference on Information Systems Development","description":"This volume is a collection of papers on emerging concepts, approaches and ideas in information systems research. It examines theoretical and methodological issues related to both information systems development in general and the complexity of information systems as socio-technical systems. The book draws on invited papers selected from the proceedings of the 25th International Conference on Information Systems Development (ISD) held in Katowice, Poland, August 24 - 26, 2016. The invited conference papers were revised and expanded and present research that is focused on context, creativity, and cognition in information systems development. These issues are significant as they provide the basis for organizations to identify new markets, support innovative technology deployment, and enable mobile applications to detect, sense, interpret, and respond to the environment.","language":"en","currency":"USD","id":"331952593X","title":"Complexity in Information Systems Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CNWyDgAAQBAJ&source=gbs_api","authors":["Jerzy Goluchowski","Malgorzata Pankowska","Henry Linger","Chris Barry","Michael Lang","Christoph Schneider"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CglnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Learn effective ways to secure your applications with Spring and Spring WebFlux","description":"Secure your Java applications by integrating the Spring Security framework in your code Key Features Provide authentication, authorization and other security features for Java applications. Learn how to secure microservices, cloud, and serverless applications easily Understand the code behind the implementation of various security features Book Description Security is one of the most vital concerns for any organization. The complexity of an application is compounded when you need to integrate security with existing code, new technology, and other frameworks. This book will show you how to effectively write Java code that is robust and easy to maintain. Hands-On Spring Security 5 for Reactive Applications starts with the essential concepts of reactive programming, Spring Framework, and Spring Security. You will then learn about a variety of authentication mechanisms and how to integrate them easily with the Spring MVC application. You will also understand how to achieve authorization in a Spring WebFlux application using Spring Security.You will be able to explore the security confgurations required to achieve OAuth2 for securing REST APIs and integrate security in microservices and serverless applications. This book will guide you in integrating add-ons that will add value to any Spring Security module. By the end of the book, you will be proficient at integrating Spring Security in your Java applications What you will learn Understand how Spring Framework and Reactive application programming are connected Implement easy security confgurations with Spring Security expressions Discover the relationship between OAuth2 and OpenID Connect Secure microservices and serverless applications with Spring Integrate add-ons, such as HDIV, Crypto Module, and CORS support Apply Spring Security 5 features to enhance your Java reactive applications Who this book is for If you are a Java developer who wants to improve application security, then this book is for you. A basic understanding of Spring, Spring Security framework, and reactive applications is required to make the most of the book.","language":"en","currency":"USD","id":"1788990072","title":"Hands-On Spring Security 5 for Reactive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CglnDwAAQBAJ&source=gbs_api","authors":["Tomcy John"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MMNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design concurrent and asynchronous applications using the RxCpp library and Modern C++17","description":"Learn how to implement the reactive programming paradigm with C++ and build asynchronous and concurrent applications Key Features Efficiently exploit concurrency and parallelism in your programs Use the Functional Reactive programming model to structure programs Understand reactive GUI programming to make your own applications using Qt Book Description Reactive programming is an effective way to build highly responsive applications with an easy-to-maintain code base. This book covers the essential functional reactive concepts that will help you build highly concurrent, event-driven, and asynchronous applications in a simpler and less error-prone way. C++ Reactive Programming begins with a discussion on how event processing was undertaken by different programming systems earlier. After a brisk introduction to modern C++ (C++17), you’ll be taken through language-level concurrency and the lock-free programming model to set the stage for our foray into the Functional Programming model. Following this, you’ll be introduced to RxCpp and its programming model. You’ll be able to gain deep insights into the RxCpp library, which facilitates reactive programming. You’ll learn how to deal with reactive programming using Qt\/C++ (for the desktop) and C++ microservices for the Web. By the end of the book, you will be well versed with advanced reactive programming concepts in modern C++ (C++17). What you will learn Understand language-level concurrency in C++ Explore advanced C++ programming for the FRP Uncover the RxCpp library and its programming model Mix the FP and OOP constructs in C++ 17 to write well-structured programs Master reactive microservices in C++ Create custom operators for RxCpp Learn advanced stream processing and error handling Who this book is for If you’re a C++ developer interested in using reactive programming to build asynchronous and concurrent applications, you’ll find this book extremely useful. This book doesn’t assume any previous knowledge of reactive programming.","language":"en","currency":"USD","id":"1788624246","title":"C++ Reactive Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MMNiDwAAQBAJ&source=gbs_api","authors":["Praseed Pai","Peter Abraham"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E99YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build full-stack web applications with Go","description":"86 recipes on how to build fast, scalable, and powerful web services and applications with Go Key Features Become proficient in RESTful web services Build scalable, high-performant web applications in Go Get acquainted with Go frameworks for web development Book Description Go is an open source programming language that is designed to scale and support concurrency at the language level. This gives you the liberty to write large concurrent web applications with ease. From creating web application to deploying them on Amazon Cloud Services, this book will be your one-stop guide to learn web development in Go. The Go Web Development Cookbook teaches you how to create REST services, write microservices, and deploy Go Docker containers. Whether you are new to programming or a professional developer, this book will help get you up to speed with web development in Go. We will focus on writing modular code in Go; in-depth informative examples build the base, one step at a time. You will learn how to create a server, work with static files, SQL, NoSQL databases, and Beego. You will also learn how to create and secure REST services, and create and deploy Go web application and Go Docker containers on Amazon Cloud Services. By the end of the book, you will be able to apply the skills you've gained in Go to create and explore web applications in any domain. What you will learn Create a simple HTTP and TCP web server and understand how it works Explore record in a MySQL and MongoDB database Write and consume RESTful web service in Go Invent microservices in Go using Micro – a microservice toolkit Create and Deploy the Beego application with Nginx Deploy Go web application and Docker containers on an AWS EC2 instance Who this book is for This book is for Go developers interested in learning how to use Go to build powerful web applications. A background in web development is expected.","language":"en","currency":"USD","id":"1787288560","title":"Go Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E99YDwAAQBAJ&source=gbs_api","authors":["Arpit Aggarwal"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MVDNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"A Comprehensive Guide to Modern Multi-Paradigm Language","description":"Master the concise and expressive power of a pragmatic, multi-paradigm language for JVM, Android and beyond DESCRIPTION The purpose of this book is to guide a reader through the capabilities of Kotlin language and give examples of how to use it for the development of various applications, be it desktop, mobile or Web. Although our primary focus is on JVM and Android, the knowledge we’re sharing here, to various extents, applies to other Kotlin-supported platforms such as JavaScript, native and even multi-platform applications. The book starts with an introduction to the language and its ecosystem, which will give you an understanding of the key ideas behind the Kotlin design, introduce you to the Kotlin tooling and present you the basic language syntax and constructs. In the next chapters, we get to know the multi-paradigm nature of Kotlin which allows us to create powerful abstractions by combining various aspects of functional and object-oriented programming. We’ll talk about using common Kotlin APIs, such as the standard library, reflection, and coroutine-based concurrency as well as the means for creating your own flexible APIs based on domain-specific languages. In the concluding chapters, we give examples of using Kotlin for more specialized tasks, such as testing, building Android applications, Web development and creating microservices. KEY FEATURES ● Language fundamentals ● Object-oriented and functional programming with Kotlin ● Kotlin standard library ● Building domain-specific languages ● Using Kotlin for Web development ● Kotlin for Android platform ● Coroutine-based concurrency WHAT WILL YOU LEARN By the end of the book you’ll obtain a thorough knowledge of all the basic aspects of Kotlin programming. You’ll be able to create a flexible and reusable code by taking advantage of object-oriented and functional features, use Kotlin standard library, compose your own domain-specific languages, write asynchronous code using Kotlin coroutines library as well. You’ll also have a basic understanding of using Kotlin for writing test code, web applications and Android development. This knowledge will also give you a solid foundation for deeper learning of related development platforms, tools, and frameworks. WHO IS THIS BOOK FOR The book is primarily aimed at developers who are familiar with Java and JVM and are willing to get a firm understanding of Kotlin while having little to no experience in that language. Discussion of various language features will be accompanied, if deemed necessary, by comparisons with their Java’s analogs, which should simplify the Java-to-Kotlin transition. Most of the material, however, is rather Java-agnostic and should be beneficial even without prior knowledge of Java. In general, experience in object-oriented or functional paradigm is a plus, but not required. Table of Contents 1. Kotlin: Powerful and Pragmatic 2. Language Fundamentals 3. Defining Functions 4. Working with Classes and Objects 5. Leveraging Advanced Functions and Functional Programming 6. Using Special-Case Classes 7. Understanding Class Hierarchies 8. Exploring Collections and I\/O 9. Generics 10. Annotations and Reflection 11. Domain-Specific Languages 12. Java Interoperability 13. Concurrency 14. Testing with Kotlin 15. Android Applications 16. Web Development with Ktor 17. Building Microservices","language":"en","currency":"USD","id":"9389328586","title":"Kotlin In-Depth [Vol-I]","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MVDNDwAAQBAJ&source=gbs_api","authors":["Aleksei Sedunov"]},{"pageCount":306,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pEFPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Deploy, manage, and orchestrate cloud-native applications with ease","description":"Deploy and scale applications on Cloud Foundry About This Book Gain hands-on experience using Cloud Foundry Implement deployment, management and scaling of applications on Cloud Foundry Learn best practices and troubleshooting tips for running applications on Cloud Foundry Who This Book Is For This book is aimed at developers, engineers and architects who want to learn key aspects of developing and running applications on the Cloud Foundry Platform. Prior knowledge Cloud Foundry is not necessary. What You Will Learn Understand Cloud Foundry (CF) tools and concepts. Understand the breadth of possibilities unleashed through a lightweight agile approach to building and deploying applications. Design and deploy cloud native applications that run well on Cloud Foundry. Learn Microservice design concepts and worker applications. Customize service brokers to publish your services in the Cloud Foundry marketplace. Using, managing and creating buildpacks for the Cloud Foundry Platform. Troubleshoot applications on Cloud Foundry Perform zero-downtime deployments using blue\/green routes, A\/B testing, and painless rollbacks to earlier versions of the application. In Detail Cloud Foundry is the open source platform to deploy, run, and scale applications. Cloud Foundry is growing rapidly and a leading product that provides PaaS (Platform as a Service) capabilities to enterprise, government, and organizations around the globe. Giants like Dell Technologies, GE, IBM, HP and the US government are using Cloud Foundry innovate faster in a rapidly changing world. Cloud Foundry is a developer's dream. Enabling them to create modern applications that can leverage the latest thinking, techniques and capabilities of the cloud, including: DevOps Application Virtualization Infrastructure agnosticism Orchestrated containers Automation Zero downtime upgrades A\/B deployment Quickly scaling applications out or in This book takes readers on a journey where they will first learn the Cloud Foundry basics, including how to deploy and scale a simple application in seconds. Readers will build their knowledge of how to create highly scalable and resilient cloud-native applications and microservices running on Cloud Foundry. Readers will learn how to integrate their application with services provided by Cloud Foundry and with those external to Cloud Foundry. Readers will learn how to structure their Cloud Foundry environment with orgs and spaces. After that, we'll discuss aspects of continuous integration\/continuous delivery (CI\/CD), monitoring and logging. Readers will also learn how to enable health checks, troubleshoot and debug applications. By the end of this book, readers will have hands-on experience in performing various deployment and scaling tasks. Additionally, they will have an understanding of what it takes to migrate and develop applications for Cloud Foundry. Style and Approach A practitioner's guide to Cloud Foundry that covers the areas of application development, deployment and services.","language":"en","currency":"USD","id":"178839657X","title":"Cloud Foundry for Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pEFPDwAAQBAJ&source=gbs_api","authors":["Rick Farmer","Rahul Jain","David Wu"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Use React and React Native to build applications for desktop browsers, mobile browsers, and even as native mobile apps About This Book Build React and React Native applications using familiar component concepts Dive deep into each platform, from routing in React to creating native mobile applications that can run offline Use Facebook's Relay, React and GraphQL technologies, to create a unified architecture that powers both web and native applications Who This Book Is For This book is written for any JavaScript developer—beginner or expert—who wants to start learning how to put both of Facebook's UI libraries to work. No knowledge of React is needed, though a working knowledge of ES2015 will help you follow along better. What You Will Learn Craft reusable React components Control navigation using the React Router to help keep your UI in sync with URLs Build isomorphic web applications using Node.js Use the Flexbox layout model to create responsive mobile designs Leverage the native APIs of Android and iOS to build engaging applications with React Native Respond to gestures in a way that's intuitive for the user Use Relay to build a unified data architecture for your React UIs In Detail React and React Native allow you to build cross-platform desktop and mobile applications using Facebook's innovative UI libraries. Combined with the Flux data architecture and Relay, you can now create powerful and feature-complete applications from just one code base! This book is split into three parts. The first part shows you how to start crafting composable UIs using React, from rendering with JSX and creating reusable components through to routing and creating isomorphic applications that run on Node. We then move on to showing you how to take the concepts of React and apply them to building Native UIs using React Native. You'll find out how to build responsive and streamlined UIs that can properly handle user interactions in a mobile environment. You'll also learn how to access device-specific APIs such as the geolocation API, and how to handle offline development with React Native. Finally, we'll tie all of these skills together and shows you how you can create React applications that run on every major platform. As well as understanding application state in depth, you'll learn how to leverage Relay to make feature-complete, data-driven web and native mobile applications. Style and approach Split into three major sections to help organize your learning, this hands-on, code-first book will help you get up to speed with React and React Native—the UI framework that powers Netflix, Yahoo, and Facebook.","language":"en","currency":"USD","id":"178646957X","title":"React and React Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jLkrDwAAQBAJ&source=gbs_api","authors":["Adam Boduch"]},{"pageCount":451,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yoh9mTBwj-sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Leading Agile Developers, Developing Agile Leaders (Adobe Reader)","description":"In many organizations, management is the biggest obstacle to successful Agile development. Unfortunately, reliable guidance on Agile management has been scarce indeed. Now, leading Agile manager Jurgen Appelo fills that gap, introducing a realistic approach to leading, managing, and growing your Agile team or organization. Writing for current managers and developers moving into management, Appelo shares insights that are grounded in modern complex systems theory, reflecting the intense complexity of modern software development. Appelo’s Management 3.0 model recognizes that today’s organizations are living, networked systems; and that management is primarily about people and relationships. Management 3.0 doesn’t offer mere checklists or prescriptions to follow slavishly; rather, it deepens your understanding of how organizations and Agile teams work and gives you tools to solve your own problems. Drawing on his extensive experience as an Agile manager, the author identifies the most important practices of Agile management and helps you improve each of them. Coverage includes • Getting beyond “Management 1.0” control and “Management 2.0” fads • Understanding how complexity affects your organization • Keeping your people active, creative, innovative, and motivated • Giving teams the care and authority they need to grow on their own • Defining boundaries so teams can succeed in alignment with business goals • Sowing the seeds for a culture of software craftsmanship • Crafting an organizational network that promotes success • Implementing continuous improvement that actually works Thoroughly pragmatic–and never trendy–Jurgen Appelo’s Management 3.0 helps you bring greater agility to any software organization, team, or project.","language":"en","currency":"USD","id":"9780321718990","title":"Management 3.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yoh9mTBwj-sC&source=gbs_api","authors":["Jurgen Appelo"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nIF8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Problem-Solution Approach","description":"Solve all your Spring Boot 2 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work over creating a project from scratch. Using a problem-solution approach, Spring Boot 2 Recipes quickly introduces you to Pivotal's Spring Boot 2 micro-framework, then dives into code snippets on how to apply and integrate Spring Boot 2 with the Spring MVC web framework, Spring Web Sockets, and microservices. You'll also get solutions to common problems with persistence, integrating Spring Boot with batch processing, algorithmic programming via Spring Batch, and much more. Other recipes cover topics such as using and integrating Boot with Spring's enterprise services, Spring Integration, testing, monitoring and more. What You'll Learn Get reusable code recipes and snippets for the Spring Boot 2 micro-framework Discover how Spring Boot 2 integrates with other Spring APIs, tools, and frameworks Access Spring MVC and the new Spring Web Sockets for simpler web development Work with microservices for web services development and integration with your Spring Boot applications Add persistence and a data tier seamlessly to make your Spring Boot web application do more Integrate enterprise services to create a more complex Java application using Spring Boot Who This Book Is For Experienced Java and Spring programmers.","language":"en","currency":"USD","id":"1484239636","title":"Spring Boot 2 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nIF8DwAAQBAJ&source=gbs_api","authors":["Marten Deinum"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X-cZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This self-study resource offers complete coverage of every topic on the AWS Certified Security Specialty exam Take the AWS Certified Security – Specialty exam with confidence using the detailed information contained in this effective self-study resource. Written by a team of AWS insiders, the book shows how to develop, deploy, and maintain robust security protocols on Amazon Web Services. AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01) covers every objective for the exam and provides comprehensive content on cloud-based security. To aid in study, each chapter includes exam tips, chapter summaries, and practice questions that simulate those on the live test. Designed to help you pass the exam with ease, this hands-on guide also serves as an ideal on-the-job reference. Covers all exam topics, including: Cloud security event investigation Cloud security event remediation and planning Monitoring with Amazon CloudWatch Enhanced security monitoring and compliance with AWS services Logging on AWS AWS cryptographic services and tools Designing edge security on AWS Designing and implementing a secure network infrastructure Troubleshooting a secure network infrastructure Designing and implementing host-based security AWS identity and access management Troubleshooting authorization and authentication services Online content includes: 130 practice exam questions Fully customizable exam engine Downloadable code","language":"en","currency":"USD","id":"1260461734","title":"AWS Certified Security Specialty All-in-One Exam Guide (Exam SCS-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X-cZEAAAQBAJ&source=gbs_api","authors":["Tracy Pierce","Aravind Kodandaramaiah","Rafael Koike","Alex Rosa"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BCEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This up-to-date study guide offers 100% coverage of every objective for the current version of the AWS Certified Solutions Architect Professional exam Get complete coverage of all objectives included on the SAA-C02 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect – Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. You’ll also build your practical knowledge with the many hands-on labs found throughout this guide. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: Design Resilient Architectures Design High-Performing Architectures Design Secure Applications and Architectures Design Cost-Optimized Architectures Online content includes: 130 practice exam questions Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260470199","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide, Second Edition (Exam SAA-C02)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BCEOEAAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XxNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"COVERS THE NEW 2018 EXAM SAA-C01! This effective study guide provides 100% coverage of every topic on the AWS Certified Solutions Architect Associate exam. Get complete coverage of all objectives included on the February 2018 SAA-C01 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: •Design Resilient Architectures •Define Performant Architectures •Specify Secure Applications and Architectures •Design Cost-Optimized Architectures •Define Operationally Excellent Architectures Digital content includes: •130 practice exam questions•Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260108260","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide (Exam SAA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XxNqDwAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7ifxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Optimized for Kubernetes, Quarkus is designed to help you create Java applications that are cloud first, container native, and serverless capable. With this cookbook, authors Alex Soto Bueno and Jason Porter from Red Hat provide detailed solutions for installing, interacting with, and using Quarkus in the development and production of microservices. The recipes in this book show midlevel to senior developers familiar with Java enterprise application development how to get started with Quarkus quickly. You’ll become familiar with how Quarkus works within the wider Java ecosystem and discover ways to adapt this framework to your particular needs. You’ll learn how to: Shorten the development cycle by enabling live reloading in dev mode Connect to and communicate with Kafka Develop with the reactive programming model Easily add fault tolerance to your services Build your application as a Kubernetes-ready container Ease development with OpenAPI and test a native Quarkus application","language":"en","currency":"USD","id":"149206260X","title":"Quarkus Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7ifxDwAAQBAJ&source=gbs_api","authors":["Alex Soto Bueno","Jason Porter"]},{"pageCount":754,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kSOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Transform your software deployment process with Microsoft Azure","description":"Explore powerful Azure DevOps solutions to develop and deploy your software faster and more efficiently. Key Features Build modern microservice-based systems with Azure architecture Learn to deploy and manage cloud services and virtual machines Configure clusters with Azure Service Fabric for deployment Book Description This Learning Path helps you understand microservices architecture and leverage various services of Microsoft Azure Service Fabric to build, deploy, and maintain highly scalable enterprise-grade applications. You will learn to select an appropriate Azure backend structure for your solutions and work with its toolkit and managed apps to share your solutions with its service catalog. As you progress through the Learning Path, you will study Azure Cloud Services, Azure-managed Kubernetes, and Azure Container Services deployment techniques. To apply all that you’ve understood, you will build an end-to-end Azure system in scalable, decoupled tiers for an industrial bakery with three business domains. Toward the end of this Learning Path, you will build another scalable architecture using Azure Service Bus topics to send orders between decoupled business domains with scalable worker roles processing these orders. By the end of this Learning Path, you will be comfortable in using development, deployment, and maintenance processes to build robust cloud solutions on Azure. This Learning Path includes content from the following Packt products: Learn Microsoft Azure by Mohamed Wali Implementing Azure Solutions - Second Edition by Florian Klaffenbach, Oliver Michalski, Markus Klein Microservices with Azure by Namit Tanasseri and Rahul Rai What you will learn Study various Azure Service Fabric application programming models Create and manage a Kubernetes cluster in Azure Kubernetes Service Use site-to-site VPN and ExpressRoute connections in your environment Design an Azure IoT app and learn to operate it in various scenarios Implement a hybrid Azure design using Azure Stack Build Azure SQL databases with Code First Migrations Integrate client applications with Web API and SignalR on Azure Implement the Azure Active Directory (Azure AD) across the entire system Who this book is for If you are an IT system architect, network admin, or a DevOps engineer who wants to implement Azure solutions for your organization, this Learning Path is for you. Basic knowledge of the Azure Cloud platform will be beneficial.","language":"en","currency":"USD","id":"1788831799","title":"Implementing Azure: Putting Modern DevOps to Use","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kSOGDwAAQBAJ&source=gbs_api","authors":["Florian Klaffenbach","Oliver Michalski","Markus Klein","Mohamed Wali","Namit Tanasseri","Rahul Rai"]},{"pageCount":762,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NOQREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A SOLID adventure into architectural principles, design patterns, .NET 5, and C#","description":"Discover the essential design and architectural patterns with ASP.NET Core to solve common software design problems. With this book, you’ll learn how to use a combination of design patterns and build fault-tolerant and robust full-stack apps and microservices with ASP.NET Core and C#.","language":"en","currency":"USD","id":"1789340659","title":"An An Atypical ASP.NET Core 5 Design Patterns Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NOQREAAAQBAJ&source=gbs_api","authors":["Carl-Hugo Marcotte"]},{"pageCount":281,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MqGsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"13th European Conference, ECSA 2019, Paris, France, September 9–13, 2019, Proceedings","description":"This book constitutes the refereed proceedings of the 13th European Conference on Software Architecture, ECSA 2019, held in Paris, France, in September 2019. In the Research Track, 11 full papers presented together with 4 short papers were carefully reviewed and selected from 63 submissions. They are organized in topical sections as follows: Services and Micro-services, Software Architecture in Development Process, Adaptation and Design Space Exploration, and Quality Attributes. In the Industrial Track, 6 submissions were received and 3 were accepted to form part of these proceedings.","language":"en","currency":"USD","id":"303029983X","title":"Software Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MqGsDwAAQBAJ&source=gbs_api","authors":["Tomas Bures","Laurence Duchien","Paola Inverardi"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lhnADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Develop a full-stack web application with Python and Flask","description":"Learn all that’s needed to build a fully functional web application from scratch. Key Features Delve deep into the principle behind RESTful API Learn how to build a scalable web application with the RESTful API architecture and Flask framework Know what are the exact tools and methodology to test your applications and how to use them Book Description Python is a flexible language that can be used for much more than just script development. By knowing the Python RESTful APIs work, you can build a powerful backend for web applications and mobile applications using Python. You'll take your first steps by building a simple API and learning how the frontend web interface can communicate with the backend. You'll also learn how to serialize and deserialize objects using the marshmallow library. Then, you'll learn how to authenticate and authorize users using Flask-JWT. You'll also learn how to enhance your APIs by adding useful features, such as email, image upload, searching, and pagination. You'll wrap up the whole book by deploying your APIs to the cloud. By the end of this book, you'll have the confidence and skill to leverage the power of RESTful APIs and Python to build efficient web applications. What you will learn Understand the concept of a RESTful API Build a RESTful API using Flask and the Flask-Restful extension Manipulate a database using Flask-SQLAlchemy and Flask-Migrate Send out plaintext and HTML format emails using the Mailgun API Implement a pagination function using Flask-SQLAlchemy Use caching to improve API performance and efficiently obtain the latest information Deploy an application to Heroku and test it using Postman Who this book is for This book is ideal for aspiring software developers who have a basic-to-intermediate knowledge of Python programming and who want to develop web applications using Python. Knowledge of how web applications work will be beneficial but is not essential.","language":"en","currency":"USD","id":"1838981101","title":"Python API Development Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lhnADwAAQBAJ&source=gbs_api","authors":["Jack Chan","Ray Chung","Jack Huang"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3iZyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build cloud-ready, reactive systems with Spring 5 and Project Reactor","description":"Explore the reactive system and create efficient microservices with Spring Boot 2.1 and Spring Cloud Key Features Understand the kind of system modern businesses require with Spring Gain deeper insights into reactive programming with Reactor and Spring Cloud Get in-depth knowledge on asynchronous and nonblocking communication with Spring 5 WebFlux Book Description These days, businesses need a new type of system that can remain responsive at all times. This is achievable with reactive programming; however, the development of these kinds of systems is a complex task, requiring a deep understanding of the domain. In order to develop highly responsive systems, the developers of the Spring Framework came up with Project Reactor. Hands-On Reactive Programming in Spring 5 begins with the fundamentals of Spring Reactive programming. You’ll explore the endless possibilities of building efficient reactive systems with the Spring 5 Framework along with other tools such as WebFlux and Spring Boot. Further on, you’ll study reactive programming techniques and apply them to databases and cross-server communication. You will advance your skills in scaling up Spring Cloud Streams and run independent, high-performant reactive microservices. By the end of the book, you will be able to put your skills to use and get on board with the reactive revolution in Spring 5.1! What you will learn Discover the difference between a reactive system and reactive programming Explore the benefits of a reactive system and understand its applications Get to grips with using reactive programming in Spring 5 Gain an understanding of Project Reactor Build a reactive system using Spring 5 and Project Reactor Create a highly efficient reactive microservice with Spring Cloud Test, monitor, and release reactive applications Who this book is for This book is for Java developers who use Spring to develop their applications and want to build robust and reactive applications that can scale in the cloud. Basic knowledge of distributed systems and asynchronous programming will help you understand the concepts covered in this book.","language":"en","currency":"USD","id":"1787287297","title":"Hands-On Reactive Programming in Spring 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3iZyDwAAQBAJ&source=gbs_api","authors":["Oleh Dokuka","Igor Lozynskyi"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rNNJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A practical guide to building modern single-page applications with Angular and Java EE","description":"Learn how to build high-performing enterprise applications using Java EE powered by Angular at the frontend Key Features Leverage Java EE 8 features to build robust backend for your enterprise applications Use Angular to build a single page frontend and combine it with the Java EE backend A practical guide filled with ample real-world examples Book Description The demand for modern and high performing web enterprise applications is growing rapidly. No more is a basic HTML frontend enough to meet customer demands. This book will be your one-stop guide to build outstanding enterprise web applications with Java EE and Angular. It will teach you how to harness the power of Java EE to build sturdy backends while applying Angular on the frontend. Your journey to building modern web enterprise applications starts here! The book starts with a brief introduction to the fundamentals of Java EE and all the new APIs offered in the latest release. Armed with the knowledge of Java EE 8, you will go over what it's like to build an end-to-end application, configure database connection for JPA, and build scalable microservices using RESTful APIs running in Docker containers. Taking advantage of the Payara Micro capabilities, you will build an Issue Management System, which will have various features exposed as services using the Java EE backend. With a detailed coverage of Angular fundamentals, the book will expand the Issue Management System by building a modern single page application frontend. Moving forward, you will learn to fit both the pieces together, that is, the frontend Angular application with the backend Java EE microservices. As each unit in a microservice promotes high cohesion, you will learn different ways in which independent units can be tested efficiently. Finishing off with concepts on securing your enterprise applications, this book is a handson guide for building modern web applications. What you will learn Write CDI-based code in Java EE 8 applications Build an understanding of microservices and what they mean in a Java EE context Employ Docker to build and run microservice applications Use configuration optionsto work effectively with JSON documents Handle asynchronous task and write RESTAPI clients Set the foundation for working on Angular projects with the fundamentals of TypeScript Learn to use Angular CLI to add and manage new features Secure Angular applicationsusing malicious attacks adopting JSON Web tokens Who this book is for This book is for Java EE developers who would like to build modern enterprise web applications using Angular. No knowledge of Angular is required.","language":"en","currency":"USD","id":"1788299388","title":"Java EE 8 and Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rNNJDwAAQBAJ&source=gbs_api","authors":["Prashant Padmanabhan"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OqYyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":"New Trends in Environmental Informatics","description":"This book presents the latest findings and ongoing research in connection with green information systems and green information & communication technology (ICT). It provides valuable insights into a broad range of cross-cutting concerns in ICT and the environmental sciences, and showcases how ICT can be used to effectively address environmental and energy efficiency issues. Offering a selection of extended contributions to the 31st International Conference EnviroInfo 2017, it is essential reading for anyone looking to expand their expertise in the area.","language":"en","currency":"USD","id":"3319656872","title":"From Science to Society","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OqYyDwAAQBAJ&source=gbs_api","authors":["Benoît Otjacques","Patrik Hitzelberger","Stefan Naumann","Volker Wohlgemuth"]},{"pageCount":410,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nO1FDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Building a Culture of Collaboration, Affinity, and Tooling at Scale","description":"Some companies think that adopting devops means bringing in specialists or a host of new tools. With this practical guide, you’ll learn why devops is a professional and cultural movement that calls for change from inside your organization. Authors Ryn Daniels and Jennifer Davis provide several approaches for improving collaboration within teams, creating affinity among teams, promoting efficient tool usage in your company, and scaling up what works throughout your organization’s inflection points. Devops stresses iterative efforts to break down information silos, monitor relationships, and repair misunderstandings that arise between and within teams in your organization. By applying the actionable strategies in this book, you can make sustainable changes in your environment regardless of your level within your organization. Explore the foundations of devops and learn the four pillars of effective devops Encourage collaboration to help individuals work together and build durable and long-lasting relationships Create affinity among teams while balancing differing goals or metrics Accelerate cultural direction by selecting tools and workflows that complement your organization Troubleshoot common problems and misunderstandings that can arise throughout the organizational lifecycle Learn from case studies from organizations and individuals to help inform your own devops journey","language":"en","currency":"USD","id":"1491926422","title":"Effective DevOps","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nO1FDAAAQBAJ&source=gbs_api","authors":["Jennifer Davis","Ryn Daniels"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0JTlCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Using JavaScript, HTML, and CSS","description":"As a web developer, you may not want to spend time making your web app secure, but it definitely comes with the territory. This practical guide provides you with the latest information on how to thwart security threats at several levels, including new areas such as microservices. You’ll learn how to help protect your app no matter where it runs, from the latest smartphone to an older desktop, and everything in between. Author John Paul Mueller delivers specific advice as well as several security programming examples for developers with a good knowledge of CSS3, HTML5, and JavaScript. In five separate sections, this book shows you how to protect against viruses, DDoS attacks, security breaches, and other nasty intrusions. Create a security plan for your organization that takes the latest devices and user needs into account Develop secure interfaces, and safely incorporate third-party code from libraries, APIs, and microservices Use sandboxing techniques, in-house and third-party testing techniques, and learn to think like a hacker Implement a maintenance cycle by determining when and how to update your application software Learn techniques for efficiently tracking security threats as well as training requirements that your organization can use","language":"en","currency":"USD","id":"1491928700","title":"Security for Web Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0JTlCgAAQBAJ&source=gbs_api","authors":["John Paul Mueller"]},{"pageCount":21,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nPkZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.64,"subtitle":null,"description":"Studienarbeit aus dem Jahr 2020 im Fachbereich Informatik - Internet der Dinge, IOT, Note: 1,3, Hochschule der Medien Stuttgart, Sprache: Deutsch, Abstract: In diesem Dokument wird die Technologie hinter Serverless Computing erörtert. Es beginnt mit einer Einführung in die Konzepte des Serverless Computing, den Vor- und Nachteilen dieser Technologie und beschreibt, wofür serverlose Anwendungen üblicherweise eingesetzt werden. Am Ende wird der Inhalt dieses Dokuments kurz zusammengefasst und die Frage beantwortet, \"wofür man Serverless Computing braucht und wofür es sich eher nicht eignet\". Serverloses Computing ist ein Ausführungsmodell für die Cloud, bei dem nur genau so viel Rechenressourcen und Speicherplatz dynamisch zugewiesen wird, wie zur Ausführung eines Codes benötigt wird. Dieser Vorgang wird auf einem von dem Cloud-Anbieter gewarteten Server ausgeführt. Serverless Computing ist also nicht tatsächlich Serverless. Der Begriff Serverless wird in dem Kontext nur benutzt, da der Cloud- Anbieter, der eine Serverless Computing Struktur hostet, die Bereitstellung und Wartung vollständig übernimmt. Natürlich sind immer noch Server beteiligt, aber nicht eigene, sondern die Server des Anbieters. Aus der Sicht des Entwicklerteams, das den Code schreibt und einsetzt, gibt es keine Server da Sie die Server nicht verwalten müssen und denn Code einfach bei ihrem Provider hochladen.","language":"de","currency":"USD","id":"3346339459","title":"Serverless Computing. Wofür braucht man das und wofür eignet es sich eher nicht?","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nPkZEAAAQBAJ&source=gbs_api","authors":["Vanessa Kraiss"]},{"pageCount":802,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A definitive guide to learning the key concepts of modern application development, 2nd Edition","description":"Solutions for modular, functional, reactive, GUI, network, and multithreaded programming Key Features Explore the latest features of Java 11 to implement efficient and reliable code Develop memory-efficient applications, understanding new garbage collection in Java 11 Create restful webservices and microservices with Spring boot 2 and Docker Book Description For more than three decades, Java has been on the forefront of developing robust software that has helped versatile businesses meet their requirements. Being one of the most widely used programming languages in history, it’s imperative for Java developers to discover effective ways of using it in order to take full advantage of the power of the latest Java features. Java 11 Cookbook offers a range of software development solutions with simple and straightforward Java 11 code examples to help you build a modern software system. Starting with the installation of Java, each recipe addresses various problem by explaining the solution and offering insights into how it works. You’ll explore the new features added to Java 11 that will make your application modular, secure, and fast. The book contains recipes on functional programming, GUI programming, concurrent programming, and database programming in Java. You’ll also be taken through the new features introduced in JDK 18.3 and 18.9. By the end of this book, you’ll be equipped with the skills required to write robust, scalable, and optimal Java code effectively. What you will learn Set up JDK and understand what's new in the JDK 11 installation Implement object-oriented designs using classes and interfaces Manage operating system processes Create a modular application with clear dependencies Build graphical user interfaces using JavaFX Use the new HTTP Client API Explore the new diagnostic features in Java 11 Discover how to use the new JShell REPL tool Who this book is for The book is for intermediate-to-advanced Java programmers who want to make their applications fast, secure, and scalable.","language":"en","currency":"USD","id":"1789135281","title":"Java 11 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GP1wDwAAQBAJ&source=gbs_api","authors":["Nick Samoylov","Mohamed Sanaulla"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eJWqDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"An example-driven guide that explores the world of modern web development with JavaScript About This Book Explore the new features of ECMAScript 6 and how they can be incorporated to build cutting edge web applications Learn about modern web architectures and build real-world apps on top of them Make use of modern JavaScript tools, techniques and frameworks to enhance your web development skills Who This Book Is For This book is for existing JavaScript developers who want to explore some of the modern JavaScript features, techniques, and architectures to develop cutting edge web applications. What You Will Learn Learn to create single page websites Gain expertise in responsive and dynamic website design Enable Real-time communications between client-client and client-server\/server-client Create APIs for large-scale applications Write complete applications using functional reactive programming In Detail Over the years, JavaScript has taken significant strides in the world of modern web development to enhance the development of a wide range of applications with different architectures. This book explores the advanced and new features that have arrived in JavaScript and how they can be applied to develop high-quality applications with different architectures. The book begins by covering a single page application that builds on the innovative MVC approach using AngularJS. As we move forward, the book shows you how to develop an enterprise-level application with the microservices architecture, using Node to build web services. We then focus on network programming concepts and you'll build a real-time web application with websockets. When you've gained a solid grip on the different architectures, we'll move on to the area where JavaScript shines, that is, UI development. You'll learn to build responsive, declarative UIs with React and Bootstrap. As we near the end of this book, you'll see how the performance of web applications can be enhanced using Functional Reactive Programming (FRP). Along the way, the book also explores how the power of JavaScript can be increased multi-fold. After reading this book, you will have a solid knowledge of the latest JavaScript techniques, tools, and architecture to build modern web apps. Style and approach Covering all the new features in ECMAScript 6, this book takes a project-based approach to introduce you to all the latest techniques, tools, and architectures of JavaScript web development. Each project that the book builds will show you a different angle of the power of JavaScript in modern web development.","language":"en","currency":"USD","id":"1785880276","title":"Modern JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eJWqDQAAQBAJ&source=gbs_api","authors":["Narayan Prusty"]},{"pageCount":194,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OZRRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Boost your application’s performance with the new features of Java 9","description":"Optimize the powerful techniques of Java 9 to boost your application's performance Key Features Tackle all kinds of performance-related issues and streamline your development Dive into the new features of Java 9 Implement highly efficient and reliable codes with the help of new APIs of Java Embedded with assessments that will help you revise the concepts you have learned in this book Book Description Java 9 which is one of the most popular application development languages. The latest released version Java 9 comes with a host of new features and new APIs with lots of ready to use components to build efficient and scalable applications. Streams, parallel and asynchronous processing, multithreading, JSON support, reactive programming, and microservices comprise the hallmark of modern programming and are now fully integrated into the JDK. This book focuses on providing quick, practical solutions to enhance your application's performance. You will explore the new features, APIs, and various tools added in Java 9 that help to speed up the development process. You will learn about jshell, Ahead-of-Time (AOT) compilation, and the basic threads related topics including sizing and synchronization. You will also explore various strategies for building microservices including container-less, self-contained, and in-container. This book is ideal for developers who would like to build reliable and high-performance applications with Java. This book is embedded with useful assessments that will help you revise the concepts you have learned in this book. What you will learn Familiarize with modular development and its impact on performance Learn various string-related performance improvements, including compact string and modify string concatenation Explore various underlying compiler improvements, such as tiered attribution and Ahead-of-Time (AOT) compilation Learn security manager improvements Understand enhancements in graphics rasterizers Use of command-line tools to speed up application development Learn how to implement multithreading and reactive programming Build microservices in Java 9 Implement APIs to improve application code Who this book is for This book is targeted at developers who would like to build reliable and high-performance applications with Java.","language":"en","currency":"USD","id":"1789133378","title":"Java: High-Performance Apps with Java 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OZRRDwAAQBAJ&source=gbs_api","authors":["Mayur Ramgir"]},{"pageCount":605,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H_hyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Confederated International Conferences: CoopIS, C&TC, and ODBASE 2018, Valletta, Malta, October 22-26, 2018, Proceedings","description":"This double volumes LNCS 11229-11230 constitutes the refereed proceedings of the Confederated International Conferences: Cooperative Information Systems, CoopIS 2018, Ontologies, Databases, and Applications of Semantics, ODBASE 2018, and Cloud and Trusted Computing, C&TC, held as part of OTM 2018 in October 2018 in Valletta, Malta. The 64 full papers presented together with 22 short papers were carefully reviewed and selected from 173 submissions. The OTM program every year covers data and Web semantics, distributed objects, Web services, databases, informationsystems, enterprise workflow and collaboration, ubiquity, interoperability, mobility, grid and high-performance computing.","language":"en","currency":"USD","id":"303002671X","title":"On the Move to Meaningful Internet Systems. OTM 2018 Conferences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H_hyDwAAQBAJ&source=gbs_api","authors":["Hervé Panetto","Christophe Debruyne","Henderik A. Proper","Claudio Agostino Ardagna","Dumitru Roman","Robert Meersman"]},{"pageCount":822,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G0C7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Taking you to the limit in Concurrency, OOP, and the most advanced capabilities of C","description":"Push the limits of what C - and you - can do, with this high-intensity guide to the most advanced capabilities of C Key Features Make the most of C’s low-level control, flexibility, and high performance A comprehensive guide to C’s most powerful and challenging features A thought-provoking guide packed with hands-on exercises and examples Book Description There’s a lot more to C than knowing the language syntax. The industry looks for developers with a rigorous, scientific understanding of the principles and practices. Extreme C will teach you to use C’s advanced low-level power to write effective, efficient systems. This intensive, practical guide will help you become an expert C programmer. Building on your existing C knowledge, you will master preprocessor directives, macros, conditional compilation, pointers, and much more. You will gain new insight into algorithm design, functions, and structures. You will discover how C helps you squeeze maximum performance out of critical, resource-constrained applications. C still plays a critical role in 21st-century programming, remaining the core language for precision engineering, aviations, space research, and more. This book shows how C works with Unix, how to implement OO principles in C, and fully covers multi-processing. In Extreme C, Amini encourages you to think, question, apply, and experiment for yourself. The book is essential for anybody who wants to take their C to the next level. What you will learn Build advanced C knowledge on strong foundations, rooted in first principles Understand memory structures and compilation pipeline and how they work, and how to make most out of them Apply object-oriented design principles to your procedural C code Write low-level code that’s close to the hardware and squeezes maximum performance out of a computer system Master concurrency, multithreading, multi-processing, and integration with other languages Unit Testing and debugging, build systems, and inter-process communication for C programming Who this book is for Extreme C is for C programmers who want to dig deep into the language and its capabilities. It will help you make the most of the low-level control C gives you.","language":"en","currency":"USD","id":"1789341353","title":"Extreme C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G0C7DwAAQBAJ&source=gbs_api","authors":["Kamran Amini"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Docker lets you create, deploy, and manage your applications anywhere at anytime – flexibility is key so you can deploy stable, secure, and scalable app containers across a wide variety of platforms and delve into microservices architecture About This Book This up-to-date edition shows how to leverage Docker's features to deploy your existing applications Learn how to package your applications with Docker and build, ship, and scale your containers Explore real-world examples of securing and managing Docker containers Who This Book Is For This book is ideal for developers, operations managers, and IT professionals who would like to learn about Docker and use it to build and deploy container-based apps. No prior knowledge of Docker is expected. What You Will Learn Develop containerized applications using the Docker version 17.03 Build Docker images from containers and launch them Develop Docker images and containers leveraging Dockerfiles Use Docker volumes to share data Get to know how data is shared between containers Understand Docker Jenkins integration Gain the power of container orchestration Familiarize yourself with the frequently used commands such as docker exec, docker ps, docker top, and docker stats In Detail Docker is an open source containerization engine that offers a simple and faster way for developing and running software. Docker containers wrap software in a complete filesystem that contains everything it needs to run, enabling any application to be run anywhere – this flexibily and portabily means that you can run apps in the cloud, on virtual machines, or on dedicated servers. This book will give you a tour of the new features of Docker and help you get started with Docker by building and deploying a simple application. It will walk you through the commands required to manage Docker images and containers. You'll be shown how to download new images, run containers, list the containers running on the Docker host, and kill them. You'll learn how to leverage Docker's volumes feature to share data between the Docker host and its containers – this data management feature is also useful for persistent data. This book also covers how to orchestrate containers using Docker compose, debug containers, and secure containers using the AppArmor and SELinux security modules. Style and approach This step-by-step guide will walk you through the features and use of Docker, from Docker software installation to the impenetrable security of containers.","language":"en","currency":"USD","id":"178646201X","title":"Learning Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qHc5DwAAQBAJ&source=gbs_api","authors":["Jeeva S. Chelladhurai","Vinod Singh","Pethuru Raj"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ml9dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build scalable and reactive applications with Spring combined with the productivity of Kotlin","description":"Learn to build a full-fledged application in Spring and Kotlin taking a reactive, microservice-based approach for scalability and robustness in the cloud Key Features Build a full-fledged application in Spring and Kotlin Architect your application to take a microservice-based approach in the cloud Integrate your application with a variety of Spring components Book Description Kotlin is being used widely by developers because of its light weight, built-in null safety, and functional and reactive programming aspects. Kotlin shares the same pragmatic, innovative and opinionated mindset as Spring, so they work well together. Spring when combined with Kotlin helps you to reach a new level of productivity. This combination has helped developers to create Functional Applications using both the tools together. This book will teach you how to take advantage of these developments and build robust, scalable and reactive applications with ease. In this book, you will begin with an introduction to Spring and its setup with Kotlin. You will then dive into assessing the design considerations of your application. Then you will learn to use Spring (with Spring Boot) along with Kotlin to build a robust backend in a microservice architecture with a REST based collaboration, and leverage Project Reactor in your application. You’ll then learn how to integrate Spring Data and Spring Cloud to manage configurations for database interaction and cloud deployment. You’ll also learn to use Spring Security to beef up security of your application before testing it with the JUnit framework and then deploying it on a cloud platform like AWS. What you will learn Explore Spring 5 concepts with Kotlin Learn both dependency injections and complex configurations Utilize Spring Data, Spring Cloud, and Spring Security in your applications Create efficient reactive systems with Project Reactor Write unit tests for your Spring\/Kotlin applications Deploy applications on cloud platforms like AWS Who this book is for Developers comfortable using Spring who have basic knowledge of Kotlin and want to take their development skills to the next level and build enterprise-grade applications will benefit from this book.","language":"en","currency":"USD","id":"1788473159","title":"Building Applications with Spring 5 and Kotlin","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ml9dDwAAQBAJ&source=gbs_api","authors":["Miloš Vasić"]},{"pageCount":424,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Build intelligent and smart conversational interfaces using Microsoft Bot Framework About This Book Develop various real-world intelligent bots from scratch using Microsoft Bot Framework Integrate your bots with most popular conversation platforms such as Skype, Slack, and Facebook Messenger Flaunt your bot building skills in your organization by thoroughly understanding and implementing the bot development concepts such as messages (rich text and pictures), dialogs, and third-party authentication and calling Who This Book Is For This book is for developers who are keen on building powerful services with great and interactive bot interface. Experience with C# is needed. What You Will Learn Set up a development environment and install all the required software to get started programming a bot Publish a bot to Slack, Skype, and the Facebook Messenger platform Develop a fully functional weather bot that communicates the current weather in a given city Help your bot identify the intent of a text with the help of LUIS in order to make decisions Integrate an API into your bot development Build an IVR solution Explore the concept of MicroServices and see how MicroServices can be used in bot development Develop an IoT project, deploy it, and connect it to a bot In Detail Bots help users to use the language as a UI and interact with the applications from any platform. This book teaches you how to develop real-world bots using Microsoft Bot Framework. The book starts with setting up the Microsoft Bot Framework development environment and emulator, and moves on to building the first bot using Connector and Builder SDK. Explore how to register, connect, test, and publish your bot to the Slack, Skype, and Facebook Messenger platforms. Throughout this book, you will build different types of bots from simple to complex, such as a weather bot, a natural speech and intent processing bot, an Interactive Voice Response (IVR) bot for a bank, a facial expression recognition bot, and more from scratch. These bots were designed and developed to teach you concepts such as text detection, implementing LUIS dialogs, Cortana Intelligence Services, third-party authentication, Rich Text format, Bot State Service, and microServices so you can practice working with the standard development tools such as Visual Studio, Bot Emulator, and Azure. Style and approach This step-by-step guide takes a learn-while-doing approach, delivering the practical knowledge and experience you need to design and build real-world Bots. The concepts come to you on an as-needed basis while developing a bot so you increase your programming knowledge and experience at the same time.","language":"en","currency":"USD","id":"1786469642","title":"Building Bots with Microsoft Bot Framework","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kHc5DwAAQBAJ&source=gbs_api","authors":["Kishore Gaddam"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jq32DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Entwicklung und Integration nach dem Architekturstil des Web","description":"Das Buch bietet eine theoretisch fundierte, vor allem aber praxistaugliche Anleitung zum professionellen Einsatz von RESTful HTTP. Es beschreibt den Architekturstil REST (Representational State Transfer) und seine Umsetzung im Rahmen der Protokolle des World Wide Web (HTTP, URIs und andere). Es wird gezeigt, wie man klassische Webanwendungen und Webservices so entwirft, dass sie im Einklang mit den Grundprinzipien des Web stehen und seine vielen Vorteile ausnutzen. Nach einer kurzen Einleitung, die die Grundprinzipien vermittelt (Ressourcen, Repräsentationen, Hyperlinks, Content Negotiation), wird ein vollständiges praktisches Beispiel vorgestellt. Danach werden die einzelnen Konzepte sowie fortgeschrittene Themen wie Caching, Dokumentation und Sicherheit detailliert betrachtet. Schließlich wird eine erweiterte Form der Beispielanwendung entwickelt, um die Umsetzung der fortgeschrittenen Konzepte zu demonstrieren. Inzwischen etablierte Best Practices zu Entwurf und Implementierung werden in einem eigenen Kapitel beschrieben und diskutiert. Neu in der dritten Auflage ist u.a. die Behandlung von immer populärer werdenden Formaten (wie HAL, collection+json und Siren), Hinweise zur Dokumentation von Web-APIs sowie das Zusammenspiel mit Web-Oberflächen nach dem ROCA-Prinzip.","language":"de","currency":"USD","id":"3864916437","title":"REST und HTTP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jq32DwAAQBAJ&source=gbs_api","authors":["Stefan Tilkov","Martin Eigenbrodt","Silvia Schreier","Oliver Wolf"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eCWGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Accelerating software delivery with container orchestrators, 2nd Edition","description":"Leverage the power of Kubernetes to build an efficient software delivery pipeline. Key Features Learn about DevOps, containers, and Kubernetes all within one handy book A practical guide to container management and orchestration Learn how to monitor, log, and troubleshoot your Kubernetes applications Book Description Kubernetes has been widely adopted across public clouds and on-premise data centers. As we're living in an era of microservices, knowing how to use and manage Kubernetes is an essential skill for everyone in the IT industry. This book is a guide to everything you need to know about Kubernetes—from simply deploying a container to administrating Kubernetes clusters wisely. You'll learn about DevOps fundamentals, as well as deploying a monolithic application as microservices and using Kubernetes to orchestrate them. You will then gain an insight into the Kubernetes network, extensions, authentication and authorization. With the DevOps spirit in mind, you'll learn how to allocate resources to your application and prepare to scale them efficiently. Knowing the status and activity of the application and clusters is crucial, so we’ll learn about monitoring and logging in Kubernetes. Having an improved ability to observe your services means that you will be able to build a continuous delivery pipeline with confidence. At the end of the book, you'll learn how to run managed Kubernetes services on three top cloud providers: Google Cloud Platform, Amazon Web Services, and Microsoft Azure. What you will learn Learn fundamental and advanced DevOps skills and tools Get a comprehensive understanding of containers Dockerize an application Administrate and manage Kubernetes cluster Extend the cluster functionality with custom resources Understand Kubernetes network and service mesh Implement Kubernetes logging and monitoring Manage Kubernetes services in Amazon Web Services, Google Cloud Platform,and Microsoft Azure Who this book is for This book is for anyone who wants to learn containerization and clustering in a practical way using Kubernetes. No prerequisite skills are required, however, essential DevOps skill and public\/private Cloud knowledge will accelerate the reading speed. If you're advanced, you can get a deeper understanding of all the tools and technique described in the book.","language":"en","currency":"USD","id":"1789530431","title":"DevOps with Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eCWGDwAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Cheng-Yang Wu"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TLZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build effective applications that meet modern software requirements","description":"Leverage the features of C# 7 and .NET core 2.0 to build real-world .NET core applications Key Features Easy-to-follow real-world projects that get you up and running with the new features of C# 7 and .NET Core 2.0 The practical applications will assist you with concepts such as Entity Framework Core, serverless computing, and more in .NET Core 2.0 Explore OAuth concepts and build ASP.NET Core applications using MongoDB Book Description .NET Core is a general purpose, modular, cross-platform, and open source implementation of .NET. With the latest release of .NET Core, many more APIs are expected to show up, which will make APIs consistent across .Net Framework, .NET Core, and Xamarin. This step-by-step guide will teach you the essential .NET Core and C# concepts with the help of real-world projects. The book starts with a brief introduction to the latest features of C# 7 and .NET Core 2.0 before moving on to explain how C# 7 can be implemented using the object-oriented paradigm. You'll learn to work with relational data using Entity Framework and see how to use ASP.NET Core practically. This book will show you how .NET Core allows the creations of cross-platform applications. You'll also learn about SignalR to add real-time functionality to your application. Then you will see how to use MongoDB and how to implement MongoDB into your applications. You'll learn about serverless computing and OAuth concepts, along with running ASP.NET Core applications with Docker Compose. This project-based guide uses practical applications to demonstrate these concepts. By the end of the book, you'll be proficient in developing applications using .NET Core 2.0. What you will learn How to incorporate Entity Framework Core to build ASP .NET Core MVC applications Get hands-on experience with SignalR, and NuGet packages Working with MongoDB in your ASP.NET Core MVC application Get hands-on experience with .NET Core MVC, Middleware, Controllers, Views, Layouts, Routing, and OAuth Implementing Azure Functions and learn what Serverless computing means See how .NET Core enables cross-platform applications that run on Windows, macOS and Linux Running a .NET Core MVC application with Docker Compose Who this book is for This book is for .NET developers who would like to master and implement C# 7 and .NET Core 2.0 with practical projects. Basic knowledge of .NET Core and C# is assumed.","language":"en","currency":"USD","id":"1788398130","title":"C# 7 and .NET Core 2.0 Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TLZTDwAAQBAJ&source=gbs_api","authors":["Dirk Strauss","Jas Rademeyer"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BJdMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 90 proven recipes to get you scraping with Python, microservices, Docker, and AWS","description":"Untangle your web scraping complexities and access web data with ease using Python scripts Key Features Hands-on recipes for advancing your web scraping skills to expert level One-stop solution guide to address complex and challenging web scraping tasks using Python Understand web page structures and collect data from a website with ease Book Description Python Web Scraping Cookbook is a solution-focused book that will teach you techniques to develop high-performance Scrapers, and deal with cookies, hidden form fields, Ajax-based sites and proxies. You'll explore a number of real-world scenarios where every part of the development or product life cycle will be fully covered. You will not only develop the skills to design reliable, high-performing data flows, but also deploy your codebase to Amazon Web Services (AWS). If you are involved in software engineering, product development, or data mining or in building data-driven products, you will find this book useful as each recipe has a clear purpose and objective. Right from extracting data from websites to writing a sophisticated web crawler, the book's independent recipes will be extremely helpful while on the job. This book covers Python libraries, requests, and BeautifulSoup. You will learn about crawling, web spidering, working with AJAX websites, and paginated items. You will also understand to tackle problems such as 403 errors, working with proxy, scraping images, and LXML. By the end of this book, you will be able to scrape websites more efficiently and deploy and operate your scraper in the cloud. What you will learn Use a variety of tools to scrape any website and data, including Scrapy and Selenium Master expression languages, such as XPath and CSS, and regular expressions to extract web data Deal with scraping traps such as hidden form fields, throttling, pagination, and different status codes Build robust scraping pipelines with SQS and RabbitMQ Scrape assets like image media and learn what to do when Scraper fails to run Explore ETL techniques of building a customized crawler, parser, and convert structured and unstructured data from websites Deploy and run your scraper as a service in AWS Elastic Container Service Who this book is for This book is ideal for Python programmers, web administrators, security professionals, and anyone who wants to perform web analytics. Familiarity with Python and basic understanding of web scraping will be useful to make the best of this book.","language":"en","currency":"USD","id":"1787286630","title":"Python Web Scraping Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BJdMDwAAQBAJ&source=gbs_api","authors":["Michael Heydt"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-jmPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Tools for Business Intelligence, data prep, and visual analytics, 3rd Edition","description":"Create powerful data visualizations and unlock intelligent business insights with Tableau Key Features Explore all the latest Tableau 2019 features and redefine business analytics for your organization Create impressive data visualizations and interactive dashboards to get insights from your data Learn effective data storytelling to transform how your business leverages data and makes decisions Book Description Tableau is the gold standard of business intelligence and visual analytics tools in every industry. It enables rapid data visualization and interpretation with charts, graphs, dashboards, and much more. Updated with the latest features of Tableau, this book takes you from the foundations of the Tableau 2019 paradigm through to advanced topics. This third edition of the bestselling guide by Tableau Zen Master, Joshua Milligan, will help you come to grips with updated features, such as set actions and transparent views. Beginning with installation, you'll create your first visualizations with Tableau and then explore practical examples and advanced techniques. You'll create bar charts, tree maps, scatterplots, time series, and a variety of other visualizations. Next, you'll discover techniques to overcome challenges presented by data structure and quality and engage in effective data storytelling and decision making with business critical information. Finally, you'll be introduced to Tableau Prep, and learn how to use it to integrate and shape data for analysis. By the end of this book, you will be equipped to leverage the powerful features of Tableau 2019 for decision making. What you will learn Develop stunning visualizations that explain complexity with clarity Explore the exciting new features of Tableau Desktop and Tableau Prep Connect to various data sources to bring all your data together Uncover techniques to prep and structure your data for easy analysis Create and use calculations to solve problems and enrich analytics Master advanced topics such as sets, LOD calcs, and much more Enable smart decisions with clustering, distribution, and forecasting Share your data stories to build a culture of trust and action Who this book is for This Tableau book is for anyone who wants to understand data. If you’re new to Tableau, don’t worry. This book builds on the foundations to help you understand how Tableau really works and then builds on that knowledge with practical examples before moving on to advanced techniques. Working experience with databases will be useful but is not necessary to get the most out of this book.","language":"en","currency":"USD","id":"1788838742","title":"Learning Tableau 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-jmPDwAAQBAJ&source=gbs_api","authors":["Joshua N. Milligan"]},{"pageCount":390,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ei59DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Automate the process of designing, developing, and delivering highly reliable apps and services with SRE","description":"Create, deploy, and manage applications at scale using SRE principles Key Features Build and run highly available, scalable, and secure software Explore abstract SRE in a simplified and streamlined way Enhance the reliability of cloud environments through SRE enhancements Book Description Site reliability engineering (SRE) is being touted as the most competent paradigm in establishing and ensuring next-generation high-quality software solutions. This book starts by introducing you to the SRE paradigm and covers the need for highly reliable IT platforms and infrastructures. As you make your way through the next set of chapters, you will learn to develop microservices using Spring Boot and make use of RESTful frameworks. You will also learn about GitHub for deployment, containerization, and Docker containers. Practical Site Reliability Engineering teaches you to set up and sustain containerized cloud environments, and also covers architectural and design patterns and reliability implementation techniques such as reactive programming, and languages such as Ballerina and Rust. In the concluding chapters, you will get well-versed with service mesh solutions such as Istio and Linkerd, and understand service resilience test practices, API gateways, and edge\/fog computing. By the end of this book, you will have gained experience on working with SRE concepts and be able to deliver highly reliable apps and services. What you will learn Understand how to achieve your SRE goals Grasp Docker-enabled containerization concepts Leverage enterprise DevOps capabilities and Microservices architecture (MSA) Get to grips with the service mesh concept and frameworks such as Istio and Linkerd Discover best practices for performance and resiliency Follow software reliability prediction approaches and enable patterns Understand Kubernetes for container and cloud orchestration Explore the end-to-end software engineering process for the containerized world Who this book is for Practical Site Reliability Engineering helps software developers, IT professionals, DevOps engineers, performance specialists, and system engineers understand how the emerging domain of SRE comes handy in automating and accelerating the process of designing, developing, debugging, and deploying highly reliable applications and services.","language":"en","currency":"USD","id":"1788838696","title":"Practical Site Reliability Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ei59DwAAQBAJ&source=gbs_api","authors":["Pethuru Raj Chelliah","Shreyash Naithani","Shailender Singh"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_UEwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Architect and design highly scalable, robust, clean and highly performant applications in .NET Core About This Book Incorporate architectural soft-skills such as DevOps and Agile methodologies to enhance program-level objectives Gain knowledge of architectural approaches on the likes of SOA architecture and microservices to provide traceability and rationale for architectural decisions Explore a variety of practical use cases and code examples to implement the tools and techniques described in the book Who This Book Is For This book is for experienced .NET developers who are aspiring to become architects of enterprise-grade applications, as well as software architects who would like to leverage .NET to create effective blueprints of applications. What You Will Learn Grasp the important aspects and best practices of application lifecycle management Leverage the popular ALM tools, application insights, and their usage to monitor performance, testability, and optimization tools in an enterprise Explore various authentication models such as social media-based authentication, 2FA and OpenID Connect, learn authorization techniques Explore Azure with various solution approaches for Microservices and Serverless architecture along with Docker containers Gain knowledge about the recent market trends and practices and how they can be achieved with .NET Core and Microsoft tools and technologies In Detail If you want to design and develop enterprise applications using .NET Core as the development framework and learn about industry-wide best practices and guidelines, then this book is for you. The book starts with a brief introduction to enterprise architecture, which will help you to understand what enterprise architecture is and what the key components are. It will then teach you about the types of patterns and the principles of software development, and explain the various aspects of distributed computing to keep your applications effective and scalable. These chapters act as a catalyst to start the practical implementation, and design and develop applications using different architectural approaches, such as layered architecture, service oriented architecture, microservices and cloud-specific solutions. Gradually, you will learn about the different approaches and models of the Security framework and explore various authentication models and authorization techniques, such as social media-based authentication and safe storage using app secrets. By the end of the book, you will get to know the concepts and usage of the emerging fields, such as DevOps, BigData, architectural practices, and Artificial Intelligence. Style and approach Filled with examples and use cases, this guide takes a no-nonsense approach to show you the best tools and techniques required to become a successful software architect.","language":"en","currency":"USD","id":"1786469375","title":"Enterprise Application Architecture with .NET Core","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_UEwDwAAQBAJ&source=gbs_api","authors":["Ganesan Senthilvel","Ovais Mehboob Ahmed Khan","Habib Ahmed Qureshi"]},{"pageCount":203,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5VNSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"7th International Symposium, BMSD 2017, Barcelona, Spain, July 3–5, 2017, Revised Selected Papers","description":"This book contains revised and extended versions of selected papers from the 7th International Symposium on Business Modeling and Software Design, BMSD 2017, held in Barcelona, Spain, in July 2017. BMSD 2017 received a total of 57 paper submissions. The 10 papers selected for inclusion in this book deal with topics such as: business processes and enterprise engineering; business models and requirements; business models and services; business models and software; information systems architectures and paradigms; and data aspects in business modeling and software development.","language":"en","currency":"USD","id":"3319784285","title":"Business Modeling and Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5VNSDwAAQBAJ&source=gbs_api","authors":["Boris Shishkov"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-GFLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design, build, and deploy responsive applications using AWS Cloud components, 2nd Edition","description":"Discover techniques and tools for building serverless applications with AWS Key Features Get well-versed with building and deploying serverless APIs with microservices Learn to build distributed applications and microservices with AWS Step Functions A step-by-step guide that will get you up and running with building and managing applications on the AWS platform Book Description Amazon Web Services (AWS) is the most popular and widely-used cloud platform. Administering and deploying application on AWS makes the applications resilient and robust. The main focus of the book is to cover the basic concepts of cloud-based development followed by running solutions in AWS Cloud, which will help the solutions run at scale. This book not only guides you through the trade-offs and ideas behind efficient cloud applications, but is a comprehensive guide to getting the most out of AWS. In the first section, you will begin by looking at the key concepts of AWS, setting up your AWS account, and operating it. This guide also covers cloud service models, which will help you build highly scalable and secure applications on the AWS platform. We will then dive deep into concepts of cloud computing with S3 storage, RDS and EC2. Next, this book will walk you through VPC, building realtime serverless environments, and deploying serverless APIs with microservices. Finally, this book will teach you to monitor your applications, and automate your infrastructure and deploy with CloudFormation. By the end of this book, you will be well-versed with the various services that AWS provides and will be able to leverage AWS infrastructure to accelerate the development process. What you will learn Set up your AWS account and get started with the basic concepts of AWS Learn about AWS terminology and identity access management Acquaint yourself with important elements of the cloud with features such as computing, ELB, and VPC Back up your database and ensure high availability by having an understanding of database-related services in the AWS cloud Integrate AWS services with your application to meet and exceed non-functional requirements Create and automate infrastructure to design cost-effective, highly available applications Who this book is for If you are an I.T. professional or a system architect who wants to improve infrastructure using AWS, then this book is for you. It is also for programmers who are new to AWS and want to build highly efficient, scalable applications.","language":"en","currency":"USD","id":"1787289311","title":"Learning AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-GFLDwAAQBAJ&source=gbs_api","authors":["Aurobindo Sarkar","Amit Shah"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o7nHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build professional desktop, mobile, and web applications that meet modern software requirements, 2nd Edition","description":"Get up to speed with using C# 8 and .NET Core 3.0 features to build real-world .NET Core applications Key Features Learn the core concepts of web applications, serverless computing, and microservices Create an ASP.NET Core MVC application using controllers, routing, middleware and authentication Build modern applications using cutting-edge services from Microsoft Azure Book Description .NET Core is a general-purpose, modular, cross-platform, and opensource implementation of .NET. The latest release of .NET Core 3 comes with improved performance and security features, along with support for desktop applications. .NET Core 3 is not only useful for new developers looking to start learning the framework, but also for legacy developers interested in migrating their apps. Updated with the latest features and enhancements, this updated second edition is a step-by-step, project-based guide. The book starts with a brief introduction to the key features of C# 8 and .NET Core 3. You'll learn to work with relational data using Entity Framework Core 3, before understanding how to use ASP.NET Core. As you progress, you’ll discover how you can use .NET Core to create cross-platform applications. Later, the book will show you how to upgrade your old WinForms apps to .NET Core 3. The concluding chapters will then help you use SignalR effectively to add real-time functionality to your applications, before demonstrating how to implement MongoDB in your apps. Finally, you'll delve into serverless computing and how to build microservices using Docker and Kubernetes. By the end of this book, you'll be proficient in developing applications using .NET Core 3. What you will learn Understand how to incorporate the Entity Framework Core 3 to build ASP.NET Core MVC applications Create a real-time chat application using Azure’s SignalR service Gain hands-on experience of working with Cosmos DB Develop an Azure Function and interface it with an Azure Logic App Explore user authentication with Identity Server and OAuth2 Understand how to use Azure Cognitive Services to add advanced functionalities with minimal code Get to grips with running a .NET Core application with Kubernetes Who this book is for This book is for developers and programmers of all levels who want to build real-world projects and explore the new features of .NET Core 3. Developers working on legacy desktop software who are looking to migrate to .NET Core 3 will also find this book useful. Basic knowledge of .NET Core and C# is assumed.","language":"en","currency":"USD","id":"1789610249","title":"C# 8 and .NET Core 3 Projects Using Azure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o7nHDwAAQBAJ&source=gbs_api","authors":["Paul Michaels","Dirk Strauss","Jas Rademeyer"]},{"pageCount":354,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QshsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design high-availability and cost-effective applications for the cloud","description":"Learn and understand the need to architect cloud applications and migrate your business to cloud efficiently Key Features Understand the core design elements required to build scalable systems Plan resources and technology stacks effectively for high security and fault tolerance Explore core architectural principles using real-world examples Book Description Cloud computing has proven to be the most revolutionary IT development since virtualization. Cloud native architectures give you the benefit of more flexibility over legacy systems. To harness this, businesses need to refresh their development models and architectures when they find they don’t port to the cloud. Cloud Native Architectures demonstrates three essential components of deploying modern cloud native architectures: organizational transformation, deployment modernization, and cloud native architecture patterns. This book starts with a quick introduction to cloud native architectures that are used as a base to define and explain what cloud native architecture is and is not. You will learn what a cloud adoption framework looks like and develop cloud native architectures using microservices and serverless computing as design principles. You’ll then explore the major pillars of cloud native design including scalability, cost optimization, security, and ways to achieve operational excellence. In the concluding chapters, you will also learn about various public cloud architectures ranging from AWS and Azure to the Google Cloud Platform. By the end of this book, you will have learned the techniques to adopt cloud native architectures that meet your business requirements. You will also understand the future trends and expectations of cloud providers. What you will learn Learn the difference between cloud native and traditional architecture Explore the aspects of migration, when and why to use it Identify the elements to consider when selecting a technology for your architecture Automate security controls and configuration management Use infrastructure as code and CICD pipelines to run environments in a sustainable manner Understand the management and monitoring capabilities for AWS cloud native application architectures Who this book is for Cloud Native Architectures is for software architects who are keen on designing resilient, scalable, and highly available applications that are native to the cloud.","language":"en","currency":"USD","id":"1787284891","title":"Cloud Native Architectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QshsDwAAQBAJ&source=gbs_api","authors":["Tom Laszewski","Kamal Arora","Erik Farr","Piyum Zonooz"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3eZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build scalable, reliable, and cost-effective applications with a serverless architecture About This Book Design a real-world serverless application from scratch Learn about AWS Lambda function and how to use Lambda functions to glue other AWS Services Use the Java programming language and well-known design patterns. Although Java is used for the examples in this book, the concept is applicable across all languages Learn to migrate your JAX-RS application to AWS Lambda and API Gateway Who This Book Is For This book is for developers and software architects who are interested in designing on the back end. Since the book uses Java to teach concepts, knowledge of Java is required. What You Will Learn Learn to form microservices from bigger Softwares Orchestrate and scale microservices Design and set up the data flow between cloud services and custom business logic Get to grips with cloud provider's APIs, limitations, and known issues Migrate existing Java applications to a serverless architecture Acquire deployment strategies Build a highly available and scalable data persistence layer Unravel cost optimization techniques In Detail Over the past years, all kind of companies from start-ups to giant enterprises started their move to public cloud providers in order to save their costs and reduce the operation effort needed to keep their shops open. Now it is even possible to craft a complex software system consisting of many independent micro-functions that will run only when they are needed without needing to maintain individual servers. The focus of this book is to design serverless architectures, and weigh the advantages and disadvantages of this approach, along with decision factors to consider. You will learn how to design a serverless application, get to know that key points of services that serverless applications are based on, and known issues and solutions. The book addresses key challenges such as how to slice out the core functionality of the software to be distributed in different cloud services and cloud functions. It covers basic and advanced usage of these services, testing and securing the serverless software, automating deployment, and more. By the end of the book, you will be equipped with knowledge of new tools and techniques to keep up with this evolution in the IT industry. Style and approach The book takes a pragmatic approach, showing you all the examples you need to build efficient serverless applications.","language":"en","currency":"USD","id":"1787128016","title":"Building Serverless Architectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3eZDDwAAQBAJ&source=gbs_api","authors":["Cagatay Gurturk"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DicGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Harness the full potential of your applications with Docker","description":"Start from scratch and develop the essential skills needed to create, deploy, and manage cloud-native applications using Docker Key Features Get a solid understanding of Docker and containers Overcome common problems while containerizing an application Master Docker commands needed for creating, deploying, and running applications Book Description Most applications, even the funky cloud-native microservices ones, need high-performance, production-grade infrastructure to run on. Having impeccable knowledge of Docker will help you to thrive in the modern cloud-first world. With this book, you'll gain the skills you need to work with Docker and its containers. The book begins with an introduction to containers and explains its functionality and application in the real world. You'll then get an overview of VMware, Kubernetes, and Docker and learn to install Docker on Windows, Mac, and Linux. Once you've understood the Ops and Dev perspective of Docker, you'll be able to see the big picture and understand what Docker exactly does. The book then turns its attention to the more technical aspects, guiding your through practical exercises covering Docker engine, Docker images, and Docker containers. You'll learn techniques for containerizing an app, deploying apps with Docker Compose, and managing cloud-native applications with Swarm. You'll also build Docker networks and Docker overlay networks and handle applications that write persistent data. Finally, you'll deploy apps with Docker stacks and secure your Docker environment. By the end of this book, you'll be well-versed in Docker and containers and have developed the skills to create, deploy, and run applications on the cloud. What you will learn Become familiar with the applications of Docker and containers Discover how to pull images into Docker host's local registry Find out how to containerize an app Build and test a Docker overlay network in the swarm mode Use Docker compose to deploy and manage multi-container applications Securely share sensitive data with containers and Swarm services Who this book is for Whether you are a beginner or an experienced developer looking to utilize Docker to develop and operate cloud-native microservices apps, this book is for you. Anyone who wants to learn Docker orchestration, networking, imaging, and security will also find it useful. No prior knowledge of Docker is necessary.","language":"en","currency":"USD","id":"1800569114","title":"Docker Deep Dive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DicGEAAAQBAJ&source=gbs_api","authors":["Nigel Poulton"]},{"pageCount":72,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JXgBDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Application programming interfaces (API) act as the digital glue that links services, applications, and systems together to create compelling customer experiences. Using APIs you can create interfaces between back-end systems and applications that can help you bring new digital services to market, open revenue channels, and exceed customer expectations. IBM® API Connect is an API management solution from IBM that offers capabilities to create, run, manage, and secure APIs and microservices, thus managing the full lifecycle of APIs for both on-premises and cloud environments. This IBM RedpaperTM publication gives a broad overview of APIs and API Connect and covers key considerations for managing the lifecycle of APIs. This paper is targeted for owners of an API Connect based API, such as, C-level executives, members of the business development teams, product managers, and technical evangelists. For practical scenarios using API Connect, refer to the companion IBM Redbooks® publication, Getting Started with IBM API Connect: Scenarios Guide, REDP-5350.","language":"en","currency":"USD","id":"073845558X","title":"Getting Started with IBM API Connect: Concepts and Architecture Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JXgBDQAAQBAJ&source=gbs_api","authors":["Wisnewski Benjamin","Bhargav Perepa","Ilene Seelemann","Kurtulus Yildirim","Rahul Gupta","Soad Hamdy","Vasfi Gucer","IBM Redbooks"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pitLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Big Data Processing Made Simple","description":"Learn how to use, deploy, and maintain Apache Spark with this comprehensive guide, written by the creators of the open-source cluster-computing framework. With an emphasis on improvements and new features in Spark 2.0, authors Bill Chambers and Matei Zaharia break down Spark topics into distinct sections, each with unique goals. You’ll explore the basic operations and common functions of Spark’s structured APIs, as well as Structured Streaming, a new high-level API for building end-to-end streaming applications. Developers and system administrators will learn the fundamentals of monitoring, tuning, and debugging Spark, and explore machine learning techniques and scenarios for employing MLlib, Spark’s scalable machine-learning library. Get a gentle overview of big data and Spark Learn about DataFrames, SQL, and Datasets—Spark’s core APIs—through worked examples Dive into Spark’s low-level APIs, RDDs, and execution of SQL and DataFrames Understand how Spark runs on a cluster Debug, monitor, and tune Spark clusters and applications Learn the power of Structured Streaming, Spark’s stream-processing engine Learn how you can apply MLlib to a variety of problems, including classification or recommendation","language":"en","currency":"USD","id":"1491912294","title":"Spark: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pitLDwAAQBAJ&source=gbs_api","authors":["Bill Chambers","Matei Zaharia"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=COlODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build nine projects by leveraging powerful frameworks such as Flask, Nameko, and Django","description":"How to build useful, real-world applications in the Python programming language Key Features Deliver scalable and high-performing applications in Python. Delve into the great ecosystem of Python frameworks and libraries through projects that you will build with this book. This comprehensive guide will help you demonstrate the power of Python by building practical projects. Book Description Python is a very powerful, high-level, object-oriented programming language. It's known for its simplicity and huge community support. Python Programming Blueprints will help you build useful, real-world applications using Python. In this book, we will cover some of the most common tasks that Python developers face on a daily basis, including performance optimization and making web applications more secure. We will familiarize ourselves with the associated software stack and master asynchronous features in Python. We will build a weather application using command-line parsing. We will then move on to create a Spotify remote control where we'll use OAuth and the Spotify Web API. The next project will cover reactive extensions by teaching you how to cast votes on Twitter the Python way. We will also focus on web development by using the famous Django framework to create an online game store. We will then create a web-based messenger using the new Nameko microservice framework. We will cover topics like authenticating users and, storing messages in Redis. By the end of the book, you will have gained hands-on experience in coding with Python. What you will learn Learn object-oriented and functional programming concepts while developing projects The dos and don'ts of storing passwords in a database Develop a fully functional website using the popular Django framework Use the Beautiful Soup library to perform web scrapping Get started with cloud computing by building microservice and serverless applications in AWS Develop scalable and cohesive microservices using the Nameko framework Create service dependencies for Redis and PostgreSQL Who this book is for This book is for software developers who are familiar with Python and want to gain hands-on experience with web and software development projects. A basic knowledge of Python programming is required.","language":"en","currency":"USD","id":"178646490X","title":"Python Programming Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=COlODwAAQBAJ&source=gbs_api","authors":["Daniel Furtado","Marcus Pennington"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sUpsCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":5.3,"subtitle":"","description":"This well-organized book presents the principles, techniques, design, and implementation of cloud computing, with a perfect balance in the presentation of theoretical and practical aspects. The book, after providing a brief introduction to the subject, gives a clear analysis of different cloud computing models and explains all the relevant concepts on virtualization, security issues and challenges in cloud computing. In addition to this, the book introduces the reader with some of the prominent cloud service provider companies like Amazon, Microsoft and Google, and discusses the various features of these web services. Further, to provide the necessary background required to understand the principles of cloud computing, the roadmap for migration of application to cloud and roles of different standards used for cloud computing are discussed in detail. The discussion ends after addressing mobile cloud computing and microservices—the recent advances in cloud computing. The book is primarily intended for the undergraduate and postgraduate students of computer science and engineering, and information technology.","language":"en","currency":"USD","id":"8120352130","title":"CLOUD COMPUTING","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sUpsCwAAQBAJ&source=gbs_api","authors":["PACHGHARE, V. K. "]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Leverage the lethal combination of Docker and Kubernetes to automate deployment and management of Java applications About This Book Master using Docker and Kubernetes to build, deploy and manage Java applications in a jiff Learn how to create your own Docker image and customize your own cluster using Kubernetes Empower the journey from development to production using this practical guide. Who This Book Is For The book is aimed at Java developers who are eager to build, deploy, and manage applications very quickly using container technology. They need have no knowledge of Docker and Kubernetes. What You Will Learn Package Java applications into Docker images Understand the running of containers locally Explore development and deployment options with Docker Integrate Docker into Maven builds Manage and monitor Java applications running on Kubernetes clusters Create Continuous Delivery pipelines for Java applications deployed to Kubernetes In Detail Imagine creating and testing Java EE applications on Apache Tomcat Server or Wildfly Application server in minutes along with deploying and managing Java applications swiftly. Sounds too good to be true? But you have a reason to cheer as such scenarios are only possible by leveraging Docker and Kubernetes. This book will start by introducing Docker and delve deep into its networking and persistent storage concepts. You will then proceed to learn how to refactor monolith application into separate services by building an application and then packaging it into Docker containers. Next, you will create an image containing Java Enterprise Application and later run it using Docker. Moving on, the book will focus on Kubernetes and its features and you will learn to deploy a Java application to Kubernetes using Maven and monitor a Java application in production. By the end of the book, you will get hands-on with some more advanced topics to further extend your knowledge about Docker and Kubernetes. Style and approach An easy-to-follow, practical guide that will help Java developers develop, deploy, and manage Java applications efficiently.","language":"en","currency":"USD","id":"1786463903","title":"Docker and Kubernetes for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UpZGDwAAQBAJ&source=gbs_api","authors":["Jaroslaw Krochmalski"]},{"pageCount":466,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build a variety of real-world applications by taking advantage of the newest features of Java 9 About This Book See some of the new features of Java 9 and be introduced to parts of the Java SDK This book provides a set of diverse, interesting projects that range in complexity from fairly simple to advanced and cover HTTP 2.0 Take advantage of Java's new modularity features to write real-world applications that solve a variety of problems Who This Book Is For This book is for Java developers who are already familiar with the language. Familiarity with more advanced topics, such as network programming and threads, would be helpful, but is not assumed. What You Will Learn Learn how to package Java applications as modules by using the Java Platform Module System Implement process management in Java by using the all-new process handling API Integrate your applications with third-party services in the cloud Interact with mail servers using JavaMail to build an application that filters spam messages Learn to use JavaFX to build rich GUI based applications, which are an essential element of application development Write microservices in Java using platform libraries and third-party frameworks Integrate a Java application with MongoDB to build a cloud-based note taking application In Detail Java is a powerful language that has applications in a wide variety of fields. From playing games on your computer to performing banking transactions, Java is at the heart of everything. The book starts by unveiling the new features of Java 9 and quickly walks you through the building blocks that form the basis of writing applications. There are 10 comprehensive projects in the book that will showcase the various features of Java 9. You will learn to build an email filter that separates spam messages from all your inboxes, a social media aggregator app that will help you efficiently track various feeds, and a microservice for a client\/server note application, to name a few. The book covers various libraries and frameworks in these projects, and also introduces a few more frameworks that complement and extend the Java SDK. Through the course of building applications, this book will not only help you get to grips with the various features of Java 9, but will also teach you how to design and prototype professional-grade applications with performance and security considerations. Style and approach This is a learn-as-you-build practical guide to building full-fledged applications using Java 9. With a project-based approach, we'll improve your Java skills. You will experience a variety of solutions to problems with Java.","language":"en","currency":"USD","id":"1786464446","title":"Java 9 Programming Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t-ZDDwAAQBAJ&source=gbs_api","authors":["Jason Lee"]},{"pageCount":476,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hc2qDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Quick fixes to your common C# programming problems, with a focus on C# 6.0 About This Book Unique recipes for C#, that places it in its real-world context. You will be able to get yourself out of any coding-corner youve backed yourself into. All code samples available through GitHub to bring C#. In line with modern development workflows, written to the latest specification of C# 6.0. Who This Book Is For The book is aimed at developers who have basic familiarity with C# programming and will know the VS 2015 environment. What You Will Learn Write better and less code to achieve the same result as in previous versions of C#. Generate tests from the Code Contracts for mission critical methods. Integrate code in Visual Studio with GitHub. Create a web application in Azure. Design and build a microservice architecture Demystify the Rx library using Reactive extensions Write high performing codes in C# and understanding multi-threading. Security and Debugging. Implement Code Contracts on code in Visual Studio. In Detail During your application development workflow, there is always a moment when you need to get out of a tight spot. Through a recipe-based approach, this book will help you overcome common programming problems and get your applications ready to face the modern world. We start with C# 6, giving you hands-on experience with the new language features. Next, we work through the tasks that you perform on a daily basis such as working with strings, generics, and lots more. Gradually, we move on to more advanced topics such as the concept of object-oriented programming, asynchronous programming, reactive extensions, and code contracts. You will learn responsive high performance programming in C# and how to create applications with Azure. Next, we will review the choices available when choosing a source control solution. At the end of the book, we will show you how to create secure and robust code, and will help you ramp up your skills when using the new version of C# 6 and Visual Studio Style and Approach Unique recipe-based guide that will help you gain a solid understanding of the new concepts in C# 6 and Visual Studio Enterprise 2015 in a concise and technically correct manner.","language":"en","currency":"USD","id":"1786463962","title":"C# Programming Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hc2qDQAAQBAJ&source=gbs_api","authors":["Dirk Strauss"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qJ7cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Demystify application development on cloud platform by leveraging the power of IBM Bluemix About This Book The first book in the market that discusses the power of IBM Bluemix Shows developers how to develop and deploy applications on the cloud platform using IBM Bluemix A comprehensive guide to help you get started with IBM Bluemix also featuring samples applications Who This Book Is For This book is aimed at developers seeking to learn application development and deployment methods on IBM Bluemix. A basic knowledge of Java and Node.js is assumed. What You Will Learn Discover IBM Bluemix as a PaaS platform and learn about its three delivery models Develop and deploy a \"Hello World\" application on IBM Bluemix using the Cloud Foundry command line utility and the Bluemix console Extend your application by using the API or services provided by IBM Bluemix Understand microservices architecture and learn how to develop a sample application based on microservices architecture, using IBM Bluemix Learn how to leverage on-premise software and build an application on IBM Bluemix Scale and monitor an application on IBM Bluemix Explore the compute options on IBM Bluemix and work with each of them Build a mobile client application using Mobile services on IBM Bluemix In Detail IBM Bluemix is an open standard platform for building, running, and managing applications on the cloud. With Bluemix, developers can build innovative applications using various compute options and value added services , developers can also manage the application lifecycle using the platform provided DevOps services. Learning IBM Bluemix will take you on a journey from the basics of IBM Bluemix to working with the platform to developing and deploying of modern applications. The sample application use cases employed in the book will introduce you to the transformative nexus of cloud, mobile, and security, all enabled through capabilities provided out-of-the-box by IBM Bluemix. By the end of the book, you will have understood the benefits and use cases for IBM Bluemix, and will possess the skills to further explore the platform and thus develop, deploy, and secure your own innovative, new-age applications. Style and approach This comprehensive, step-by-step guide to learning IBM Bluemix will cover everything that is required to build, deploy, manage, and secure an application on the cloud.","language":"en","currency":"USD","id":"178588199X","title":"Learning IBM Bluemix","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qJ7cDgAAQBAJ&source=gbs_api","authors":["Sreelatha Sankaranarayanan"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fEqgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Developing Open Serverless Solutions","description":"Serverless computing greatly simplifies software development. Your team can focus solely on your application while the cloud provider manages the servers you need. This practical guide shows you step-by-step how to build and deploy complex applications in a flexible multicloud, multilanguage environment using Apache OpenWhisk. You’ll learn how this platform enables you to pursue a vendor-independent approach using preconfigured containers, microservices, and Kubernetes as your cloud operating system. Michele Sciabarrà demonstrates how to build a serverless application using classical design patterns and the programming language or languages that best fit your task. You’ll start by building a simple serverless application hands-on before diving into the more complex aspects of the OpenWhisk platform. Examine how OpenWhisk’s serverless architecture works, including the use of packages, actions, sequences, triggers, rules, and feeds Learn how OpenWhisk compares to existing architectures, such as Java Enterprise Edition Manipulate OpenWhisk features using the command-line interface or a JavaScript API Design applications using common Gang of Four design patterns Use architectural design patterns such as model-view-controller to combine several OpenWhisk actions Learn how to test and debug your code in a serverless environment","language":"en","currency":"USD","id":"1492046124","title":"Learning Apache OpenWhisk","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fEqgDwAAQBAJ&source=gbs_api","authors":["Michele Sciabarrà"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9WZUDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Solving Interoperability and Communication in a Cloud of Clouds","description":"The complete guide to Cisco® Intercloud: use cases, planning, and deployment Using Cisco Intercloud technologies, you can seamlessly integrate private, hybrid, and public clouds–securely providing the right resources at will, with consistent control. Now, four leading experts thoroughly introduce these powerful new technologies. Writing for CTOs, IT\/network managers, security architects, product managers, application owners, service architects, and consultants, they explain both underlying Intercloud concepts and practical use cases. Sharing deep architectural insight, the authors focus on key technical enablers, from virtualization to autonomic management and advanced protocols. They also address the business challenges service providers will face in federated Intercloud relationships. Illuminating the Intercloud with cutting-edge customer examples, they also describe a phased pathway towards coherent deployment. You’ll discover how the Intercloud can improve agility, portability, cost, and speed–and how to start transforming its potential into reality. Explore the Intercloud from both a technical and business standpoint Understand the role of Intercloud federations, exchanges, and brokers Review models for architecture and deployment Plan for effective service and customer management Manage workload portability without compromising service levels Handle service provisioning, assurance, and billing Implement best practices for federated security, privacy, and compliance Understand cloud APIs from “network up” and “application down” views Preview emerging standards for interoperability across disparate clouds Overcome challenges at IaaS, PaaS, SaaS, and other service layers Define user-to-network service contracts (UNCs) that permit dynamic cloud service mashups Understand microservices architectures and overlays for porting Intercloud applications Use the Intercloud to cooperatively engage resources from multiple cloud domains, and solve real business problems This book is part of the Networking Technology Series from Cisco Press ® , which offers networking professionals valuable information for constructing efficient networks, understanding new technologies, and building successful careers.","language":"en","currency":"USD","id":"0134189248","title":"Intercloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9WZUDAAAQBAJ&source=gbs_api","authors":["Jazib Frahim","Venkata Josyula","Monique Morrow","Ken Owens"]},{"pageCount":1027,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dIvgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Optimize Java Persistence Performance in Spring Boot Applications","description":"This book is a collection of developer code recipes and best practices for persisting data using Spring, particularly Spring Boot. The book is structured around practical recipes, where each recipe discusses a performance case or performance-related case, and almost every recipe has one or more applications. Mainly, when we try to accomplish something (e.g., read some data from the database), there are several approaches to do it, and, in order to choose the best way, you have to know the implied trades-off from a performance perspective. You’ll see that in the end, all these penalties slow down the application. Besides presenting the arguments that favor a certain choice, the application is written in Spring Boot style which is quite different than plain Hibernate. Persistence is an important set of techniques and technologies for accessing and using data, and this book demonstrates that data is mobile regardless of specific applications and contexts. In Java development, persistence is a key factor in enterprise, ecommerce, cloud and other transaction-oriented applications. After reading and using this book, you'll have the fundamentals to apply these persistence solutions into your own mission-critical enterprise Java applications that you build using Spring. What You Will Learn Shape *-to-many associations for best performances Effectively exploit Spring Projections (DTO) Learn best practices for batching inserts, updates and deletes Effectively fetch parent and association in a single SELECT Learn how to inspect Persistent Context content Dissect pagination techniques (offset and keyset) Handle queries, locking, schemas, Hibernate types, and more Who This Book Is For Any Spring and Spring Boot developer that wants to squeeze the persistence layer performances.","language":"en","currency":"USD","id":"1484256263","title":"Spring Boot Persistence Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dIvgDwAAQBAJ&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1-GtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"OpenShift for Infrastructure and Operations Teams","description":"Design and architect resilient OpenShift clusters and gain a keen understanding of how hundreds of projects are integrated into a powerful solution. While there are many OpenShift resources available for developers, this book focuses on the key elements of infrastructure and operations that teams need when looking to integrate and maintain this platform. You'll review important concepts, such as repeatable deployment techniques, advanced OpenShift RBAC capabilities, monitoring clusters, and integrating with external services. You'll also see how to run specialized workloads in OpenShift and how to deploy non-web based applications on the platform, all designed to help cultivate best practices as your organization continue evolve in microservices architectures. OpenShift has become the main enterprise Kubernetes distribution and its market penetration continues to growth at rapid rate. While OpenShift’s documentation provides a great list of configuration options to work with the platform, it can be a daunting task to wade through. Architecting and Operating OpenShift Clusters breaks this content down into clear and useful concepts to provide you with a solid understanding of the OpenShift internal architecture. What You'll Learn Operate high availability in muti-tenant OCP clusters Understand OpenShift SDN models, capabilities, and storage classes Integrate OCP with existing data center capabilities and CI\/CD pipelines Support advanced capabilities like: Istio, Multus, Kubernetes Operators, hybrid deployments Who This Book Is For Cloud architects, OpenShift cluster administrators, and teams supporting developers in OpenShift environments who have a basic understanding of this platform and microservices architectures.","language":"en","currency":"USD","id":"1484249852","title":"Architecting and Operating OpenShift Clusters","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1-GtDwAAQBAJ&source=gbs_api","authors":["William Caban"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a52BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build performant and concurrent Unix and Linux systems with C++17","description":"A hands-on guide to making system programming with C++ easy Key Features Write system-level code leveraging C++17 Learn the internals of the Linux Application Binary Interface (ABI) and apply it to system programming Explore C++ concurrency to take advantage of server-level constructs Book Description C++ is a general-purpose programming language with a bias toward system programming as it provides ready access to hardware-level resources, efficient compilation, and a versatile approach to higher-level abstractions. This book will help you understand the benefits of system programming with C++17. You will gain a firm understanding of various C, C++, and POSIX standards, as well as their respective system types for both C++ and POSIX. After a brief refresher on C++, Resource Acquisition Is Initialization (RAII), and the new C++ Guideline Support Library (GSL), you will learn to program Linux and Unix systems along with process management. As you progress through the chapters, you will become acquainted with C++'s support for IO. You will then study various memory management methods, including a chapter on allocators and how they benefit system programming. You will also explore how to program file input and output and learn about POSIX sockets. This book will help you get to grips with safely setting up a UDP and TCP server\/client. Finally, you will be guided through Unix time interfaces, multithreading, and error handling with C++ exceptions. By the end of this book, you will be comfortable with using C++ to program high-quality systems. What you will learn Understand the benefits of using C++ for system programming Program Linux\/Unix systems using C++ Discover the advantages of Resource Acquisition Is Initialization (RAII) Program both console and file input and output Uncover the POSIX socket APIs and understand how to program them Explore advanced system programming topics, such as C++ allocators Use POSIX and C++ threads to program concurrent systems Grasp how C++ can be used to create performant system applications Who this book is for If you are a fresh developer with intermediate knowledge of C++ but little or no knowledge of Unix and Linux system programming, this book will help you learn system programming with C++ in a practical way.","language":"en","currency":"USD","id":"1789131774","title":"Hands-On System Programming with C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a52BDwAAQBAJ&source=gbs_api","authors":["Dr. Rian Quinn"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H6a-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Perform powerful penetration testing using Kali Linux, Metasploit, Nessus, Nmap, and Wireshark","description":"Explore the latest ethical hacking tools and techniques in Kali Linux 2019 to perform penetration testing from scratch Key Features Get up and running with Kali Linux 2019.2 Gain comprehensive insights into security concepts such as social engineering, wireless network exploitation, and web application attacks Learn to use Linux commands in the way ethical hackers do to gain control of your environment Book Description The current rise in hacking and security breaches makes it more important than ever to effectively pentest your environment, ensuring endpoint protection. This book will take you through the latest version of Kali Linux and help you use various tools and techniques to efficiently deal with crucial security aspects. Through real-world examples, you’ll understand how to set up a lab and later explore core penetration testing concepts. Throughout the course of this book, you’ll get up to speed with gathering sensitive information and even discover different vulnerability assessment tools bundled in Kali Linux 2019. In later chapters, you’ll gain insights into concepts such as social engineering, attacking wireless networks, exploitation of web applications and remote access connections to further build on your pentesting skills. You’ll also focus on techniques such as bypassing controls, attacking the end user and maintaining persistence access through social media. Finally, this pentesting book covers best practices for performing complex penetration testing techniques in a highly secured environment. By the end of this book, you’ll be able to use Kali Linux to detect vulnerabilities and secure your system by applying penetration testing techniques of varying complexity. What you will learn Explore the fundamentals of ethical hacking Learn how to install and configure Kali Linux Get up to speed with performing wireless network pentesting Gain insights into passive and active information gathering Understand web application pentesting Decode WEP, WPA, and WPA2 encryptions using a variety of methods, such as the fake authentication attack, the ARP request replay attack, and the dictionary attack Who this book is for If you are an IT security professional or a security consultant who wants to get started with penetration testing using Kali Linux 2019.2, then this book is for you. The book will also help if you’re simply looking to learn more about ethical hacking and various security breaches. Although prior knowledge of Kali Linux is not necessary, some understanding of cybersecurity will be useful.","language":"en","currency":"USD","id":"1789612624","title":"Learn Kali Linux 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H6a-DwAAQBAJ&source=gbs_api","authors":["Glen D. Singh"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Modern web development using React 16, Node, Express, and MongoDB","description":"Unleash the power of MERN stack by building diverse web applications using React, Node.js, Express, and MongoDB Key Features Create dynamic web applications with the MERN stack Leverage the power of React in building interactive and complex user interfaces Unlock the potential of Node, Express, and MongoDB to build modern full-stack applications Book Description The benefits of using a full JavaScript stack for web development are undeniable, especially when robust and widely adopted technologies such as React, Node, and Express and are available. Combining the power of React with industry-tested, server-side technologies, such as Node, Express, and MongoDB, creates a diverse array of possibilities when developing real-world web applications. This book guides you through preparing the development environment for MERN stack-based web development, to creating a basic skeleton application and extending it to build four different web applications. These applications include a social media, an online marketplace, a media streaming, and a web-based game application with virtual reality features. While learning to set up the stack and developing a diverse range of applications with this book, you will grasp the inner workings of the MERN stack, extend its capabilities for complex features, and gain actionable knowledge of how to prepare MERN-based applications to meet the growing demands of real-world web applications. What you will learn Set up your development environment and develop a MERN application Implement user authentication and authorization using JSON Web Tokens Build a social media application by extending the basic MERN application Create an online marketplace application with shopping cart and Stripe payments Develop a media streaming application using MongoDB GridFS Implement server-side rendering with data to improve SEO Set up and use React 360 to develop user interfaces with VR capabilities Learn industry best practices to make MERN stack applications reliable and scalable Who this book is for Full-Stack React Web Development Projects is for JavaScript developers who have some experience with React, but no previous experience with full-stack development involving Node, Express, and MongoDB, and who want practical guidelines to start building different types of real-world web applications with this stack.","language":"en","currency":"USD","id":"1788832949","title":"Full-Stack React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anteDwAAQBAJ&source=gbs_api","authors":["Shama Hoque"]},{"pageCount":760,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hm21DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Confederated International Conferences: CoopIS, ODBASE, C&TC 2019, Rhodes, Greece, October 21–25, 2019, Proceedings","description":"This volume LNCS 11877 constitutes the refereed proceedings of the Confederated International Conferences: Cooperative Information Systems, CoopIS 2019, Ontologies, Databases, and Applications of Semantics, ODBASE 2019, and Cloud and Trusted Computing, C&TC, held as part of OTM 2019 in October 2019 in Rhodes, Greece. The 38 full papers presented together with 8 short papers were carefully reviewed and selected from 156 submissions. The OTM program every year covers data and Web semantics, distributed objects, Web services, databases, informationsystems, enterprise workflow and collaboration, ubiquity, interoperability, mobility, grid and high-performance computing.","language":"en","currency":"USD","id":"3030332462","title":"On the Move to Meaningful Internet Systems: OTM 2019 Conferences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hm21DwAAQBAJ&source=gbs_api","authors":["Hervé Panetto","Christophe Debruyne","Martin Hepp","Dave Lewis","Claudio Agostino Ardagna","Robert Meersman"]},{"pageCount":193,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anJgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"15th International Conference, Held as Part of the Services Conference Federation, SCF 2018, Seattle, WA, USA, June 25-30, 2018, Proceedings","description":"This book constitutes the proceedings of the International Conference on Services Computing, SCC 2018, as part of SCF 2018, held in Seattle, WA, USA, in June 2018. The 12 papers presented in this volume were carefully reviewed and selected from numerous submissions. The papers cover the science and technology of leveraging computing and information technology to model, create, operate, and manage business services.","language":"en","currency":"USD","id":"3319943766","title":"Services Computing – SCC 2018","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anJgDwAAQBAJ&source=gbs_api","authors":["João Eduardo Ferreira","George Spanoudakis","Yutao Ma","Liang-Jie Zhang"]},{"pageCount":286,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1-GtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"OpenShift for Infrastructure and Operations Teams","description":"Design and architect resilient OpenShift clusters and gain a keen understanding of how hundreds of projects are integrated into a powerful solution. While there are many OpenShift resources available for developers, this book focuses on the key elements of infrastructure and operations that teams need when looking to integrate and maintain this platform. You'll review important concepts, such as repeatable deployment techniques, advanced OpenShift RBAC capabilities, monitoring clusters, and integrating with external services. You'll also see how to run specialized workloads in OpenShift and how to deploy non-web based applications on the platform, all designed to help cultivate best practices as your organization continue evolve in microservices architectures. OpenShift has become the main enterprise Kubernetes distribution and its market penetration continues to growth at rapid rate. While OpenShift’s documentation provides a great list of configuration options to work with the platform, it can be a daunting task to wade through. Architecting and Operating OpenShift Clusters breaks this content down into clear and useful concepts to provide you with a solid understanding of the OpenShift internal architecture. What You'll Learn Operate high availability in muti-tenant OCP clusters Understand OpenShift SDN models, capabilities, and storage classes Integrate OCP with existing data center capabilities and CI\/CD pipelines Support advanced capabilities like: Istio, Multus, Kubernetes Operators, hybrid deployments Who This Book Is For Cloud architects, OpenShift cluster administrators, and teams supporting developers in OpenShift environments who have a basic understanding of this platform and microservices architectures.","language":"en","currency":"USD","id":"1484249852","title":"Architecting and Operating OpenShift Clusters","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1-GtDwAAQBAJ&source=gbs_api","authors":["William Caban"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a52BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build performant and concurrent Unix and Linux systems with C++17","description":"A hands-on guide to making system programming with C++ easy Key Features Write system-level code leveraging C++17 Learn the internals of the Linux Application Binary Interface (ABI) and apply it to system programming Explore C++ concurrency to take advantage of server-level constructs Book Description C++ is a general-purpose programming language with a bias toward system programming as it provides ready access to hardware-level resources, efficient compilation, and a versatile approach to higher-level abstractions. This book will help you understand the benefits of system programming with C++17. You will gain a firm understanding of various C, C++, and POSIX standards, as well as their respective system types for both C++ and POSIX. After a brief refresher on C++, Resource Acquisition Is Initialization (RAII), and the new C++ Guideline Support Library (GSL), you will learn to program Linux and Unix systems along with process management. As you progress through the chapters, you will become acquainted with C++'s support for IO. You will then study various memory management methods, including a chapter on allocators and how they benefit system programming. You will also explore how to program file input and output and learn about POSIX sockets. This book will help you get to grips with safely setting up a UDP and TCP server\/client. Finally, you will be guided through Unix time interfaces, multithreading, and error handling with C++ exceptions. By the end of this book, you will be comfortable with using C++ to program high-quality systems. What you will learn Understand the benefits of using C++ for system programming Program Linux\/Unix systems using C++ Discover the advantages of Resource Acquisition Is Initialization (RAII) Program both console and file input and output Uncover the POSIX socket APIs and understand how to program them Explore advanced system programming topics, such as C++ allocators Use POSIX and C++ threads to program concurrent systems Grasp how C++ can be used to create performant system applications Who this book is for If you are a fresh developer with intermediate knowledge of C++ but little or no knowledge of Unix and Linux system programming, this book will help you learn system programming with C++ in a practical way.","language":"en","currency":"USD","id":"1789131774","title":"Hands-On System Programming with C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a52BDwAAQBAJ&source=gbs_api","authors":["Dr. Rian Quinn"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H6a-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Perform powerful penetration testing using Kali Linux, Metasploit, Nessus, Nmap, and Wireshark","description":"Explore the latest ethical hacking tools and techniques in Kali Linux 2019 to perform penetration testing from scratch Key Features Get up and running with Kali Linux 2019.2 Gain comprehensive insights into security concepts such as social engineering, wireless network exploitation, and web application attacks Learn to use Linux commands in the way ethical hackers do to gain control of your environment Book Description The current rise in hacking and security breaches makes it more important than ever to effectively pentest your environment, ensuring endpoint protection. This book will take you through the latest version of Kali Linux and help you use various tools and techniques to efficiently deal with crucial security aspects. Through real-world examples, you’ll understand how to set up a lab and later explore core penetration testing concepts. Throughout the course of this book, you’ll get up to speed with gathering sensitive information and even discover different vulnerability assessment tools bundled in Kali Linux 2019. In later chapters, you’ll gain insights into concepts such as social engineering, attacking wireless networks, exploitation of web applications and remote access connections to further build on your pentesting skills. You’ll also focus on techniques such as bypassing controls, attacking the end user and maintaining persistence access through social media. Finally, this pentesting book covers best practices for performing complex penetration testing techniques in a highly secured environment. By the end of this book, you’ll be able to use Kali Linux to detect vulnerabilities and secure your system by applying penetration testing techniques of varying complexity. What you will learn Explore the fundamentals of ethical hacking Learn how to install and configure Kali Linux Get up to speed with performing wireless network pentesting Gain insights into passive and active information gathering Understand web application pentesting Decode WEP, WPA, and WPA2 encryptions using a variety of methods, such as the fake authentication attack, the ARP request replay attack, and the dictionary attack Who this book is for If you are an IT security professional or a security consultant who wants to get started with penetration testing using Kali Linux 2019.2, then this book is for you. The book will also help if you’re simply looking to learn more about ethical hacking and various security breaches. Although prior knowledge of Kali Linux is not necessary, some understanding of cybersecurity will be useful.","language":"en","currency":"USD","id":"1789612624","title":"Learn Kali Linux 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H6a-DwAAQBAJ&source=gbs_api","authors":["Glen D. Singh"]},{"pageCount":760,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hm21DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Confederated International Conferences: CoopIS, ODBASE, C&TC 2019, Rhodes, Greece, October 21–25, 2019, Proceedings","description":"This volume LNCS 11877 constitutes the refereed proceedings of the Confederated International Conferences: Cooperative Information Systems, CoopIS 2019, Ontologies, Databases, and Applications of Semantics, ODBASE 2019, and Cloud and Trusted Computing, C&TC, held as part of OTM 2019 in October 2019 in Rhodes, Greece. The 38 full papers presented together with 8 short papers were carefully reviewed and selected from 156 submissions. The OTM program every year covers data and Web semantics, distributed objects, Web services, databases, informationsystems, enterprise workflow and collaboration, ubiquity, interoperability, mobility, grid and high-performance computing.","language":"en","currency":"USD","id":"3030332462","title":"On the Move to Meaningful Internet Systems: OTM 2019 Conferences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hm21DwAAQBAJ&source=gbs_api","authors":["Hervé Panetto","Christophe Debruyne","Martin Hepp","Dave Lewis","Claudio Agostino Ardagna","Robert Meersman"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Modern web development using React 16, Node, Express, and MongoDB","description":"Unleash the power of MERN stack by building diverse web applications using React, Node.js, Express, and MongoDB Key Features Create dynamic web applications with the MERN stack Leverage the power of React in building interactive and complex user interfaces Unlock the potential of Node, Express, and MongoDB to build modern full-stack applications Book Description The benefits of using a full JavaScript stack for web development are undeniable, especially when robust and widely adopted technologies such as React, Node, and Express and are available. Combining the power of React with industry-tested, server-side technologies, such as Node, Express, and MongoDB, creates a diverse array of possibilities when developing real-world web applications. This book guides you through preparing the development environment for MERN stack-based web development, to creating a basic skeleton application and extending it to build four different web applications. These applications include a social media, an online marketplace, a media streaming, and a web-based game application with virtual reality features. While learning to set up the stack and developing a diverse range of applications with this book, you will grasp the inner workings of the MERN stack, extend its capabilities for complex features, and gain actionable knowledge of how to prepare MERN-based applications to meet the growing demands of real-world web applications. What you will learn Set up your development environment and develop a MERN application Implement user authentication and authorization using JSON Web Tokens Build a social media application by extending the basic MERN application Create an online marketplace application with shopping cart and Stripe payments Develop a media streaming application using MongoDB GridFS Implement server-side rendering with data to improve SEO Set up and use React 360 to develop user interfaces with VR capabilities Learn industry best practices to make MERN stack applications reliable and scalable Who this book is for Full-Stack React Web Development Projects is for JavaScript developers who have some experience with React, but no previous experience with full-stack development involving Node, Express, and MongoDB, and who want practical guidelines to start building different types of real-world web applications with this stack.","language":"en","currency":"USD","id":"1788832949","title":"Full-Stack React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anteDwAAQBAJ&source=gbs_api","authors":["Shama Hoque"]},{"pageCount":760,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7MxfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"A Problem-Solution Approach","description":"Quickly find solutions to dozens of common programming problems with the Java Enterprise Edition Platform for small business web applications, enterprise database applications, and microservices solutions. Content is presented in the popular problem-solution format. Look up the programming problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! Java EE 8 Recipes provides you with effective and proven solutions that can be used to accomplish just about any task that you may encounter. You can feel confident using the reliable solutions that are demonstrated in this book in your personal or corporate environment. Java is a mature programming language that has been refined over the years into a productive and lucrative language for those with the skills to wield it. One result of this years-long refining process is that that the language carries forward many older feature sets that no longer represent the best way of getting work accomplished. You can rest assured that Java EE 8 Recipes provides solutions using the most current approaches implemented in the most current Java Enterprise technologies, including JSON-P 1.1, JSF 2.3, and JAX-RS 2.1. Build a streamlined and reliable application that uses the latest in Java technologies, and develop it much faster than you did with the older technologies. Rejuvenate your Java expertise to use the freshest capabilities, or perhaps learn Java Enterprise development for the first time and discover one of the most widely used and most powerful technologies available for application development today. Develop productively. Develop with proven technology. Develop with Java Enterprise Edition. The book: Teaches how to develop RESTful enterprise applications quickly using the most current Java EE technologies Explores different solutions for developing sophisticated web user interfaces Walks you through a myriad of different concepts to apply while working with databases using Java technologies What You'll Learn Develop Java Enterprise applications using the latest in Java EE technologies Build great-looking user interfaces using Java Server Faces Employ Java Servlet technology and standard frameworks in developing professional web applications Create enterprise-level database applications using Enterprise Java Beans and JAX-RS RESTFul web services Make use of Arquillian to build a cohesive test suite for Java EE applications Manage Java EE application security through Java EE's container feature set Who This Book Is For Java developers who want to develop effective and proven solutions without reading a lengthy manual and scrubbing for techniques. A beginning Java programmer will find the book handy for learning a variety of different solutions for the platform, while advanced developers will enjoy the ease of the problem-solution approach to quickly broaden their knowledge of the platform’s latest technologies.","language":"en","currency":"USD","id":"1484235940","title":"Java EE 8 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7MxfDwAAQBAJ&source=gbs_api","authors":["Josh Juneau"]},{"pageCount":193,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anJgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"15th International Conference, Held as Part of the Services Conference Federation, SCF 2018, Seattle, WA, USA, June 25-30, 2018, Proceedings","description":"This book constitutes the proceedings of the International Conference on Services Computing, SCC 2018, as part of SCF 2018, held in Seattle, WA, USA, in June 2018. The 12 papers presented in this volume were carefully reviewed and selected from numerous submissions. The papers cover the science and technology of leveraging computing and information technology to model, create, operate, and manage business services.","language":"en","currency":"USD","id":"3319943766","title":"Services Computing – SCC 2018","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anJgDwAAQBAJ&source=gbs_api","authors":["João Eduardo Ferreira","George Spanoudakis","Yutao Ma","Liang-Jie Zhang"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gdYeEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"Strategies, practices, and patterns to help architects design continually evolving solutions","description":"A guide to successfully operating in a lean-agile organization for solutions architects and enterprise architects Key Features Develop the right combination of processes and technical excellence to address architectural challenges Explore a range of architectural techniques to modernize legacy systems Discover how to design and continuously improve well-architected sustainable software Book Description Many organizations have embraced Agile methodologies to transform their ability to rapidly respond to constantly changing customer demands. However, in this melee, many enterprises often neglect to invest in architects by presuming architecture is not an intrinsic element of Agile software development. Since the role of an architect is not pre-defined in Agile, many organizations struggle to position architects, often resulting in friction with other roles or a failure to provide a clear learning path for architects to be productive. This book guides architects and organizations through new Agile ways of incrementally developing the architecture for delivering an uninterrupted, continuous flow of values that meets customer needs. You'll explore various aspects of Agile architecture and how it differs from traditional architecture. The book later covers Agile architects' responsibilities and how architects can add significant value by positioning themselves appropriately in the Agile flow of work. Through examples, you'll also learn concepts such as architectural decision backlog,the last responsible moment, value delivery, architecting for change, DevOps, and evolutionary collaboration. By the end of this Agile book, you'll be able to operate as an architect in Agile development initiatives and successfully architect reliable software systems. What you will learn Acquire clarity on the duties of architects in Agile development Understand architectural styles such as domain-driven design and microservices Identify the pitfalls of traditional architecture and learn how to develop solutions Understand the principles of value and data-driven architecture Discover DevOps and continuous delivery from an architect's perspective Adopt Lean-Agile documentation and governance Develop a set of personal and interpersonal qualities Find out how to lead the transformation to achieve organization-wide agility Who this book is for This agile study guide is for architects currently working on agile development projects or aspiring to work on agile software delivery, irrespective of the methodology they are using. You will also find this book useful if you're a senior developer or a budding architect looking to understand an agile architect's role by embracing agile architecture strategies and a lean-agile mindset. To understand the concepts covered in this book easily, you need to have prior knowledge of basic agile development practices.","language":"en","currency":null,"id":"1800568207","title":"Becoming an Agile Software Architect","infoLink":"http:\/\/books.google.com\/books?id=gdYeEAAAQBAJ&dq=microservices&hl=&as_brr=5&source=gbs_api","authors":["Rajesh R V"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kl54DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Netw Fun Vir (NFV ePub_1","description":"Network Functions Virtualization (NFV) will drive dramatic cost reductions while also accelerating service delivery. Using NFV with SDN, network owners can provision new functions rapidly on demand, improve scalability, and leverage microservices. Benefits like these will make NFV indispensable for service providers, mobile operators, telcos, and enterprises alike. Network Functions Virtualization (NFV) with a Touch of SDN is the first practical introduction to NFV’s fundamental concepts, techniques, and use cases. Written for wide audiences of network engineers, architects, planners, and operators, it assumes no previous knowledge of NFV architecture, deployment, or management. The authors first explain how virtualization, VMs, containers, and related technologies establish the foundation for the NFV transformation. Next, they show how these concepts and technologies can be applied to virtualize network functions in the cloud, data centers, routing, security, and the mobile packet core. You’ll discover new tools and techniques for managing and orchestrating virtualized network devices, and gain new clarity on how SDN and NFV interact and interrelate. By the time you’re done, you’ll be ready to assess vendor claims, evaluate architectures, and plan NFV’s role in your own networks. Understand NFV’s key benefits and market drivers Review how virtualization makes NFV possible Consider key issues associated with NFV network design and deployment Integrate NFV into existing network designs Orchestrate, build, and deploy NFV networks and cloud services Maximize operational efficiency by building more programmable, automated networks Understand how NFV and SDN work together Address security, programmability, performance, and service function chaining Preview evolving concepts that will shape NFV’s future","language":"en","currency":"USD","id":"0134464338","title":"Network Functions Virtualization (NFV) with a Touch of SDN","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kl54DQAAQBAJ&source=gbs_api","authors":["Rajendra Chayapathi","Syed F. Hassan","Paresh Shah"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J_eVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Learn design patterns that enable the building of large-scale software architectures","description":"Understand Gang of Four, architectural, functional, and reactive design patterns and how to implement them on modern Java platforms, such as Java 12 and beyond Key Features Learn OOP, functional, and reactive patterns for creating readable and maintainable code Explore architectural patterns and practices for building scalable and reliable applications Tackle all kinds of performance-related issues and streamline development using design patterns Book Description Java design patterns are reusable and proven solutions to software design problems. This book covers over 60 battle-tested design patterns used by developers to create functional, reusable, and flexible software. Hands-On Design Patterns with Java starts with an introduction to the Unified Modeling Language (UML), and delves into class and object diagrams with the help of detailed examples. You'll study concepts and approaches to object-oriented programming (OOP) and OOP design patterns to build robust applications. As you advance, you'll explore the categories of GOF design patterns, such as behavioral, creational, and structural, that help you improve code readability and enable large-scale reuse of software. You’ll also discover how to work effectively with microservices and serverless architectures by using cloud design patterns, each of which is thoroughly explained and accompanied by real-world programming solutions. By the end of the book, you’ll be able to speed up your software development process using the right design patterns, and you’ll be comfortable working on scalable and maintainable projects of any size. What you will learn Understand the significance of design patterns for software engineering Visualize software design with UML diagrams Strengthen your understanding of OOP to create reusable software systems Discover GOF design patterns to develop scalable applications Examine programming challenges and the design patterns that solve them Explore architectural patterns for microservices and cloud development Who this book is for If you are a developer who wants to learn how to write clear, concise, and effective code for building production-ready applications, this book is for you. Familiarity with the fundamentals of Java is assumed.","language":"en","currency":"USD","id":"1789809959","title":"Hands-On Design Patterns with Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J_eVDwAAQBAJ&source=gbs_api","authors":["Dr. Edward Lavieri"]},{"pageCount":297,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZftKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"Three Keywords for Information Systems Innovation","description":"This book presents a collection of original research papers addressing the relationship between information systems (IS) and innovation. “Open”, “Smart” and “Network” are three keywords that are currently guiding information systems (IS) innovation, enhancing IS potentialities and their ability to support decision-making processes. The book discusses the relevance of these three new concepts in connection with technological and organizational innovations (i.e. cloud, smart technologies and networking), and the role they play in the development of accounting and management information systems. The book’s primary aim is to investigate how these innovations could influence information systems (with a particular focus on accounting and management information systems) by enhancing their information potentialities and improving accounting methodologies, performance measurement systems, data management, information systems architectures, and external and internal reporting. The book is based on a selection of the best papers—original double-blind reviewed contributions—presented at the 2016 Annual Conference of the Italian Chapter of the Association for Information Systems (AIS).","language":"en","currency":"USD","id":"3319626361","title":"Network, Smart and Open","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZftKDwAAQBAJ&source=gbs_api","authors":["Rita Lamboglia","Andrea Cardoni","Renata Paola Dameri","Daniela Mancini"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OrZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build real-world Android and web applications the Kotlin way","description":"Enhance your Kotlin programming skills by building 3 real-world applications Key Features Build three full-fledged, engaging applications from scratch and learn to deploy them Enhance your app development and programming activities with Kotlin’s powerful and intuitive tools and utilities. Experience the gentle learning curve, expressiveness, and intuitiveness of Kotlin, as you develop your own applications Book Description Kotlin greatly reduces the verbosity of source code. With Google having announced their support for Kotlin as a first-class language for writing Android apps, now's the time learn how to create apps from scratch with Kotlin Kotlin Programming By Example takes you through the building blocks of Kotlin, such as functions and classes. You’ll explore various features of Kotlin by building three applications of varying complexity. For a quick start to Android development, we look at building a classic game, Tetris, and elaborate on object-oriented programming in Kotlin. Our next application will be a messenger app, a level up in terms of complexity. Before moving onto the third app, we take a look at data persistent methods, helping us learn about the storage and retrieval of useful applications. Our final app is a place reviewer: a web application that will make use of the Google Maps API and Place Picker. By the end of this book, you will have gained experience of of creating and deploying Android applications using Kotlin. What you will learn Learn the building blocks of the Kotlin programming language Develop powerful RESTful microservices for Android applications Create reactive Android applications efficiently Implement an MVC architecture pattern and dependency management using Kotlin Centralize, transform, and stash data with Logstash Secure applications using Spring Security Deploy Kotlin microservices to AWS and Android applications to the Play Store Who this book is for This book is for those who are new to Kotlin or are familiar with the basics, having dabbled with Java until now. Basic programming knowledge is mandatory.","language":"en","currency":"USD","id":"1788479785","title":"Kotlin Programming By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OrZTDwAAQBAJ&source=gbs_api","authors":["Iyanu Adelekan"]},{"pageCount":203,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Zj5FDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":151.2,"subtitle":"SEDA 2016","description":"This book presents high-quality original contributions on new software engineering models, approaches, methods, and tools and their evaluation in the context of defence and security applications. In addition, important business and economic aspects are discussed, with a particular focus on cost\/benefit analysis, new business models, organizational evolution, and business intelligence systems. The contents are based on presentations delivered at SEDA 2016, the 5th International Conference in Software Engineering for Defence Applications, which was held in Rome, Italy, in May 2016. This conference series represents a targeted response to the growing need for research that reports and debates the practical implications of software engineering within the defence environment and also for software performance evaluation in real settings through controlled experiments as well as case and field studies. The book will appeal to all with an interest in modeling, managing, and implementing defence-related software development products and processes in a structured and supportable way.","language":"en","currency":"USD","id":"3319705784","title":"Proceedings of 5th International Conference in Software Engineering for Defence Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Zj5FDwAAQBAJ&source=gbs_api","authors":["Paolo Ciancarini","Stanislav Litvinov","Angelo Messina","Alberto Sillitti","Giancarlo Succi"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9ojJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Study Guide","description":"Pass the Pivotal Certified Professional exam using source code examples, study summaries, and mock exams. In this book, you'll find a descriptive overview of certification-related Spring modules and a single example application demonstrating the use of all required Spring modules. Also, it is suitable as an introductory primer for Spring newcomers. Furthermore, in Pivotal Certified Professional Spring Developer Exam: A Study Guide each chapter contains a brief study summary and question set, and the book’s free downloadable source code package includes one mock exam (50 questions – like a real exam). After using this study guide, you will be ready to take and pass the Pivotal Certified Professional exam. When you become Pivotal Certified, you will have one of the most valuable credentials in Java. The demand for Spring skills is skyrocketing. Pivotal certification helps you advance your skills and your career, and get the maximum benefit from Spring. Passing the exam demonstrates your understanding of Spring and validates your familiarity with: container-basics, aspect oriented programming (AOP), data access and transactions, Spring Security, Spring Boot, microservices and the Spring model-view-controller (MVC). Good luck! What You'll Learn Understand the core principles of the popular Spring Framework Use dependency injection Work with aspects in Spring and do AOP (aspect oriented programming) Control transactional behavior and work with SQL and NoSQL (MongoDB) databases Create and secure web applications based on Spring MVC Get to know the format of exam and type of questions in it Create Spring microservices applications Who This Book Is ForSpring developers who have taken the Pivotal Core Spring class are eligible to take the Pivotal Certified Professional exam.","language":"en","currency":"USD","id":"1484208110","title":"Pivotal Certified Professional Spring Developer Exam","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9ojJDQAAQBAJ&source=gbs_api","authors":["Iuliana Cosmina"]},{"pageCount":331,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TQUaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":null,"description":"With over 75 million downloads per month, Spring Boot is the most widely used Java framework available. Its ease and power have revolutionized application development from monoliths to microservices. Yet Spring Boot's simplicity can also be confounding. How do developers learn enough to be productive immediately? This practical book shows you how to use this framework to write successful mission-critical applications. Mark Heckler from VMware, the company behind Spring, guides you through Spring Boot's architecture and approach, covering topics such as debugging, testing, and deployment. If you want to develop cloud native Java or Kotlin applications with Spring Boot rapidly and effectively--using reactive programming, building APIs, and creating database access of all kinds--this book is for you. Learn how Spring Boot simplifies cloud native application development and deployment Build reactive applications and extend communication across the network boundary to create distributed systems Understand how Spring Boot's architecture and approach increase developer productivity and application portability Deploy Spring Boot applications for production workloads rapidly and reliably Monitor application and system health for optimal performance and reliability Debug, test, and secure cloud-based applications painlessly","language":"en","currency":"USD","id":"1492076937","title":"Spring Boot: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TQUaEAAAQBAJ&source=gbs_api","authors":["Mark Heckler"]},{"pageCount":583,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fDy5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"17th International Conference, ICSOC 2019, Toulouse, France, October 28–31, 2019, Proceedings","description":"This book constitutes the proceedings of the 17th International Conference on Service-Oriented Computing, ICSOC 2019, held in Toulouse, France, in October 2019. The 28 full and 12 short papers presented together with 7 poster and 2 invited papers in this volume were carefully reviewed and selected from 181 submissions. The papers have been organized in the following topical sections: Service Engineering; Run-time Service Operations and Management; Services and Data; Services in the Cloud; Services on the Internet of Things; Services in Organizations, Business and Society; and Services at the Edge.","language":"en","currency":"USD","id":"3030337022","title":"Service-Oriented Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fDy5DwAAQBAJ&source=gbs_api","authors":["Sami Yangui","Ismael Bouassida Rodriguez","Khalil Drira","Zahir Tari"]},{"pageCount":430,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z82qDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get up to date with the finer points of Ubuntu Server using this comprehensive guide About This Book Get well-versed with newly-added features in Ubuntu 16.04 Master the art of installing, managing, and troubleshooting Ubuntu Server A practical easy-to-understand book that will help you enhance your existing skills. Who This Book Is For This book is intended for readers with intermediate or advanced-beginner skills with Linux, who would like to learn all about setting up servers with Ubuntu Server. This book assumes that the reader knows the basics of Linux, such as editing configuration files and running basic commands. What You Will Learn Learn how to manage users, groups, and permissions Encrypt and decrypt disks with Linux Unified Key Setup \/Luks Setup SSH for remote access, and connect it to other nodes Understand how to add, remove, and search for packages Use NFS and Samba to share directories with other users Get to know techniques for managing Apache and MariaDB Explore best practices and troubleshooting techniques In Detail Ubuntu is a Debian-based Linux operating system, and has various versions targeted at servers, desktops, phones, tablets and televisions. The Ubuntu Server Edition, also called Ubuntu Server, offers support for several common configurations, and also simplifies common Linux server deployment processes. With this book as their guide, readers will be able to configure and deploy Ubuntu Servers using Ubuntu Server 16.04, with all the skills necessary to manage real servers. The book begins with the concept of user management, group management, as well as file-system permissions. To manage your storage on Ubuntu Server systems, you will learn how to add and format storage and view disk usage. Later, you will also learn how to configure network interfaces, manage IP addresses, deploy Network Manager in order to connect to networks, and manage network interfaces. Furthermore, you will understand how to start and stop services so that you can manage running processes on Linux servers. The book will then demonstrate how to access and share files to or from Ubuntu Servers. You will learn how to create and manage databases using MariaDB and share web content with Apache. To virtualize hosts and applications, you will be shown how to set up KVM\/Qemu and Docker and manage virtual machines with virt-manager. Lastly, you will explore best practices and troubleshooting techniques when working with Ubuntu Servers. By the end of the book, you will be an expert Ubuntu Server user well-versed in its advanced concepts. Style and Approach This book is an advanced guide that will show readers how to administer, manage, and deploy Ubuntu server and will also provide expert-level knowledge on advanced security and backup techniques.","language":"en","currency":"USD","id":"1785287133","title":"Mastering Ubuntu Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z82qDQAAQBAJ&source=gbs_api","authors":["Jay LaCroix"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xGxLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Create production CoreOS clusters and master the art of deploying Container-based microservices About This Book Confidently deploy distributed applications and effectively manage distributed infrastructure using Containers and CoreOS Build secure, scalable CoreOS clusters to deploy distributed applications using open source technologies and industry best practices Every concept and technology in this book is illustrated with practical examples that can be used in both development and production environments. Who This Book Is For This book is intended for Cloud application developers and Cloud infrastructure administrators. If you are looking to deploy a CoreOS cluster or you already have a CoreOS cluster that you want to manage better in terms of performance, security, and scaling, then this book is perfect for you. To follow the hands-on stuff, you need to have a Google and an AWS Cloud account and be able to run CoreOS VMs on your machine. A basic understanding of public and private clouds, Containers, Docker, Linux, and CoreOS is required. What You Will Learn Install CoreOS on a VM, on the Cloud, and bare metal, and find out how to keep your cluster secure and up to date Configure and troubleshoot key CoreOS services, such as etcd, systemd, and fleet, for distributed application deployment Study container networking using CoreOS Flannel and other solutions, such as Docker libnetwork, Weave, and Calico Explore the container filesystem and container volume management using Docker volume, NFS, GlusterFS, and Flocker Get to know the internals of container technologies such as Docker, Rkt, and Container orchestration using Openstack, Kubernetes and Docker native solutions Troubleshoot CoreOS cluster and Containers using monitoring and logging tools and master production techniques such as staging, security, and automation In Detail CoreOS makes Google and Amazon-style Cloud infrastructure available for anyone building their own private Cloud. This book covers the CoreOS internals and the technologies used in the deployment of container-based distributed applications. It starts with an overview of CoreOS and distributed application development while sharing knowledge on related technologies. Critical CoreOS services and networking and storage considerations for CoreOS are covered next. In latter half of the book, you will learn about Container runtime systems such as Docker and Rkt and Container Orchestration using Kubernetes. You will also find out about the integration of popular orchestration solutions such as OpenStack, the AWS Container service, and the Google Container Engine with CoreOS and Docker. Lastly, we cover troubleshooting as well as production considerations. Style and approach This is an easy-to–follow, comprehensive guide that covers both basic and advanced concepts. All topics are illustrated with practical examples that can be used in both simulation and production environments.","language":"en","currency":"USD","id":"178528830X","title":"Mastering CoreOS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xGxLDAAAQBAJ&source=gbs_api","authors":["Sreenivas Makam"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xNRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The easiest way to build Python RESTful APIs and web services with Django","description":"Design, build and test RESTful web services with the Django framework and Python Key Features Create efficient real-world RESTful web services with the latest Django framework Authenticate, secure, and integrate third-party packages efficiently in your Web Services Leverage the power of Python for faster Web Service development Book Description Django is a Python web framework that makes the web development process very easy. It reduces the amount of trivial code, which simplifies the creation of web applications and results in faster development. It is very powerful and a great choice for creating RESTful web services. If you are a Python developer and want to efficiently create RESTful web services with Django for your apps, then this is the right book for you. The book starts off by showing you how to install and configure the environment, required software, and tools to create RESTful web services with Django and the Django REST framework. We then move on to working with advanced serialization and migrations to interact with SQLite and non-SQL data sources. We will use the features included in the Django REST framework to improve our simple web service. Further, we will create API views to process diverse HTTP requests on objects, go through relationships and hyperlinked API management, and then discover the necessary steps to include security and permissions related to data models and APIs. We will also apply throttling rules and run tests to check that versioning works as expected. Next we will run automated tests to improve code coverage. By the end of the book, you will be able to build RESTful web services with Django. What you will learn The best way to build a RESTful Web Service or API with Django and the Django REST Framework Develop complex RESTful APIs from scratch with Django and the Django REST Framework Work with either SQL or NoSQL data sources Design RESTful Web Services based on application requirements Use third-party packages and extensions to perform common tasks Create automated tests for RESTful web services Debug, test, and profile RESTful web services with Django and the Django REST Framework Who this book is for This book is for Python developers who want to create RESTful web services with Django; you need to have a basic working knowledge of Django but no previous experience with RESTful web services is required.","language":"en","currency":"USD","id":"1788835573","title":"Django RESTful Web Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xNRJDwAAQBAJ&source=gbs_api","authors":["Gaston C. Hillar"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FhlKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Efficiently secure critical infrastructure systems","description":"Your one-step guide to understanding industrial cyber security, its control systems, and its operations. About This Book Learn about endpoint protection such as anti-malware implementation, updating, monitoring, and sanitizing user workloads and mobile devices Filled with practical examples to help you secure critical infrastructure systems efficiently A step-by-step guide that will teach you the techniques and methodologies of building robust infrastructure systems Who This Book Is For If you are a security professional and want to ensure a robust environment for critical infrastructure systems, this book is for you. IT professionals interested in getting into the cyber security domain or who are looking at gaining industrial cyber security certifications will also find this book useful. What You Will Learn Understand industrial cybersecurity, its control systems and operations Design security-oriented architectures, network segmentation, and security support services Configure event monitoring systems, anti-malware applications, and endpoint security Gain knowledge of ICS risks, threat detection, and access management Learn about patch management and life cycle management Secure your industrial control systems from design through retirement In Detail With industries expanding, cyber attacks have increased significantly. Understanding your control system's vulnerabilities and learning techniques to defend critical infrastructure systems from cyber threats is increasingly important. With the help of real-world use cases, this book will teach you the methodologies and security measures necessary to protect critical infrastructure systems and will get you up to speed with identifying unique challenges.Industrial cybersecurity begins by introducing Industrial Control System (ICS) technology, including ICS architectures, communication media, and protocols. This is followed by a presentation on ICS (in) security. After presenting an ICS-related attack scenario, securing of the ICS is discussed, including topics such as network segmentation, defense-in-depth strategies, and protective solutions. Along with practical examples for protecting industrial control systems, this book details security assessments, risk management, and security program development. It also covers essential cybersecurity aspects, such as threat detection and access management. Topics related to endpoint hardening such as monitoring, updating, and anti-malware implementations are also discussed. Style and approach A step-by-step guide to implement Industrial Cyber Security effectively.","language":"en","currency":"USD","id":"1788395980","title":"Industrial Cybersecurity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FhlKDwAAQBAJ&source=gbs_api","authors":["Pascal Ackerman"]},{"pageCount":834,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.19,"subtitle":null,"description":"Explore and master modern JavaScript techniques with ES2015 in order to build large-scale web applications About This Book This course offers an expert's eye on the latest ES6 features and how these advanced tasks fit together in JavaScript as a whole Discover robust JavaScript implementations of classic and advanced design patterns Learn about modern web architectures and build real-world apps on top of them Who This Book Is For This course is for experienced developers familiar with other object-oriented languages who wants to learn new capabilities of ES-2015 to improve their web development skills and build professional-quality web applications. This also goes for those who want to explore some modern JavaScript features, techniques, and architectures in order to develop cutting-edge web applications. What You Will Learn Get a run through of the basic language constructs, Functions, and Closures of JavaScript Code using the powerful object-oriented feature in JavaScript Master DOM manipulation, cross-browser strategies, and ES6 Harness the power of patterns for tasks ranging from application building to code testing Identify the best use cases for microservices Gain expertise in responsive and dynamic website design Enable real-time communications between client-client and client-server\/server-client Write complete applications using functional reactive programming In Detail JavaScript is a high-level, dynamic, untyped, lightweight, and interpreted programming language. Mastering modern JavaScript techniques and the toolchain are essential to develop web-scale applications. This Learning Path will upgrade your skills to ES2015, and you will get to introduce yourself to popular frameworks like React and Angular 2. In the first module, you will get familiar with the language constructs and how to make code easy to organize. You will gain a concrete understanding of variable scoping, loops, and best practices on using types and data structures, as well as the coding style and recommended code organization patterns in JavaScript. By the end of the module, you will understand how reactive JavaScript is going to be the new paradigm. Over the course of the next module, you will explore how design patterns can help you improve and organize your JavaScript code. You'll get to grips with creational, structural, and behavioral patterns and get a deeper look at patterns used in functional programming, as well as model view patterns and patterns to build web applications. By the end of the module, you'll be saved of a lot of trial and error and developmental headaches, and you will be on the road to becoming a JavaScript expert. In the last leg of this course, you will shift your focus to network programming concepts as you build a real-time web application with websockets. Along the way, you'll explore how the power of JavaScript can be increased multi-fold with high performance techniques. By the end of this module, you'll be a skilled JavaScript developer with a solid knowledge of the latest JavaScript techniques, tools, and architecture to build modern web apps. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Mastering JavaScript by Ved Antani Mastering JavaScript Design Patterns, Second Edition by Simon Timms Modern JavaScript Applications by Narayan Prusty Style and approach This course is a comprehensive guide with a clear focus on practical use cases and patterns. Each chapter consists of best practices, useful advice, and a bunch of easy-to-follow examples that will build up your skills as you advance.","language":"en","currency":"USD","id":"1787124282","title":"JavaScript : Moving to ES2015","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fLkrDwAAQBAJ&source=gbs_api","authors":["Ved Antani","Simon Timms","Narayan Prusty"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Usv_CFfY4U0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"A practical book with plenty of screenshots to guide you through the many features of multilingual Drupal. A demo ecommerce site is provided if you want to practice on a sample site, although you can apply the techniques learnt in the book directly to your site too. Any Drupal users who know the basics of building a Drupal site and are familiar with the Drupal UI, will benefit from this book. No previous knowledge of localization or internationalization is required.","language":"en","currency":"USD","id":"184951819X","title":"Drupal 7 Multilingual Sites","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Usv_CFfY4U0C&source=gbs_api","authors":["Kristen Pol"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y1qWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A guide to developing efficient and elegant T-SQL code","description":"Troubleshoot query performance issues, identify anti-patterns in code, and write efficient T-SQL queries Key Features Discover T-SQL functionalities and services that help you interact with relational databases Understand the roles, tasks and responsibilities of a T-SQL developer Explore solutions for carrying out database querying tasks, database administration, and troubleshooting Book Description Transact-SQL (T-SQL) is Microsoft's proprietary extension to the SQL language that is used with Microsoft SQL Server and Azure SQL Database. This book will be a useful guide to learning the art of writing efficient T-SQL code in modern SQL Server versions, as well as the Azure SQL Database. The book will get you started with query processing fundamentals to help you write powerful, performant T-SQL queries. You will then focus on query execution plans and learn how to leverage them for troubleshooting. In the later chapters, you will learn how to identify various T-SQL patterns and anti-patterns. This will help you analyze execution plans to gain insights into current performance, and determine whether or not a query is scalable. You will also learn to build diagnostic queries using dynamic management views (DMVs) and dynamic management functions (DMFs) to address various challenges in T-SQL execution. Next, you will study how to leverage the built-in tools of SQL Server to shorten the time taken to address query performance and scalability issues. In the concluding chapters, the book will guide you through implementing various features, such as Extended Events, Query Store, and Query Tuning Assistant using hands-on examples. By the end of this book, you will have the skills to determine query performance bottlenecks, avoid pitfalls, and discover the anti-patterns in use. Foreword by Conor Cunningham, Partner Architect – SQL Server and Azure SQL – Microsoft What you will learn Use Query Store to understand and easily change query performance Recognize and eliminate bottlenecks that lead to slow performance Deploy quick fixes and long-term solutions to improve query performance Implement best practices to minimize performance risk using T-SQL Achieve optimal performance by ensuring careful query and index design Use the latest performance optimization features in SQL Server 2017 and SQL Server 2019 Protect query performance during upgrades to newer versions of SQL Server Who this book is for This book is for database administrators, database developers, data analysts, data scientists, and T-SQL practitioners who want to get started with writing T-SQL code and troubleshooting query performance issues, through the help of practical examples. Previous knowledge of T-SQL querying is not required to get started on this book.","language":"en","currency":"USD","id":"178934297X","title":"Learn T-SQL Querying","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y1qWDwAAQBAJ&source=gbs_api","authors":["Pedro Lopes","Pam Lahoud"]},{"pageCount":217,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Rb5sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"7th IFIP WG 2.14 European Conference, ESOCC 2018, Como, Italy, September 12-14, 2018, Proceedings","description":"This book constitutes the refereed proceedings of the 7th IFIP WG 2.14 European Conference on Service-Oriented and Cloud Computing, ESOCC 2018, held in Como, Italy, in September 2018. The 10 full and 5 short papers presented in this volume were carefully reviewed and selected from 32 submissions. The volume also contains one invited talk in full paper length. The main event mapped to the main research track which focused on the presentation of cutting-edge research in both the service-oriented and cloud computing areas. In conjunction, an industrial track was also held attempting to bring together academia and industry through showcasing the application of service-oriented and cloud computing research, especially in the form of case studies, in the industry.","language":"en","currency":"USD","id":"3319998196","title":"Service-Oriented and Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Rb5sDwAAQBAJ&source=gbs_api","authors":["Kyriakos Kritikos","Pierluigi Plebani","Flavio de Paoli"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PshsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A guide to creating smart, efficient, and reusable software, 2nd Edition","description":"Exploit various design patterns to master the art of solving problems using Python Key Features Master the application design using the core design patterns and latest features of Python 3.7 Learn tricks to solve common design and architectural challenges Choose the right plan to improve your programs and increase their productivity Book Description Python is an object-oriented scripting language that is used in a wide range of categories. In software engineering, a design pattern is an elected solution for solving software design problems. Although they have been around for a while, design patterns remain one of the top topics in software engineering, and are a ready source for software developers to solve the problems they face on a regular basis. This book takes you through a variety of design patterns and explains them with real-world examples. You will get to grips with low-level details and concepts that show you how to write Python code, without focusing on common solutions as enabled in Java and C++. You'll also fnd sections on corrections, best practices, system architecture, and its designing aspects. This book will help you learn the core concepts of design patterns and the way they can be used to resolve software design problems. You'll focus on most of the Gang of Four (GoF) design patterns, which are used to solve everyday problems, and take your skills to the next level with reactive and functional patterns that help you build resilient, scalable, and robust applications. By the end of the book, you'll be able to effciently address commonly faced problems and develop applications, and also be comfortable working on scalable and maintainable projects of any size. What you will learn Explore Factory Method and Abstract Factory for object creation Clone objects using the Prototype pattern Make incompatible interfaces compatible using the Adapter pattern Secure an interface using the Proxy pattern Choose an algorithm dynamically using the Strategy pattern Keep the logic decoupled from the UI using the MVC pattern Leverage the Observer pattern to understand reactive programming Explore patterns for cloud-native, microservices, and serverless architectures Who this book is for This book is for intermediate Python developers. Prior knowledge of design patterns is not required to enjoy this book.","language":"en","currency":"USD","id":"178883206X","title":"Mastering Python Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PshsDwAAQBAJ&source=gbs_api","authors":["Kamon Ayeva","Sakis Kasampalis"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Kv5vDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Write reliable code to create powerful applications by mastering advanced JavaScript design patterns About This Book Learn how to use tried and true software design methodologies to enhance your JavaScript code Discover robust JavaScript implementations of classic and advanced design patterns Packed with easy-to-follow examples that can be used to create reusable code and extensible designs Who This Book Is For This book is ideal for JavaScript developers who want to gain expertise in object-oriented programming with JavaScript and the new capabilities of ES-2015 to improve their web development skills and build professional-quality web applications. What You Will Learn Harness the power of patterns for tasks ranging from application building to code testing Rethink and revitalize your code with the use of functional patterns Improve the way you organize your code Build large-scale apps seamlessly with the help of reactive patterns Identify the best use cases for microservices Get to grips with creational, behavioral, and structural design patterns Explore advanced design patterns including dependency injection In Detail With the recent release of ES-2015, there are several new object-oriented features and functions introduced in JavaScript. These new features enhance the capabilities of JavaScript to utilize design patterns and software design methodologies to write powerful code. Through this book, you will explore how design patterns can help you improve and organize your JavaScript code. You'll get to grips with creational, structural and behavioral patterns as you discover how to put them to work in different scenarios. Then, you'll get a deeper look at patterns used in functional programming, as well as model view patterns and patterns to build web applications. This updated edition will also delve into reactive design patterns and microservices as they are a growing phenomenon in the world of web development. You will also find patterns to improve the testability of your code using mock objects, mocking frameworks, and monkey patching. We'll also show you some advanced patterns including dependency injection and live post processing. By the end of the book, you'll be saved of a lot of trial and error and developmental headaches, and you will be on the road to becoming a JavaScript expert. Style and approach Packed with several real-world use cases, this book shows you through step-by-step instructions how to implement the advanced object-oriented programming features to build sophisticated web applications that promote scalability and reusability.","language":"en","currency":"USD","id":"1785880357","title":"Mastering JavaScript Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Kv5vDQAAQBAJ&source=gbs_api","authors":["Simon Timms"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xRcaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Everything you need to succeed on the Google Cloud Certified Professional Cloud Architect exam in one accessible study guide Take the challenging Google Cloud Certified Professional Cloud Architect exam with confidence using the comprehensive information contained in this invaluable self-study guide. The book provides a thorough overview of cloud architecture and Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Professional Cloud Architect All-In-One Exam Guideis based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and in-depth explanations. You will discover how to design, develop, and manage robust, secure, scalable, and highly available solutions to drive business objectives. Offers 100% coverage of every objective for the Google Cloud Certified Professional Cloud Architect exam Online content includes 100 additional practice questions in the TotalTester customizable exam engine Written by a Google Cloud Certified Professional Cloud Architect","language":"en","currency":"USD","id":"1264257287","title":"Google Cloud Certified Professional Cloud Architect All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xRcaEAAAQBAJ&source=gbs_api","authors":["Iman Ghanizada"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3igKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This effective self-study system delivers complete coverage of every topic on the AWS Certified Developer Associate Exam Take the challenging AWS Certified Developer Associate Exam with confidence using the comprehensive information contained in this effective test preparation guide. Written by an Amazon Web Services certified expert and experienced trainer, AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01) covers every subject on the exam and clearly explains how to create, deploy, migrate, monitor, and debug cloud-native applications. Designed to help you pass the exam with ease, this guide also serves as an ideal on-the-job reference. Covers all topics on the exam, including: Getting started with AWS Journey AWS high availability and fault tolerance Working with cloud storage Authentication and authorization Creating SQL and NoSQL databases in AWS Cloud AWS application integration and management Developing cloud-native applications in AWS Building, deploying, and debugging cloud applications Electronic content includes: 130 practice questions Test engine containing full-length practice exams and customizable quizzes","language":"en","currency":"USD","id":"1260460185","title":"AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3igKEAAAQBAJ&source=gbs_api","authors":["Kamesh Ganesan"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O3WBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":"Build, test, and deploy cloud-native applications in the cloud-native way","description":"This course teaches concepts by deep-dive on-hand exercises. Throughout the course, you will learn the required toolset by using both on-premise, open-source, and hosted cloud solutions. You’ll find checklists, best practices, and critical points mentioned throughout the lessons, making things more interesting. Key Features Explains in detail cloud-native continuous integration and delivery Demonstrates how to run a build in a CI\/CD system Shows continuous delivery to Docker Registry and continuous deployment to Kubernetes Book Description Cloud-native software development is based on developing distributed applications focusing on speed, stability, and high availability. With this paradigm shift, software development has changed substantially and converted into a more agile environment where distributed teams develop distributed applications. In addition, the environment where the software is built, tested and deployed has changed from bare-metal servers to cloud systems. In this course, the new concepts of cloud-native Continuous Integration and Delivery are discussed in depth. Cloud-native tooling and services such as cloud providers (AWS, Google Cloud) containerization with Docker, container-orchestrators such as Kubernetes will be a part of this course to teach how to analyze and design modern software delivery pipelines. What you will learn Learn the basics of DevOps patterns for cloud-native architecture Learn the cloud-native way of designing CI\/CD systems Create multi-stage builds and tests for Docker. Apply the best practices for Docker container images Experiment using GitLab CI\/CD pipelines for continuous integration Build and test their applications on cloud Learn how to continuously deliver to Docker registry Learn how to continuously deploy to Kubernetes Experiment using GitLab CI\/CD pipelines for Continuous Delivery Configure and deploy software to Kubernetes using Helm Who this book is for This book is ideal for professionals interested in cloud-native software development. To benefit the most from this book, you must be familiar with developing, building, testing, integrating, and deploying containerized microservices into cloud systems.","language":"en","currency":"USD","id":"1789800021","title":"Cloud-Native Continuous Integration and Delivery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O3WBDwAAQBAJ&source=gbs_api","authors":["Onur Yilmaz"]},{"pageCount":217,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X3syDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"11th European Conference, ECSA 2017, Canterbury, UK, September 11-15, 2017, Proceedings","description":"This book constitutes the proceedings of the 11th European Conference on Software Architecture, ECSA 2017, held in Canterbury, UK, in September 2017. The 9 full papers presented together with 12 short papers and one keynote talk were carefully reviewed and selected from 54 submissions. They are organized in topical sections on Software Architecture Analysis and Verification; Software Architecture Evolution; Automatic Generation; Architectural Decisions; Software Architecture Practice.​","language":"en","currency":"USD","id":"331965831X","title":"Software Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X3syDwAAQBAJ&source=gbs_api","authors":["Antónia Lopes","Rogério de Lemos"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHg5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Become a developer superhero and build stunning cross-platform apps with Delphi About This Book A one-stop guide on Delphi to help you build cross-platform apps This book covers important concepts such as the FireMonkey library, shows you how to interact with the Internet of Things, and enables you to integrate with Cloud services The code is explained in detail with observations on how to create native apps for Ios and Android with a single code base Who This Book Is For If you want to create stunning applications for mobile, desktop, the cloud, and the Internet of Things, then this book is for you. This book is for developers who would like to build native cross-platform apps with a single codebase for iOS and Android. A basic knowledge of Delphi is assumed, although we do cover a primer on the language. What You Will Learn Understand the basics of Delphi and the FireMonkey application platform as well as the specifics of Android and iOS platforms Complete complex apps quickly with access to platform features and APIs using a single, easy-to-maintain code base Work with local data sources, including embedded SQL databases, REST servers, and Backend-as-a-Service providers Take full advantage of mobile hardware capabilities by working with sensors and Internet of Things gadgets and devices Integrate with cloud services and data using REST APIs and scalable multi-tier frameworks for outstanding multi-user and social experience Architect and deploy powerful mobile back-end services and get super-productive by leveraging Delphi IDE agile functionality Get to know the best practices for writing a high-quality, reliable, and maintainable codebase in the Delphi Object Pascal language In Detail Delphi is the most powerful Object Pascal IDE and component library for cross-platform native app development. It enables building natively compiled, blazingly fast apps for all major platforms including Android, iOS, Windows, Mac, and Linux. If you want to build server-side applications, create web services, and have clear GUIs for your project, then this book is for you. The book begins with a basic primer on Delphi helping you get accustomed to the IDE and the Object Pascal language and will then quickly move on to advanced-level concepts. Through this book, we'll help you understand the architecture of applications and will teach you the important concepts of the FireMonkey library, show you how to build server-side services, and enable you to interact with the Internet of Things. Towards the end, you will learn to integrate your app with various web services and deploy them. By the end of the book, you will be able to build powerful, cross-platform, native apps for iOS and Android with a single code base. Style and approach This book will help you build cross-platform mobile apps with Delphi using a step-by-step approach.","language":"en","currency":"USD","id":"1786465841","title":"Expert Delphi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHg5DwAAQBAJ&source=gbs_api","authors":["Pawel Glowacki"]},{"pageCount":136,"thumbnail":"http:\/\/books.google.com\/books\/content?id=st3JDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build frontend-to-backend web applications using the best practices of a powerful, fast, and easy-to-deploy server language About This Book Build a fully-featured REST API to enable client-side single page apps Utilize TLS to build reliable and secure sites A quick guide that provides everything a developer needs to know to build end-to-end web applications in Go Who This Book Is For This book is intended for experienced programmers with minimal-to-moderate exposure to the Go language. If you have some fundamentals down, but are looking for more detail when it comes to using Go for the web, this is the book for you. What You Will Learn Create a listening web server Route requests Implement SSL\/TLS Use Go's logic-less templates Implement caching for maximum performance Use sessions and cookies Utilize security best practices to keep users and data safe Connect to data sources Create a RESTful API In Detail Go is an open source programming language that makes it easy to build simple, reliable, and efficient software. It is a statically typed language with syntax loosely derived from that of C, adding garbage collection, type safety, some dynamic-typing capabilities, additional built-in types such as variable-length arrays and key-value maps, and a large standard library. Learning Go Web Development is a start-to-finish walkthrough of the topics most critical to anyone building a new web application. Whether it's keeping your application secure, connecting to your database, enabling token-based authentication, or utilizing logic-less templates, this book has you covered. You'll begin by learning about routing requests and implementing SSL. Moving on, you'll get to know about practices to keep users' data safe. By the end of the book, you will be able to build robust, secure, and fully-featured applications for the web. Style and approach This concise book demonstrates by doing. You'll build a component every step of the way and in the end, will have a blogging platform that can be used for personal experimentation and augmented to be used in production.","language":"en","currency":"USD","id":"1785289047","title":"Learning Go Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=st3JDAAAQBAJ&source=gbs_api","authors":["Nathan Kozyra"]}]