[{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4QKACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Build an interactive and full-featured web application from scratch using Node.js and MongoDB About This Book Configure your development environment to use Node.js and MongoDB Use Node.js to connect to a MongoDB database and perform data manipulations A practical guide with clear instructions to design and develop a complete web application from start to finish Who This Book Is For This book is designed for JavaScript developers of any skill level that want to get up and running using Node.js and MongoDB to build full-featured web applications. A basic understanding of JavaScript and HTML is the only requirement for this book. What You Will Learn Configure your development environment to use Node.js and MongoDB Write and configure a web server using Node.js powered by the Express.js framework Build dynamic HTML pages using the Handlebars template engine Persist application data using MongoDB and Mongoose ODM Test your code using automated testing tools such as the Mocha framework Deploy the development environment to the cloud using services such as Heroku, Amazon Web Services, and Microsoft Azure Explore Single-Page application frameworks to take your web applications to the next level In Detail Node.js and MongoDB are quickly becoming one of the most popular tech stacks for the web. Powered by Google's V8 engine, Node.js caters to easily building fast, scalable network applications while MongoDB is the perfect fit as a scalable, high-performance, open source NoSQL database solution. Using these two technologies together, web applications can be built quickly and easily and deployed to the cloud with very little difficulty. The book will begin by introducing you to the groundwork needed to set up the development environment. Here, you will quickly run through the steps necessary to get the main application server up and running. Then you will see how to use Node.js to connect to a MongoDB database and perform data manipulations. From here on, the book will take you through integration with third-party tools for interaction with web apps. It then moves on to show you how to use controllers and view models to generate reusable code that will reduce development time. Toward the end of the book, we will cover tests to properly execute the code and some popular frameworks for developing web applications. By the end of the book, you will have a running web application developed with MongoDB and Node.js along with it's popular frameworks. Style and approach An easy guide to Node.js and MongoDB, which will quickly introduce you to the relevant concepts by taking you through the different steps involved in building a full-fledged web application.","language":"en","currency":"USD","id":"1785287451","title":"Web Development with MongoDB and NodeJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4QKACwAAQBAJ&source=gbs_api","authors":["Mithun Satheesh","Bruno Joseph D'mello","Jason Krol"]},{"pageCount":66,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fp6NtavDp-EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Sharding, Cluster Setup, and Administration","description":"Create a MongoDB cluster that will grow to meet the needs of your application. With this short and concise book, you'll get guidelines for setting up and using clusters to store a large volume of data, and learn how to access the data efficiently. In the process, you'll understand how to make your application work with a distributed database system. Scaling MongoDB will help you: Set up a MongoDB cluster through sharding Work with a cluster to query and update data Operate, monitor, and backup your cluster Plan your application to deal with outages By following the advice in this book, you'll be well on your way to building and running an efficient, predictable distributed system using MongoDB.","language":"en","currency":"USD","id":"9781449303877","title":"Scaling MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fp6NtavDp-EC&source=gbs_api","authors":["Kristina Chodorow"]},{"pageCount":249,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7iI3CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Architecting, Developing, and Administering MongoDB","description":"The \"one-size-fits-all\" thinking regarding traditional RDBMSs has been challenged in the last few years by the emergence of diversified NoSQL databases. More than 120 NoSQL databases are now available in the market, and the market leader by far is MongoDB. With so many companies opting for MongoDB as their NoSQL database of choice, there's a need for a practical how-to combined with expert advice for getting the most out of the software. Beginning with a short introduction to the basics of NoSQL databases, MongoDB experts Navin Sabharwal and Shankatala Gupta Edward introduce readers to MongoDB – the leading document based NoSQL database, acquainting them step by step with all aspects of MongoDB. They cover the data model, underlying architecture, how to code using Mongo Shell, and administration of the MongoDB platform, among other topics. The book also provides clear guidelines and practical examples for architecting and developing applications using the MongoDB platform and deploying them. Database developers, architects, and database administrators will find useful information covering all aspects of the MongoDB platform and how to put it to use practically. Practical Guide to MongoDB provides readers with: A solid understanding of NoSQL databases An understanding of how to get started with MongoDB Methodical coverage of the architecture, development, and administration of MongoDB A plethora of \"How to’s\" enabling you to use the technology most efficiently to solve the problems you face Practical MongoDB is for those just starting to learning to work with NoSQL databases in general and MongoDB in particular. Skills in these areas are in demand, making this book essential reading for those who want to work more productively or break into big data work. It will prove equally useful for entrepreneurs and others who like to work with new tech nologies.","language":"en","currency":"USD","id":"1484206479","title":"Practical MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7iI3CwAAQBAJ&source=gbs_api","authors":["Shakuntala Gupta Edward","Navin Sabharwal"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hcy4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"This book really does cover just the MongoDB, simply in depth so it also wont take you very far. Throughout each chapter you will learn tons of new techniques for using MongoDB objects and the basic CRUD techniques for DB connections. Later chapters even offer source code from multiple languages like Java, Python, and PHP. This lets you see how applications can scale using Mongo regardless of the backend language. You can learn sharding and replication for scaling databases. This book is very compact with less than 100 pages. But its also incredibly detailed and wastes no time diving right into the action and ease of use.. ● What's inside ■ NoSQL, Architecture of MongoDB ■ Standard DB operations, Indexes, queries ■ Map-reduce for custom aggregations and reporting ■ Java, Python and PHP Connectivity ■ Schema design patterns ■ Deploying for scale and high availability","language":"en","currency":"USD","id":"0359975119","title":"Mongodb Simply In Depth","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hcy4DwAAQBAJ&source=gbs_api","authors":["Ajit Singh","Sultan Ahmad"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ra1PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Pro MongoDB Development is about MongoDB, a NoSQL database based on the BSON (binary JSON) document model. The book discusses all aspects of using MongoDB in web applications: Java, PHP, Ruby, JavaScript are the most commonly used programming\/scripting languages and the book discusses accessing MongoDB database with these languages. The book also discusses using Java EE frameworks Kundera and Spring Data with MongoDB. As NoSQL databases are commonly used with the Hadoop ecosystem the book also discusses using MongoDB with Apache Hive. Migration from other NoSQL databases (Apache Cassandra and Couchbase) and from relational databases (Oracle Database) is also discussed. What You'll Learn: How to use a Java client and MongoDB shell How to use MongoDB with PHP, Ruby, and Node.js as well How to migrate Apache Cassandra tables to MongoDB documents; Couchbase to MongoDB; and transferring data between Oracle and MongoDB How to use Kundera, Spring Data, and Spring XD with MongoDB How to load MongoDB data into Oracle Database and integrating MongoDB with Oracle Database in Oracle Data Integrator Audience: The target audience of the book is NoSQL database developers. Target audience includes Java, PHP and Ruby developers. The book is suitable for an intermediate level course in NoSQL database.","language":"en","currency":"USD","id":"1484215982","title":"Pro MongoDB Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ra1PCwAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":610,"thumbnail":"http:\/\/books.google.com\/books\/content?id=99_8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"A guide to understanding MongoDB development and administration for NoSQL developers","description":"This book covers the latest release of MongoDB. You'll learn how to master various tasks related to the development and administration of a MongoDB database, along with best practices to optimize the workflow. The book also covers multiple financial and practical use cases that will enable you to use MongoDB for commercial data storage.","language":"en","currency":"USD","id":"1789614791","title":"Learn MongoDB 4.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=99_8DwAAQBAJ&source=gbs_api","authors":["Doug Bierer"]},{"pageCount":146,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hTjoAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"This is an easy-to-follow guide on the key integration points between Pentaho and MongoDB. This book employs a practical approach designed to have Pentaho configured to talk to MongoDB early on so that you see rapid results. This book is intended for business analysts, data architects, and developers new to either Pentaho or MongoDB who want to be able to deliver a complete solution for storing, processing, and visualizing data. It’s assumed that you will already have experience defining data requirements needed to support business processes and exposure to database modeling, SQL query, and reporting techniques.","language":"en","currency":"USD","id":"1782168362","title":"Pentaho Analytics for MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hTjoAgAAQBAJ&source=gbs_api","authors":["Bo Borland"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8JYQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A complete guide to dealing with Big Data using MongoDB","description":"The Definitive Guide to MongoDB, Second Edition, is updated for the latest version and includes all of the latest MongoDB features, including the aggregation framework introduced in version 2.2 and hashed indexes in version 2.4. MongoDB is the most popular of the \"Big Data\" NoSQL database technologies, and it's still growing. David Hows from 10gen, along with experienced MongoDB authors Peter Membrey and Eelco Plugge, provide their expertise and experience in teaching you everything you need to know to become a MongoDB pro.","language":"en","currency":"USD","id":"1430258225","title":"The Definitive Guide to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8JYQAwAAQBAJ&source=gbs_api","authors":["David Hows","Eelco Plugge","Peter Membrey","Tim Hawkins"]},{"pageCount":70,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Clv0uTLZDzIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Patterns and processes for the popular document-oriented database","description":"Learn how to leverage MongoDB with your Python applications, using the hands-on recipes in this book. You get complete code samples for tasks such as making fast geo queries for location-based apps, efficiently indexing your user documents for social-graph lookups, and many other scenarios. This guide explains the basics of the document-oriented database and shows you how to set up a Python environment with it. Learn how to read and write to MongoDB, apply idiomatic MongoDB and Python patterns, and use the database with several popular Python web frameworks. You’ll discover how to model your data, write effective queries, and avoid concurrency problems such as race conditions and deadlocks. The recipes will help you: Read, write, count, and sort documents in a MongoDB collection Learn how to use the rich MongoDB query language Maintain data integrity in replicated\/distributed MongoDB environments Use embedding to efficiently model your data without joins Code defensively to avoid keyerrors and other bugs Apply atomic operations to update game scores, billing systems, and more with the fast accounting pattern Use MongoDB with the Pylons 1.x, Django, and Pyramid web frameworks","language":"en","currency":"USD","id":"144931709X","title":"MongoDB and Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Clv0uTLZDzIC&source=gbs_api","authors":["Niall O'Higgins"]},{"pageCount":80,"thumbnail":"http:\/\/books.google.com\/books\/content?id=04l7eomuKLgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Document-Oriented Data for Web Developers","description":"What would happen if you optimized a data store for the operations application developers actually use? You’d arrive at MongoDB, the reliable document-oriented database. With this concise guide, you’ll learn how to build elegant database applications with MongoDB and PHP. Written by the Chief Solutions Architect at 10gen—the company that develops and supports this open source database—this book takes you through MongoDB basics such as queries, read-write operations, and administration, and then dives into MapReduce, sharding, and other advanced topics. Get out of the relational database rut, and take advantage of a high-performing system optimized for operations and scale. Learn step-by-step the tools you need to build PHP applications with MongoDB Perform Create, Read, Update, and Delete (CRUD) operations, and learn how to perform queries to retrieve data Administer your database, and access and manipulate data with the MongoDB Shell Use functions to work with sets, arrays, and multiple documents to perform synchronous, asynchronous, and atomic operations Discover PHP’s community tools and libraries, and why they’re valuable Work with regular expressions, aggregation, MapReduce, replication, and sharding","language":"en","currency":"USD","id":"1449324843","title":"MongoDB and PHP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=04l7eomuKLgC&source=gbs_api","authors":["Steve Francia"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wUuBgNMG0F0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Create dynamic web applications by combining the power of Ruby and MongoDB with this book and ebook.","language":"en","currency":"USD","id":"1849515034","title":"Ruby and MongoDB Web Development Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wUuBgNMG0F0C&source=gbs_api","authors":["Gautam Rege"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4ogx82US4fwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"The NoSQL Database for Cloud and Desktop Computing","description":"MongoDB, a cross-platform NoSQL database, is the fastest-growing new database in the world. MongoDB provides a rich document-oriented structure with dynamic queries that you’ll recognize from RDBMS offerings such as MySQL. In other words, this is a book about a NoSQL database that does not require the SQL crowd to re-learn how the database world works! MongoDB has reached 1.0 and boasts 50,000+ users. The community is strong and vibrant and MongoDB is improving at a fast rate. With scalable and fast databases becoming critical for today’s applications, this book shows you how to install, administer and program MongoDB without pretending SQL never existed.","language":"en","currency":"USD","id":"1430230525","title":"The Definitive Guide to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4ogx82US4fwC&source=gbs_api","authors":["Peter Membrey","Eelco Plugge","DUPTim Hawkins"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6k0Z0mD48QwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Hibernate and MongoDB are a powerful combination of open source persistence and NoSQL technologies for today's Java-based enterprise and cloud application developers. Hibernate is the leading open source Java-based persistence, object relational management engine, recently repositioned as an object grid management engine. MongoDB is a growing, popular open source NoSQL framework, especially popular among cloud application and big data developers. With these two, enterprise and cloud developers have a \"complete out of the box\" solution. Pro Hibernate and MongoDB shows you how to use and integrate Hibernate and MongoDB. More specifically, this book guides you through the bootstrap; building transactions; handling queries and query entities; and mappings. Then, this book explores the principles and techniques for taking these application principles to the cloud, using the OpenShift Platform as a Service (PaaS) and more. In this book, you get two case studies: An enterprise application using Hibernate and MongoDB. then, A cloud application (OpenShip) migrated from the enterprise application case study After reading or using this book, you come away with the experience from two case studies that give you possible frameworks or templates that you can apply to your own specific application or cloud application building context.","language":"en","currency":"USD","id":"1430257954","title":"Pro Hibernate and MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6k0Z0mD48QwC&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l8OiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you want a reference to show you practical solutions, or just want to satisfy your need for more knowledge of this fantastic NoSQL database, then this book is ideal for you. To get the most out of this book, you should know the basics of MongoDB.","language":"en","currency":"USD","id":"1782161953","title":"MongoDB Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l8OiBQAAQBAJ&source=gbs_api","authors":["Amol Nayak"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=V0EUBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book has a perfect balance of concepts and their practical implementation along with solutions to make a highly available MongoDB server with clear instructions and guidance. If you are using MongoDB in a production environment and need a solution to make a highly available MongoDB server, this book is ideal for you. Familiarity with MongoDB is expected so that you understand the content of this book.","language":"en","currency":"USD","id":"1783986735","title":"MongoDB High Availability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=V0EUBAAAQBAJ&source=gbs_api","authors":["Afshin Mehrabani"]},{"pageCount":72,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W45TiomnyPMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. MongoDB Starter is a fast and practical guide designed to help you start developing high-performance and scalable applications using MongoDB.MongoDB Starter is ideal for developers who are new to MongoDB and who need a no-nonsense guide on how to start working with it. No knowledge of MongoDB is required to follow this book, but some knowledge of C++ would be helpful.","language":"en","currency":"USD","id":"1782169717","title":"Instant MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W45TiomnyPMC&source=gbs_api","authors":["Amol Nayak"]},{"pageCount":514,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vq_CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Powerful and Scalable Data Storage","description":"Manage your data with a system designed to support modern application development. Updated for MongoDB 4.2, the third edition of this authoritative and accessible guide shows you the advantages of using document-oriented databases. You’ll learn how this secure, high-performance system enables flexible data models, high availability, and horizontal scalability. Authors Shannon Bradshaw, Eoin Brazil, and Kristina Chodorow provide guidance for database developers, advanced configuration for system administrators, and use cases for a variety of projects. NoSQL newcomers and experienced MongoDB users will find updates on querying, indexing, aggregation, transactions, replica sets, ops management, sharding and data administration, durability, monitoring, and security. In six parts, this book shows you how to: Work with MongoDB, perform write operations, find documents, and create complex queries Index collections, aggregate data, and use transactions for your application Configure a local replica set and learn how replication interacts with your application Set up cluster components and choose a shard key for a variety of applications Explore aspects of application administration and configure authentication and authorization Use stats when monitoring, back up and restore deployments, and use system settings when deploying MongoDB","language":"en","currency":"USD","id":"1491954418","title":"MongoDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vq_CDwAAQBAJ&source=gbs_api","authors":["Shannon Bradshaw","Eoin Brazil","Kristina Chodorow"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ethXBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"NoSQL database usage is growing at a stunning 50% per year, as organizations discover NoSQL's potential to address even the most challenging Big Data and real-time database problems. Every NoSQL database is different, but one is the most popular by far: MongoDB. Now, in just 24 lessons of one hour or less, you can learn how to leverage MongoDB's immense power. Each short, easy lesson builds on all that's come before, teaching NoSQL concepts and MongoDB techniques from the ground up. Sams Teach Yourself NoSQL with MongoDB in 24 Hours covers all this, and much more: Learning how NoSQL is different, when to use it, and when to use traditional RDBMSes instead Designing and implementing MongoDB databases of diverse types and sizes Storing and interacting with data via Java, PHP, Python, and Node.js\/Mongoose Choosing the right NoSQL distribution model for your application Installing and configuring MongoDB Designing MongoDB data models, including collections, indexes, and GridFS Balancing consistency, performance, and durability Leveraging the immense power of Map-Reduce Administering, monitoring, securing, backing up, and repairing MongoDB databases Mastering advanced techniques such as sharding and replication Optimizing performance","language":"en","currency":"USD","id":"0133844412","title":"NoSQL with MongoDB in 24 Hours, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ethXBAAAQBAJ&source=gbs_api","authors":["Brad Dayley"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FI3XBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Building Well-Designed and Supportable MongoDB Databases","description":"Congratulations! You completed the MongoDB application within the given tight timeframe and there is a party to celebrate your application’s release into production. Although people are congratulating you at the celebration, you are feeling some uneasiness inside. To complete the project on time required making a lot of assumptions about the data, such as what terms meant and how calculations are derived. In addition, the poor documentation about the application will be of limited use to the support team, and not investigating all of the inherent rules in the data may eventually lead to poorly-performing structures in the not-so-distant future. Now, what if you had a time machine and could go back and read this book. You would learn that even NoSQL databases like MongoDB require some level of data modeling. Data modeling is the process of learning about the data, and regardless of technology, this process must be performed for a successful application. You would learn the value of conceptual, logical, and physical data modeling and how each stage increases our knowledge of the data and reduces assumptions and poor design decisions. Read this book to learn how to do data modeling for MongoDB applications, and accomplish these five objectives: Understand how data modeling contributes to the process of learning about the data, and is, therefore, a required technique, even when the resulting database is not relational. That is, NoSQL does not mean NoDataModeling! Know how NoSQL databases differ from traditional relational databases, and where MongoDB fits. Explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts, and learn the basics of adding, querying, updating, and deleting data in MongoDB. Practice a streamlined, template-driven approach to performing conceptual, logical, and physical data modeling. Recognize that data modeling does not always have to lead to traditional data models! Distinguish top-down from bottom-up development approaches and complete a top-down case study which ties all of the modeling techniques together. This book is written for anyone who is working with, or will be working with MongoDB, including business analysts, data modelers, database administrators, developers, project managers, and data scientists. There are three sections: In Section I, Getting Started, we will reveal the power of data modeling and the tight connections to data models that exist when designing any type of database (Chapter 1), compare NoSQL with traditional relational databases and where MongoDB fits (Chapter 2), explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts (Chapter 3), and explain the basics of adding, querying, updating, and deleting data in MongoDB (Chapter 4). In Section II, Levels of Granularity, we cover Conceptual Data Modeling (Chapter 5), Logical Data Modeling (Chapter 6), and Physical Data Modeling (Chapter 7). Notice the “ing” at the end of each of these chapters. We focus on the process of building each of these models, which is where we gain essential business knowledge. In Section III, Case Study, we will explain both top down and bottom up development approaches and go through a top down case study where we start with business requirements and end with the MongoDB database. This case study will tie together all of the techniques in the previous seven chapters. Nike Senior Data Architect Ryan Smith wrote the foreword. Key points are included at the end of each chapter as a way to reinforce concepts. In addition, this book is loaded with hands-on exercises, along with their answers provided in Appendix A. Appendix B contains all of the book’s references and Appendix C contains a glossary of the terms used throughout the text.","language":"en","currency":"USD","id":"1634620410","title":"Data Modeling for MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FI3XBgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":68,"thumbnail":"http:\/\/books.google.com\/books\/content?id=N-p_aXDGVKoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Get the Most Out of Your Database","description":"Getting started with MongoDB is easy, but once you begin building applications with it, you'll face some complex issues. What are the tradeoffs between normalized and denormalized data? How do you handle replica set failure and failover? This collection of MongoDB tips, tricks, and hacks helps you resolve issues with everything from application design and implementation to data safety and monitoring. You get specific guidance in five topic areas directly from engineers at 10gen, the company that develops and supports this open source database: Application Design Tips: What to keep in mind when designing your schema Implementation Tips: Programming applications against MongoDB Optimization Tips: Speeding up your applications Data Safety Tips: Using replication and journaling to keep data safe—without sacrificing too much performance Administration Tips: How to configure MongoDB and keep it running smoothly","language":"en","currency":"USD","id":"1449308678","title":"50 Tips and Tricks for MongoDB Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=N-p_aXDGVKoC&source=gbs_api","authors":["Kristina Chodorow"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3n1Vy81G6b8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Annotation With the rise of Web 2.0, the need for a highly scalable database, capable of storing diverse user-generated content is increasing. MongoDB, an open-source, non-relational database has stepped up to meet this demand and is being used in some of the most popular websites in the world. MongoDB is one of the NoSQL databases which is gaining popularity for developing PHP Web 2.0 applications.PHP and MongoDB Web Development Beginners Guide is a fast-paced, hands-on guide to get started with web application development using PHP and MongoDB. The book follows a Code first, explain later approach, using practical examples in PHP to demonstrate unique features of MongoDB. It does not overwhelm you with information (or starve you of it), but gives you enough to get a solid practical grasp on the concepts.The book starts by introducing the underlying concepts of MongoDB. Each chapter contains practical examples in PHP that teache specific features of the database.The book teaches you to build a blogging application, handle user sessions and authentication, and perform aggregation with MapReduce. You will learn unique MongoDB features and solve interesting problems like real-time analytics, location-aware web apps etc. You will be guided to use MongoDB alongside MySQL to build a diverse data back-end.With its concise coverage of concepts and numerous practical examples, PHP and MongoDB Web Development Beginners Guide is the right choice for the PHP developer to get started with learning MongoDB.","language":"en","currency":"USD","id":"1849513635","title":"PHP and MongoDB Web Development Beginner¿s Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3n1Vy81G6b8C&source=gbs_api","authors":["Rubayeet Islam"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aRLyxbyMeVEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":"Rapid Prototyping and Scalable Deployment","description":"Build an application from backend to browser with Node.js, and kick open the doors to real-time event programming. With this hands-on book, you’ll learn how to create a social network application similar to LinkedIn and Facebook, but with a real-time twist. And you’ll build it with just one programming language: JavaScript. If you’re an experienced web developer unfamiliar with JavaScript, the book’s first section introduces you to the project’s core technologies: Node.js, Backbone.js, and the MongoDB data store. You’ll then launch into the project—a highly responsive, highly scalable application—guided by clear explanations and lots of code examples. Learn about key modules in Node.js for building real-time apps Use the Backbone.js framework to write clean browser code, and maintain better data integration with MongoDB Structure project files as a foundation for code that will arrive later Create user accounts and learn how to secure the data Use Backbone.js templates to build the application’s UIs, and integrate access control with Node.js Develop a contact list to help users link to and track other accounts Use Socket.io to create real-time chat functionality Extend your UIs to give users up-to-the-minute information","language":"en","currency":"USD","id":"1449337767","title":"Building Node Applications with MongoDB and Backbone","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aRLyxbyMeVEC&source=gbs_api","authors":["Mike Wilson"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t2dBlNfKk6gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Practical Use Cases with the Leading NoSQL Database","description":"Whether you’re building a social media site or an internal-use enterprise application, this hands-on guide shows you the connection between MongoDB and the business problems it’s designed to solve. You’ll learn how to apply MongoDB design patterns to several challenging domains, such as ecommerce, content management, and online gaming. Using Python and JavaScript code examples, you’ll discover how MongoDB lets you scale your data model while simplifying the development process. Many businesses launch NoSQL databases without understanding the techniques for using their features most effectively. This book demonstrates the benefits of document embedding, polymorphic schemas, and other MongoDB patterns for tackling specific big data use cases, including: Operational intelligence: Perform real-time analytics of business data Ecommerce: Use MongoDB as a product catalog master or inventory management system Content management: Learn methods for storing content nodes, binary assets, and discussions Online advertising networks: Apply techniques for frequency capping ad impressions, and keyword targeting and bidding Social networking: Learn how to store a complex social graph, modeled after Google+ Online gaming: Provide concurrent access to character and world data for a multiplayer role-playing game","language":"en","currency":"USD","id":"1449340075","title":"MongoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t2dBlNfKk6gC&source=gbs_api","authors":["Rick Copeland"]},{"pageCount":8,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3ZSbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.33,"subtitle":null,"description":"Academic Paper from the year 2019 in the subject Computer Science - Software, grade: 8.6, Patna Women's College (Patna Women's College), course: MCA, language: English, abstract: MongoDB is a document-oriented database which helps us group data more logically. This paper demonstrates the conversion of data from a native tabular form to unstructured documents. The document and collections within it needs not to be well defined prior to the creation of unstructured data in MongoDB. The MongoDB has lots of extensive built-in-features and is highly compatible with other software systems, with extensive and flexible ways of accessing data beyond JSON query, its highly compatible Business Intelligence Connector is highly compatible which makes it compatible with existing databases. High scalability is making it remarkable and popular in the World and hence made me think about writing a paper demonstrating the data conversion. This conversion has helped me in making the most of modern data to be compatible with MongoDB. Data is stored on the cloud as cloud-based storage is an excellent and most cost-effective solution. My solution is highly scalable as the built-in shading solution for data handling makes it one of the best big data handling tool. The data that i have used, is location based in MongoDB that can directly yeild document ACID transactions to maintain data integrity.","language":"en","currency":"USD","id":"3668949859","title":"Data Migration from Relational Database to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3ZSbDwAAQBAJ&source=gbs_api","authors":["Ajit Singh"]},{"pageCount":247,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9S3EDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With Data Modeling and Query Building Strategies","description":"Get the most out of MongoDB using a problem-solution approach. This book starts with recipes on the MongoDB query language, including how to query various data structures stored within documents. These self-contained code examples allow you to solve your MongoDB problems without fuss. MongoDB Recipes describes how to use advanced querying in MongoDB, such as indexing and the aggregation framework. It demonstrates how to use the Compass function, a GUI client interacting with MongoDB, and how to apply data modeling to your MongoDB application. You’ll see recipes on the latest features of MongoDB 4 allowing you to manage data in an efficient manner using MongoDB. What You Will Learn Work with the MongoDB document model Design MongoDB schemas Use the MongoDB query language Harness the aggregation framework Create replica sets and sharding in MongoDB Who This Book Is ForDevelopers and professionals who work with MongoDB.","language":"en","currency":"USD","id":"1484248910","title":"MongoDB Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9S3EDwAAQBAJ&source=gbs_api","authors":["Subhashini Chellappan","Dharanitharan Ganesan"]},{"pageCount":209,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k4toDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Migrating to Azure Cosmos DB and Using the MongoDB API","description":"Learn Azure Cosmos DB and its MongoDB API with hands-on samples and advanced features such as the multi-homing API, geo-replication, custom indexing, TTL, request units (RU), consistency levels, partitioning, and much more. Each chapter explains Azure Cosmos DB’s features and functionalities by comparing it to MongoDB with coding samples. Cosmos DB for MongoDB Developers starts with an overview of NoSQL and Azure Cosmos DB and moves on to demonstrate the difference between geo-replication of Azure Cosmos DB compared to MongoDB. Along the way you’ll cover subjects including indexing, partitioning, consistency, and sizing, all of which will help you understand the concepts of read units and how this calculation is derived from an existing MongoDB’s usage. The next part of the book shows you the process and strategies for migrating to Azure Cosmos DB. You will learn the day-to-day scenarios of using Azure Cosmos DB, its sizing strategies, and optimizing techniques for the MongoDB API. This information will help you when planning to migrate from MongoDB or if you would like to compare MongoDB to the Azure Cosmos DB MongoDB API before considering the switch. What You Will Learn Migrate to MongoDB and understand its strategies Develop a sample application using MongoDB’s client driver Make use of sizing best practices and performance optimization scenarios Optimize MongoDB’s partition mechanism and indexing Who This Book Is For MongoDB developers who wish to learn Azure Cosmos DB. It specifically caters to a technical audience, working on MongoDB.","language":"en","currency":"USD","id":"1484236823","title":"Cosmos DB for MongoDB Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k4toDwAAQBAJ&source=gbs_api","authors":["Manish Sharma"]},{"pageCount":144,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kmQnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Need a quick and easy to understand introduction to MongoDB and NoSQL databases? MongoDB Basics, from The Definitive Guide to MongoDB, 2E, shows you how a document-oriented database system differs from a relational database, and how to install and get started using it. You'll also learn MongoDB design basics, including geospatial indexing, how to navigate, view, and query your database, and how to use GridFS with a bit of Python.","language":"en","currency":"USD","id":"1484208951","title":"MongoDB Basics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kmQnCgAAQBAJ&source=gbs_api","authors":["Peter Membrey","David Hows","Eelco Plugge"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1RhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 100 practical recipes to efficiently maintain and administer your MongoDB solution","description":"Manage, fine-tune, secure and deploy your MongoDB solution with ease with the help of practical recipes About This Book Configure and deploy your MongoDB instance securely, without any hassle Optimize your database's query performance, perform scale-out operations, and make your database highly available Practical guide with a recipe-based approach to help you tackle any problem in the application and database administration aspects of MongoDB Who This Book Is For Database administrators with a basic understanding of the features of MongoDB and who want to professionally configure, deploy, and administer a MongoDB database, will find this book essential. If you are a MongoDB developer and want to get into MongoDB administration, this book will also help you. What You Will Learn Install and deploy MongoDB in production Manage and implement optimal indexes Optimize monitoring in MongoDB Fine-tune the performance of your queries Debug and diagnose your database's performance Optimize database backups and recovery and ensure high availability Make your MongoDB instance scalable Implement security and user authentication features in MongoDB Master optimal cloud deployment strategies In Detail MongoDB is a high-performance and feature-rich NoSQL database that forms the backbone of the systems that power many different organizations. Packed with many features that have become essential for many different types of software professional and incredibly easy to use, this cookbook contains more than 100 recipes to address the everyday challenges of working with MongoDB. Starting with database configuration, you will understand the indexing aspects of MongoDB. The book also includes practical recipes on how you can optimize your database query performance, perform diagnostics, and query debugging. You will also learn how to implement the core administration tasks required for high-availability and scalability, achieved through replica sets and sharding, respectively. You will also implement server security concepts such as authentication, user management, role-based access models, and TLS configuration. You will also learn how to back up and recover your database efficiently and monitor server performance. By the end of this book, you will have all the information you need—along with tips, tricks, and best practices—to implement a high-performance MongoDB solution. Style and approach This practical book follows a problem-solution approach to help you tackle any issues encountered while performing MongoDB administrative tasks. Each recipe is detailed, and explained in a very easy to understand manner","language":"en","currency":"USD","id":"1787127184","title":"MongoDB Administrator's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1RhKDwAAQBAJ&source=gbs_api","authors":["Cyrus Dasadia"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gV0-ZF_YXqYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28,"subtitle":null,"description":"Learn how to build apps for mobile devices on Cloud platforms The marketplace for apps is ever expanding, increasing the potential to make money. With this guide, you'll learn how to build cross-platform applications for mobile devices that are supported by the power of Cloud-based services such as Amazon Web Services. An introduction to Cloud-based applications explains how to use HTML5 to create cross-platform mobile apps and then use Cloud services to enhance those apps. You'll learn how to build your first app with HTML5 and set it up in the Cloud, while also discovering how to use jQuery to your advantage. Highlights the skills and knowledge you need to create successful apps for mobile devices with HTML5 Takes you through the steps for building web applications for the iPhone and Android Details how to enhance your app through faster launching, touch vs. click, storage capabilities, and a cache Looks at how best to use JSON, FourSquare, jQuery, AJAX, and more Shares tips for creating hybrid apps that run natively If you're interested in having your application be one of the 200,000+ apps featured in the iPhone store or the 50,000+ in the Android store, then you need this book.","language":"en","currency":"USD","id":"1118203356","title":"Beginning Mobile Application Development in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gV0-ZF_YXqYC&source=gbs_api","authors":["Richard Rodger"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QUXfBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at developers and technical testers who are looking for a quick way to take their SoapUI skills and understanding to the next level. Even if you are new to SoapUI but have basic Java skills and a reasonable grasp of RESTFul and Soap web services, then you should have no problem making use of this book.","language":"en","currency":"USD","id":"1784398713","title":"SoapUI Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QUXfBgAAQBAJ&source=gbs_api","authors":["Rupert Anderson"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UEOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Mongo, Express, AngularJS, and Node.js","description":"Traditionally, web applications have been architected so that the back-end houses all the front-end code. This has resulted in heavy projects that are difficult to manage and scale. This book will explain a new way to write web applications by treating the front-end as if it were a third-party (such as a mobile client). This book, written by a practicing MEAN developer, will take a holistic approach to using the MEAN JavaScript platform for creating modern web applications and lay out how to use the MEAN (Mongo, Express, AngularJS, and Node.js) set of tools to create a web application, from installation and setup of the tools to debugging and deploying your app. After an introduction to how web development is changing and the advantages of using the MEAN stack, the author jumps into an introduction to each tool and then dives into using the complete JavaScript-based application stack to build, test, and deploy apps.","language":"en","currency":"USD","id":"0133962377","title":"Write Modern Web Apps with the MEAN Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UEOZBAAAQBAJ&source=gbs_api","authors":["Jeff Dickey"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U1RwBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Covering 14.10 and 15.04","description":"Ubuntu Unleashed 2015 Edition is filled with unique and advanced information for everyone who wants to make the most of the Linux-based Ubuntu operating system. This new edition has been thoroughly revised and updated by a long-time Ubuntu community leader to reflect the exciting new Ubuntu 14.10 while including tons of information that will continue to apply to future editions. Former Ubuntu Forum administrator Matthew Helmke covers all you need to know about Ubuntu 14.10 installation, configuration, productivity, multimedia, development, system administration, server operations, networking, virtualization, security, DevOps, and more–including intermediate-to-advanced techniques you won’t find in any other book. Helmke presents up-to-the-minute introductions to Ubuntu’s key productivity and Web development tools, programming languages, hardware support, and more. You’ll find new or improved coverage of Ubuntu’s Unity interface, various types of servers, software repositories, database options, virtualization and cloud services, development tools, monitoring, troubleshooting, Ubuntu’s push into mobile and other touch screen devices, and much more. Detailed information on how to… Configure and customize the Unity desktop Get started with multimedia and productivity applications, including LibreOffice Manage Linux services, users, and software packages Administer and run Ubuntu from the command line Automate tasks and use shell scripting Provide secure remote access and configure a secure VPN Manage kernels and modules Administer file, print, email, proxy, LDAP, DNS, and HTTP servers (Apache, Nginx, or alternatives) Learn about new options for managing large numbers of servers Work with databases (both SQL and the newest NoSQL alternatives) Get started with virtualization Build a private cloud with Juju and Charms Learn the basics about popular programming languages including Python, PHP, Perl, and new alternatives such as Go and Rust Learn about Ubuntu’s work toward usability on touch-screen and phone devices Ubuntu 14.10 on DVD DVD includes the full Ubuntu 14.10 distribution for 64 bit computers (most desktop and notebooks systems today) as well as the complete LibreOffice office suite and hundreds of additional programs and utilities. Free Kick Start Chapter! Purchase this book and receive a free Ubuntu 15.04 Kick Start chapter after Ubuntu 15.04 is released. See inside back cover for details","language":"en","currency":"USD","id":"0133794067","title":"Ubuntu Unleashed 2015 Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U1RwBQAAQBAJ&source=gbs_api","authors":["Matthew Helmke"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rKQ5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"The definitive guide to using the MEAN stack to build web applications","description":"Node.js, MongoDB and Angular Web Development The definitive guide to using the MEAN stack to build web applications Node.js is a leading server-side programming environment, MongoDB is the most popular NoSQL database, and Angular is the leading framework for MVC-based front-end development. Together, they provide an easy-to-implement, fully integrated web development stack that allows web programmers to create high-performance sites and applications built completely in JavaScript, from server to client. Updated for Angular 2, Angular 4, and subsequent versions, this new edition of Node.js, MongoDB and Angular Web Development shows you how to integrate these three technologies into complete working solutions. It begins with concise, crystal-clear tutorials on each technology and then quickly moves on to building common web applications. You’ll learn how to use Node.js and MongoDB to build more scalable, high-performance sites, how to leverage Angular’s innovative MVC approach to structure more effective pages and applications, and how to use all three together to deliver outstanding next-generation Web solutions. Implement a highly scalable and dynamic web server using Node.js and Express Implement a MongoDB data store for your web applications Access and interact with MongoDB from Node.js JavaScript code Learn the basics of TypeScript Define custom Angular directives that extend the HTML language Build server-side web services in JavaScript Implement client-side services that can interact with the Node.js web server Build dynamic browser views that provide rich user interaction Add authenticated user accounts and nested comment components to your web applications and pages Contents at a Glance Part I: Getting Started 1 Introducing the Node.js-to-Angular Stack 2 JavaScript Primer Part II: Learning Node.js 3 Getting Started with Node.js 4 Using Events, Listeners, Timers, and Callbacks in Node.js 5 Handling Data I\/O in Node.js 6 Accessing the File System from Node.js 7 Implementing HTTP Services in Node.js 8 Implementing Socket Services in Node.js 9 Scaling Applications Using Multiple Processors in Node.js 10 Using Additional Node.js Modules Part III: Learning MongoDB 11 Understanding NoSQL and MongoDB 12 Getting Started with MongoDB 13 Getting Started with MongoDB and Node.js 14 Manipulating MongoDB Documents from Node.js 15 Accessing MongoDB from Node.js 16 Using Mongoose for Structured Schema and Validation 17 Advanced MongoDB Concepts Part IV: Using Express to Make Life Easier 18 Implementing Express in Node.js 19 Implementing Express Middleware Part V: Learning Angular 20 Jumping into TypeScript 21 Getting Started with Angular 22 Angular Components 23 Expressions 24 Data Binding 25 Built-in Directives Part VI: Advanced Angular 26 Custom Directives 27 Events and Change Detection 28 Implementing Angular Services in Web Applications 29 Creating Your Own Custom Angular Services 30 Having Fun with Angular","language":"en","currency":"USD","id":"0134656164","title":"Node.js, MongoDB and Angular Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rKQ5DwAAQBAJ&source=gbs_api","authors":["Brad Dayley","Brendan Dayley","Caleb Dayley"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x9hpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a .NET developer who is looking for a simpler way to build services, this is the book for you. It will show you how to write fast, maintainable APIs that are a pleasure to use and maintain starting from the database to the client and everything in-between.","language":"en","currency":"USD","id":"1783986573","title":"ServiceStack 4 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x9hpBgAAQBAJ&source=gbs_api","authors":["Kyle Hodgson","Darren Reid"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yv1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Learn the skills you need to work with the world's most popular NoSQL database","description":"A fast paced guide that will help you to create, read, update and delete data using MongoDB Key Features Create secure databases with MongoDB Manipulate and maintain your database Model and use data in a No SQL environment with MongoDB Book Description MongoDB has grown to become the de facto NoSQL database with millions of users, from small start-ups to Fortune 500 companies. It can solve problems that are considered difficult, if not impossible, for aging RDBMS technologies. Written for version 4 of MongoDB, this book is the easiest way to get started with MongoDB. You will start by getting a MongoDB installation up and running in a safe and secure manner. You will learn how to perform mission-critical create, read, update, and delete operations, and set up database security. You will also learn about advanced features of MongoDB such as the aggregation pipeline, replication, and sharding. You will learn how to build a simple web application that uses MongoDB to respond to AJAX queries, and see how to make use of the MongoDB programming language driver for PHP. The examples incorporate new features available in MongoDB version 4 where appropriate. What you will learn Get a standard MongoDB database up and running quickly Perform simple CRUD operations on the database using the MongoDB command shell Set up a simple aggregation pipeline to return subsets of data grouped, sorted, and filtered Safeguard your data via replication and handle massive amounts of data via sharding Publish data from a web form to the database using a program language driver Explore the basic CRUD operations performed using the PHP MongoDB driver Who this book is for Web developers, IT professionals and Database Administrators (DBAs) who want to learn how to create and manage MongoDB databases.","language":"en","currency":"USD","id":"1789349729","title":"MongoDB 4 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yv1wDwAAQBAJ&source=gbs_api","authors":["Doug Bierer"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7NhpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Intended for seasoned Go programmers who want to put their expertise in Go to use to solve big, real-world, modern problems. With a basic understanding of channels and goroutines, you will hone your skills to build tools and programs that are quick and simple. You need not be an expert in distributed systems or technologies in order to deliver solutions capable of great scale. It is assumed that you are familiar with the basic concepts of Go.","language":"en","currency":"USD","id":"1783988037","title":"Go Programming Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7NhpBgAAQBAJ&source=gbs_api","authors":["Mat Ryer"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jABUAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.17,"subtitle":null,"description":"MongoDB – это документо-ориентированная база данных, предназначенная для гибкой, масштабируемой и очень быстрой работы даже при больших объемах данных. При ее проектировании изначально закладывалась высокая доступность, поддержка сложных динамических схем и простое распределение данных по нескольким серверам. Эта книга представляет собой введение в MongoDB и документо-ориентированную модель данных. Она дает не только общую картину, необходимую разработчику, но и достаточно деталей, чтобы удовлетворить системного инженера. Многочисленные примеры помогут обрести уверенность в области моделирования данных – вопросе, который необычайно важен для разработки ПО. Вам понравится углубленное изложение различных функциональных возможностей, в том числе репликации, автосегментирования и развертывания.","language":"ru","currency":"USD","id":"5457572587","title":"MongoDB в действии","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jABUAwAAQBAJ&source=gbs_api","authors":["Кайл Бэнкер"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":542,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TayXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Full Stack Web App Development with Mongo, Express, React, and Node","description":"Assemble the complete stack required to build a modern web app using MongoDB, Express, React, and Node. This book also covers many other complementary tools: React Router, GraphQL, React-Bootstrap, Babel, and Webpack. This new edition will use the latest version of React (React 16) and the latest React Router (React Router 4), which has a significantly different approach to routing compared to React Router 2 which was used in the first edition of the book. Though the primary focus of Pro MERN Stack is to equip you with all that is required to build a full-fledged web application, a large portion of the book will be devoted to React 16. The popular MEAN (MongoDB, Express, AngularJS, Node) stack introduced Single Page Apps (SPAs) and front-end Model-View-Controller (MVC) as new and efficient paradigms. Facebook's React is a technology that competes indirectly with AngularJS. It is not a full-fledged MVC framework. It is a JavaScript library for building user interfaces (in some sense the View part). Yet, it is possible to build a web app by replacing AngularJS with React – hence the term MERN stack What You Will Learn Discover the features of React 16 to get the maximum out of this library Gain the basics of MongoDB, Express, and Node to build a web app Work with other libraries complementary to React, including React-Bootstrap, React Router, and GraphQL Use tools such as Babel and Webpack required to build JavaScript-based SPAs Tie all the components together to build a complete web app. Who This Book Is For Developers and architects who have prior experience in any web app stack other than the MERN stack will find the book useful to learn about this modern stack. Prior knowledge of JavaScript, HTML, and CSS is required.","language":"en","currency":"USD","id":"1484243919","title":"Pro MERN Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TayXDwAAQBAJ&source=gbs_api","authors":["Vasan Subramanian"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5LK8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"快速具備MongoDB的基本使用技能 活用大數據資料處理的實用入門書！ IT業界最流行、最活耀的文件導向資料庫—MongoDB 在大數據時代，NoSQL已經成為資料儲存的主流，而在NoSQL中最具影響力的資料庫，則以文件類型的MongoDB為第一，其在IT業界最為活躍。本書內容共分為10章，包含基本操作、學習文字與圖形化管理界面、索引Index查詢效能分析、大數據的聚合資料中靈活的Map-Reduce與獨有的Aggregation Pipeline操作、資料複製以及Web API伺服器專案開發，可以讓你在短時間內快速上手，並了解如何將MongoDB實際應用在真實系統產品上。本書適合資料庫管理開發人員、資料探勘與分析人員以及各類應用大數據儲存的開發人員閱讀。 本書特色 ◎ 內容精簡、淺顯易懂，可7天快速學會MongoDB。 ◎ 透過實際範例，準確掌握精髓技巧。 ◎ 搭配Robo 3T的圖形介面操作，一步步帶領你上手。 ◎ Replication資料複製機制實際演練操作。 ◎ 了解索引Index加速查詢的機制與效能優化，查詢大數據也不怕。 ◎ 強大的Aggregation聚合資料，在大數據中滿足各種複雜的查詢操作。 ◎ 獨有的Aggregation Pipeline聚合管線操作，輕鬆玩大數據。 ◎ 靈活使用JavaScript的Map-Reduce，連續計算大數據也不怕。 ◎ 學會開發與測試Web API伺服器，使用ASP.NET Web API 2。","language":"zh-CN","currency":"USD","id":"9864343947","title":"7天學會大數據資料處理—NoSQL：MongoDB入門與活用（第三版）","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5LK8DwAAQBAJ&source=gbs_api","authors":["黃士嘉、林敬傑"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pcZpBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"This book contains a selection of refereed and revised papers of the Intelligent Distributed Computing Track originally presented at the third International Symposium on Intelligent Informatics (ISI-2014), September 24-27, 2014, Delhi, India. The papers selected for this Track cover several Distributed Computing and related topics including Peer-to-Peer Networks, Cloud Computing, Mobile Clouds, Wireless Sensor Networks, and their applications.","language":"en","currency":"USD","id":"3319112279","title":"Intelligent Distributed Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pcZpBAAAQBAJ&source=gbs_api","authors":["Rajkumar Buyya","Sabu M. Thampi"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A6VWBxzcKXEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.A simple Starter approach to show the readers how to develop a real-time web application using Meteor, with the help of a sample project.This book is ideal for people with knowledge of standard JavaScript, basic HTML, and some CSS. This book starts at the very beginning, from installing the framework on your computer all the way up to deploying your finished app on the Web. If you want to get into this exciting new framework, and you would like to learn how to take a project from being a concept to a real-world app, then this is definitely the book for you.","language":"en","currency":"USD","id":"1782163433","title":"Instant Meteor JavaScript Framework Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A6VWBxzcKXEC&source=gbs_api","authors":["Gabriel Manricks"]},{"pageCount":198,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SOVrBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"If you are a web developer with basic knowledge of JavaScript and want to take on Web 2.0, build real-time applications, or simply want to write a complete application using only JavaScript and HTML\/CSS, this is the book for you. This book is based on Meteor 1.0.","language":"en","currency":"USD","id":"1783988134","title":"Building Single-page Web Apps with Meteor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SOVrBgAAQBAJ&source=gbs_api","authors":["Fabian Vogelsteller"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fru9BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is ideal for any JavaScript developer who is interested in producing well-tested code. If you have no prior experience with testing, Node.js, or any other tool, do not worry, as they will be explained from scratch.","language":"en","currency":"USD","id":"1784390178","title":"Learning Behavior-driven Development with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fru9BgAAQBAJ&source=gbs_api","authors":["Enrique Amodeo"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R5_5CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book covers the basic concepts in data modeling and also provides you with the tools to design better schemas. With a focus on data usage, this book will cover how queries and indexes can influence the way we design schemas, with thorough examples and detailed code. The book begins with a brief discussion of data models, drawing a parallel between relational databases, NoSQL, and consequently MongoDB. Next, the book explains the most basic MongoDB concepts, such as read and write operations, indexing, and how to design schemas by knowing how applications will use the data. Finally, we will talk about best practices that will help you optimize and manage your database, presenting you with a real-life example of data modeling on a real-time logging analytics application.","language":"en","currency":"USD","id":"1783550589","title":"MongoDB Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R5_5CQAAQBAJ&source=gbs_api","authors":["Wilson da Rocha França"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L3haDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":null,"description":"Build the foundational data science skills necessary to work with and better understand complex data science algorithms. This example-driven book provides complete Python coding examples to complement and clarify data science concepts, and enrich the learning experience. Coding examples include visualizations whenever appropriate. The book is a necessary precursor to applying and implementing machine learning algorithms. The book is self-contained. All of the math, statistics, stochastic, and programming skills required to master the content are covered. In-depth knowledge of object-oriented programming isn’t required because complete examples are provided and explained. Data Science Fundamentals with Python and MongoDB is an excellent starting point for those interested in pursuing a career in data science. Like any science, the fundamentals of data science are a prerequisite to competency. Without proficiency in mathematics, statistics, data manipulation, and coding, the path to success is “rocky” at best. The coding examples in this book are concise, accurate, and complete, and perfectly complement the data science concepts introduced. What You'll Learn Prepare for a career in data science Work with complex data structures in Python Simulate with Monte Carlo and Stochastic algorithms Apply linear algebra using vectors and matrices Utilize complex algorithms such as gradient descent and principal component analysis Wrangle, cleanse, visualize, and problem solve with data Use MongoDB and JSON to work with data Who This Book Is For The novice yearning to break into the data science world, and the enthusiast looking to enrich, deepen, and develop data science skills through mastering the underlying fundamentals that are sometimes skipped over in the rush to be productive. Some knowledge of object-oriented programming will make learning easier.","language":"en","currency":"USD","id":"1484235975","title":"Data Science Fundamentals for Python and MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L3haDwAAQBAJ&source=gbs_api","authors":["David Paper"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=anteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Modern web development using React 16, Node, Express, and MongoDB","description":"Unleash the power of MERN stack by building diverse web applications using React, Node.js, Express, and MongoDB Key Features Create dynamic web applications with the MERN stack Leverage the power of React in building interactive and complex user interfaces Unlock the potential of Node, Express, and MongoDB to build modern full-stack applications Book Description The benefits of using a full JavaScript stack for web development are undeniable, especially when robust and widely adopted technologies such as React, Node, and Express and are available. Combining the power of React with industry-tested, server-side technologies, such as Node, Express, and MongoDB, creates a diverse array of possibilities when developing real-world web applications. This book guides you through preparing the development environment for MERN stack-based web development, to creating a basic skeleton application and extending it to build four different web applications. These applications include a social media, an online marketplace, a media streaming, and a web-based game application with virtual reality features. While learning to set up the stack and developing a diverse range of applications with this book, you will grasp the inner workings of the MERN stack, extend its capabilities for complex features, and gain actionable knowledge of how to prepare MERN-based applications to meet the growing demands of real-world web applications. What you will learn Set up your development environment and develop a MERN application Implement user authentication and authorization using JSON Web Tokens Build a social media application by extending the basic MERN application Create an online marketplace application with shopping cart and Stripe payments Develop a media streaming application using MongoDB GridFS Implement server-side rendering with data to improve SEO Set up and use React 360 to develop user interfaces with VR capabilities Learn industry best practices to make MERN stack applications reliable and scalable Who this book is for Full-Stack React Web Development Projects is for JavaScript developers who have some experience with React, but no previous experience with full-stack development involving Node, Express, and MongoDB, and who want practical guidelines to start building different types of real-world web applications with this stack.","language":"en","currency":"USD","id":"1788832949","title":"Full-Stack React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=anteDwAAQBAJ&source=gbs_api","authors":["Shama Hoque"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Iwh4AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Mastering Dart by Projects is a step-by-step guide that aims to give you hands-on knowledge about programming in Dart using an example-based approach. If you want to become a web developer, or perhaps you already are a web developer but you want to add Dart to your tool belt, then this book is for you. This book assumes that you have at least some knowledge of HTML and how web applications work. Some previous programming experience, preferably in a modern language like C#, Java, Python, Ruby, or JavaScript, will also give you a head start. You can also work with Dart on your preferred platform, be it Linux, Mac OS X, or Windows.","language":"en","currency":"USD","id":"1849697434","title":"Learning Dart","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Iwh4AgAAQBAJ&source=gbs_api","authors":["Ivo Balbaert","Dzenan Ridjanovic"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HNwkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book is intended for people who are not familiar with AngularJS and who want to take their PhoneGap development skills further by developing apps using different JavaScript libraries. People with some knowledge of PhoneGap, HTML, CSS, and JavaScript will find this book immediately useful.","language":"en","currency":"USD","id":"1783988932","title":"PhoneGap and AngularJS for Cross-platform Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HNwkBQAAQBAJ&source=gbs_api","authors":["Yuxian, Eugene Liang"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bFywDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"With SQL and NOSQL Databases","description":"Designed to provide an insight into the SQL and MySQL database concepts using python DESCRIPTION Python is becoming increasingly popular among data scientists. However, analysis and visualization tools need to interact with the data stored in various formats such as relational and NOSQL databases. This book aims to make the reader proficient in interacting with databases such as MySQL, SQLite, MongoDB, and Cassandra. This book assumes that the reader has no prior knowledge of programming. Hence, basic programming concepts, key concepts of OOP, serialization and data persistence have been explained in such a way that it is easy to understand. NOSQL is an emerging technology. Using MongoDB and Cassandra, the two widely used NOSQL databases are explained in detail. The knowhow of handling databases using Python will certainly be helpful for readers pursuing a career in Data Science. KEY FEATURES A practical approach Ample code examples A Quick Start Guide to Python for beginners WHAT WILL YOU LEARN Python basics and programming fundamentals Serialization libraries pickle, CSV, JSON, and XML DB-AP and, SQLAlchemy Python with Excel documents Python with MongoDB and Cassandra WHO THIS BOOK IS FOR Students and professionals who want to become proficient at database tools for a successful career in data science. Table of Contents 1. Getting Started 2. Program Flow Control 3. Structured Python 4. Python – OOP 5. File IO 6. Object Serialization 7. RDBMS Concepts 8. Python DB-API 9. Python – SQLAlchemy 10. Python and Excel 11. Python – PyMongo 12. Python – Cassandra","language":"en","currency":"USD","id":"9388511751","title":"Python Data Persistence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bFywDwAAQBAJ&source=gbs_api","authors":["Malhar Lathkar"]},{"pageCount":716,"thumbnail":"http:\/\/books.google.com\/books\/content?id=097dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Learn MERN stack development by building modern web apps using MongoDB, Express, React, and Node.js, 2nd Edition","description":"A practical, project-based guide to full-stack JavaScript web development combining the power of React with industry-tested server-side technologies Key Features Build your career as a full-stack developer with this practical guide Understand how the different aspects of a MERN application come together through a series of practical projects Master the MERN stack by building robust social media, E-commerce store, and web-based VR game apps Book Description Facebook's React combined with industry-tested, server-side technologies, such as Node, Express, and MongoDB, enables you to develop and deploy robust real-world full-stack web apps. This updated second edition focuses on the latest versions and conventions of the technologies in this stack, along with their new features such as Hooks in React and async\/await in JavaScript. The book also explores advanced topics such as implementing real-time bidding, a web-based classroom app, and data visualization in an expense tracking app. Full-Stack React Projects will take you through the process of preparing the development environment for MERN stack-based web development, creating a basic skeleton app, and extending it to build six different web apps. You’ll build apps for social media, classrooms, media streaming, online marketplaces with real-time bidding, and web-based games with virtual reality features. Throughout the book, you’ll learn how MERN stack web development works, extend its capabilities for complex features, and gain actionable insights into creating MERN-based apps, along with exploring industry best practices to meet the ever-increasing demands of the real world. By the end of this React book, you’ll be able to build production-ready MERN full-stack apps using advanced tools and techniques in modern web development. What you will learn Extend a basic MERN-based application to build a variety of applications Add real-time communication capabilities with Socket.IO Implement data visualization features for React applications using Victory Develop media streaming applications using MongoDB GridFS Improve SEO for your MERN apps by implementing server-side rendering with data Implement user authentication and authorization using JSON web tokens Set up and use React 360 to develop user interfaces with VR capabilities Make your MERN stack applications reliable and scalable with industry best practices Who this book is for This is one of the most useful web development books for JavaScript developers who may have worked with React but have minimal experience in full-stack development with Node, Express, and MongoDB.","language":"en","currency":"USD","id":"1839213116","title":"Full-Stack React Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=097dDwAAQBAJ&source=gbs_api","authors":["Shama Hoque"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CwBwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Create real-time server-side applications with this practical, step-by-step guide About This Book Learn about server-side JavaScript with Node.js and Node modules through the most up-to-date book on Node.js web development Understand website development both with and without the Connect\/Express web application framework Develop both HTTP server and client applications Who This Book Is For This book is for anybody looking for an alternative to the \"P\" languages (Perl, PHP, and Python), or anyone looking for a new paradigm of server-side application development. You should have at least a rudimentary understanding of JavaScript and web application development. What You Will Learn Install and use Node.js for both development and deployment Use the Express application framework Configure Bootstrap for mobile-first theming Use data storage engines such as MySQL, SQLITE3, and MongoDB Understand user authentication methods, including OAuth, with third-party services Deploy Node.js to live servers, including microservice development with Docker Perform unit testing with Mocha Perform functional testing of the web application with CasperJS In Detail Node.js is a server-side JavaScript platform using an event driven, non-blocking I\/O model allowing users to build fast and scalable data-intensive applications running in real time. Node.js Web Development shows JavaScript is not just for browser-side applications. It can be used for server-side web application development, real-time applications, microservices, and much more. This book gives you an excellent starting point, bringing you straight to the heart of developing web applications with Node.js. You will progress from a rudimentary knowledge of JavaScript and server-side development to being able to create and maintain your own Node.js application. With this book you'll learn how to use the HTTP Server and Client objects, data storage with both SQL and MongoDB databases, real-time applications with Socket.IO, mobile-first theming with Bootstrap, microservice deployment with Docker, authenticating against third-party services using OAuth, and much more. Style and Approach This book is a practical guide for anyone looking to develop striking and robust web applications using Node.js.","language":"en","currency":"USD","id":"1785885413","title":"Node.js Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CwBwDQAAQBAJ&source=gbs_api","authors":["David Herron"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tjjrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Modern Patterns for Developing React Apps","description":"If you want to learn how to build efficient React applications, this is your book. Ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, this updated edition provides best practices and patterns for writing modern React code. No prior knowledge of React or functional JavaScript is necessary. With their learning road map, authors Alex Banks and Eve Porcello show you how to create UIs that can deftly display changes without page reloads on large-scale, data-driven websites. You’ll also discover how to work with functional programming and the latest ECMAScript features. Once you learn how to build React components with this hands-on guide, you’ll understand just how useful React can be in your organization. Understand key functional programming concepts with JavaScriptLook under the hood to learn how React runs in the browserCreate application presentation layers with React componentsManage data and reduce the time you spend debugging applicationsIncorporate React Hooks to manage state and fetch dataUse a routing solution for single-page application featuresLearn how to structure React applications with servers in mind","language":"en","currency":"USD","id":"1492051675","title":"Learning React","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tjjrDwAAQBAJ&source=gbs_api","authors":["Alex Banks","Eve Porcello"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VED3Sre6X_MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Already know Python but want to learn more? A lot more? Dive into a variety of topics used in practice for real-world applications. Covers regular expressions, Internet\/network programming, GUIs, SQL\/databases\/ORMs, threading, and Web development. Learn about contemporary development trends such as Google+, Twitter, MongoDB, OAuth, Python 3 migration, and Java\/Jython. Presents brand new material on Django, Google App Engine, CSV\/JSON\/XML, and Microsoft Office. Includes Python 2 and 3 code samples to get you started right away! Provides code snippets, interactive examples, and practical exercises to help build your Python skills. The Complete Developer’s Guide to Python Python is an agile, robust, and expressive programming language that continues to build momentum. It combines the power of compiled languages with the simplicity and rapid development of scripting languages. In Core Python Applications Programming, Third Edition , leading Python developer and corporate trainer Wesley Chun helps you take your Python knowledge to the next level. This book has everything you need to become a versatile Python developer. You will be introduced to multiple areas of application development and gain knowledge that can be immediately applied to projects, and you will find code samples in both Python 2 and 3, including migration tips if that’s on your roadmap too. Some snippets will even run unmodified on 2.x or 3.x. Learn professional Python style, best practices, and good programming habits Build clients and servers using TCP, UDP, XML-RPC, and be exposed to higher-level libraries like SocketServer and Twisted Develop GUI applications using Tkinter and other available toolkits Improve application performance by writing extensions in C\/C++, or enhance I\/O-bound code with multithreading Discover SQL and relational databases, ORMs, and even non-relational (NonSQL) databases like MongoDB Learn the basics of Web programming, including Web clients and servers, plus CGI and WSGI Expose yourself to regular expressions and powerful text processing tools for creating and parsing CSV, JSON, and XML data Interface with popular Microsoft Office applications such as Excel, PowerPoint, and Outlook using COM client programming Dive deeper into Web development with the Django framework and cloud computing with Google App Engine Explore Java programming with Jython, the way to run Python code on the JVM Connect to Web services Yahoo! Finance to get stock quotes, or Yahoo! Mail, Gmail, and others to download or send e-mail Jump into the social media craze by learning how to connect to the Twitter and Google+ networks Core Python Applications Programming, Third Edition, delivers Broad coverage of a variety of areas of development used in real-world applications today Powerful insights into current and best practices for the intermediate Python programmer Dozens of code examples, from quick snippets to full-fledged applications A variety of exercises at the end of every chapter to help hammer the concepts home","language":"en","currency":"USD","id":"0132850001","title":"Core Python Applications Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VED3Sre6X_MC&source=gbs_api","authors":["Wesley J Chun"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZUjiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This book is designed to introduce you to using containers and Kubernetes for full-stack development. You'll learn how to develop a full-stack application using Node.js and MongoDB and how to and manage them using Docker, then Docker Compose, and finally Kubernetes.","language":"en","currency":"USD","id":"0999773054","title":"From Containers to Kubernetes with Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZUjiDwAAQBAJ&source=gbs_api","authors":["Kathleen Juell"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DxTFXO771tIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is a mini tutorial full of code examples and strategies to give you plenty of options when building your own applications with MongoDB.This book is ideal for people who want to develop applications on the Node.js stack quickly and efficiently. Prior knowledge of the stack is not essential as the book briefly covers the installation of the core components and builds all aspects of the example application. The focus of the book is on what Mongoose adds to you applications, so experienced Node.js developers will also benefit.","language":"en","currency":"USD","id":"1782168206","title":"Mongoose for Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DxTFXO771tIC&source=gbs_api","authors":["Simon Holmes"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AJ0uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"This book covers the Linux Mint 18.2 release (Sonya), focusing on desktops and administrative tools. The emphasis here is on what users will face when using Mint, covering topics like installation, applications, software management, the Mint desktops (Cinnamon, Mate, KDE, and Xfce), shell commands, network connections, and system administration tasks. Linux Mint 18.2 is based on the Ubuntu 16.04 LTR (Long Term Release). The Cinnamon, Mate, and Linux Mint KDE desktops are examined in detail. Cinnamon and Mate have custom Mint menus to manage access to applications and devices. Advanced components are also examined such as the LightDM Display Manager, PulseAudio sound configuration, and Mint software management applications (Software Manager and Update Manager). The new X-Apps are also reviewed, including Xplayer, Xed, and Xviewer. Administration topics include system tools, managing users, file systems, Bluetooth setup, printer configuration, and network folder and file sharing. In addition, configuration of wired and wireless connections, firewalls (the Gufw and FirewallD), and service management using systemd are covered. Shared resources are also examined, including the CUPS printing server, the NFS Linux network file server, and Samba Windows file and printing server. This ebook version is epub3 and edupub (EPUB for Education) compliant (version 3.0.1, epubcheck 4.0.2) with pagelist, sections, index list, and tocs.","language":"en","currency":"USD","id":"1936280930","title":"Linux Mint 18.2: Desktops and Administration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AJ0uDwAAQBAJ&source=gbs_api","authors":["Richard Petersen"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E7q9BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is intended for users with some knowledge of the Elixir language syntax and basic data types\/structures. Although this is a cookbook and no sequential reading is required, the book’s structure will allow less advanced users who follow it to be gradually exposed to some of Elixir’s features and concepts specific to functional programming. To get the most out of this book, you need to be well versed with Erlang.","language":"en","currency":"USD","id":"1784393487","title":"Elixir Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E7q9BgAAQBAJ&source=gbs_api","authors":["Paulo A Pereira"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LiJ-BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"DevOps for VMware® Administrators is the first book focused on using DevOps tools and practices with VMware technologies. The authors introduce high-value tools from third parties and VMware itself, and guide you through using them to improve the performance of all your virtualized systems and applications. You’ll walk through automating and optimizing configuration management, provisioning, log management, continuous integration, and more. The authors also offer step-by-step coverage of deploying and managing applications at scale with Docker containers and Google Kubernetes. They conclude with an up-to-the-minute discussion of VMware’s newest DevOps initiatives, including VMware vRealize Automation and VMware vRealize Code Stream. Coverage includes • Understanding the challenges that DevOps tools and practices can help VMware administrators to solve • Using Vagrant to quickly deploy Dev and Test environments that match production system specifications • Writing Chef “recipes” that streamline server configuration and maintenance • Simplifying Unix\/Linux configuration management and orchestration with Ansible • Implementing Docker containers for faster and easier application management • Automating provisioning across the full lifecycle with Razor • Integrating Microsoft PowerShell Desired State Configuration (DSC) and VMware PowerCLI to automate key Windows Server and vSphere VM admin tasks • Using Puppet to automate infrastructure provisioning, configuration, orchestration, and reporting • Supercharging log management with ELK (Elasticsearch, Logstash, Kibana) • Supporting DevOps source code management with Git and continuous integration practices with Jenkins • Achieving continuous integration, delivery, and deployment with VMware’s vRealize Code Stream","language":"en","currency":"USD","id":"0133795268","title":"DevOps for VMware Administrators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LiJ-BwAAQBAJ&source=gbs_api","authors":["Trevor A. Roberts Jr.","Josh Atwell","Egle Sigler","Yvo van Doorn"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FNxdCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Design, build, and deliver efficient Java applications using the most advanced NoSQL database About This Book Reuse the skills you have acquired through Hibernate or Spring to promote your applications to use NoSQL storage Explore the list of libraries that are already available to assist you in developing Java EE applications with MongoDB A step-by-step tutorial to create leaner and faster applications using MongoDB Who This Book Is For This book is for Java developers and architects that want to learn how to develop Java applications using the most popular NoSQL solution and the use cases of it. What You Will Learn Install MongoDB and its client tools Set up a basic project that uses a MongoDB driver and perform CRUD operations with it Explore simple strategies for mapping Mongo documents with Java classes Use bulk operations to speed up the creation of massive document Design and develop a Java Enterprise application that uses MongoDB as storage Develop and deploy an application that uses Hibernate OGM as a persistence layer for your entities Use Spring Data and Spring Boot to leverage micro-services using MongoDB as storage In Detail The NoSQL movement is growing in relevance, attracting more and more developers. The MongoDB database is a well-recognized rising star in the NoSQL world. It is a document database, which allows data persistence and enables you to query data in a nested state without any schema constraint and complex joins between documents. This book provides all the knowledge you need to make MongoDB fit in your application schema, at the best of its capabilities. It starts from a basic introduction to the driver that can be used to perform some low-level interaction with the storage. Then it moves to use different patterns to abstract the persistence layer into your applications, starting from the flexible Google JSON library to the Hibernate OGM Framework and finally landing on the Spring data framework. By the end of this book, you will know everything you need to use MongoDB in your Java applications. Style and approach A simple, tutorial-like approach is used to explain the concepts contained in the book in the simplest possible way. The chapters of this book are arranged so that complexity increases progressively as you gain more experience from the earlier chapters.","language":"en","currency":"USD","id":"1785286293","title":"MongoDB for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FNxdCgAAQBAJ&source=gbs_api","authors":["Francesco Marchioni"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6VKjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Developing Cloud-Native Applications","description":"If you’re looking to develop native applications in Kubernetes, this is your guide. Developers and AppOps administrators will learn how to build Kubernetes-native applications that interact directly with the API server to query or update the state of resources. AWS developer advocate Michael Hausenblas and Red Hat principal software engineer Stefan Schimanski explain the characteristics of these apps and show you how to program Kubernetes to build them. You’ll explore the basic building blocks of Kubernetes, including the client-go API library and custom resources. All you need to get started is a rudimentary understanding of development and system administration tools and practices, such as package management, the Go programming language, and Git. Walk through Kubernetes API basics and dive into the server’s inner structure Explore Kubernetes’s programming interface in Go, including Kubernetes API objects Learn about custom resources—the central extension tools used in the Kubernetes ecosystem Use tags to control Kubernetes code generators for custom resources Write custom controllers and operators and make them production ready Extend the Kubernetes API surface by implementing a custom API server","language":"en","currency":"USD","id":"1492047058","title":"Programming Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6VKjDwAAQBAJ&source=gbs_api","authors":["Michael Hausenblas","Stefan Schimanski"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wfnOBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Easy, Common-Sense Guide to Solving Real Problems with NoSQL The Mere Mortals ® tutorials have earned worldwide praise as the clearest, simplest way to master essential database technologies. Now, there’s one for today’s exciting new NoSQL databases. NoSQL for Mere Mortals guides you through solving real problems with NoSQL and achieving unprecedented scalability, cost efficiency, flexibility, and availability. Drawing on 20+ years of cutting-edge database experience, Dan Sullivan explains the advantages, use cases, and terminology associated with all four main categories of NoSQL databases: key-value, document, column family, and graph databases. For each, he introduces pragmatic best practices for building high-value applications. Through step-by-step examples, you’ll discover how to choose the right database for each task, and use it the right way. Coverage includes --Getting started: What NoSQL databases are, how they differ from relational databases, when to use them, and when not to Data management principles and design criteria: Essential knowledge for creating any database solution, NoSQL or relational --Key-value databases: Gaining more utility from data structures --Document databases: Schemaless databases, normalization and denormalization, mutable documents, indexing, and design patterns --Column family databases: Google’s BigTable design, table design, indexing, partitioning, and Big Data Graph databases: Graph\/network modeling, design tips, query methods, and traps to avoid Whether you’re a database developer, data modeler, database user, or student, learning NoSQL can open up immense new opportunities. As thousands of database professionals already know, For Mere Mortals is the fastest, easiest route to mastery.","language":"en","currency":"USD","id":"0134029887","title":"NoSQL for Mere Mortals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wfnOBwAAQBAJ&source=gbs_api","authors":["Dan Sullivan"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Idi8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Learn to code in Python and kickstart your career in software development or data science","description":"More than just a Python guide for beginners, The Python Workshop takes you through the full spectrum of basic to advanced topics, equipping you with the skills you need to get started with data science and more. Filled with practical step-by-step examples and interactive exercises, you'll learn by doing as you grow your new Python skillset.","language":"en","currency":"USD","id":"1838984534","title":"The The Python Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Idi8DwAAQBAJ&source=gbs_api","authors":["Andrew Bird","Dr Lau Cher Han","Mario Corchero Jiménez","Graham Lee","Corey Wade"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EBrADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Design, deploy, and operate a complex system with multiple microservices using Docker and Kubernetes","description":"A step-by-step guide to building microservices using Python and Docker, along with managing and orchestrating them with Kubernetes Key Features Learn to use Docker containers to create, operate, and deploy your microservices Create workflows to manage independent deployments on coordinating services using CI and GitOps through GitHub, Travis CI, and Flux Develop a REST microservice in Python using the Flask framework and Postgres database Book Description Microservices architecture helps create complex systems with multiple, interconnected services that can be maintained by independent teams working in parallel. This book guides you on how to develop these complex systems with the help of containers. You’ll start by learning to design an efficient strategy for migrating a legacy monolithic system to microservices. You’ll build a RESTful microservice with Python and learn how to encapsulate the code for the services into a container using Docker. While developing the services, you’ll understand how to use tools such as GitHub and Travis CI to ensure continuous delivery (CD) and continuous integration (CI). As the systems become complex and grow in size, you’ll be introduced to Kubernetes and explore how to orchestrate a system of containers while managing multiple services. Next, you’ll configure Kubernetes clusters for production-ready environments and secure them for reliable deployments. In the concluding chapters, you’ll learn how to detect and debug critical problems with the help of logs and metrics. Finally, you’ll discover a variety of strategies for working with multiple teams dealing with different microservices for effective collaboration. By the end of this book, you’ll be able to build production-grade microservices as well as orchestrate a complex system of services using containers. What you will learn Discover how to design, test, and operate scalable microservices Coordinate and deploy different services using Kubernetes Use Docker to construct scalable and manageable applications with microservices Understand how to monitor a complete system to ensure early detection of problems Become well versed with migrating from an existing monolithic system to a microservice one Use load balancing to ensure seamless operation between the old monolith and the new service Who this book is for This book is for developers, engineers, or software architects who are trying to move away from traditional approaches for building complex multi-service systems by adopting microservices and containers. Although familiarity with Python programming is assumed, no prior knowledge of Docker is required.","language":"en","currency":"USD","id":"1838822550","title":"Hands-On Docker for Microservices with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EBrADwAAQBAJ&source=gbs_api","authors":["Jaime Buelta"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xBOjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19,"subtitle":"Get Up to Speed With Node.js in a Weekend","description":"Node.js is changing the way web apps are built. As Node.js apps are written in JavaScript, you can quickly and simply use your front-end skills to develop staggeringly fast, scalable real-time web applications. Read this book and, in a weekend, you’ll learn how to: Develop a complete working Node.js application - from start-to-finish Deploy your new application to a production server Scale your projects quickly and cheaply PLUS discover how to use Twitter Bootstrap, MongoDB and Back-bone.js to create fancy web apps, extend their storage, and dy-namically update them.","language":"en","currency":"USD","id":"1457192047","title":"Jump Start Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xBOjBgAAQBAJ&source=gbs_api","authors":["Don Nguyen"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4ZctAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.48,"subtitle":"What You Need to Know about Data Mining and Data-Analytic Thinking","description":"Written by renowned data science experts Foster Provost and Tom Fawcett, Data Science for Business introduces the fundamental principles of data science, and walks you through the \"data-analytic thinking\" necessary for extracting useful knowledge and business value from the data you collect. This guide also helps you understand the many data-mining techniques in use today. Based on an MBA course Provost has taught at New York University over the past ten years, Data Science for Business provides examples of real-world business problems to illustrate these principles. You’ll not only learn how to improve communication between business stakeholders and data scientists, but also how participate intelligently in your company’s data science projects. You’ll also discover how to think data-analytically, and fully appreciate how data science methods can support business decision-making. Understand how data science fits in your organization—and how you can use it for competitive advantage Treat data as a business asset that requires careful investment if you’re to gain real value Approach business problems data-analytically, using the data-mining process to gather good data in the most appropriate way Learn general concepts for actually extracting knowledge from data Apply data science principles when interviewing data science job candidates","language":"en","currency":"USD","id":"144937428X","title":"Data Science for Business","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4ZctAAAAQBAJ&source=gbs_api","authors":["Foster Provost","Tom Fawcett"]},{"pageCount":289,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OalPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Scalable Web Apps and RESTful Services","description":"Take a deep dive into web development using the Go programming language to build web apps and RESTful services to create reliable and efficient software. Web Development with Go provides Go language fundamentals and then moves on to advanced web development concepts and successful deployment of Go web apps to the cloud. Web Development with Go will teach you how to develop scalable real-world web apps, RESTful services, and backend systems with Go. The book starts off by covering Go programming language fundamentals as a prerequisite for web development. After a thorough understanding of the basics, the book delves into web development using the built-in package, net\/http. With each chapter you’ll be introduced to new concepts for gradually building a real-world web system. The book further shows you how to integrate Go with other technologies. For example, it provides an overview of using MongoDB as a means of persistent storage, and provides an end-to-end REST API sample as well. The book then moves on to demonstrate how to deploy web apps to the cloud using the Google Cloud platform. Web Development with Go provides: Fundamentals for building real-world web apps in Go Thorough coverage of prerequisites and practical code examples Demo web apps for attaining a deeper understanding of web development A reference REST API app which can be used to build scalable real-world backend services in Go A thorough demonstration of deploying web apps to the Cloud using the Google Cloud platform Go is a high-performance language while providing greater level of developer productivity, therefore Web Development with Go equips you with the necessary skills and knowledge required for effectively building robust and efficient web apps by leveraging the features of Go.","language":"en","currency":"USD","id":"1484210522","title":"Web Development with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OalPCwAAQBAJ&source=gbs_api","authors":["Shiju Varghese"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oPiT-V2eYTsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"As with all Packt books this guide will use practical examples to impart information to the reader. Getting Started with NoSQL is a great resource for someone starting with NoSQL and an indispensable guide for technology decision makers. It is assumed that you have a background in RDBMS modeling and SQL and have had exposure to at least one of the programming languages - Java or JavaScript.","language":"en","currency":"USD","id":"1849694990","title":"Getting Started with Nosql","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oPiT-V2eYTsC&source=gbs_api","authors":["Gaurav Vaish"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1xQqBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":"Real-World Skills for the CompTIA Cloud+ Certification and Beyond: Exam CV0-001","description":"Learn in-demand cloud computing skills from industry experts Deploying and Managing a Cloud Infrastructure is an excellent resource for IT professionals seeking to tap into the demand for cloud administrators. This book helps prepare candidates for the CompTIA Cloud+ Certification (CV0-001) cloud computing certification exam. Designed for IT professionals with 2-3 years of networking experience, this certification provides validation of your cloud infrastructure knowledge. With over 30 years of combined experience in cloud computing, the author team provides the latest expert perspectives on enterprise-level mobile computing, and covers the most essential topics for building and maintaining cloud-based systems, including: Understanding basic cloud-related computing concepts, terminology, and characteristics Identifying cloud delivery solutions and deploying new infrastructure Managing cloud technologies, services, and networks Monitoring hardware and software performance Featuring real-world examples and interactive exercises, Deploying and Managing Cloud Infrastructure delivers practical knowledge you can apply immediately. And, in addition, you also get access to a full set of electronic study tools including: Interactive Test Environment Electronic Flashcards Glossary of Key Terms Now is the time to learn the cloud computing skills you need to take that next step in your IT career.","language":"en","currency":"USD","id":"1118875583","title":"Deploying and Managing a Cloud Infrastructure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1xQqBgAAQBAJ&source=gbs_api","authors":["Abdul Salam","Zafar Gilani","Salman Ul Haq"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4EoZBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":null,"description":"If you've always wanted to get started with AngularJS, this is an essential guide designed to help you do exactly that. Start building applications immediately with the featured examples, and uncover a simpler approach to JavaScript web development. You will need some prior experience with HTML, CSS, and JavaScript to get started.","language":"en","currency":"USD","id":"1783553820","title":"AngularJS by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4EoZBwAAQBAJ&source=gbs_api","authors":["Chandermani"]},{"pageCount":138,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gxqxAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This step-by-step, practical guide filled with detailed steps and screenshots will help you discover the Phalcon extension and will enable you to build your blog application with Phalcon quickly and easily. If you are a PHP developer with some knowledge and experience of working with PHP and you want to develop stunning web applications easily and quickly, then this book is perfect for you. Learning how to use Phalcon is perhaps the best way to explore the MVC architecture.","language":"en","currency":"USD","id":"1783287683","title":"Getting Started with Phalcon","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gxqxAgAAQBAJ&source=gbs_api","authors":["Stephan A. Miller"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iftUDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":"Interfacing to the Real World with Embedded Linux","description":"Expand Raspberry Pi capabilities with fundamental engineering principles Exploring Raspberry Pi is the innovators guide to bringing Raspberry Pi to life. This book favors engineering principles over a 'recipe' approach to give you the skills you need to design and build your own projects. You'll understand the fundamental principles in a way that transfers to any type of electronics, electronic modules, or external peripherals, using a \"learning by doing\" approach that caters to both beginners and experts. The book begins with basic Linux and programming skills, and helps you stock your inventory with common parts and supplies. Next, you'll learn how to make parts work together to achieve the goals of your project, no matter what type of components you use. The companion website provides a full repository that structures all of the code and scripts, along with links to video tutorials and supplementary content that takes you deeper into your project. The Raspberry Pi's most famous feature is its adaptability. It can be used for thousands of electronic applications, and using the Linux OS expands the functionality even more. This book helps you get the most from your Raspberry Pi, but it also gives you the fundamental engineering skills you need to incorporate any electronics into any project. Develop the Linux and programming skills you need to build basic applications Build your inventory of parts so you can always \"make it work\" Understand interfacing, controlling, and communicating with almost any component Explore advanced applications with video, audio, real-world interactions, and more Be free to adapt and create with Exploring Raspberry Pi.","language":"en","currency":"USD","id":"1119188709","title":"Exploring Raspberry Pi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iftUDAAAQBAJ&source=gbs_api","authors":["Derek Molloy"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LebtAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Paradigm Over Syntax","description":"If you’re familiar with functional programming basics and want to gain a much deeper understanding, this in-depth guide takes you beyond syntax and demonstrates how you need to think in a new way. Software architect Neal Ford shows intermediate to advanced developers how functional coding allows you to step back a level of abstraction so you can see your programming problem with greater clarity. Each chapter shows you various examples of functional thinking, using numerous code examples from Java 8 and other JVM languages that include functional capabilities. This book may bend your mind, but you’ll come away with a much better grasp of functional programming concepts. Understand why many imperative languages are adding functional capabilities Compare functional and imperative solutions to common problems Examine ways to cede control of routine chores to the runtime Learn how memoization and laziness eliminate hand-crafted solutions Explore functional approaches to design patterns and code reuse View real-world examples of functional thinking with Java 8, and in functional architectures and web frameworks Learn the pros and cons of living in a paradigmatically richer world If you’re new to functional programming, check out Josh Backfield’s book Becoming Functional.","language":"en","currency":"USD","id":"1449365477","title":"Functional Thinking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LebtAwAAQBAJ&source=gbs_api","authors":["Neal Ford"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OxKwBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"쉽게, 재미있게, 확실하게 배우는 실습형 입문서!","description":"지금 당장 스프링 4로 애플리케이션을 만들어 보자! 이 책은 스프링 프레임워크를 사용해 애플리케이션을 만드는 실습서입니다. 스프링 프레임워크의 모든 기능과 모듈을 사용해 애플리케이션을 만들면서 각각의 사용법뿐만 아니라 실무에서 효과적으로 적용할 수 있는 지식을 점진적으로 배울 수 있습니다. 이 책에서 다루는 기본 기술과 실전 개발 기술 [기본 기술] • 그레이들 도구를 이용한 의존성 관리와 빌드 • 프로그래밍으로 스프링 컨테이너와 빈을 설정하는 방법 • 의존성 주입에 애너테이션을 사용하는 방법 • 컬렉션과 커스텀 타입 사용 방법 • 빈 프로퍼티와 빈 라이프사이클 인터페이스를 커스터마이즈하고 설정하는 방법 • XML, 애너테이션, 그루비 빈 리더를 이용해 메타데이터를 다루는 방법 • 스프링 부트와 스프링 XD를 사용하는 방법 [실전 개발 기술] • 유닛 테스팅과 통합 테스팅 • 스프링을 이용한 JMS 메시지 전송과 수신 • 스프링과 RabbitMQ를 이용한 AMQP 메시지 전송과 수신 • 스프링에서 관점 지향 프로그래밍 활용 • JDBC와 NoSQL 데이터베이스를 이용한 스프링 프레임워크 통합 • 웹 애플리케이션 생성과 REST API 노출 • 국제화 • 소셜 기능 지원 • 이메일 사용과 태스크 스케줄링 • 스프링과 그루비와 같은 동적 언어 통합","language":"ko","currency":"USD","id":"8966188192","title":"스프링 4 코딩 공작소","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OxKwBAAAQBAJ&source=gbs_api","authors":["펠리페 구티에레즈"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=irZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Get up and running with the fundamentals and functionalities of seven of the most popular NoSQL databases","description":"A beginner's guide to get you up and running with Cassandra, DynamoDB, HBase, InfluxDB, MongoDB, Neo4j, and Redis Key Features Covers the basics of 7 NoSQL databases and how they are used in the enterprises Quick introduction to MongoDB, DynamoDB, Redis, Cassandra, Neo4j, InfluxDB, and HBase Includes effective techniques for database querying and management Book Description This is the golden age of open source NoSQL databases. With enterprises having to work with large amounts of unstructured data and moving away from expensive monolithic architecture, the adoption of NoSQL databases is rapidly increasing. Being familiar with the popular NoSQL databases and knowing how to use them is a must for budding DBAs and developers. This book introduces you to the different types of NoSQL databases and gets you started with seven of the most popular NoSQL databases used by enterprises today. We start off with a brief overview of what NoSQL databases are, followed by an explanation of why and when to use them. The book then covers the seven most popular databases in each of these categories: MongoDB, Amazon DynamoDB, Redis, HBase, Cassandra, InfluxDB, and Neo4j. The book doesn't go into too much detail about each database but teaches you enough to get started with them. By the end of this book, you will have a thorough understanding of the different NoSQL databases and their functionalities, empowering you to select and use the right database according to your needs. What you will learn Understand how MongoDB provides high-performance, high-availability, and automatic scaling Interact with your Neo4j instances via database queries, Python scripts, and Java application code Get familiar with common querying and programming methods to interact with Redis Study the different types of problems Cassandra can solve Work with HBase components to support common operations such as creating tables and reading\/writing data Discover data models and work with CRUD operations using DynamoDB Discover what makes InfluxDB a great choice for working with time-series data Who this book is for If you are a budding DBA or a developer who wants to get started with the fundamentals of NoSQL databases, this book is for you. Relational DBAs who want to get insights into the various offerings of popular NoSQL databases will also find this book to be very useful.","language":"en","currency":"USD","id":"1787127141","title":"Seven NoSQL Databases in a Week","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=irZTDwAAQBAJ&source=gbs_api","authors":["Xun (Brian) Wu","Sudarshan Kadambi","Devram Kandhare","Aaron Ploetz"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SWTNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Manage your own robust, inexpensive cybersecurity testing environment This hands-on guide shows clearly how to administer an effective cybersecurity testing lab using affordable technologies and cloud resources. Build Your Own Cybersecurity Testing Lab: Low-cost Solutions for Testing in Virtual and Cloud-based Environments fully explains multiple techniques for developing lab systems, including the use of Infrastructure-as-Code, meaning you can write programs to create your labs quickly, without manual steps that could lead to costly and frustrating mistakes. Written by a seasoned IT security professional and academic, this book offers complete coverage of cloud and virtual environments as well as physical networks and automation. Included with the book is access to videos that demystify difficult concepts. Inside, you will discover how to: • Gather network requirements and build your cybersecurity testing lab • Set up virtual machines and physical systems from inexpensive components • Select and configure the necessary operating systems • Gain remote access through SSH, RDP, and other remote access protocols • Efficiently isolate subnets with physical switches, routers, and VLANs • Analyze the vulnerabilities and challenges of cloud-based infrastructures • Handle implementation of systems on Amazon Web Services, Microsoft Azure, and Google Cloud Engine • Maximize consistency and repeatability using the latest automation tools","language":"en","currency":"USD","id":"1260458326","title":"Build Your Own Cybersecurity Testing Lab: Low-cost Solutions for Testing in Virtual and Cloud-based Environments","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SWTNDwAAQBAJ&source=gbs_api","authors":["Ric Messier"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SJHvCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"The Go Programming Language is the authoritative resource for any programmer who wants to learn Go. It shows how to write clear and idiomatic Go to solve real-world problems. The book does not assume prior knowledge of Go nor experience with any specific language, so you’ll find it accessible whether you’re most comfortable with JavaScript, Ruby, Python, Java, or C++. The first chapter is a tutorial on the basic concepts of Go, introduced through programs for file I\/O and text processing, simple graphics, and web clients and servers. Early chapters cover the structural elements of Go programs: syntax, control flow, data types, and the organization of a program into packages, files, and functions. The examples illustrate many packages from the standard library and show how to create new ones of your own. Later chapters explain the package mechanism in more detail, and how to build, test, and maintain projects using the go tool. The chapters on methods and interfaces introduce Go’s unconventional approach to object-oriented programming, in which methods can be declared on any type and interfaces are implicitly satisfied. They explain the key principles of encapsulation, composition, and substitutability using realistic examples. Two chapters on concurrency present in-depth approaches to this increasingly important topic. The first, which covers the basic mechanisms of goroutines and channels, illustrates the style known as communicating sequential processes for which Go is renowned. The second covers more traditional aspects of concurrency with shared variables. These chapters provide a solid foundation for programmers encountering concurrency for the first time. The final two chapters explore lower-level features of Go. One covers the art of metaprogramming using reflection. The other shows how to use the unsafe package to step outside the type system for special situations, and how to use the cgo tool to create Go bindings for C libraries. The book features hundreds of interesting and practical examples of well-written Go code that cover the whole language, its most important packages, and a wide range of applications. Each chapter has exercises to test your understanding and explore extensions and alternatives. Source code is freely available for download from http:\/\/gopl.io\/ and may be conveniently fetched, built, and installed using the go get command.","language":"en","currency":"USD","id":"0134190564","title":"The Go Programming Language","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SJHvCgAAQBAJ&source=gbs_api","authors":["Alan A. A. Donovan","Brian W. Kernighan"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WUM1CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"A comprehensive guide to AngularJS, Google's open-sourceclient-side framework for app development. Most of the existing guides to AngularJS struggle to providesimple and understandable explanations for more advanced concepts.As a result, some developers who understand all the basic conceptsof AngularJS struggle when it comes to building more complexreal-world applications. Professional AngularJS provides athorough understanding of AngularJS, covering everything from basicconcepts, such as directives and data binding, to more advancedconcepts like transclusion, build systems, and automatedintegration testing. In addition to explaining the features ofAngularJS, this book distills real-world experience on how thesefeatures fit together to enable teams to work together moreeffectively in building extraordinary apps. Offers a more thorough and comprehensive approach toAngularJS Includes pointers to other advanced topics Lets you build a simple application from scratch, explainingbasic building blocks along the way for quick hands-onlearning","language":"en","currency":"USD","id":"1118832086","title":"Professional AngularJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WUM1CAAAQBAJ&source=gbs_api","authors":["Valeri Karpov","Diego Netto"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BEcj5im1i4wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Cross-Platform Mobile Development for Android and iPhone","description":"Gain hands-on experience with the amazing PhoneGap library, using the practical recipes in this handy guide. With these solutions, you can enable your mobile web apps to interact with device-specific features such as the accelerometer, GPS, camera, and address book. Learn how to use your knowledge of HTML, CSS, and JavaScript to build full mobile apps for iOS, Android, and several other platforms without rewriting apps in the native platform language. Each recipe includes sample code you can use in your project right away, as well as a discussion of why the solution works. Add functionality that’s available only on a certain device or platform Retrieve the device’s current GPS location and place a marker on a map Create and save a new contact or edit an existing contact in the address book Take pictures with the camera or select one of the user’s existing photos Upload a file from the local device to an external server Allow the device to record audio or video through your app Enable your application to save files locally","language":"en","currency":"USD","id":"1449334407","title":"20 Recipes for Programming PhoneGap","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BEcj5im1i4wC&source=gbs_api","authors":["Jamie Munro"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fd9YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build light weight, scalable, and faster web applications with the power of JSON, 2nd Edition","description":"Use JSON for building web applications with technologies like HTML, JavaScript, Angular, Node.js, Hapi.js, Kafka, socket.io, MongoDB, Gulp.js, and handlebar.js, and others formats like GEOJSON, JSON-LD, MessagePack, and BSON. Key Features Use JSON with trending technologies like Angular, Hapi.js, MongoDB, Kafka, and Socket.io Debug, validate, and format JSON using developer toolkits, JSONLint, and JSON Editor Online Explore other JSON formats like GeoJSON, JSON-LD, BSON, and MessagePack Book Description JSON is an established and standard format used to exchange data. This book shows how JSON plays different roles in full web development through examples. By the end of this book, you'll have a new perspective on providing solutions for your applications and handling their complexities. After establishing a strong basic foundation with JSON, you'll learn to build frontend apps by creating a carousel. Next, you'll learn to implement JSON with Angular 5, Node.js, template embedding, and composer.json in PHP. This book will also help you implement Hapi.js (known for its JSON-configurable architecture) for server-side scripting. You'll learn to implement JSON for real-time apps using Kafka, as well as how to implement JSON for a task runner, and for MongoDB BSON storage. The book ends with some case studies on JSON formats to help you sharpen your creativity by exploring futuristic JSON implementations. By the end of the book, you'll be up and running with all the essential features of JSON and JavaScript and able to build fast, scalable, and efficient web applications. What you will learn Use JSON to store metadata for dependency managers, package managers, configuration managers, and metadata stores Handle asynchronous behavior in applications using callbacks, promises, generators, and async-await functions Use JSON for Angular 5, Node.js, Gulp.js, and Hapi.js Implement JSON as BSON in MongoDB Make use of JSON in developing automation scripts Implement JSON for realtime using socket.io and distributed systems using Kafka Who this book is for If you’re a web developer with a basic understanding of JavaScript and want to write JSON data, integrate it with RESTful APIs to create faster and scalable applications, this book is for you.","language":"en","currency":"USD","id":"1788628764","title":"JavaScript and JSON Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fd9YDwAAQBAJ&source=gbs_api","authors":["Sai S Sriparasa","Bruno Joseph D'mello"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ujTcCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.95,"subtitle":"Applying the Industry Standard on Data Model Quality","description":"Data models are the main medium used to communicate data requirements from business to IT, and within IT from analysts, modelers, and architects, to database designers and developers. Therefore it’s essential to get the data model right. But how do you determine right? That’s where the Data Model Scorecard® comes in. The Data Model Scorecard is a data model quality scoring tool containing ten categories aimed at improving the quality of your organization’s data models. Many of my consulting assignments are dedicated to applying the Data Model Scorecard to my client’s data models – I will show you how to apply the Scorecard in this book. This book, written for people who build, use, or review data models, contains the Data Model Scorecard template and an explanation along with many examples of each of the ten Scorecard categories. There are three sections: In Section I, Data Modeling and the Need for Validation, receive a short data modeling primer in Chapter 1, understand why it is important to get the data model right in Chapter 2, and learn about the Data Model Scorecard in Chapter 3. In Section II, Data Model Scorecard Categories, we will explain each of the ten categories of the Data Model Scorecard. There are ten chapters in this section, each chapter dedicated to a specific Scorecard category: · Chapter 4: Correctness · Chapter 5: Completeness · Chapter 6: Scheme · Chapter 7: Structure · Chapter 8: Abstraction · Chapter 9: Standards · Chapter 10: Readability · Chapter 11: Definitions · Chapter 12: Consistency · Chapter 13: Data In Section III, Validating Data Models, we will prepare for the model review (Chapter 14), cover tips to help during the model review (Chapter 15), and then review a data model based upon an actual project (Chapter 16).","language":"en","currency":"USD","id":"1634620844","title":"Data Model Scorecard","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ujTcCgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zITUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.95,"subtitle":null,"description":"Creating a precise diagram of business terms within your projects is a simple yet powerful communication tool for project managers, data governance professionals, and business analysts. Similar to how the Rosetta Stone provided a communication tool across multiple languages, the Rosedata Stone provides a communication tool across business languages. The Rosedata Stone, called the Business Terms Model (BTM) or the Conceptual Data Model, displays the achievement of a Common Business Language of terms for a particular business initiative. With more and more data being created and used, combined with intense competition, strict regulations, and rapid-spread social media, the financial, liability, and credibility stakes have never been higher and therefore the need for a Common Business Language has never been greater. Appreciate the power of the BTM and apply the steps to build a BTM over the book’s five chapters: Challenges. Explore how a Common Business Language is more important than ever with technologies like the Cloud and NoSQL, and Regulations such as the GDPR. Needs. Identify scope and plan precise, minimal visuals that will capture the Common Business Language. Solution. Meet the BTM and its components, along with the variations of relational and dimensional BTMs. Experience how several data modeling tools display the BTM, including CaseTalk, ER\/Studio, erwin DM, and Hackolade. Construction. Build operational (relational) and analytics (dimensional) BTMs for a bakery chain. Practice. Reinforce BTM concepts and build BTMs for two of your own initiatives alongside a real example.","language":"en","currency":"USD","id":"163462775X","title":"The Rosedata Stone: Achieving a Common Business Language using the Business Terms Model","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zITUDwAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=91CH2q7bR2IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"A Concise Guide to Mastering JavaScript","description":"If you want to significantly expand your web development skills beyond PHP, this practical, hands-on book teaches you ECMAScript—the core JavaScript language—from the ground up. You’ll discover some similarities between JavaScript and PHP, such as conditions and loops, but the primary focus is on JavaScript’s unique object creation, classes, prototypes, and inheritance. JavaScript knowledge is essential for working with today’s Web, whether you’re building applications for the client, the server, or for mobile use—and your PHP experience gives you a head start. This book will help you become fluent with JavaScript quickly, and then serve as a handy reference once you start coding. Explore JavaScript syntax, including variables, arrays, loops, and conditions Learn how functions are important in JavaScript—and why they’re actually objects Delve into JavaScript’s object-oriented features, including prototypes, code reuse, and inheritance Examine the built-in API and explore its global functions, properties, and objects Learn about updates in ECMAScript5, the latest version of the standard Use common design patterns to organize your code in large applications","language":"en","currency":"USD","id":"1449370314","title":"JavaScript for PHP Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=91CH2q7bR2IC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":706,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NPbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"Master the World's Most-Used Programming Language","description":"For web developers and other programmers interested in using JavaScript, this bestselling book provides the most comprehensive JavaScript material on the market. The seventh edition represents a significant update, with new information for ECMAScript 2020, and new chapters on language-specific features. JavaScript: The Definitive Guide is ideal for experienced programmers who want to learn the programming language of the web, and for current JavaScript programmers who want to master it.","language":"en","currency":"USD","id":"1491951982","title":"JavaScript: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NPbkDwAAQBAJ&source=gbs_api","authors":["David Flanagan"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G88GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at web developers who are familiar with frontend technologies like JavaScript, HTML, and CSS, and modern tools like Bower, Yeoman, and Grunt.","language":"en","currency":"USD","id":"1783552107","title":"Learning Single-page Web Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G88GBgAAQBAJ&source=gbs_api","authors":["Fernando Monteiro"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OIQgR_PfmksC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Faster, Smarter Web Development","description":"There's no need to reinvent the wheel every time you run into a problem with ASP.NET's Model-View-Controller (MVC) framework. This concise cookbook provides recipes to help you solve tasks many web developers encounter every day. Each recipe includes the C# code you need, along with a complete working example of how to implement the solution. Learn practical techniques for applying user authentication, providing faster page reloads, validating user data, filtering search results, and many other issues related to MVC3 development. These recipes help you: Restrict access to views with password protection Allow users to upload and save a file to your website Implement AJAX to allow users to see updated content quickly Validate form input to ensure the data you capture is what you expect Create thumbnails to preview images rather than view them full-size Give your web application the ability to change languages Use CAPTCHA to prevent automated programs from completing forms Make URLs more user- and search-engine-friendly with the MapRoute function","language":"en","currency":"USD","id":"1449317650","title":"20 Recipes for Programming MVC 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OIQgR_PfmksC&source=gbs_api","authors":["Jamie Munro"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rhijBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":null,"description":"Learn JavaScript from scratch! Packed with numerous examples, JavaScript: Novice to Ninja is a fun, step-by-step and comprehensive introduction to development in JavaScript. Discover how to use JavaScript to solve real-world problems, build smarter forms, track user events, and design eye-catching animations. Learn JavaScript's built-in functions, methods, and properties. Use JavaScript to validate form entries and interact with your users. Understand how to respond to user events and add interactivity to your applications. Create animations that bring your web site to life. Start programming using the DOM And much more!","language":"en","currency":"USD","id":"1457192632","title":"JavaScript: Novice to Ninja","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rhijBgAAQBAJ&source=gbs_api","authors":["Darren Jones"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]}]