[{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SJHvCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"The Go Programming Language is the authoritative resource for any programmer who wants to learn Go. It shows how to write clear and idiomatic Go to solve real-world problems. The book does not assume prior knowledge of Go nor experience with any specific language, so you’ll find it accessible whether you’re most comfortable with JavaScript, Ruby, Python, Java, or C++. The first chapter is a tutorial on the basic concepts of Go, introduced through programs for file I\/O and text processing, simple graphics, and web clients and servers. Early chapters cover the structural elements of Go programs: syntax, control flow, data types, and the organization of a program into packages, files, and functions. The examples illustrate many packages from the standard library and show how to create new ones of your own. Later chapters explain the package mechanism in more detail, and how to build, test, and maintain projects using the go tool. The chapters on methods and interfaces introduce Go’s unconventional approach to object-oriented programming, in which methods can be declared on any type and interfaces are implicitly satisfied. They explain the key principles of encapsulation, composition, and substitutability using realistic examples. Two chapters on concurrency present in-depth approaches to this increasingly important topic. The first, which covers the basic mechanisms of goroutines and channels, illustrates the style known as communicating sequential processes for which Go is renowned. The second covers more traditional aspects of concurrency with shared variables. These chapters provide a solid foundation for programmers encountering concurrency for the first time. The final two chapters explore lower-level features of Go. One covers the art of metaprogramming using reflection. The other shows how to use the unsafe package to step outside the type system for special situations, and how to use the cgo tool to create Go bindings for C libraries. The book features hundreds of interesting and practical examples of well-written Go code that cover the whole language, its most important packages, and a wide range of applications. Each chapter has exercises to test your understanding and explore extensions and alternatives. Source code is freely available for download from http:\/\/gopl.io\/ and may be conveniently fetched, built, and installed using the go get command.","language":"en","currency":"USD","id":"0134190564","title":"The Go Programming Language","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SJHvCgAAQBAJ&source=gbs_api","authors":["Alan A. A. Donovan","Brian W. Kernighan"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WUM1CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"A comprehensive guide to AngularJS, Google's open-sourceclient-side framework for app development. Most of the existing guides to AngularJS struggle to providesimple and understandable explanations for more advanced concepts.As a result, some developers who understand all the basic conceptsof AngularJS struggle when it comes to building more complexreal-world applications. Professional AngularJS provides athorough understanding of AngularJS, covering everything from basicconcepts, such as directives and data binding, to more advancedconcepts like transclusion, build systems, and automatedintegration testing. In addition to explaining the features ofAngularJS, this book distills real-world experience on how thesefeatures fit together to enable teams to work together moreeffectively in building extraordinary apps. Offers a more thorough and comprehensive approach toAngularJS Includes pointers to other advanced topics Lets you build a simple application from scratch, explainingbasic building blocks along the way for quick hands-onlearning","language":"en","currency":"USD","id":"1118832086","title":"Professional AngularJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WUM1CAAAQBAJ&source=gbs_api","authors":["Valeri Karpov","Diego Netto"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_i6bDeoCQzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Handbook of Agile Software Craftsmanship","description":"Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it. What kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code–of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"en","currency":"USD","id":"0136083250","title":"Clean Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_i6bDeoCQzsC&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BEcj5im1i4wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Cross-Platform Mobile Development for Android and iPhone","description":"Gain hands-on experience with the amazing PhoneGap library, using the practical recipes in this handy guide. With these solutions, you can enable your mobile web apps to interact with device-specific features such as the accelerometer, GPS, camera, and address book. Learn how to use your knowledge of HTML, CSS, and JavaScript to build full mobile apps for iOS, Android, and several other platforms without rewriting apps in the native platform language. Each recipe includes sample code you can use in your project right away, as well as a discussion of why the solution works. Add functionality that’s available only on a certain device or platform Retrieve the device’s current GPS location and place a marker on a map Create and save a new contact or edit an existing contact in the address book Take pictures with the camera or select one of the user’s existing photos Upload a file from the local device to an external server Allow the device to record audio or video through your app Enable your application to save files locally","language":"en","currency":"USD","id":"1449334407","title":"20 Recipes for Programming PhoneGap","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BEcj5im1i4wC&source=gbs_api","authors":["Jamie Munro"]},{"pageCount":145,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3MrBDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A practical introduction to KeystoneJS using a real-world project","description":"Learn how to develop a complete and robust Node, express.js and MongoDB-based web application and mobile application backend quickly using KeystoneJS. You’ll learn how KeystoneJS makes complicated things simple, without limiting the power or flexibility of node.js or the frameworks it is built on. Beginning KeystoneJS shows you how to build database-driven websites, applications, and APIs, all built upon Express, the defacto web server for Node.js that uses MongoDB as its storage backend. What You Will Learn Discover the setup and architecture of the KeystoneJS framework. See how easy it is to extend KeystoneJS Understand the custom types and fields provided out of the box Write clean markup and create templates using Swig Use the powerful editing options in the framework's responsive dashboard Who This Book Is For Technical and non-technical people who would like to build applications quickly to leverage structured data to improve productivity.","language":"en","currency":"USD","id":"1484225473","title":"Beginning KeystoneJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3MrBDQAAQBAJ&source=gbs_api","authors":["Manikanta Panati"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ujTcCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.95,"subtitle":"Applying the Industry Standard on Data Model Quality","description":"Data models are the main medium used to communicate data requirements from business to IT, and within IT from analysts, modelers, and architects, to database designers and developers. Therefore it’s essential to get the data model right. But how do you determine right? That’s where the Data Model Scorecard® comes in. The Data Model Scorecard is a data model quality scoring tool containing ten categories aimed at improving the quality of your organization’s data models. Many of my consulting assignments are dedicated to applying the Data Model Scorecard to my client’s data models – I will show you how to apply the Scorecard in this book. This book, written for people who build, use, or review data models, contains the Data Model Scorecard template and an explanation along with many examples of each of the ten Scorecard categories. There are three sections: In Section I, Data Modeling and the Need for Validation, receive a short data modeling primer in Chapter 1, understand why it is important to get the data model right in Chapter 2, and learn about the Data Model Scorecard in Chapter 3. In Section II, Data Model Scorecard Categories, we will explain each of the ten categories of the Data Model Scorecard. There are ten chapters in this section, each chapter dedicated to a specific Scorecard category: · Chapter 4: Correctness · Chapter 5: Completeness · Chapter 6: Scheme · Chapter 7: Structure · Chapter 8: Abstraction · Chapter 9: Standards · Chapter 10: Readability · Chapter 11: Definitions · Chapter 12: Consistency · Chapter 13: Data In Section III, Validating Data Models, we will prepare for the model review (Chapter 14), cover tips to help during the model review (Chapter 15), and then review a data model based upon an actual project (Chapter 16).","language":"en","currency":"USD","id":"1634620844","title":"Data Model Scorecard","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ujTcCgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zITUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.95,"subtitle":null,"description":"Creating a precise diagram of business terms within your projects is a simple yet powerful communication tool for project managers, data governance professionals, and business analysts. Similar to how the Rosetta Stone provided a communication tool across multiple languages, the Rosedata Stone provides a communication tool across business languages. The Rosedata Stone, called the Business Terms Model (BTM) or the Conceptual Data Model, displays the achievement of a Common Business Language of terms for a particular business initiative. With more and more data being created and used, combined with intense competition, strict regulations, and rapid-spread social media, the financial, liability, and credibility stakes have never been higher and therefore the need for a Common Business Language has never been greater. Appreciate the power of the BTM and apply the steps to build a BTM over the book’s five chapters: Challenges. Explore how a Common Business Language is more important than ever with technologies like the Cloud and NoSQL, and Regulations such as the GDPR. Needs. Identify scope and plan precise, minimal visuals that will capture the Common Business Language. Solution. Meet the BTM and its components, along with the variations of relational and dimensional BTMs. Experience how several data modeling tools display the BTM, including CaseTalk, ER\/Studio, erwin DM, and Hackolade. Construction. Build operational (relational) and analytics (dimensional) BTMs for a bakery chain. Practice. Reinforce BTM concepts and build BTMs for two of your own initiatives alongside a real example.","language":"en","currency":"USD","id":"163462775X","title":"The Rosedata Stone: Achieving a Common Business Language using the Business Terms Model","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zITUDwAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=91CH2q7bR2IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"A Concise Guide to Mastering JavaScript","description":"If you want to significantly expand your web development skills beyond PHP, this practical, hands-on book teaches you ECMAScript—the core JavaScript language—from the ground up. You’ll discover some similarities between JavaScript and PHP, such as conditions and loops, but the primary focus is on JavaScript’s unique object creation, classes, prototypes, and inheritance. JavaScript knowledge is essential for working with today’s Web, whether you’re building applications for the client, the server, or for mobile use—and your PHP experience gives you a head start. This book will help you become fluent with JavaScript quickly, and then serve as a handy reference once you start coding. Explore JavaScript syntax, including variables, arrays, loops, and conditions Learn how functions are important in JavaScript—and why they’re actually objects Delve into JavaScript’s object-oriented features, including prototypes, code reuse, and inheritance Examine the built-in API and explore its global functions, properties, and objects Learn about updates in ECMAScript5, the latest version of the standard Use common design patterns to organize your code in large applications","language":"en","currency":"USD","id":"1449370314","title":"JavaScript for PHP Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=91CH2q7bR2IC&source=gbs_api","authors":["Stoyan Stefanov"]},{"pageCount":706,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NPbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"Master the World's Most-Used Programming Language","description":"For web developers and other programmers interested in using JavaScript, this bestselling book provides the most comprehensive JavaScript material on the market. The seventh edition represents a significant update, with new information for ECMAScript 2020, and new chapters on language-specific features. JavaScript: The Definitive Guide is ideal for experienced programmers who want to learn the programming language of the web, and for current JavaScript programmers who want to master it.","language":"en","currency":"USD","id":"1491951982","title":"JavaScript: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NPbkDwAAQBAJ&source=gbs_api","authors":["David Flanagan"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G88GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at web developers who are familiar with frontend technologies like JavaScript, HTML, and CSS, and modern tools like Bower, Yeoman, and Grunt.","language":"en","currency":"USD","id":"1783552107","title":"Learning Single-page Web Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G88GBgAAQBAJ&source=gbs_api","authors":["Fernando Monteiro"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OIQgR_PfmksC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Faster, Smarter Web Development","description":"There's no need to reinvent the wheel every time you run into a problem with ASP.NET's Model-View-Controller (MVC) framework. This concise cookbook provides recipes to help you solve tasks many web developers encounter every day. Each recipe includes the C# code you need, along with a complete working example of how to implement the solution. Learn practical techniques for applying user authentication, providing faster page reloads, validating user data, filtering search results, and many other issues related to MVC3 development. These recipes help you: Restrict access to views with password protection Allow users to upload and save a file to your website Implement AJAX to allow users to see updated content quickly Validate form input to ensure the data you capture is what you expect Create thumbnails to preview images rather than view them full-size Give your web application the ability to change languages Use CAPTCHA to prevent automated programs from completing forms Make URLs more user- and search-engine-friendly with the MapRoute function","language":"en","currency":"USD","id":"1449317650","title":"20 Recipes for Programming MVC 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OIQgR_PfmksC&source=gbs_api","authors":["Jamie Munro"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xsZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.77,"subtitle":null,"description":"Cutting-edge techniques for finding and fixing critical security flaws Fortify your network and avert digital catastrophe with proven strategies from a team of security experts. Completely updated and featuring 13 new chapters, Gray Hat Hacking, The Ethical Hacker’s Handbook, Fifth Edition explains the enemy’s current weapons, skills, and tactics and offers field-tested remedies, case studies, and ready-to-try testing labs. Find out how hackers gain access, overtake network devices, script and inject malicious code, and plunder Web applications and browsers. Android-based exploits, reverse engineering techniques, and cyber law are thoroughly covered in this state-of-the-art resource. And the new topic of exploiting the Internet of things is introduced in this edition. •Build and launch spoofing exploits with Ettercap •Induce error conditions and crash software using fuzzers •Use advanced reverse engineering to exploit Windows and Linux software •Bypass Windows Access Control and memory protection schemes •Exploit web applications with Padding Oracle Attacks •Learn the use-after-free technique used in recent zero days •Hijack web browsers with advanced XSS attacks •Understand ransomware and how it takes control of your desktop •Dissect Android malware with JEB and DAD decompilers •Find one-day vulnerabilities with binary diffing •Exploit wireless systems with Software Defined Radios (SDR) •Exploit Internet of things devices •Dissect and exploit embedded devices •Understand bug bounty programs •Deploy next-generation honeypots •Dissect ATM malware and analyze common ATM attacks •Learn the business side of ethical hacking","language":"en","currency":"USD","id":"1260108422","title":"Gray Hat Hacking: The Ethical Hacker's Handbook, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xsZaDwAAQBAJ&source=gbs_api","authors":["Daniel Regalado","Shon Harris","Allen Harper","Chris Eagle","Jonathan Ness","Branko Spasojevic","Ryan Linn","Stephen Sims"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jTflCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Learn to process massive real-time data streams using Storm and Python—no Java required! About This Book Learn to use Apache Storm and the Python Petrel library to build distributed applications that process large streams of data Explore sample applications in real-time and analyze them in the popular NoSQL databases MongoDB and Redis Discover how to apply software development best practices to improve performance, productivity, and quality in your Storm projects Who This Book Is For This book is intended for Python developers who want to benefit from Storm's real-time data processing capabilities. If you are new to Python, you'll benefit from the attention to key supporting tools and techniques such as automated testing, virtual environments, and logging. If you're an experienced Python developer, you'll appreciate the thorough and detailed examples What You Will Learn Install Storm and learn about the prerequisites Get to know the components of a Storm topology and how to control the flow of data between them Ingest Twitter data directly into Storm Use Storm with MongoDB and Redis Build topologies and run them in Storm Use an interactive graphical debugger to debug your topology as it's running in Storm Test your topology components outside of Storm Configure your topology using YAML In Detail Big data is a trending concept that everyone wants to learn about. With its ability to process all kinds of data in real time, Storm is an important addition to your big data “bag of tricks.” At the same time, Python is one of the fastest-growing programming languages today. It has become a top choice for both data science and everyday application development. Together, Storm and Python enable you to build and deploy real-time big data applications quickly and easily. You will begin with some basic command tutorials to set up storm and learn about its configurations in detail. You will then go through the requirement scenarios to create a Storm cluster. Next, you'll be provided with an overview of Petrel, followed by an example of Twitter topology and persistence using Redis and MongoDB. Finally, you will build a production-quality Storm topology using development best practices. Style and approach This book takes an easy-to-follow and a practical approach to help you understand all the concepts related to Storm and Python.","language":"en","currency":"USD","id":"1784392871","title":"Building Python Real-Time Applications with Storm","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jTflCwAAQBAJ&source=gbs_api","authors":["Kartik Bhatnagar","Barry Hart"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S69PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"In this fast-paced book on the Docker open standards platform for developing, packaging and running portable distributed applications, Deepak Vorhadiscusses how to build, ship and run applications on any platform such as a PC, the cloud, data center or a virtual machine. He describes how to install and create Docker images. and the advantages off Docker containers.The remainder of the book is devoted to discussing using Docker with important software solutions. He begins by discussing using Docker with a traditional RDBMS using Oracle and MySQL. Next he moves on to NoSQL with chapter on MongoDB Cassandra, and Couchbase. Then he addresses the use of Docker in the Hadoop ecosystem with complete chapters on utilizing not only Hadoop, but Hive, HBase, Sqoop, Kafka, Solr and Spark. What You Will Learn How to install a Docker image How to create a Docker container How to run an Application in a Docker Container Use Docker with Apache Hadoop Ecosystem Use Docker with NoSQL Databases Use Docker with RDBMS Who This Book Is ForApache Hadoop Developers. Database developers. NoSQL Developers.","language":"en","currency":"USD","id":"1484218302","title":"Pro Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S69PCwAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":492,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dnteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Server-side development with Node 10 made easy, 4th Edition","description":"Create real-time applications using Node.js 10, Docker, MySQL, MongoDB, and Socket.IO with this practical guide and go beyond the developer's laptop to cover live deployment, including HTTPS and hardened security. Key Features Learn server-side JavaScript coding through the most up-to-date book on Node.js Explore the latest JavaScript features, and EcmaScript modules Walk through different stages of developing robust applications using Node.js 10 Book Description Node.js is a server-side JavaScript platform using an event-driven, non-blocking I\/O model allowing users to build fast and scalable data-intensive applications running in real time. This book gives you an excellent starting point, bringing you straight to the heart of developing web applications with Node.js. You will progress from a rudimentary knowledge of JavaScript and server-side development to being able to create, maintain, deploy and test your own Node.js application.You will understand the importance of transitioning to functions that return Promise objects, and the difference between fs, fs\/promises and fs-extra. With this book you'll learn how to use the HTTP Server and Client objects, data storage with both SQL and MongoDB databases, real-time applications with Socket.IO, mobile-first theming with Bootstrap, microservice deployment with Docker, authenticating against third-party services using OAuth, and use some well known tools to beef up security of Express 4.16 applications. What you will learn Install and use Node.js 10 for both development and deployment Use the Express 4.16 application framework Work with REST service development using the Restify framework Use data storage engines such as MySQL, SQLITE3, and MongoDB Use User authentication methods with OAuth2 Perform Real-time communication with the front-end using Socket.IO Implement Docker microservices in development, testing and deployment Perform unit testing with Mocha 5.x, and functional testing with Puppeteer 1.1.x Work with HTTPS using Let’s Encrypt, and application security with Helmet Who this book is for This book is for anybody looking for an alternative to the \"P\" languages (Perl, PHP, and Python), or anyone looking for a new paradigm of server-side application development. You should have at least a rudimentary understanding of JavaScript and web application development.","language":"en","currency":"USD","id":"1788627369","title":"Node.js Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dnteDwAAQBAJ&source=gbs_api","authors":["David Herron"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]},{"pageCount":344,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EE_VDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Building Cross-Platform Applications with GraphQL, React, React Native, and Electron","description":"JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications. In this practical book, new and experienced JavaScript developers will learn how to use this language to create APIs as well as web, mobile, and desktop applications. Author and engineering leader Adam D. Scott covers technologies such as Node.js, GraphQL, React, React Native, and Electron. Ideal for developers who want to build full stack applications and ambitious web development beginners looking to bootstrap a startup, this book shows you how to create a single CRUD-style application that will work across several platforms. Explore GraphQL’s simple process for querying data Learn about shared authentication for APIs, web apps, and native applications Build performant web applications with React and Styled Components Use React Native to write cross-platform applications for iOS and Android that compile to native code Learn how to write desktop applications with Electron","language":"en","currency":"USD","id":"1492046930","title":"JavaScript Everywhere","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EE_VDwAAQBAJ&source=gbs_api","authors":["Adam D. Scott"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.32,"subtitle":"A Craftsman's Guide to Software Structure and Design","description":"Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and\/or corrections as they become available.","language":"en","currency":"USD","id":"0134494326","title":"Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uGE1DwAAQBAJ&source=gbs_api","authors":["Robert C. Martin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YemUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Making Your JavaScript Applications Scale","description":"Any programmer working with a dynamically typed language will tell you how hard it is to scale to more lines of code and more engineers. That’s why Facebook, Google, and Microsoft invented gradual static type layers for their dynamically typed JavaScript and Python code. This practical book shows you how one such type layer, TypeScript, is unique among them: it makes programming fun with its powerful static type system. If you’re a programmer with intermediate JavaScript experience, author Boris Cherny will teach you how to master the TypeScript language. You’ll understand how TypeScript can help you eliminate bugs in your code and enable you to scale your code across more engineers than you could before. In this book, you’ll: Start with the basics: Learn about TypeScript’s different types and type operators, including what they’re for and how they’re used Explore advanced topics: Understand TypeScript’s sophisticated type system, including how to safely handle errors and build asynchronous programs Dive in hands-on: Use TypeScript with your favorite frontend and backend frameworks, migrate your existing JavaScript project to TypeScript, and run your TypeScript application in production","language":"en","currency":"USD","id":"1492037605","title":"Programming TypeScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YemUDwAAQBAJ&source=gbs_api","authors":["Boris Cherny"]},{"pageCount":489,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0uqjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39,"subtitle":null,"description":"Completely updated for Django 3.1 Django for Professionals takes your web development skills to the next level, teaching you how to build production-ready websites with Python and Django. Once you have learned the basics of Django there is a massive gap between building simple \"toy apps\" and what it takes to build a \"production-ready\" web application suitable for deployment to thousands or even millions of users. In the book you’ll learn how to: * Build a Bookstore website from scratch * Use Docker and PostgreSQL locally to mimic production settings * Implement advanced user registration with email * Write comprehensive tests * Adopt advanced security and performance improvements * Add search and file\/image uploads If you want to take advantage of all that Django has to offer, Django for Professionals is a comprehensive best practices guide to building and deploying modern websites.","language":"en","currency":"USD","id":"1081582162","title":"Django for Professionals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0uqjDwAAQBAJ&source=gbs_api","authors":["William S. Vincent"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7MmeyhTnqRkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"* Quick start to learning python—very example oriented approach * Book has its own Web site established by the author: http:\/\/diveintopython.org\/ Author is well known in the Open Source community and the book has a unique quick approach to learning an object oriented language.","language":"en","currency":"USD","id":"1430207000","title":"Dive Into Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7MmeyhTnqRkC&source=gbs_api","authors":["Mark Pilgrim"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Practically and deeply understand concurrency in Python to write efficient programs About This Book Build highly efficient, robust, and concurrent applications Work through practical examples that will help you address the challenges of writing concurrent code Improve the overall speed of execution in multiprocessor and multicore systems and keep them highly available Who This Book Is For This book is for Python developers who would like to get started with concurrent programming. Readers are expected to have a working knowledge of the Python language, as this book will build on these fundamentals concepts. What You Will Learn Explore the concept of threading and multiprocessing in Python Understand concurrency with threads Manage exceptions in child threads Handle the hardest part in a concurrent system — shared resources Build concurrent systems with Communicating Sequential Processes (CSP) Maintain all concurrent systems and master them Apply reactive programming to build concurrent systems Use GPU to solve specific problems In Detail Python is a very high level, general purpose language that is utilized heavily in fields such as data science and research, as well as being one of the top choices for general purpose programming for programmers around the world. It features a wide number of powerful, high and low-level libraries and frameworks that complement its delightful syntax and enable Python programmers to create. This book introduces some of the most popular libraries and frameworks and goes in-depth into how you can leverage these libraries for your own high-concurrent, highly-performant Python programs. We'll cover the fundamental concepts of concurrency needed to be able to write your own concurrent and parallel software systems in Python. The book will guide you down the path to mastering Python concurrency, giving you all the necessary hardware and theoretical knowledge. We'll cover concepts such as debugging and exception handling as well as some of the most popular libraries and frameworks that allow you to create event-driven and reactive systems. By the end of the book, you'll have learned the techniques to write incredibly efficient concurrent systems that follow best practices. Style and approach This easy-to-follow guide teaches you new practices and techniques to optimize your code, and then moves toward more advanced ways to effectively write efficient Python code. Small and simple practical examples will help you test the concepts yourself, and you will be able to easily adapt them for any application.","language":"en","currency":"USD","id":"178728316X","title":"Learning Concurrency in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hJZGDwAAQBAJ&source=gbs_api","authors":["Elliot Forbes"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EZUeBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is ideal for you if you're a developer experienced with the PHP or Java programming languages and have a basic understanding of using the command line.","language":"en","currency":"USD","id":"1783980974","title":"Learning OpenShift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EZUeBQAAQBAJ&source=gbs_api","authors":["Grant Shipley"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wPd_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Make use of Node.js to learn the development of a simple yet scalable cross-platform mobile application About This Book Use Node.js to satisfy the core backend requirements of modern apps, including user management, security, data access, and real-time data communication Build practical real-world mobile applications, which will give you the necessary knowledge to build your very own mobile solutions Step-by-step development of projects using Ionic Framework as the frontend and Node.js for the backend supported by a MongoDB database Who This Book Is For This book is intended for web developers of all levels of expertise who want to deep dive into cross-platform mobile application development without going through the pains of understanding the languages and native frameworks that form an integral part of developing for different mobile platforms. This book is also for you if you are a developer who wants to capitalize on the MobileFirst strategy and so are going to use JavaScript for your complete stack. What You Will Learn Develop an API from scratch Set up a MongoDB Database as part of your mobile application backend Deploy a cross-platform mobile application from the command line Incorporate features within your mobile application that use native phone features such as a gyroscope, GPS, and accelerometer Implement mobile applications that use web-enabled APIs Build a mobile application with real-time chat messaging features Develop a secure mobile application that is capable of functioning with real-time data In Detail Node.js is a massively popular JavaScript library that lets you use JavaScript to easily program scalable network applications and web services. People approaching Node.js for the first time are often attracted by its efficiency, scalability, and the fact that it's based on JavaScript, the language of the Web, which means that developers can use the same language to write backend code. Also, it's increasingly being seen as a \"modern\" replacement for PHP in web development, which relies on fast-paced data exchange. The growing community and the large amount of available modules makes Node.js one of the most attractive development environments. This book takes a step-wise and incremental approach toward developing cross-platform mobile technologies using existing web technologies. This will allow you to truly understand and become proficient in developing cross-platform mobile applications with Node.js, Ionic Framework, and MongoDB. The book starts off by introducing all the necessary requirements and knowledge to build a mobile application with a companion web service. It covers the ability to create an API from scratch and implement a comprehensive user database that will give you the opportunity to offer a mobile application with a personalized experience. Midway through the book, you will learn the basic processes to create a successful mobile application. You will also gain higher-level knowledge, allowing you to develop a functional and secure mobile application to ensure a seamless user experience for end users. Finally, the book ends with more advanced projects, which will bring together all the knowledge and expertise developed in the previous chapters to create a practical and functional mobile-application that has useful real-world features. Style and approach This book is an easy-to-follow guide that takes a step-wise approach in giving expertise and knowledge to help you truly understand what is needed to create a memorable user experience for end users. Each topic is placed in the context of the bigger picture, that is, to create cross-platform mobile applications using existing technologies.","language":"en","currency":"USD","id":"1782175040","title":"Learning Node.js for Mobile Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wPd_CwAAQBAJ&source=gbs_api","authors":["Stefan Buttigieg","Milorad Jevdjenic"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jzvcCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"New Opportunities for Connected Data","description":"Discover how graph databases can help you manage and query highly connected data. With this practical book, you’ll learn how to design and implement a graph database that brings the power of graphs to bear on a broad range of problem domains. Whether you want to speed up your response to user queries or build a database that can adapt as your business evolves, this book shows you how to apply the schema-free graph model to real-world problems. This second edition includes new code samples and diagrams, using the latest Neo4j syntax, as well as information on new functionality. Learn how different organizations are using graph databases to outperform their competitors. With this book’s data modeling, query, and code examples, you’ll quickly be able to implement your own solution. Model data with the Cypher query language and property graph model Learn best practices and common pitfalls when modeling with graphs Plan and implement a graph database solution in test-driven fashion Explore real-world examples to learn how and why organizations use a graph database Understand common patterns and components of graph database architecture Use analytical techniques and algorithms to mine graph database information","language":"en","currency":"USD","id":"1491930845","title":"Graph Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jzvcCQAAQBAJ&source=gbs_api","authors":["Ian Robinson","Jim Webber","Emil Eifrem"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PEFK3MuwBsIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"ElasticSearch is an open source search server built on Apache Lucene. It was built to provide a scalable search solution with built-in support for near real-time search and multi-tenancy.Jumping into the world of ElasticSearch by setting up your own custom cluster, this book will show you how to create a fast, scalable, and flexible search solution. By learning the ins-and-outs of data indexing and analysis, \"ElasticSearch Server\" will start you on your journey to mastering the powerful capabilities of ElasticSearch. With practical chapters covering how to search data, extend your search, and go deep into cluster administration and search analysis, this book is perfect for those new and experienced with search servers.In \"ElasticSearch Server\" you will learn how to revolutionize your website or application with faster, more accurate, and flexible search functionality. Starting with chapters on setting up your own ElasticSearch cluster and searching and extending your search parameters you will quickly be able to create a fast, scalable, and completely custom search solution.Building on your knowledge further you will learn about ElasticSearch's query API and become confident using powerful filtering and faceting capabilities. You will develop practical knowledge on how to make use of ElasticSearch's near real-time capabilities and support for multi-tenancy.Your journey then concludes with chapters that help you monitor and tune your ElasticSearch cluster as well as advanced topics such as shard allocation, gateway configuration, and the discovery module.","language":"en","currency":"USD","id":"1849518440","title":"Elasticsearch Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PEFK3MuwBsIC&source=gbs_api","authors":["Rafal Kuc","Marek Rogozinski"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Veb7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.If you are a .NET oriented web developer who is curious to find out what lies beyond the Microsoft provided frameworks, then this book is for you! It’s beneficial to have a good knowledge of C# and .NET, as well as a basic working knowledge of HTTP. If testability is important to you, and you’re looking for a lightweight, code focused approach to building web applications, this book offers you all the guidance that you will need.","language":"en","currency":"USD","id":"1783283920","title":"Instant Nancy Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Veb7AAAAQBAJ&source=gbs_api","authors":["Christian Horsdal"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GK7NBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for anyone who's worked with Clojure and wants to use it to start developing applications for the Web. Experience or familiarity with basic Clojure syntax is a must, and exposure to Leiningen (or other similar build tools such as Maven) would be helpful.","language":"en","currency":"USD","id":"1784394874","title":"Clojure Web Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GK7NBgAAQBAJ&source=gbs_api","authors":["Ryan Baldwin"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4hRp35fpqiwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Written by an expert HornetQ developer this guide develops an applicable example to accompany practical tutorials and screenshots. Readers will have no trouble applying what they've learnt to their own messaging needs, This book is intended both for first time users and readers who are already using the JBoss messaging system. Advanced features are explained and every chapter suggests further improvement, so the willing reader is challenged by increasing their knowledge in a practical and productive way.","language":"en","currency":"USD","id":"9781849518413","title":"HornetQ Messaging Developer's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4hRp35fpqiwC&source=gbs_api","authors":["Piero Giacomelli"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=levlBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Modeling Techniques in Predictive Analytics","description":"Master modern web and network data modeling: both theory and applications. In Web and Network Data Science, a top faculty member of Northwestern University’s prestigious analytics program presents the first fully-integrated treatment of both the business and academic elements of web and network modeling for predictive analytics. Some books in this field focus either entirely on business issues (e.g., Google Analytics and SEO); others are strictly academic (covering topics such as sociology, complexity theory, ecology, applied physics, and economics). This text gives today's managers and students what they really need: integrated coverage of concepts, principles, and theory in the context of real-world applications. Building on his pioneering Web Analytics course at Northwestern University, Thomas W. Miller covers usability testing, Web site performance, usage analysis, social media platforms, search engine optimization (SEO), and many other topics. He balances this practical coverage with accessible and up-to-date introductions to both social network analysis and network science, demonstrating how these disciplines can be used to solve real business problems.","language":"en","currency":"USD","id":"0133887642","title":"Web and Network Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=levlBQAAQBAJ&source=gbs_api","authors":["Thomas W. Miller"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A2dCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"A Practical Approach to RESTful Services using RabbitMQ, Eureka, Ribbon, Zuul and Cucumber","description":"Build a microservices architecture with Spring Boot, by evolving an application from a small monolith to an event-driven architecture composed of several services. This book follows an incremental approach to teach microservice structure, test-driven development, Eureka, Ribbon, Zuul, and end-to-end tests with Cucumber. Author Moises Macero follows a very pragmatic approach to explain the benefits of using this type of software architecture, instead of keeping you distracted with theoretical concepts. He covers some of the state-of-the-art techniques in computer programming, from a practical point of view. You’ll focus on what's important, starting with the minimum viable product but keeping the flexibility to evolve it. What You'll Learn Build microservices with Spring Boot Use event-driven architecture and messaging with RabbitMQ Create RESTful services with Spring Master service discovery with Eureka and load balancing with Ribbon Route requests with Zuul as your API gateway Write end-to-end rests for an event-driven architecture using Cucumber Carry out continuous integration and deployment Who This Book Is For Those with at least some prior experience with Java programming. Some prior exposure to Spring Boot recommended but not required.","language":"en","currency":"USD","id":"1484231651","title":"Learn Microservices with Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A2dCDwAAQBAJ&source=gbs_api","authors":["Moises Macero"]},{"pageCount":602,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WXTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Lessons Learned from Programming Over Time","description":"Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions","language":"en","currency":"USD","id":"1492082740","title":"Software Engineering at Google","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WXTTDwAAQBAJ&source=gbs_api","authors":["Titus Winters","Tom Manshreck","Hyrum Wright"]},{"pageCount":354,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FpifBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a web or a full-stack JavaScript developer who is interested in learning how to build modern web applications using the MEAN stack, this book is for you.","language":"en","currency":"USD","id":"1783983299","title":"MEAN Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FpifBAAAQBAJ&source=gbs_api","authors":["Amos Q. Haviv"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HW-5SZ1HKusC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Creating Applications for the 21st Century","description":"Your Hands-On Guide to Go, the Revolutionary New Language Designed for Concurrency, Multicore Hardware, and Programmer Convenience Today’s most exciting new programming language, Go, is designed from the ground up to help you easily leverage all the power of today’s multicore hardware. With this guide, pioneering Go programmer Mark Summerfield shows how to write code that takes full advantage of Go’s breakthrough features and idioms. Both a tutorial and a language reference, Programming in Go brings together all the knowledge you need to evaluate Go, think in Go, and write high-performance software with Go. Summerfield presents multiple idiom comparisons showing exactly how Go improves upon older languages, calling special attention to Go’s key innovations. Along the way, he explains everything from the absolute basics through Go’s lock-free channel-based concurrency and its flexible and unusual duck-typing type-safe approach to object-orientation. Throughout, Summerfield’s approach is thoroughly practical. Each chapter offers multiple live code examples designed to encourage experimentation and help you quickly develop mastery. Wherever possible, complete programs and packages are presented to provide realistic use cases, as well as exercises. Coverage includes Quickly getting and installing Go, and building and running Go programs Exploring Go’s syntax, features, and extensive standard library Programming Boolean values, expressions, and numeric types Creating, comparing, indexing, slicing, and formatting strings Understanding Go’s highly efficient built-in collection types: slices and maps Using Go as a procedural programming language Discovering Go’s unusual and flexible approach to object orientation Mastering Go’s unique, simple, and natural approach to fine-grained concurrency Reading and writing binary, text, JSON, and XML files Importing and using standard library packages, custom packages, and third-party packages Creating, documenting, unit testing, and benchmarking custom packages","language":"en","currency":"USD","id":"0132764091","title":"Programming in Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HW-5SZ1HKusC&source=gbs_api","authors":["Mark Summerfield"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AwpnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Your stepping stone to penetration testing","description":"Learn how to hack systems like black hat hackers and secure them like security experts Key Features Understand how computer systems work and their vulnerabilities Exploit weaknesses and hack into machines to test their security Learn how to secure systems from hackers Book Description This book starts with the basics of ethical hacking, how to practice hacking safely and legally, and how to install and interact with Kali Linux and the Linux terminal. You will explore network hacking, where you will see how to test the security of wired and wireless networks. You’ll also learn how to crack the password for any Wi-Fi network (whether it uses WEP, WPA, or WPA2) and spy on the connected devices. Moving on, you will discover how to gain access to remote computer systems using client-side and server-side attacks. You will also get the hang of post-exploitation techniques, including remotely controlling and interacting with the systems that you compromised. Towards the end of the book, you will be able to pick up web application hacking techniques. You'll see how to discover, exploit, and prevent a number of website vulnerabilities, such as XSS and SQL injections. The attacks covered are practical techniques that work against real systems and are purely for educational purposes. At the end of each section, you will learn how to detect, prevent, and secure systems from these attacks. What you will learn Understand ethical hacking and the different fields and types of hackers Set up a penetration testing lab to practice safe and legal hacking Explore Linux basics, commands, and how to interact with the terminal Access password-protected networks and spy on connected clients Use server and client-side attacks to hack and control remote computers Control a hacked system remotely and use it to hack other systems Discover, exploit, and prevent a number of web application vulnerabilities such as XSS and SQL injections Who this book is for Learning Ethical Hacking from Scratch is for anyone interested in learning how to hack and test the security of systems like professional hackers and security experts.","language":"en","currency":"USD","id":"1788624785","title":"Learn Ethical Hacking from Scratch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AwpnDwAAQBAJ&source=gbs_api","authors":["Zaid Sabih"]},{"pageCount":242,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kqy-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Data Science Fundamentals with Python","description":"Aspiring data science professionals can learn the Scikit-Learn library along with the fundamentals of machine learning with this book. The book combines the Anaconda Python distribution with the popular Scikit-Learn library to demonstrate a wide range of supervised and unsupervised machine learning algorithms. Care is taken to walk you through the principles of machine learning through clear examples written in Python that you can try out and experiment with at home on your own machine. All applied math and programming skills required to master the content are covered in this book. In-depth knowledge of object-oriented programming is not required as working and complete examples are provided and explained. Coding examples are in-depth and complex when necessary. They are also concise, accurate, and complete, and complement the machine learning concepts introduced. Working the examples helps to build the skills necessary to understand and apply complex machine learning algorithms. Hands-on Scikit-Learn for Machine Learning Applications is an excellent starting point for those pursuing a career in machine learning. Students of this book will learn the fundamentals that are a prerequisite to competency. Readers will be exposed to the Anaconda distribution of Python that is designed specifically for data science professionals, and will build skills in the popular Scikit-Learn library that underlies many machine learning applications in the world of Python. What You'll Learn Work with simple and complex datasets common to Scikit-Learn Manipulate data into vectors and matrices for algorithmic processing Become familiar with the Anaconda distribution used in data science Apply machine learning with Classifiers, Regressors, and Dimensionality Reduction Tune algorithms and find the best algorithms for each dataset Load data from and save to CSV, JSON, Numpy, and Pandas formats Who This Book Is For The aspiring data scientist yearning to break into machine learning through mastering the underlying fundamentals that are sometimes skipped over in the rush to be productive. Some knowledge of object-oriented programming and very basic applied linear algebra will make learning easier, although anyone can benefit from this book.","language":"en","currency":"USD","id":"1484253736","title":"Hands-on Scikit-Learn for Machine Learning Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kqy-DwAAQBAJ&source=gbs_api","authors":["David Paper"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.6,"subtitle":"The Good Parts","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","language":"en","currency":"USD","id":"0596554877","title":"JavaScript: The Good Parts","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PXa2bby0oQ0C&source=gbs_api","authors":["Douglas Crockford"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QtCTBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are a web developer who wants to learn more about developing applications in Flask and scale them with industry-standard practices, this is the book for you. This book will also act as a handy tool if you are aware of Flask's major extensions and want to make the best use of them. It is assumed that you have knowledge of Python and a basic understanding of Flask. If you are completely new to Flask, reading the book from the first chapter and going forward will help in getting acquainted with Flask as you go ahead.","language":"en","currency":"USD","id":"1783983418","title":"Flask Framework Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QtCTBQAAQBAJ&source=gbs_api","authors":["Shalabh Aggarwal"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8eZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the power of Python to collect, process, and mine deep insights from social media data About This Book Acquire data from various social media platforms such as Facebook, Twitter, YouTube, GitHub, and more Analyze and extract actionable insights from your social data using various Python tools A highly practical guide to conducting efficient social media analytics at scale Who This Book Is For If you are a programmer or a data analyst familiar with the Python programming language and want to perform analyses of your social data to acquire valuable business insights, this book is for you. The book does not assume any prior knowledge of any data analysis tool or process. What You Will Learn Understand the basics of social media mining Use PyMongo to clean, store, and access data in MongoDB Understand user reactions and emotion detection on Facebook Perform Twitter sentiment analysis and entity recognition using Python Analyze video and campaign performance on YouTube Mine popular trends on GitHub and predict the next big technology Extract conversational topics on public internet forums Analyze user interests on Pinterest Perform large-scale social media analytics on the cloud In Detail Social Media platforms such as Facebook, Twitter, Forums, Pinterest, and YouTube have become part of everyday life in a big way. However, these complex and noisy data streams pose a potent challenge to everyone when it comes to harnessing them properly and benefiting from them. This book will introduce you to the concept of social media analytics, and how you can leverage its capabilities to empower your business. Right from acquiring data from various social networking sources such as Twitter, Facebook, YouTube, Pinterest, and social forums, you will see how to clean data and make it ready for analytical operations using various Python APIs. This book explains how to structure the clean data obtained and store in MongoDB using PyMongo. You will also perform web scraping and visualize data using Scrappy and Beautifulsoup. Finally, you will be introduced to different techniques to perform analytics at scale for your social data on the cloud, using Python and Spark. By the end of this book, you will be able to utilize the power of Python to gain valuable insights from social media data and use them to enhance your business processes. Style and approach This book follows a step-by-step approach to teach readers the concepts of social media analytics using the Python programming language. To explain various data analysis processes, real-world datasets are used wherever required.","language":"en","currency":"USD","id":"1787126757","title":"Python Social Media Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8eZDDwAAQBAJ&source=gbs_api","authors":["Siddhartha Chatterjee","Michal Krystyanczuk"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AppGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build fast web applications for handling any kind of data","description":"Use the two popular web development stacks, Node.js and MongoDB, to build full-featured web applications About This Book Learn the new ECMAScript along with Node 8 and MongoDB to make your application more effective. Get the up-to-date information required to launch your first application prototype using the latest versions of Node.js and MongoDB. A practical guide with clear instructions to designing and developing a complete web application from start to finish using trending frameworks such as angular4 and hapi Who This Book Is For The book is designed for JavaScript developers of any skill level who want to get up-and-running using Node.js and MongoDB to build full-featured web applications. A basic understanding of JavaScript and HTML is the only prerequisite for this book. What You Will Learn Work with Node.js building blocks Write and configure a web server using Node.js powered by the Express.js framework Build dynamic HTML pages using the Handlebars template engine Persist application data using MongoDB and Mongoose ODM Test your code using automated testing tools such as the Mocha framework Automate test cases using Gulp Reduce your web development time by integrating third-party tools for web interaction. Deploy a development environment to the cloud using services such as Heroku, Amazon Web Services, and Microsoft Azure Explore single-page application frameworks to take your web applications to the next level In Detail Node.js builds fast, scalable network applications while MongoDB is the perfect fit as a high-performance, open source NoSQL database solution. The combination of these two technologies offers high performance and scalability and helps in building fast, scalable network applications. Together they provide the power for manage any form of data as well as speed of delivery. This book will help you to get these two technologies working together to build web applications quickly and easily, with effortless deployment to the cloud. You will also learn about angular 4, which consumes pure JSON APOIs from a hapi server. The book begins by setting up your development environment, running you through the steps necessary to get the main application server up-and-running. Then you will see how to use Node.js to connect to a MongoDB database and perform data manipulations. From here on, the book will take you through integration with third-party tools to interact with web apps. You will see how to use controllers and view models to generate reusable code that will reduce development time. Toward the end, the book supplies tests to properly execute your code and take your skills to the next level with the most popular frameworks for developing web applications. By the end of the book, you will have a running web application developed with MongoDB, Node.js, and some of the most powerful and popular frameworks. Style and approach A practical guide with clear instructions to designing and developing a complete web application from start to finish","language":"en","currency":"USD","id":"1788394771","title":"Web Development with MongoDB and Node","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AppGDwAAQBAJ&source=gbs_api","authors":["Bruno Joseph D'mello","Mithun Satheesh","Jason Krol"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=15lUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build six practical and instructive Node.js projects","description":"This is an advanced, practical guide to harnessing the power of Node.js by creating 6 full-scale real-world projects, from creating a chat application to an eLearning system. Key Features Develop scalable and lightweight applications using Node.js Learn how to interface Node.js with other popular technologies such as MongoDB, MySQL, and more Your companion to master the Node ecosystem through six real-world projects Book Description With its event-driven architecture and efficient web services capabilities, more and more companies are building their entire infrastructure around Node.js. Node has become a de facto part of web development that any serious developer needs to master. This book includes six Node.js projects that gradually increase in complexity. You'll start by building a simple web server and create a basic website. You will then move to create the login system, blog system, chat system, and e-learning system. By creating and following the example projects in this book, you’ll improve your Node.js skills through practical working projects, and you'll learn how to use Node.js with many other useful technologies, such as ExpressJS, Kickstart, and Heroku. What you will learn Create powerful applications using Node.js Build scalable and lightweight web applications Use the Express Framework to build web applications Understand the coding principles behind practical web applications Understand the concepts of network programming Use Node.js with other technologies including Kickstart and Heroku Use Node with database technologies Cassandra and MongoDB Who this book is for If you are a web developer or a student who wants to learn about Node.js in a hands-on manner, this book will be perfect for you. A basic understanding of HTML, JavaScript, and some front-end programming experience is required.","language":"en","currency":"USD","id":"1788295927","title":"Learn Node.js by Building 6 Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=15lUDwAAQBAJ&source=gbs_api","authors":["Eduonix Learning Solutions"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=25lUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Master Node.js by building real-world applications","description":"Takes you through creating your own API, building a full real-time web app, securing your Node systems, and practical applications of the latest Async and Await technologies. It maps out everything in a comprehensive, easy-to-follow package designed to get you up and running quickly. Key Features Entirely project-based and practical Explains the \"why\" of Node.js features, not just the \"how\", providing with a deep understanding and enabling you to easily apply concepts in your own applications Covers the full range of technologies around Node.js – npm, MongoDB, version control with Git, and many more Book Description Advanced Node.js Development is a practical, project-based book that provides you with all you need to progress as a Node.js developer. Node is a ubiquitous technology on the modern web, and an essential part of any web developer’s toolkit. If you're looking to create real-world Node applications, or you want to switch careers or launch a side-project to generate some extra income, then you're in the right place. This book was written around a single goal: turning you into a professional Node developer capable of developing, testing, and deploying real-world production applications. There's no better time to dive in. According to the 2018 Stack Overflow Survey, Node is in the top ten for back-end popularity and back-end salary. This book is built from the ground up around the latest version of Node.js (version 9.x.x). You'll be learning all the cutting-edge features available only in the latest software versions. This book delivers advanced skills that you need to become a professional Node developer. Along this journey you'll create your own API, you'll build a full real-time web app and create projects that apply the latest Async and Await technologies. Andrew Mead maps everything out for you in this book so that you can learn how to build powerful Node.js projects in a comprehensive, easy-to-follow package designed to get you up and running quickly. What you will learn Develop, test, and deploy real-world Node.js applications Master Node.js by building practical, working examples Use awesome third-party Node modules such as MongoDB, Mongoose, Socket.io, and Express Create real-time web applications Explore async and await in ES7 Who this book is for This book is for anyone looking to launch their own Node applications, switch careers, or freelance as a Node developer. You should have a basic understanding of JavaScript in order to follow this book. This book follows directly on from Learning Node.js Development, but more advanced readers can benefit from this book without having read the first part.","language":"en","currency":"USD","id":"1788394798","title":"Advanced Node.js Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=25lUDwAAQBAJ&source=gbs_api","authors":["Andrew Mead"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GpoKZncgCxsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 150 recipes to design and optimize large scale Apache Cassandra deployments.","language":"en","currency":"USD","id":"1849515131","title":"Cassandra High Performance Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GpoKZncgCxsC&source=gbs_api","authors":["Edward Capriolo"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BHs2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"A Hands-On Guide to Angular 2 and Angular 4","description":"Learning Angular, Second Edition A Hands-On Guide to Angular 2 and Angular 4 Learning Angular teaches modern application development with Angular 2 and Angular 4. It begins with the basics of Angular and the technologies and techniques used throughout the book, such as key features of TypeScript, newer ES6 syntax and concepts, and details about the tools needed to write professional Angular applications. The reader will next build an Angular application from scratch while learning about the primary pieces of an Angular application and see how they work together. Using lots of examples, the core parts of Angular will be introduced, such as Components, the Router, and Services. The book also covers techniques like server-side rendering and how to incrementally add Angular 2+ features to existing AngularJS applications. Finally, the reader will gain insight into advanced skills that should be part of any professional Angular developer’s toolkit such as testing, tooling options, and performance tuning. Understand how Angular is organized and learn best practices for designing Angular applications Quickly build Angular templates with built-in directives that enhance the user experience Bind UI elements to your data model, so changes to your model and UI occur automatically in tandem Define custom Angular directives that extend HTML Implement zoomable images, expandable lists, and other rich UI components Implement client-side services that interact with web servers Build dynamic browser views to provide even richer user interaction Create custom services you can easily reuse Implement rich UI components as custom Angular directives Contents at a Glance Introduction What is Angular Why Use Angular Who this Book is For How to Use this Book Getting the Source Code Chapter 1: Jumping into JavaScript Setting Up a JavaScript Development Environment Defining Variables Understanding JavaScript Data Types Using Operators Implementing Looping Creating Functions Understanding Variable Scope Using JavaScript Objects Manipulating Strings Working with Arrays Adding Error Handling Chapter 2: Jumping into TypeScript Learning the Different Types Understanding Interfaces Implementing Classes Implementing Modules Understanding Functions Chapter 3: Getting Started with Angular Why Angular? Understanding Angular Separation of Responsibilities Adding Angular to Your Environment Using the Angular CLI Creating a Basic Angular Application Chapter 4: Angular Components Component Configuration Building the Template Using Constructors Using External Templates Implementing Directives Chapter 5: Expressions Using Expressions Using Pipes Building a Custom Pipe Chapter 6: Data Binding Understanding Data Binding Interpolation Property Binding Attribute Binding Class Binding Style Binding Event Binding Two-Way Binding Chapter 7: Built-in Directives Understanding Directives Using Built-in Directives Structural Directives Attribute Directives Chapter 8: Custom Directives Creating a Custom Attribute Directive Creating a Custom Directive with a Component Chapter 9: Events and Change Detection Using Browser Events Emitting Custom Events Using Observables Chapter 10: Implementing Angular Services in Web Applications Understanding Angular Services Using the Built in Services Sending HTTP GET and PUT Requests with the http Service Implementing a Simple Mock Server Using the http Service Changing Views with the router Service Implementing a Router with a Navigation Bar Implementing a Router with Parameters Chapter 11: Creating Your Own Custom Angular Service Integrating Custom Services into Angular Applications Implementing a Simple Application That Uses a Constant Data Service Implementing a Data Transform Service Implementing a Variable Data Service Implementing a Service that Returns a Promise Implementing a Shared Service Chapter 12: Having Fun with Angular Implementing an Angular Application That Uses the Animation Service Implementing an Angular Application That Zooms in on Images Implementing an Angular Application That Enables Drag and Drop Implementing a Star Rating Angular Component","language":"en","currency":"USD","id":"0134577027","title":"Learning Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BHs2DwAAQBAJ&source=gbs_api","authors":["Brad Dayley","Brendan Dayley","Caleb Dayley"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CeTWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build, test, ship, and run containers with Docker and Kubernetes, 2nd Edition","description":"Explore the core functionality of containerizing your applications and making them production-ready Key Features Grasp basic to advanced Docker concepts with this comprehensive guide Get acquainted with Docker containers, Docker images, orchestrators, cloud integration, and networking Learn to simplify dependencies and deploy and test containers in production Book Description Containers enable you to package an application with all the components it needs, such as libraries and other dependencies, and ship it as one package. Docker containers have revolutionized the software supply chain in both small and large enterprises. Starting with an introduction to Docker fundamentals and setting up an environment to work with it, you’ll delve into concepts such as Docker containers, Docker images, and Docker Compose. As you progress, the book will help you explore deployment, orchestration, networking, and security. Finally, you’ll get to grips with Docker functionalities on public clouds such as Amazon Web Services (AWS), Azure, and Google Cloud Platform (GCP), and learn about Docker Enterprise Edition features. Additionally, you’ll also discover the benefits of increased security with the use of containers. By the end of this Docker book, you’ll be able to build, ship, and run a containerized, highly distributed application on Docker Swarm or Kubernetes, running on-premises or in the cloud. What you will learn Containerize your traditional or microservice-based applications Develop, modify, debug, and test an application running inside a container Share or ship your application as an immutable container image Build a Docker Swarm and a Kubernetes cluster in the cloud Run a highly distributed application using Docker Swarm or Kubernetes Update or rollback a distributed application with zero downtime Secure your applications with encapsulation, networks, and secrets Troubleshoot a containerized, highly distributed application in the cloud Who this book is for This book is for Linux professionals, system administrators, operations engineers, DevOps engineers, and developers or stakeholders who are interested in getting started with Docker from scratch. No prior experience with Docker containers is required. Users with a Linux system would be able to take full advantage of this book.","language":"en","currency":"USD","id":"1838641203","title":"Learn Docker – Fundamentals of Docker 19.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CeTWDwAAQBAJ&source=gbs_api","authors":["Gabriel N. Schenker"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vNNJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Hands-on techniques to implement enterprise analytics and machine learning using Hadoop, Spark, NoSQL and R","description":"Get command of your organizational Big Data using the power of data science and analytics Key Features A perfect companion to boost your Big Data storing, processing, analyzing skills to help you take informed business decisions Work with the best tools such as Apache Hadoop, R, Python, and Spark for NoSQL platforms to perform massive online analyses Get expert tips on statistical inference, machine learning, mathematical modeling, and data visualization for Big Data Book Description Big Data analytics relates to the strategies used by organizations to collect, organize and analyze large amounts of data to uncover valuable business insights that otherwise cannot be analyzed through traditional systems. Crafting an enterprise-scale cost-efficient Big Data and machine learning solution to uncover insights and value from your organization's data is a challenge. Today, with hundreds of new Big Data systems, machine learning packages and BI Tools, selecting the right combination of technologies is an even greater challenge. This book will help you do that. With the help of this guide, you will be able to bridge the gap between the theoretical world of technology with the practical ground reality of building corporate Big Data and data science platforms. You will get hands-on exposure to Hadoop and Spark, build machine learning dashboards using R and R Shiny, create web-based apps using NoSQL databases such as MongoDB and even learn how to write R code for neural networks. By the end of the book, you will have a very clear and concrete understanding of what Big Data analytics means, how it drives revenues for organizations, and how you can develop your own Big Data analytics solution using different tools and methods articulated in this book. What you will learn - Get a 360-degree view into the world of Big Data, data science and machine learning - Broad range of technical and business Big Data analytics topics that caters to the interests of the technical experts as well as corporate IT executives - Get hands-on experience with industry-standard Big Data and machine learning tools such as Hadoop, Spark, MongoDB, KDB+ and R - Create production-grade machine learning BI Dashboards using R and R Shiny with step-by-step instructions - Learn how to combine open-source Big Data, machine learning and BI Tools to create low-cost business analytics applications - Understand corporate strategies for successful Big Data and data science projects - Go beyond general-purpose analytics to develop cutting-edge Big Data applications using emerging technologies Who this book is for The book is intended for existing and aspiring Big Data professionals who wish to become the go-to person in their organization when it comes to Big Data architecture, analytics, and governance. While no prior knowledge of Big Data or related technologies is assumed, it will be helpful to have some programming experience.","language":"en","currency":"USD","id":"1783554401","title":"Practical Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vNNJDwAAQBAJ&source=gbs_api","authors":["Nataraj Dasgupta"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HnxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build web applications with MongoDB, Express.js, React, and Node","description":"Build web applications with MongoDB, ExpressJS, React, and Node Key Features Build applications with the MERN stack Work with each component of the MERN stack Become confident with MERN and ready for more! Book Description The MERN stack is a collection of great tools—MongoDB, Express.js, React, and Node—that provide a strong base for a developer to build easily maintainable web applications. With each of them a JavaScript or JavaScript-based technology, having a shared programming language means it takes less time to develop web applications. This book focuses on providing key tasks that can help you get started, learn, understand, and build full-stack web applications. It walks you through the process of installing all the requirements and project setup to build client-side React web applications, managing synchronous and asynchronous data flows with Redux, and building real-time web applications with Socket.IO, RESTful APIs, and other concepts. This book gives you practical and clear hands-on experience so you can begin building a full-stack MERN web application. Quick Start Guides are focused, shorter titles that provide a faster paced introduction to a technology. They are for people who don't need all the detail at this point in their learning curve. The presentation has been streamlined to concentrate on the things you really need to know. What you will learn Get started with the MERN stack Install Node.js and configure MongoDB Build RESTful APIs with Express.js and Mongoose Build real-time applications with Socket.IO Manage synchronous and asynchronous data flows with Redux Build web applications with React Who this book is for The book is for JavaScript developers who want to get stated with the MERN Stack.","language":"en","currency":"USD","id":"1787280047","title":"MERN Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HnxeDwAAQBAJ&source=gbs_api","authors":["Eddy Wilson"]},{"pageCount":446,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0NRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Over 150 recipes for high-performance database querying and administration","description":"Design and administer enterprise-grade MySQL 8 solutions Key Features Store, retrieve, and manipulate your data using the latest MySQL 8 features Practical recipes on effective administration in MySQL, with a focus on security, performance tuning, troubleshooting, and more Contains tips, tricks, and best practices for designing, developing, and administering your MySQL 8 database solution without any hassle Book Description MySQL is one of the most popular and widely used relational databases in the World today. The recently released MySQL 8 version promises to be better and more efficient than ever before. This book contains everything you need to know to be the go-to person in your organization when it comes to MySQL. Starting with a quick installation and configuration of your MySQL instance, the book quickly jumps into the querying aspects of MySQL. It shows you the newest improvements in MySQL 8 and gives you hands-on experience in managing high-transaction and real-time datasets. If you've already worked with MySQL before and are looking to migrate your application to MySQL 8, this book will also show you how to do that. The book also contains recipes on efficient MySQL administration, with tips on effective user management, data recovery, security, database monitoring, performance tuning, troubleshooting, and more. With quick solutions to common and not-so-common problems you might encounter while working with MySQL 8, the book contains practical tips and tricks to give you the edge over others in designing, developing, and administering your database effectively. What you will learn Install and configure your MySQL 8 instance without any hassle Get to grips with new features of MySQL 8 like CTE, Window functions and many more Perform backup tasks, recover data and set up various replication topologies for your database Maximize performance by using new features of MySQL 8 like descending indexes, controlling query optimizer and resource groups Learn how to use general table space to suit the SaaS or multi-tenant applications Analyze slow queries using performance schema, sys schema and third party tools Manage and monitor your MySQL instance and implement efficient performance-tuning tasks Who this book is for If you are a MySQL developer or administrator looking for quick, handy solutions to solve the most common and not-so-common problems in MySQL, this book is for you. MySQL DBAs looking to get up-to-speed with the latest MySQL 8 development and administration features will also find this book very useful. Prior knowledge of Linux and RDBMS is desirable.","language":"en","currency":"USD","id":"1788398440","title":"MySQL 8 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0NRJDwAAQBAJ&source=gbs_api","authors":["Karthik Appigatla"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Aigg5gl_CTYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Scalable Server-Side Code with JavaScript","description":"This book introduces you to Node, the new web development framework written in JavaScript. You'll learn hands-on how Node makes life easier for experienced JavaScript developers: not only can you work on the front end and back end in the same language, you'll also have more flexibility in choosing how to divide application logic between client and server. Written by a core contributor to the framework, Node: Up and Running shows you how Node scales up to support large numbers of simultaneous connections across multiple servers, and scales down to let you create quick one-off applications with minimal infrastructure. Built on the V8 JavaScript engine that runs Google Chrome, Node is already winning the hearts and minds of many companies, including Google and Yahoo! This book shows you why. Understand Node's event-loop architecture, non-blocking I\/O, and event-driven programming Discover how Node supports a variety of database and data storage tools Learn best practices for writing easy-to-maintain code for Node Get concrete examples of how to use the various Node APIs in practice Take advantage of the book’s complete API reference","language":"en","currency":"USD","id":"1449336957","title":"Node: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Aigg5gl_CTYC&source=gbs_api","authors":["Tom Hughes-Croucher","Mike Wilson"]},{"pageCount":568,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y83aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.49,"subtitle":"Build powerful and reliable Python web applications from scratch, 3rd Edition","description":"Learn Django 3 with four end-to-end web projects Key Features Learn Django 3 by building real-world web applications from scratch in Python, using coding best practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Implement advanced functionalities like a full-text search engine, a user activity stream, or a recommendation engine Add real-time features with Django Channels and WebSockets Book Description If you want to learn the entire process of developing professional web applications with Python and Django, then this book is for you. In the process of building four professional Django projects, you will learn about Django 3 features, how to solve common web development problems, how to implement best practices, and how to successfully deploy your applications. In this book, you will build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Step-by-step guidance will teach you how to integrate popular technologies, enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. By the end of this book, you will have mastered Django 3 by building advanced web applications. What you will learn Build real-world web applications Learn Django essentials, including models, views, ORM, templates, URLs, forms, and authentication Implement advanced features such as custom model fields, custom template tags, cache, middleware, localization, and more Create complex functionalities, such as AJAX interactions, social authentication, a full-text search engine, a payment system, a CMS, a RESTful API, and more Integrate other technologies, including Redis, Celery, RabbitMQ, PostgreSQL, and Channels, into your projects Deploy Django projects in production using NGINX, uWSGI, and Daphne Who this book is for This book is intended for developers with Python knowledge who wish to learn Django in a pragmatic way. Perhaps you are completely new to Django, or you already know a little but you want to get the most out of it. This book will help you to master the most relevant areas of the framework by building practical projects from scratch. You need to have familiarity with programming concepts in order to read this book. Some previous knowledge of HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1838989323","title":"Django 3 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y83aDwAAQBAJ&source=gbs_api","authors":["Antonio Melé"]},{"pageCount":116,"thumbnail":"http:\/\/books.google.com\/books\/content?id=433ptYeXcLwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"It is a tutorial guide to learning how to use Opa with JavaScript, Nodejs, and MongoDB to develop web applications easily and effectively.If you are a web developer who wants to get started with the Opa framework and build web applications with it? Then this book is for you. Web development experience is assumed and would be helpful.","language":"en","currency":"USD","id":"1782163751","title":"Opa Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=433ptYeXcLwC&source=gbs_api","authors":["Li Wenbo"]},{"pageCount":315,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WreZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"A Problem-Solution Approach","description":"Get the most out of asyncio and find solutions to your most troubling Python programming problems. This book offers a pragmatic collection of recipes by going beyond online resources and docs to provide guidance on using this complex library. As such, you’ll see how to improve application performance and run computationally intensive programs faster. asyncio Recipes starts with examples illustrating the primitives that come with the asyncio library, and explains how to determine if asyncio is the right choice for your application. It shows how to use asyncio to yield performance gains without multiple threads, and identifies common mistakes and how to prevent them. Later chapters cover error-handling, testing, and debugging. By the end of this book, you'll understand how asyncio runs behind the scenes, and be confident enough to contribute to asyncio-first projects. What You Will Learn Discover quirky APIs such as the event loop policies Write asyncio code with native coroutines Use the ast module to find legacy asyncio code Work with contextvars See what a async context manager is and why a lot of asyncio APIs use them Who This Book Is For Experienced Python developers or hobbyists who want to understand asyncio and speed up their applications by adding concurrency to their toolkit.","language":"en","currency":"USD","id":"148424401X","title":"asyncio Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WreZDwAAQBAJ&source=gbs_api","authors":["Mohamed Mustapha Tahrioui"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UmzQCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Bringing Together Data, Semantics, and Software","description":"How do we design for data when traditional design techniques cannot extend to new database technologies? In this era of big data and the Internet of Things, it is essential that we have the tools we need to understand the data coming to us faster than ever before, and to design databases and data processing systems that can adapt easily to ever-changing data schemas and ever-changing business requirements. There must be no intellectual disconnect between data and the software that manages it. It must be possible to extract meaning and knowledge from data to drive artificial intelligence applications. Novel NoSQL data organization techniques must be used side-by-side with traditional SQL databases. Are existing data modeling techniques ready for all of this? The Concept and Object Modeling Notation (COMN) is able to cover the full spectrum of analysis and design. A single COMN model can represent the objects and concepts in the problem space, logical data design, and concrete NoSQL and SQL document, key-value, columnar, and relational database implementations. COMN models enable an unprecedented level of traceability of requirements to implementation. COMN models can also represent the static structure of software and the predicates that represent the patterns of meaning in databases. This book will teach you: the simple and familiar graphical notation of COMN with its three basic shapes and four line styles how to think about objects, concepts, types, and classes in the real world, using the ordinary meanings of English words that aren’t tangled with confused techno-speak how to express logical data designs that are freer from implementation considerations than is possible in any other notation how to understand key-value, document, columnar, and table-oriented database designs in logical and physical terms how to use COMN to specify physical database implementations in any NoSQL or SQL database with the precision necessary for model-driven development","language":"en","currency":"USD","id":"1634621115","title":"NoSQL and SQL Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UmzQCwAAQBAJ&source=gbs_api","authors":["Ted Hills"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PSonZP4Nj5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"Practical Raspberry Pi takes you quickly through the hardware and software basics of the Raspberry Pi. Author Brendan Horan then gets you started on a series of fun and practical projects, including a simple temperature sensor, a media center, a real-time clock, and even a security monitoring device, all of which require minimal programming experience. Along with these projects, you'll learn all about the Raspberry Pi hardware, including how it can be so powerful and still so small and inexpensive, why it's so suitable as a video player, and how you can customize it for different tasks, including running different operating systems on it, including Android and RISC OS. The Raspberry Pi is an inexpensive but relatively powerful little computer. It was designed to get kids interested in computing and programming, but it's also a great platform for hardware hackery. The projects in this book will get you deep into the hardware to show you what the Raspberry Pi can really do.","language":"en","currency":"USD","id":"1430249722","title":"Practical Raspberry Pi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PSonZP4Nj5sC&source=gbs_api","authors":["Brendan Horan"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PSonZP4Nj5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"Practical Raspberry Pi takes you quickly through the hardware and software basics of the Raspberry Pi. Author Brendan Horan then gets you started on a series of fun and practical projects, including a simple temperature sensor, a media center, a real-time clock, and even a security monitoring device, all of which require minimal programming experience. Along with these projects, you'll learn all about the Raspberry Pi hardware, including how it can be so powerful and still so small and inexpensive, why it's so suitable as a video player, and how you can customize it for different tasks, including running different operating systems on it, including Android and RISC OS. The Raspberry Pi is an inexpensive but relatively powerful little computer. It was designed to get kids interested in computing and programming, but it's also a great platform for hardware hackery. The projects in this book will get you deep into the hardware to show you what the Raspberry Pi can really do.","language":"en","currency":"USD","id":"1430249722","title":"Practical Raspberry Pi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PSonZP4Nj5sC&source=gbs_api","authors":["Brendan Horan"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUcmAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Capacity Management","description":"Cloud Capacity Management helps readers in understanding what the cloud, IaaS, PaaS, SaaS are, how they relate to capacity planning and management and which stakeholders are involved in delivering value in the cloud value chain. It explains the role of capacity management for a creator, aggregator, and consumer of cloud services and how to provision for it in a 'pay as you use model'. This involves a high level of abstraction and virtualization to facilitate rapid and on demand provisioning of services. The conventional IT service models take a traditional approach when planning for service capacity to provide optimum services levels which has huge cost implications for service providers. This book addresses the gap areas between traditional capacity management practices and cloud service models. It also showcases capacity management process design and implementation in a cloud computing domain using ITSM best practices. This book is a blend of ITSM best practices and infrastructure capacity planning and optimization implementation in various cloud scenarios. Cloud Capacity Management addresses the basics of cloud computing, its various models, and their impact on capacity planning. This book also highlights the infrastructure capacity management implementation process in a cloud environment showcasing inherent capabilities of tool sets available and the various techniques for capacity planning and performance management. Techniques like dynamic resource scheduling, scaling, load balancing, and clustering etc are explained for implementing capacity management.","language":"en","currency":"USD","id":"1430249242","title":"Cloud Capacity Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUcmAAAAQBAJ&source=gbs_api","authors":["Navin Sabharwal","Prashant Wali"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4D63DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"62 Specific Ways to Improve Your TypeScript","description":"TypeScript is a typed superset of JavaScript with the potential to solve many of the headaches for which JavaScript is famous. But TypeScript has a learning curve of its own, and understanding how to use it effectively can take time. This book guides you through 62 specific ways to improve your use of TypeScript. Author Dan Vanderkam, a principal software engineer at Sidewalk Labs, shows you how to apply these ideas, following the format popularized by Effective C++ and Effective Java (both from Addison-Wesley). You’ll advance from a beginning or intermediate user familiar with the basics to an advanced user who knows how to use the language well. Effective TypeScript is divided into eight chapters: Getting to Know TypeScript TypeScript’s Type System Type Inference Type Design Working with any Types Declarations and @types Writing and Running Your Code Migrating to TypeScript","language":"en","currency":null,"id":"1492053694","title":"Effective TypeScript","infoLink":"http:\/\/books.google.com\/books?id=4D63DwAAQBAJ&dq=mongodb&hl=&as_brr=5&source=gbs_api","authors":["Dan Vanderkam"]},{"pageCount":505,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fQJ2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Real-World Scalable Web Apps","description":"Learn how to build a wide range of scalable real-world web applications using a professional development toolkit. If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages.With this book, you'll work with a varied collection of standards and frameworks and see how all those pieces fit together. Practical Node.js takes you from installing all the necessary modules to writing full-stack web applications. You'll harness the power of the Express.js and Hapi frameworks, the MongoDB database with Mongoskin and Mongoose. You'll also work with Pug and Handlebars template engines, Stylus and LESS CSS lanaguages, OAuth and Everyauth libraries, and the Socket.IO and Derby libraries, and everything in between. This exciting second edition is fully updated for ES6\/ES2015 and also covers how to deploy to Heroku and AWS, daemonize apps, and write REST APIs. You’ll build full-stack real-world Node.js apps from scratch, and also discover how to write your own Node.js modules and publish them on NPM. Fully supported by a continuously updated source code repository on GitHub and with full-color code examples, learn what you can do with Node.js and how far you can take it! What You'll Learn Manipulate data from the mongo console Use the Mongoskin and Mongoose MongoDB libraries Build REST API servers with Express and Hapi Deploy apps to Heroku and AWS Test services with Mocha, Expect and TravisCI Implement a third-party OAuth strategy with Everyauth Web developers who have some familiarity with the basics of Node.js and want to learn how to use it to build apps in a professional environment.","language":"en","currency":"USD","id":"1484230396","title":"Practical Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fQJ2DwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QGZ-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This fully updated study guide delivers 100% coverage of every topic on the CompTIA ITF+ IT Fundamentals exam Take the CompTIA ITF+ IT Fundamentals exam with complete confidence using this bestselling and effective self-study system. Written by CompTIA certification and training experts, this authoritative guide explains foundational computer technologies in full detail. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations throughout. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Also includes a voucher coupon for a 10% discount on your CompTIA exams! Covers all exam topics, including: • Computer basics • System hardware • I\/O ports and peripherals • Data storage and sharing • PC setup and configuration • Understanding operating systems • Working with applications and files • Setting up and configuring a mobile device • Connecting to networks and the Internet • Handling local and online security threats • Computer maintenance and management • Troubleshooting and problem solving • Understanding databases • Software development and implementation Online content includes: • 130 practice exam questions in a customizable test engine • Link to over an hour of free video training from Mike Meyers","language":"en","currency":"USD","id":"1260441881","title":"ITF+ CompTIA IT Fundamentals All-in-One Exam Guide, Second Edition (Exam FC0-U61)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QGZ-DwAAQBAJ&source=gbs_api","authors":["Mike Meyers","Scott Jernigan","Daniel Lachance"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=08O3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Get up and running on the latest JavaScript standard using this fully updated beginner’s guide This hands-on, fast-paced guide shows, from start to finish, how to create dynamic Web pages complete with special effects using JavaScript. This edition contains updates for all major new features and the latest Web development techniques and practices. You will discover how to extend JavaScript’s capabilities to the server side using Node.js. JavaScript: A Beginner's Guide, Fifth Edition begins by clearly explaining the fundamentals, including variables, functions, operators, event handlers, objects, arrays, strings, and forms. From there, the book moves on to more advanced techniques, such as debugging, accessibility, and security. Throughout, “Ask the Expert,” “Try This,” notes, tips, and self tests highlight salient points and aid in learning. •Teaches, step by step, how to get started developing Web applications•Features detailed examples and downloadable project files•Written by an experienced Web developer and JavaScript expert","language":"en","currency":"USD","id":"1260457699","title":"JavaScript A Beginner's Guide Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=08O3DwAAQBAJ&source=gbs_api","authors":["John Pollock"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=V5qzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":34.99,"subtitle":"Dive into the Future of Infrastructure","description":"Kubernetes radically changes the way applications are built and deployed in the cloud. Since its introduction in 2014, this container orchestrator has become one of the largest and most popular open source projects in the world. The updated edition of this practical book shows developers and ops personnel how Kubernetes and container technology can help you achieve new levels of velocity, agility, reliability, and efficiency. Kelsey Hightower, Brendan Burns, and Joe Beda—who’ve worked on Kubernetes at Google and beyond—explain how this system fits into the lifecycle of a distributed application. You’ll learn how to use tools and APIs to automate scalable distributed systems, whether it’s for online services, machine learning applications, or a cluster of Raspberry Pi computers. Create a simple cluster to learn how Kubernetes works Dive into the details of deploying an application using Kubernetes Learn specialized objects in Kubernetes, such as DaemonSets, jobs, ConfigMaps, and secrets Explore deployments that tie together the lifecycle of a complete application Get practical examples of how to develop and deploy real-world applications in Kubernetes","language":"en","currency":"USD","id":"1492046485","title":"Kubernetes: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=V5qzDwAAQBAJ&source=gbs_api","authors":["Brendan Burns","Joe Beda","Kelsey Hightower"]},{"pageCount":646,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BVnHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Regression, ConvNets, GANs, RNNs, NLP, and more with TensorFlow 2 and the Keras API, 2nd Edition","description":"Build machine and deep learning systems with the newly released TensorFlow 2 and Keras for the lab, production, and mobile devices Key Features Introduces and then uses TensorFlow 2 and Keras right from the start Teaches key machine and deep learning techniques Understand the fundamentals of deep learning and machine learning through clear explanations and extensive code samples Book Description Deep Learning with TensorFlow 2 and Keras, Second Edition teaches neural networks and deep learning techniques alongside TensorFlow (TF) and Keras. You’ll learn how to write deep learning applications in the most powerful, popular, and scalable machine learning stack available. TensorFlow is the machine learning library of choice for professional applications, while Keras offers a simple and powerful Python API for accessing TensorFlow. TensorFlow 2 provides full Keras integration, making advanced machine learning easier and more convenient than ever before. This book also introduces neural networks with TensorFlow, runs through the main applications (regression, ConvNets (CNNs), GANs, RNNs, NLP), covers two working example apps, and then dives into TF in production, TF mobile, and using TensorFlow with AutoML. What you will learn Build machine learning and deep learning systems with TensorFlow 2 and the Keras API Use Regression analysis, the most popular approach to machine learning Understand ConvNets (convolutional neural networks) and how they are essential for deep learning systems such as image classifiers Use GANs (generative adversarial networks) to create new data that fits with existing patterns Discover RNNs (recurrent neural networks) that can process sequences of input intelligently, using one part of a sequence to correctly interpret another Apply deep learning to natural human language and interpret natural language texts to produce an appropriate response Train your models on the cloud and put TF to work in real environments Explore how Google tools can automate simple ML workflows without the need for complex modeling Who this book is for This book is for Python developers and data scientists who want to build machine learning and deep learning systems with TensorFlow. Whether or not you have done machine learning before, this book gives you the theory and practice required to use Keras, TensorFlow 2, and AutoML to build machine learning systems.","language":"en","currency":"USD","id":"1838827722","title":"Deep Learning with TensorFlow 2 and Keras","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BVnHDwAAQBAJ&source=gbs_api","authors":["Antonio Gulli","Amita Kapoor","Sujit Pal"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZH6bpbcrlvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"Building Javascript Based Scalable Software","description":"Learn to build fast and scalable software in JavaScript with Node.js Node.js is a powerful and popular new framework for writing scalable network programs using JavaScript. This no nonsense book begins with an overview of Node.js and then quickly dives into the code, core concepts, and APIs. In-depth coverage pares down the essentials to cover debugging, unit testing, and flow control so that you can start building and testing your own modules right away. Covers node and asynchronous programming main concepts Addresses the basics: modules, buffers, events, and timers Explores streams, file systems, networking, and automated unit testing Goes beyond the basics, and shares techniques and tools for debugging, unit testing, and flow control If you already know JavaScript and are curious about the power of Node.js, then this is the ideal book for you.","language":"en","currency":"USD","id":"1118240561","title":"Professional Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZH6bpbcrlvYC&source=gbs_api","authors":["Pedro Teixeira"]},{"pageCount":526,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XCLhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"A complete hands-on guide to modern web and mobile development with React.js, 3rd Edition","description":"Get up to speed with React, React Native, GraphQL and Apollo for building cross-platform native apps with the help of practical examples Key Features Covers the latest features of React such as Hooks, Suspense, NativeBase, and Apollo in this updated third edition Get to grips with the React architecture for writing easy-to-manage web and mobile applications Understand GraphQL and Apollo for building a scalable backend for your cross-platform apps Book Description React and React Native, Facebook’s innovative User Interface (UI) libraries, are designed to help you build robust cross-platform web and mobile applications. This updated third edition is improved and updated to cover the latest version of React. The book particularly focuses on the latest developments in the React ecosystem, such as modern Hook implementations, code splitting using lazy components and Suspense, user interface framework components using Material-UI, and Apollo. In terms of React Native, the book has been updated to version 0.62 and demonstrates how to apply native UI components for your existing mobile apps using NativeBase. You will begin by learning about the essential building blocks of React components. Next, you’ll progress to working with higher-level functionalities in application development, before putting this knowledge to use by developing user interface components for the web and for native platforms. In the concluding chapters, you’ll learn how to bring your application together with a robust data architecture. By the end of this book, you’ll be able to build React applications for the web and React Native applications for multiple mobile platforms. What you will learn Delve into the React architecture, component properties, state, and context Get to grips with React Hooks for handling functions and components Implement code splitting in React using lazy components and Suspense Build robust user interfaces for mobile and desktop apps using Material-UI Write shared components for Android and iOS mobile apps using React Native Simplify layout design for React Native apps using NativeBase Write GraphQL schemas to power web and mobile apps Implement web and mobile components that are driven by Apollo Who this book is for This book is for any JavaScript developer who wants to start learning how to use Facebook’s UI libraries, React and React Native, for mobile and web application development. Although no prior knowledge of React is needed, working knowledge of JavaScript programming will help you understand the concepts covered in the book more effectively.","language":"en","currency":"USD","id":"1839212438","title":"React and React Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XCLhDwAAQBAJ&source=gbs_api","authors":["Adam Boduch","Roy Derks"]},{"pageCount":510,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EJdMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Effective guide to administering high-performance MySQL 8 solutions","description":"Step by step guide to monitor, manage, and secure your database engine Key Features Your companion to master all the administration-related tasks in MySQL 8 Ensure high performance and high availability of your MySQL solution using effective replication and backup techniques A comprehensive guide to performing query optimization, security and a whole host of other administrative tasks in MySQL 8 Book Description MySQL is one of the most popular and widely used relational databases in the world today. The recently released version 8.0 brings along some major advancements in the way your MySQL solution can be administered. This handbook will be your companion to understand the newly introduced features in MySQL and how you can leverage them to design a high-performance MySQL solution for your organization. This book starts with a brief introduction to the newly introduced features in MySQL 8, followed by quickly jumping onto the crucial administration topics that you will find useful in your day to day work. Topics such as migrating to MySQL 8, MySQL benchmarking, achieving high performance by implementing the indexing techniques, and optimizing your queries are covered in this book. You will also learn how to perform replication, scale your MySQL solution and implement effective security techniques. A special section on the common and not so common troubleshooting techniques for effective MySQL administration is also covered in this book. By the end of this highly practical book, you will have all the knowledge you need to tackle any problem you might encounter while administering your MySQL solution. What you will learn Understanding different MySQL 8 data types based on type of contents and storage requirements Best practices for optimal use of features in MySQL 8 Explore globalization configuration and caching techniques to improve performance Create custom storage engine as per system requirements Learn various ways of index implementation for flash memory storages Configure and implement replication along with approaches to use replication as solution Understand how to make your MySQL 8 solution highly available Troubleshoot common issues and identify error codes while using MySQL 8 Who this book is for This book is intended for MySQL administrators who are looking for a handy guide covering all the MySQL administration-related tasks. If you are a DBA looking to get started with MySQL administration, this book will also help you. Knowledge of the basic database concepts is required to get started with this book.","language":"en","currency":"USD","id":"1788393848","title":"MySQL 8 Administrator’s Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EJdMDwAAQBAJ&source=gbs_api","authors":["Chintan Mehta","Ankit K Bhavsar","Hetal Oza","Subhash Shah"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ASTXBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.95,"subtitle":null,"description":"Data Modeling Theory and Practice is for practitioners and academics who have learned the conventions and rules of data modeling and are looking for a deeper understanding of the discipline. The coverage of theory includes a detailed review of the extensive literature on data modeling and logical database design, referencing nearly 500 publications, with a strong focus on their relevance to practice. The practice component incorporates the largest-ever study of data modeling practitioners, involving over 450 participants in interviews, surveys and data modeling tasks. The results challenge many long-held assumptions about data modeling and will be of interest to academics and practitioners alike. Graeme Simsion brings to the book the practical perspective and intellectual clarity that have made his Data Modeling Essentials a classic in the field. He begins with a question about the nature of data modeling (design or description), and uses it to illuminate such issues as the definition of data modeling, its philosophical underpinnings, inputs and deliverables, the necessary behaviors and skills, the role of creativity, product diversity, quality measures, personal styles, and the differences between experts and novices. Data Modeling Theory and Practice is essential reading for anyone involved in data modeling practice, research, or teaching.","language":"en","currency":"USD","id":"1634620739","title":"Data Modeling Theory and Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ASTXBgAAQBAJ&source=gbs_api","authors":["Graeme Simsion"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4PWoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design documents and implement real world e-commerce applications with Couchbase About This Book Get acquainted with Couchbase architecture and design your document-based data schema Implement full text search using industry standard elastic search plugins Develop critical and high performance applications using this hands-on tutorial guide Who This Book Is For If you are new to the NoSQL document system or have little or no experience in NoSQL development and administration and are planning to deploy Couchbase for your next project, then this book is for you. It would be helpful to have a bit of familiarity with Java. What You Will Learn Get acquainted with the concept of NoSQL databases and configure your Couchbase database cluster Maintain Couchbase effectively using the web-based administrative console with ease Enable partition capabilities by making use of Buckets Analyze important design considerations for maintaining relationship between various documents Use Couchbase SDK Java API to store and retrieve document Write views using map\/reduce to retrieve documents efficiently Get familiar with N1QL and how to use it in Java applications Integrate Couchbase with Elasticsearch to implement full text search Configure XDCR for disaster recovery and develop ecommerce application using Couchbase In Detail NoSQL database systems have changed application development in terms of adaptability to dynamics schema and scalability. Compared with the currently available NoSQL database systems, Couchbase is the fastest. Its ease of configuration and powerful features for storing different schema structures, retrieval using map reduce and inbuilt disaster recovery by replicating document across the geographical region, make it one of the most powerful, scalable and comprehensive NoSQL in the market. Couchbase also introduces smart client API for various programming language to integrate the database with the application easily, yet providing very complex features like cluster health awareness. This book achieves its goal by taking up an end-to-end development structure, right from understanding NOSQL document design to implementing full fledged eCommerce application design using Couchbase as a backend. Starting with the architecture of Couchbase to get you up and running, this book quickly takes you through designing a NoSQL document and implementing highly scalable applications using Java API. You will then be introduced to document design and get to know the various ways to administer Couchbase. Followed by this, learn to store documents using bucket. Moving on, you will then learn to store, retrieve and delete documents using smart client base on Java API. You will then retrieve documents using SQL like syntax call N1QL. Next, you will learn how to write map reduce base views. Finally, you will configure XDCR for disaster recovery and implement an eCommerce application using Couchbase. Style and approach The book starts from absolute basics and slowly moves to more advanced topics ensuring at every step that all concepts and terms are understood by the reader to have complete understanding at every stage. Technical and complex terms are explained in clear and simple language, thus making this book a perfect companion for those who have started their journey to NoSQL using Couchbase","language":"en","currency":"USD","id":"1785284282","title":"Learning Couchbase","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4PWoCwAAQBAJ&source=gbs_api","authors":["Henry Potsangbam"]},{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yu_7CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.95,"subtitle":"Adapting to Agile Data Modeling in a Big Data World","description":"Build a working knowledge of data modeling concepts and best practices, along with how to apply these principles with ER\/Studio. This second edition includes numerous updates and new sections including an overview of ER\/Studio’s support for agile development, as well as a description of some of ER\/Studio’s newer features for NoSQL, such as MongoDB’s containment structure.","language":"en","currency":"USD","id":"1634620941","title":"Data Modeling Made Simple with ER\/Studio Data Architect","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yu_7CgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZZ_6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A deep dive into distributed ledgers, consensus protocols, smart contracts, DApps, cryptocurrencies, Ethereum, and more, 3rd Edition","description":"Mastering Blockchain, Third Edition is the blockchain bible to equip you with extensive knowledge of distributed ledgers, cryptocurrencies, smart contracts, consensus algorithms, cryptography and blockchain platforms such as Ethereum, Bitcoin, and many more.","language":"en","currency":"USD","id":"1839211377","title":"Mastering Blockchain","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZZ_6DwAAQBAJ&source=gbs_api","authors":["Imran Bashir"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8XPbxNszVUgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":"Lite","description":"Practical, hands-on \"Cookbook\" approach. Full of clear, step-by-step instructions that you can apply straight away. Written for people who want to get maximum results without lots of background and theory reading. JSF developers who want to work with validators, converters and security features of JSF. You don't need any prior knowledge of JSF to use these recipes.","language":"en","currency":"USD","id":"1849691630","title":"Jsf 2.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8XPbxNszVUgC&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vetaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is for developers who want an alternative way to store and process data within their applications. No previous graph database experience is required; however, some basic database knowledge will help you understand the concepts more easily.","language":"en","currency":"USD","id":"1849517177","title":"Learning Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vetaBAAAQBAJ&source=gbs_api","authors":["Rik Van Bruggen"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jugCDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.95,"subtitle":"Visualize Structure and Meaning","description":"Master a graph data modeling technique superior to traditional data modeling for both relational and NoSQL databases (graph, document, key-value, and column), leveraging cognitive psychology to improve big data designs. From Karen Lopez’s Foreword: In this book, Thomas Frisendal raises important questions about the continued usefulness of traditional data modeling notations and approaches: Are Entity Relationship Diagrams (ERDs) relevant to analytical data requirements? Are ERDs relevant in the new world of Big Data? Are ERDs still the best way to work with business users to understand their needs? Are Logical and Physical Data Models too closely coupled? Are we correct in using the same notations for communicating with business users and developers? Should we refine our existing notations and tools to meet these new needs, or should we start again from a blank page? What new notations and approaches will we need? How will we use those to build enterprise database systems? Frisendal takes us through the history of data modeling, enterprise data models and traditional modeling methods. He points out, quite contentiously, where he feels we have gone wrong and in a few places where we got it right. He then maps out the psychology of meaning and context, while identifying important issues about where data modeling may or may not fit in business modeling. The main subject of this work is a proposal for a new exploration-driven modeling approach and new modeling notations for business concept models, business solutions models, and physical data models with examples on how to leverage those for implementing into any target database or datastore. These new notations are based on a property graph approach to modeling data.","language":"en","currency":"USD","id":"1634621239","title":"Graph Data Modeling for NoSQL and SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jugCDQAAQBAJ&source=gbs_api","authors":["Thomas Frisendal"]},{"pageCount":161,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGyCCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":"Criando aplicações web real-time com JavaScript","description":"O JavaScript já é uma opção real de desenvolvimento server-side. Trabalhar com a mesma linguagem que utilizamos no front-end é também uma grande vantagem. Diversos frameworks surgiram e, sem dúvida, o Meteor é que mais se destaca. Neste livro, venha desenvolver sua própria rede social do zero implementando funcionalidades que interagem em tempo real, além de também aprender a trabalhar com diversos componentes nativos do framework que visam agilizar a prototipagem da aplicação, utilizando o Meteor 1.1.x. Também veremos como lidar tarefas do dia a dia como criação de templates com Handlebars; integração com a API do Facebook para autenticação e cadastro de usuários; utilização do banco de dados não-relacional MongoDB; e programação orientada a eventos, utilizando PubSub nativo do Meteor.","language":"pt","currency":"USD","id":"8555191351","title":"Meteor","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGyCCwAAQBAJ&source=gbs_api","authors":["Caio Ribeiro Pereira"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6VTBAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Problem-Solution Approach","description":"Node.js Recipes is your one-stop reference for solving Node.js problems. Filled with useful recipes that follow a problem\/solution format, you can look up recipes for many situations that you may come across in your day-to-day server-side development. Node.js is accessible to those who not only relish in server-side programming but also web developers who understand the ubiquitous language of the web. Node.js Recipes covers all the essential ingredients required to become a seasoned Node.js developer in no time - make it your indispensable reference today.","language":"en","currency":"USD","id":"1430260599","title":"Node.js Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6VTBAQAAQBAJ&source=gbs_api","authors":["Cory Gackenheimer"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-u0tAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"A practical book, guiding the reader through the development of a single page application using a feature-driven approach.If you are an experienced JavaScript developer who wants to build highly scalable, real-world applications using Express, this book is ideal for you. This book is an advanced title and assumes that the reader has some experience with node, Javascript MVC web development frameworks, and has heard of Express before, or is familiar with it. You should also have a basic understanding of Redis and MongoDB. This book is not a tutorial on Node, but aims to explore some of the more advanced topics you will encounter when developing, deploying, and maintaining an Express web application.","language":"en","currency":"USD","id":"1783282509","title":"Advanced Express Web Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-u0tAgAAQBAJ&source=gbs_api","authors":["Andrew Keig"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6uKfBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"Learning AngularJS Get started with AngularJS web development fast AngularJS is one of the most exciting and innovative new technologies emerging in the world of web development. Designed to simplify the development and testing of web applications, it also provides structure for the entire development process. Websites are no longer simple static content–instead, websites have become much more dynamic, with a single page often serving as the entire site or application. And AngularJS allows web developers to build the necessary programming logic for such applications directly into a web page, binding the data model for the client web application to backend services and databases. AngularJS also allows the extension of HTML so that the UI design logic can be expressed easily in an HTML template file. Learning AngularJS shows you how to create powerful, interactive web applications that have a well-structured, reusable code base that will be easy to maintain. You’ll also learn how to leverage AngularJS’s innovative MVC approach to implement well-designed and well-structured web pages and web applications. Understand how AngularJS is organized and learn best practices for designing AngularJS applications Find out how to define modules and utilize dependency injection Quickly build AngularJS templates with built-in directives that enhance the user experience Bind UI elements to your data model, so changes to your model and UI occur automatically in tandem Define custom AngularJS directives that extend HTML Implement zoomable images, expandable lists, and other rich UI components Implement client-side services that interact with web servers Build dynamic browser views to provide even richer user interaction Create custom services you can easily reuse Design unit and end-to-end tests for AngularJS applications Contents at a Glance 1 Jumping Into JavaScript Setting Up a JavaScript Development Environment Using Node.js Defining Variables Understanding JavaScript Data Types Using Operators Implementing Looping Creating Functions Understanding Variable Scope Using JavaScript Objects Manipulating Strings Working with Arrays Adding Error Handling 2 Getting Started with AngularJS Why AngularJS? Understanding AngularJS An Overview of the AngularJS Life Cycle Separation of Responsibilities Integrating AngularJS with Existing JavaScript and jQuery Adding AngularJS to Your Environment Bootstrapping AngularJS in an HTML Document Using the Global APIs Creating a Basic AngularJS Application Using jQuery or jQuery Lite in AngularJS Applications 3 Understanding AngularJS Application Dynamics Looking at Modules and Dependency Injection Defining an AngularJS Module Object Creating Providers in AngularJS Modules Implementing Providers and Dependency Injection Applying Configuration and Run Blocks to Modules 4 Implementing the Scope as a Data Model Understanding Scopes Implementing Scope Hierarchy 5 Using AngularJS Templates to Create Views Understanding Templates Using Expressions Using Filters Creating Custom Filters 6 Implementing Directives in AngularJS Views Understanding Directives Using Built-in Directives 7 Creating Your Own Custom Directives to Extend HTML Understanding Custom Directive Definitions Implementing Custom Directives 8 Using Events to Interact with Data in the Model Browser Events User Interaction Events Adding $watches to Track Scope Change Events Emitting and Broadcasting Custom Events 9 Implementing AngularJS Services in Web Applications Understanding AngularJS Services Using the Built-in Services Using the $q Service to Provide Deferred Responses 10 Creating Your Own Custom AngularJS Services Understanding Custom AngularJS Services Integrating Custom Services into Your AngularJS Applications 11 Creating Rich Web Application Components the AngularJS Way Building a Tabbed View Implementing Draggable and Droppable Elements 204 Adding a Zoom View Field to Images Implementing Expandable and Collapsible Elements Adding Star Ratings to Elements A Testing AngularJS Applications Deciding on a Testing Platform Understanding AngularJS Unit Tests Understanding AngularJS End-to-End Testing","language":"en","currency":"USD","id":"0134034619","title":"Learning AngularJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6uKfBQAAQBAJ&source=gbs_api","authors":["Brad Dayley"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Effective data processing with MySQL 8, Hadoop, NoSQL APIs, and other Big Data tools","description":"Uncover the power of MySQL 8 for Big Data About This Book Combine the powers of MySQL and Hadoop to build a solid Big Data solution for your organization Integrate MySQL with different NoSQL APIs and Big Data tools such as Apache Sqoop A comprehensive guide with practical examples on building a high performance Big Data pipeline with MySQL Who This Book Is For This book is intended for MySQL database administrators and Big Data professionals looking to integrate MySQL 8 and Hadoop to implement a high performance Big Data solution. Some previous experience with MySQL will be helpful, although the book will highlight the newer features introduced in MySQL 8. What You Will Learn Explore the features of MySQL 8 and how they can be leveraged to handle Big Data Unlock the new features of MySQL 8 for managing structured and unstructured Big Data Integrate MySQL 8 and Hadoop for efficient data processing Perform aggregation using MySQL 8 for optimum data utilization Explore different kinds of join and union in MySQL 8 to process Big Data efficiently Accelerate Big Data processing with Memcached Integrate MySQL with the NoSQL API Implement replication to build highly available solutions for Big Data In Detail With organizations handling large amounts of data on a regular basis, MySQL has become a popular solution to handle this structured Big Data. In this book, you will see how DBAs can use MySQL 8 to handle billions of records, and load and retrieve data with performance comparable or superior to commercial DB solutions with higher costs. Many organizations today depend on MySQL for their websites and a Big Data solution for their data archiving, storage, and analysis needs. However, integrating them can be challenging. This book will show you how to implement a successful Big Data strategy with Apache Hadoop and MySQL 8. It will cover real-time use case scenario to explain integration and achieve Big Data solutions using technologies such as Apache Hadoop, Apache Sqoop, and MySQL Applier. Also, the book includes case studies on Apache Sqoop and real-time event processing. By the end of this book, you will know how to efficiently use MySQL 8 to manage data for your Big Data applications. Style and approach Step by Step guide filled with real-world practical examples.","language":"en","currency":"USD","id":"1788390423","title":"MySQL 8 for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xhKDwAAQBAJ&source=gbs_api","authors":["Shabbir Challawala","Jaydip Lakhatariya","Chintan Mehta","Kandarp Patel"]},{"pageCount":77,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q164BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"This brief provides methods for harnessing Twitter data to discover solutions to complex inquiries. The brief introduces the process of collecting data through Twitter’s APIs and offers strategies for curating large datasets. The text gives examples of Twitter data with real-world examples, the present challenges and complexities of building visual analytic tools, and the best strategies to address these issues. Examples demonstrate how powerful measures can be computed using various Twitter data sources. Due to its openness in sharing data, Twitter is a prime example of social media in which researchers can verify their hypotheses, and practitioners can mine interesting patterns and build their own applications. This brief is designed to provide researchers, practitioners, project managers, as well as graduate students with an entry point to jump start their Twitter endeavors. It also serves as a convenient reference for readers seasoned in Twitter data analysis.","language":"en","currency":"USD","id":"1461493722","title":"Twitter Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q164BAAAQBAJ&source=gbs_api","authors":["Shamanth Kumar","Fred Morstatter","Huan Liu"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OXpzPr1C4o4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Nmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities. \"Nmap 6: Network exploration and security auditing cookbook\" will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts. \"Nmap 6: Network exploration and security auditing cookbook\" is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system. The book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.","language":"en","currency":"USD","id":"1849517495","title":"Nmap 6: Network Exploration and Security Auditing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OXpzPr1C4o4C&source=gbs_api","authors":["Paulino Calderon Pale"]},{"pageCount":513,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M_TKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication describes the features and functions the latest member of the IBM Z® platform, the IBM z15TM (machine type 8561). It includes information about the IBM z15 processor design, I\/O innovations, security features, and supported operating systems. The z15 is a state-of-the-art data and transaction system that delivers advanced capabilities, which are vital to any digital transformation. The z15 is designed for enhanced modularity, which is in an industry standard footprint. This system excels at the following tasks: Making use of multicloud integration services Securing data with pervasive encryption Accelerating digital transformation with agile service delivery Transforming a transactional platform into a data powerhouse Getting more out of the platform with IT Operational Analytics Accelerating digital transformation with agile service delivery Revolutionizing business processes Blending open source and Z technologies This book explains how this system uses new innovations and traditional Z strengths to satisfy growing demand for cloud, analytics, and open source technologies. With the z15 as the base, applications can run in a trusted, reliable, and secure environment that improves operations and lessens business risk.","language":"en","currency":"USD","id":"0738458120","title":"IBM z15 (8561) Technical Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M_TKDwAAQBAJ&source=gbs_api","authors":["Octavian Lascu","John Troy","Jannie Houlbjerg","Frank Packheiser","Paul Schouten","Kazuhiro Nakajima","Anna Shugol","Hervey Kamga","Bo XU","IBM Redbooks"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yivVDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"Learn virtualization skills by building your own virtual machine Virtualization Essentials, Second Edition provides new and aspiring IT professionals with immersive training in working with virtualization environments. Clear, straightforward discussion simplifies complex concepts, and the hands-on tutorial approach helps you quickly get up to speed on the fundamentals. You'll begin by learning what virtualization is and how it works within the computing environment, then you'll dive right into building your own virtual machine. You'll learn how to set up the CPU, memory, storage, networking, and more as you master the skills that put you in-demand on the job market. Each chapter focuses on a specific goal, and concludes with review questions that test your understanding as well as suggested exercises that help you reinforce what you've learned. As more and more companies are leveraging virtualization, it's imperative that IT professionals have the skills and knowledge to interface with virtualization-centric infrastructures. This book takes a learning-by-doing approach to give you hands-on training and a core understanding of virtualization. Understand how virtualization works Create a virtual machine by scratch and migration Configure and manage basic components and supporting devices Develop the necessary skill set to work in today's virtual world Virtualization was initially used to build test labs, but its use has expanded to become best practice for a tremendous variety of IT solutions including high availability, business continuity, dynamic IT, and more. Cloud computing and DevOps rely on virtualization technologies, and the exponential spread of these and similar applications make virtualization proficiency a major value-add for any IT professional. Virtualization Essentials, Second Edition provides accessible, user-friendly, informative virtualization training for the forward-looking pro.","language":"en","currency":"USD","id":"1119267749","title":"Virtualization Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yivVDAAAQBAJ&source=gbs_api","authors":["Matthew Portnoy"]},{"pageCount":732,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tRrRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Full stack web development with .NET Core 3.1 and Angular 9, 3rd Edition","description":"This full-stack guide will help you become fluent in both frontend and backend web development by combining the impressive capabilities of ASP.NET Core 3.1 and Angular 9 from project setup right through the deployment. Furthermore, you will learn to add capabilities like security, testability, and scalability to your apps using expert techniques.","language":"en","currency":"USD","id":"1789611482","title":"ASP.NET Core 3 and Angular 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tRrRDwAAQBAJ&source=gbs_api","authors":["Valerio De Sanctis"]},{"pageCount":578,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nvZ0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Second International Conference, ICACDS 2018, Dehradun, India, April 20-21, 2018, Revised Selected Papers","description":"This two-volume set (CCIS 905 and CCIS 906) constitutes the refereed proceedings of the Second International Conference on Advances in Computing and Data Sciences, ICACDS 2018, held in Dehradun, India, in April 2018. The 110 full papers were carefully reviewed and selected from 598 submissions. The papers are centered around topics like advanced computing, data sciences, distributed systems organizing principles, development frameworks and environments, software verification and validation, computational complexity and cryptography, machine learning theory, database theory, probabilistic representations.","language":"en","currency":"USD","id":"9811318131","title":"Advances in Computing and Data Sciences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nvZ0DwAAQBAJ&source=gbs_api","authors":["Mayank Singh","P. K. Gupta","Vipin Tyagi","Jan Flusser","Tuncer Ören"]},{"pageCount":279,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eC-IDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Data Programming and the Cloud","description":"Program for data analysis using R and learn practical skills to make your work more efficient. This book covers how to automate running code and the creation of reports to share your results, as well as writing functions and packages. Advanced R is not designed to teach advanced R programming nor to teach the theory behind statistical procedures. Rather, it is designed to be a practical guide moving beyond merely using R to programming in R to automate tasks. This book will show you how to manipulate data in modern R structures and includes connecting R to data bases such as SQLite, PostgeSQL, and MongoDB. The book closes with a hands-on section to get R running in the cloud. Each chapter also includes a detailed bibliography with references to research articles and other resources that cover relevant conceptual and theoretical topics. What You Will Learn Write and document R functions Make an R package and share it via GitHub or privately Add tests to R code to insure it works as intended Build packages automatically with GitHub Use R to talk directly to databases and do complex data management Run R in the Amazon cloud Generate presentation-ready tables and reports using R Who This Book Is For Working professionals, researchers, or students who are familiar with R and basic statistical techniques such as linear regression and who want to learn how to take their R coding and programming to the next level.","language":"en","currency":"USD","id":"1484220773","title":"Advanced R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eC-IDQAAQBAJ&source=gbs_api","authors":["Matt Wiley","Joshua F. Wiley"]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Fast-track your web development career using the powerful features of advanced JavaScript","description":"Develop your JavaScript programming skills by learning strategies and techniques commonly used in modern full-stack application development Key Features Write and deploy full-stack applications efficiently with JavaScript Delve into JavaScript’s multiple programming paradigms Get up to speed with core concepts such as modularity and functional programming to write efficient code Book Description In depth knowledge of JavaScript makes it easier to learn a variety of other frameworks, including React, Angular, and related tools and libraries. This book is designed to help you cover the core JavaScript concepts you need to build modern applications. You'll start by learning how to represent an HTML document in the Document Object Model (DOM). Then, you'll combine your knowledge of the DOM and Node.js to create a web scraper for practical situations. As you read through further lessons, you'll create a Node.js-based RESTful API using the Express library for Node.js. You'll also understand how modular designs can be used for better reusability and collaboration with multiple developers on a single project. Later lessons will guide you through building unit tests, which ensure that the core functionality of your program is not affected over time. The book will also demonstrate how constructors, async\/await, and events can load your applications quickly and efficiently. Finally, you'll gain useful insights into functional programming concepts such as immutability, pure functions, and higher-order functions. By the end of this book, you'll have the skills you need to tackle any real-world JavaScript development problem using a modern JavaScript approach, both for the client and server sides. What you will learn Apply the core concepts of functional programming Build a Node.js project that uses the Express.js library to host an API Create unit tests for a Node.js project to validate it Use the Cheerio library with Node.js to create a basic web scraper Develop a React interface to build processing flows Use callbacks as a basic way to bring control back Who this book is for If you want to advance from being a frontend developer to a full-stack developer and learn how Node.js can be used for hosting full-stack applications, this is an ideal book for you. After reading this book, you'll be able to write better JavaScript code and learn about the latest trends in the language. To easily grasp the concepts explained here, you should know the basic syntax of JavaScript and should've worked with popular frontend libraries such as jQuery. You should have also used JavaScript with HTML and CSS but not necessarily Node.js.","language":"en","currency":"USD","id":"1838822755","title":"Professional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSOzDwAAQBAJ&source=gbs_api","authors":["Hugo Di Francesco","Siyuan Gao","Vinicius Isola","Philip Kirkbride"]},{"pageCount":668,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QFqxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build and deploy Java microservices using Spring Cloud, Istio, and Kubernetes","description":"Apply microservices patterns to build resilient and scalable distributed systems Key Features Understand the challenges of building large-scale microservice landscapes Build cloud-native production-ready microservices with this comprehensive guide Discover how to get the best out of Spring Cloud, Kubernetes, and Istio when used together Book Description Microservices architecture allows developers to build and maintain applications with ease, and enterprises are rapidly adopting it to build software using Spring Boot as their default framework. With this book, you’ll learn how to efficiently build and deploy microservices using Spring Boot. This microservices book will take you through tried and tested approaches to building distributed systems and implementing microservices architecture in your organization. Starting with a set of simple cooperating microservices developed using Spring Boot, you’ll learn how you can add functionalities such as persistence, make your microservices reactive, and describe their APIs using Swagger\/OpenAPI. As you advance, you’ll understand how to add different services from Spring Cloud to your microservice system. The book also demonstrates how to deploy your microservices using Kubernetes and manage them with Istio for improved security and traffic management. Finally, you’ll explore centralized log management using the EFK stack and monitor microservices using Prometheus and Grafana. By the end of this book, you’ll be able to build microservices that are scalable and robust using Spring Boot and Spring Cloud. What you will learn Build reactive microservices using Spring Boot Develop resilient and scalable microservices using Spring Cloud Use OAuth 2.0\/OIDC and Spring Security to protect public APIs Implement Docker to bridge the gap between development, testing, and production Deploy and manage microservices using Kubernetes Apply Istio for improved security, observability, and traffic management Who this book is for This book is for Java and Spring developers and architects who want to learn how to break up their existing monoliths into microservices and deploy them either on-premises or in the cloud using Kubernetes as a container orchestrator and Istio as a service Mesh. No familiarity with microservices architecture is required to get started with this book.","language":"en","currency":"USD","id":"1789613523","title":"Hands-On Microservices with Spring Boot and Spring Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QFqxDwAAQBAJ&source=gbs_api","authors":["Magnus Larsson"]},{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8FHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"See a Mesos-based big data stack created and the components used. You will use currently available Apache full and incubating systems. The components are introduced by example and you learn how they work together. In the Complete Guide to Open Source Big Data Stack, the author begins by creating a private cloud and then installs and examines Apache Brooklyn. After that, he uses each chapter to introduce one piece of the big data stack—sharing how to source the software and how to install it. You learn by simple example, step by step and chapter by chapter, as a real big data stack is created. The book concentrates on Apache-based systems and shares detailed examples of cloud storage, release management, resource management, processing, queuing, frameworks, data visualization, and more. What You’ll Learn Install a private cloud onto the local cluster using Apache cloud stack Source, install, and configure Apache: Brooklyn, Mesos, Kafka, and Zeppelin See how Brooklyn can be used to install Mule ESB on a cluster and Cassandra in the cloud Install and use DCOS for big data processing Use Apache Spark for big data stack data processing Who This Book Is For Developers, architects, IT project managers, database administrators, and others charged with developing or supporting a big data system. It is also for anyone interested in Hadoop or big data, and those experiencing problems with data size.","language":"en","currency":"USD","id":"1484221494","title":"Complete Guide to Open Source Big Data Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8FHDwAAQBAJ&source=gbs_api","authors":["Michael Frampton"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P03iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop future-proof responsive websites using the latest HTML5 and CSS techniques, 3rd Edition","description":"Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops — plus everything in-between Key Features Understand what responsive web design is and its significance for modern web development Explore the latest developments in responsive web design including variable fonts, CSS Scroll Snap, and more Get to grips with the uses and benefits of the new CSS Grid layout Book Description Responsive Web Design with HTML5 and CSS, Third Edition is a renewed and extended version of one of the most comprehensive and bestselling books on the latest HTML5 and CSS tools and techniques for responsive web design. Written in the author's signature friendly and informal style, this edition covers all the newest developments and improvements in responsive web design including better user accessibility, variable fonts and font loading, CSS Scroll Snap, and much, much more. With a new chapter dedicated to CSS Grid, you will understand how it differs from the Flexbox layout mechanism and when you should use one over the other. Furthermore, you will acquire practical knowledge of SVG, writing accessible HTML markup, creating stunning aesthetics and effects with CSS, applying transitions, transformations, and animations, integrating media queries, and more. The book concludes by exploring some exclusive tips and approaches for front-end development from the author. By the end of this book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. What you will learn Integrate CSS media queries into your designs; apply different styles to different devices Load different sets of images depending upon screen size or resolution Leverage the speed, semantics, and clean markup of accessible HTML patterns Implement SVGs into your designs to provide resolution-independent images Apply the latest features of CSS like custom properties, variable fonts, and CSS Grid Add validation and interface elements like date and color pickers to HTML forms Understand the multitude of ways to enhance interface elements with filters, shadows, animations, and more Who this book is for Are you a full-stack developer who needs to gem up on his front-end skills? Perhaps you work on the front-end and you need a definitive overview of all modern HTML and CSS has to offer? Maybe you have done a little website building but you need a deep understanding of responsive web designs and how to achieve them? This is a book for you! All you need to take advantage of this book is a working understanding of HTML and CSS. No JavaScript knowledge is needed.","language":"en","currency":"USD","id":"1839219793","title":"Responsive Web Design with HTML5 and CSS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P03iDwAAQBAJ&source=gbs_api","authors":["Ben Frain"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2lnYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Kick-start your solutions architect career by learning architecture design principles and strategies","description":"From fundamentals and design patterns to the different strategies for creating secure and reliable architectures in AWS cloud, learn everything you need to become a successful solutions architect Key Features Create solutions and transform business requirements into technical architecture with this practical guide Understand various challenges that you might come across while refactoring or modernizing legacy applications Delve into security automation, DevOps, and validation of solution architecture Book Description Becoming a solutions architect gives you the flexibility to work with cutting-edge technologies and define product strategies. This handbook takes you through the essential concepts, design principles and patterns, architectural considerations, and all the latest technology that you need to know to become a successful solutions architect. This book starts with a quick introduction to the fundamentals of solution architecture design principles and attributes that will assist you in understanding how solution architecture benefits software projects across enterprises. You'll learn what a cloud migration and application modernization framework looks like, and will use microservices, event-driven, cache-based, and serverless patterns to design robust architectures. You'll then explore the main pillars of architecture design, including performance, scalability, cost optimization, security, operational excellence, and DevOps. Additionally, you'll also learn advanced concepts relating to big data, machine learning, and the Internet of Things (IoT). Finally, you'll get to grips with the documentation of architecture design and the soft skills that are necessary to become a better solutions architect. By the end of this book, you'll have learned techniques to create an efficient architecture design that meets your business requirements. What you will learn Explore the various roles of a solutions architect and their involvement in the enterprise landscape Approach big data processing, machine learning, and IoT from an architect's perspective and understand how they fit into modern architecture Discover different solution architecture patterns such as event-driven and microservice patterns Find ways to keep yourself updated with new technologies and enhance your skills Modernize legacy applications with the help of cloud integration Get to grips with choosing an appropriate strategy to reduce cost Who this book is for This book is for software developers, system engineers, DevOps engineers, architects, and team leaders working in the information technology industry who aspire to become solutions architect professionals. A good understanding of the software development process and general programming experience with any language will be useful.","language":"en","currency":"USD","id":"183864783X","title":"Solutions Architect's Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2lnYDwAAQBAJ&source=gbs_api","authors":["Saurabh Shrivastava","Neelanjali Srivastav"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4IzrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Hone your problem-solving skills by learning different algorithms and their implementation in Python","description":"Algorithms play an important role in both the science and practice of computing. To optimally use algorithms, a deeper understanding of their logic and mathematics is essential. Beyond traditional computing, the ability to apply these algorithms to solve real-world problems is a necessary skill, and this is what this book focuses on.","language":"en","currency":"USD","id":"178980986X","title":"40 Algorithms Every Programmer Should Know","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4IzrDwAAQBAJ&source=gbs_api","authors":["Imran Ahmad"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2K3EAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"To make better informed business decisions, better serve clients, and increase operational efficiencies, you must be aware of changes to key data as they occur. In addition, you must enable the immediate delivery of this information to the people and processes that need to act upon it. This ability to sense and respond to data changes is fundamental to dynamic warehousing, master data management, and many other key initiatives. A major challenge in providing this type of environment is determining how to tie all the independent systems together and process the immense data flow requirements. IBM® InfoSphere® Change Data Capture (InfoSphere CDC) can respond to that challenge, providing programming-free data integration, and eliminating redundant data transfer, to minimize the impact on production systems. In this IBM Redbooks® publication, we show you examples of how InfoSphere CDC can be used to implement integrated systems, to keep those systems updated immediately as changes occur, and to use your existing infrastructure and scale up as your workload grows. InfoSphere CDC can also enhance your investment in other software, such as IBM DataStage® and IBM QualityStage®, IBM InfoSphere Warehouse, and IBM InfoSphere Master Data Management Server, enabling real-time and event-driven processes. Enable the integration of your critical data and make it immediately available as your business needs it.","language":"en","currency":"USD","id":"0738436372","title":"Smarter Business: Dynamic Information with IBM InfoSphere Data Replication CDC","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2K3EAgAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Alec Beaton","Mark Ketchie","Frank Ketelaars","Anzar Noor","Judy Parkes","Deepak Rangarao","Bill Shubin","Wim Van Tichelen","IBM Redbooks"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t2bnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19,"subtitle":null,"description":"Get a Jump Start on version control with Git today! If you've worked on a web development project of any size, you've probably used Git, the most broadly adopted distributed version control system available. It enables you to store different versions of project files and directories, so you can roll back to an earlier one if something goes wrong. And since it's distributed, it smoothes the path for dev team collaboration. This short, practical book will help you to: Understand Git's core philosophy. Get started with Git: install it, learn the basic commands, and set up your first project. Work with Git as part of a collaborative team. Use Git's debugging tools for maximum debug efficiency. Master Git workflow Take control with Git's advanced features: reflog, rebase, stash, and more. Use Git with cloud-based Git repository host services like Github and Bitbucket. See how Git's used effectively on large open-source projects. Whether you're a Git newbie or you've been using it for some time but only really scratching the surface of its capabilities, this book will help you to gain a deep understanding of how Git works, and how to use it to streamline your workflow.","language":"en","currency":"USD","id":"1098122879","title":"Jump Start Git","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t2bnDwAAQBAJ&source=gbs_api","authors":["Shaumik Daityari"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kW8LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Discover solutions, techniques, and best practices for server-side web development with Node.js 14, 4th Edition","description":"The fourth edition of Node Cookbook covers the latest features and libraries of Node.js 14. With this recipe-based guide, you’ll learn how to handle files, build simple web applications, and build your own modules using Node.js. You’ll also be able to diagnose problems in your apps, handle security concerns, and deploy your apps to the cloud.","language":"en","currency":"USD","id":"1838554572","title":"Node Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kW8LEAAAQBAJ&source=gbs_api","authors":["Bethany Griggs"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YeH2k26PjtAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Engineering at Cloud Scale","description":"Cloud services are just as susceptible to network outages as any other platform. This concise book shows you how to prepare for potentially devastating interruptions by building your own resilient and reliable applications in the public cloud. Guided by engineers from 9apps—an independent provider of Amazon Web Services and Eucalyptus cloud solutions—you’ll learn how to combine AWS with open source tools such as PostgreSQL, MongoDB, and Redis. This isn’t a book on theory. With detailed examples, sample scripts, and solid advice, software engineers with operations experience will learn specific techniques that 9apps routinely uses in its cloud infrastructures. Build cloud applications with the \"rip, mix, and burn\" approach Get a crash course on Amazon Web Services Learn the top ten tips for surviving outages in the cloud Use elasticsearch to build a dependable NoSQL data store Combine AWS and PostgreSQL to build an RDBMS that scales well Create a highly available document database with MongoDB Replica Set and SimpleDB Augment Redis with AWS to provide backup\/restore, failover, and monitoring capabilities Work with CloudFront and Route 53 to safeguard global content delivery","language":"en","currency":"USD","id":"1449339255","title":"Resilience and Reliability on AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YeH2k26PjtAC&source=gbs_api","authors":["Jurg van Vliet","Flavia Paganelli","Jasper Geurtsen"]},{"pageCount":132,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qEXkBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"An Introduction to Hadoop, Its Ecosystem, and Aligned Technologies","description":"If your organization is about to enter the world of big data, you not only need to decide whether Apache Hadoop is the right platform to use, but also which of its many components are best suited to your task. This field guide makes the exercise manageable by breaking down the Hadoop ecosystem into short, digestible sections. You’ll quickly understand how Hadoop’s projects, subprojects, and related technologies work together. Each chapter introduces a different topic—such as core technologies or data transfer—and explains why certain components may or may not be useful for particular needs. When it comes to data, Hadoop is a whole new ballgame, but with this handy reference, you’ll have a good grasp of the playing field. Topics include: Core technologies—Hadoop Distributed File System (HDFS), MapReduce, YARN, and Spark Database and data management—Cassandra, HBase, MongoDB, and Hive Serialization—Avro, JSON, and Parquet Management and monitoring—Puppet, Chef, Zookeeper, and Oozie Analytic helpers—Pig, Mahout, and MLLib Data transfer—Scoop, Flume, distcp, and Storm Security, access control, auditing—Sentry, Kerberos, and Knox Cloud computing and virtualization—Serengeti, Docker, and Whirr","language":"en","currency":"USD","id":"1491947888","title":"Field Guide to Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qEXkBgAAQBAJ&source=gbs_api","authors":["Kevin Sitto","Marshall Presser"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ota_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Evolutionary Patterns to Transform Your Monolith","description":"How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture. With many illustrative examples, insightful migration patterns, and a bevy of practical advice to transition your monolith enterprise into a microservice operation, this practical guide covers multiple scenarios and strategies for a successful migration, from initial planning all the way through application and database decomposition. You’ll learn several tried and tested patterns and techniques that you can use as you migrate your existing architecture. Ideal for organizations looking to transition to microservices, rather than rebuild Helps companies determine whether to migrate, when to migrate, and where to begin Addresses communication, integration, and the migration of legacy systems Discusses multiple migration patterns and where they apply Provides database migration examples, along with synchronization strategies Explores application decomposition, including several architectural refactoring patterns Delves into details of database decomposition, including the impact of breaking referential and transactional integrity, new failure modes, and more","language":"en","currency":"USD","id":"1492047791","title":"Monolith to Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ota_DwAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jarYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Actionable solutions to common problems in Python web development, 4th Edition","description":"Practical recipes for building fast, robust, and secure web apps using Django 3 and Python Key Features Explore the latest version of Django, and learn effectively with the help of practical examples Follow a task-based approach to develop professional web apps using Django and Python Learn to deploy, scale, and secure apps using Docker and Amazon Web Services(AWS) Book Description Django is a web framework for perfectionists with deadlines, designed to help you build manageable medium and large web projects in a short time span. This fourth edition of Django Web Development Cookbook is updated with Django 3's latest features to guide you effectively through the development process. This Django book starts by helping you create a virtual environment and project structure for building Python web apps. You'll learn how to build models, views, forms, and templates for your web apps and then integrate JavaScript in your Django apps to add more features. As you advance, you'll create responsive multilingual websites, ready to be shared on social networks. The book will take you through uploading and processing images, rendering data in HTML5, PDF, and Excel, using and creating APIs, and navigating different data types in Django. You'll become well-versed in security best practices and caching techniques to enhance your website's security and speed. This edition not only helps you work with the PostgreSQL database but also the MySQL database. You'll also discover advanced recipes for using Django with Docker and Ansible in development, staging, and production environments. By the end of this book, you will have become proficient in using Django's powerful features and will be equipped to create robust websites. What you will learn Discover how to set the basic configurations to start any Django project Understand full-stack web application development using Django Build a database structure using reusable model mixins Implement security, performance, and deployment features in your web apps Import data from local sources and external web services and export it to your app Secure web applications against malicious usage and find and fix common performance bottlenecks Who this book is for This Django book is for Python web developers who want to build fast and secure web apps that can scale over time. You'll also find this book useful if you want to upgrade to the latest Django framework. Knowledge of Python 3, along with a basic understanding of the Django framework will help you make the most of this book.","language":"en","currency":"USD","id":"1838985972","title":"Django 3 Web Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jarYDwAAQBAJ&source=gbs_api","authors":["Aidas Bendoraitis","Jake Kronika"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GfBfCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"從基礎概念到實戰演練，徹底駕馭Hyper-V 3.0 R2虛擬化技術 ★以一台 PC 實體主機運作大量虛擬主機的層層虛擬化環境 透過新一代Hyper-V 3.0 R2虛擬化技術，建置一套具備高可用性、可隨時動態遷移、彈性化虛擬架構其實很簡單。本書特別說明如何藉由「Nested Virtualization」的概念，搭建出「Hyper-V in a Box」多層虛擬化運作環境，只要準備一台 PC 主機，便能實作書中所有虛擬化環境，從基礎設定開始，慢慢進階到Hyper-V 3.0 R2各項實作。 ★一步一步帶您設定及實戰演練Hyper-V虛擬化技術 實作單元包括虛擬磁碟線上擴充及縮小（VHDX Online Resize）、即時遷移（Live Migration）、儲存即時遷移（Live Storage Migration）、無共用儲存即時遷移（Shared-Nothing Live Migration）、Hyper-V 複本（Hyper-V Replica）、重複資料刪除（Data Deduplication）、Windows Azure Backup雲端備份…等技術均有詳盡的說明及操作，以方便您評估新一代Hyper-V 3.0 R2虛擬化技術平台。 ★提供超實用免費線上學習工具，自學進修都不成問題 除了跟著本書進行實戰演練之外，還告訴您如何註冊微軟虛擬學院MVA免費線上學習課程，免費的Windows Server 2012 R2電子書讓您取得更多相關資訊，並透過各種官方所繪製的元件及運作架構圖，快速幫助您了解各種技術的運作原理。 台灣微軟伺服器平台事業部副總經理 周旺暾 台灣微軟資深產品行銷經理 李玉秀 台灣微軟資深企業應用業務經理 蘇書平 --聯合推薦-- *** 電子書版本不提供光碟 *** #博碩文化","language":"zh-CN","currency":"USD","id":"9862019352","title":"24小時不打烊的雲端服務：專家教你用Windows Server 2012 R2 Hyper-V3初級篇：虛擬化環境實戰","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GfBfCgAAQBAJ&source=gbs_api","authors":["王偉任"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"本书以Spring Boot为技术基础，从入门到精通，由浅入深地介绍Spring Data JPA的使用。有语法，有实践，有原理剖析。 本书分为12章，内容包括整体认识JPA、JPA基础查询方法、定义查询方法、注解式查询方法、@Entity实例里面常用注解详解、JpaRepository扩展详解、JPA的MVC扩展REST支持、DataSource的配置、乐观锁、SpEL表达式在Spring Data里面的应用、Spring Data Redis实现cacheable的实践、IntelliJ IDEA加快开发效率、Spring Data REST简单介绍等。 本书适合Java开发初学者、Java开发工程师、Java开发架构师阅读，也适合高等院校和培训学校相关专业的师生教学参考。","language":"zh-CN","currency":"USD","id":"7302499489","title":"Spring Data JPA从入门到精通","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VSf7DwAAQBAJ&source=gbs_api","authors":["张振华著"]},{"pageCount":1008,"thumbnail":"http:\/\/books.google.com\/books\/content?id=m-pfCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.29,"subtitle":null,"description":"新一代的 Hyper-V 3.0 虛擬化技術到底能夠幫助您的企業迎向哪些挑戰，不管是計畫性遷移、非計畫性停機、異地備援、重複資料刪除等進階技術，都內含在Windows Server 2012（Hyper-V 3.0）當中，相信您在閱讀完本書並且實作一遍之後便能有深刻的體會。 想學習 Hyper-V 3.0 虛擬化技術卻不知如何著手？ 除了跟著本書進行實戰演練之外，還告訴您如何註冊微軟虛擬學院 MVA 免費線上學習課程，在家進修也OK！ 沒有時間及設備準備書中所談 Hyper-V 3.0 虛擬化測試環","language":"zh-CN","currency":"USD","id":"9862017325","title":"24小時不打烊的雲端服務 : 專家教你用Windows Server 2012 Hyper-V3.0實戰虛擬化技術","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=m-pfCgAAQBAJ&source=gbs_api","authors":["王偉任"]},{"pageCount":194,"thumbnail":"http:\/\/books.google.com\/books\/content?id=e3jJAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication is intended for business leaders and IT architects who are responsible for building and extending their data warehouse and Business Intelligence infrastructure. It provides an overview of powerful new capabilities of Information Server in the areas of big data, statistical models, data governance and data quality. The book also provides key technical details that IT professionals can use in solution planning, design, and implementation.","language":"en","currency":"USD","id":"0738438499","title":"IBM Information Server: Integration and Governance for Emerging Data Warehouse Demands","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=e3jJAgAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Manish Bhide","Holger Kache","Bob Kitzberger","Beate Porst","Yeh-Heng Sheng","Harald C. Smith","IBM Redbooks"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fd9YDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build light weight, scalable, and faster web applications with the power of JSON, 2nd Edition","description":"Use JSON for building web applications with technologies like HTML, JavaScript, Angular, Node.js, Hapi.js, Kafka, socket.io, MongoDB, Gulp.js, and handlebar.js, and others formats like GEOJSON, JSON-LD, MessagePack, and BSON. Key Features Use JSON with trending technologies like Angular, Hapi.js, MongoDB, Kafka, and Socket.io Debug, validate, and format JSON using developer toolkits, JSONLint, and JSON Editor Online Explore other JSON formats like GeoJSON, JSON-LD, BSON, and MessagePack Book Description JSON is an established and standard format used to exchange data. This book shows how JSON plays different roles in full web development through examples. By the end of this book, you'll have a new perspective on providing solutions for your applications and handling their complexities. After establishing a strong basic foundation with JSON, you'll learn to build frontend apps by creating a carousel. Next, you'll learn to implement JSON with Angular 5, Node.js, template embedding, and composer.json in PHP. This book will also help you implement Hapi.js (known for its JSON-configurable architecture) for server-side scripting. You'll learn to implement JSON for real-time apps using Kafka, as well as how to implement JSON for a task runner, and for MongoDB BSON storage. The book ends with some case studies on JSON formats to help you sharpen your creativity by exploring futuristic JSON implementations. By the end of the book, you'll be up and running with all the essential features of JSON and JavaScript and able to build fast, scalable, and efficient web applications. What you will learn Use JSON to store metadata for dependency managers, package managers, configuration managers, and metadata stores Handle asynchronous behavior in applications using callbacks, promises, generators, and async-await functions Use JSON for Angular 5, Node.js, Gulp.js, and Hapi.js Implement JSON as BSON in MongoDB Make use of JSON in developing automation scripts Implement JSON for realtime using socket.io and distributed systems using Kafka Who this book is for If you’re a web developer with a basic understanding of JavaScript and want to write JSON data, integrate it with RESTful APIs to create faster and scalable applications, this book is for you.","language":"en","currency":"USD","id":"1788628764","title":"JavaScript and JSON Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fd9YDwAAQBAJ&source=gbs_api","authors":["Sai S Sriparasa","Bruno Joseph D'mello"]},{"pageCount":218,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rHzJAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Building on the business intelligence (BI) framework and capabilities that are outlined in InfoSphere Warehouse: A Robust Infrastructure for Business Intelligence, SG24-7813, this IBM® Redbooks® publication focuses on the new business insight challenges that have arisen in the last few years and the new technologies in IBM DB2® 10 for Linux, UNIX, and Windows that provide powerful analytic capabilities to meet those challenges. This book is organized in to two parts. The first part provides an overview of data warehouse infrastructure and DB2 Warehouse, and outlines the planning and design process for building your data warehouse. The second part covers the major technologies that are available in DB2 10 for Linux, UNIX, and Windows. We focus on functions that help you get the most value and performance from your data warehouse. These technologies include database partitioning, intrapartition parallelism, compression, multidimensional clustering, range (table) partitioning, data movement utilities, database monitoring interfaces, infrastructures for high availability, DB2 workload management, data mining, and relational OLAP capabilities. A chapter on BLU Acceleration gives you all of the details about this exciting DB2 10.5 innovation that simplifies and speeds up reporting and analytics. Easy to set up and self-optimizing, BLU Acceleration eliminates the need for indexes, aggregates, or time-consuming database tuning to achieve top performance and storage efficiency. No SQL or schema changes are required to take advantage of this breakthrough technology. This book is primarily intended for use by IBM employees, IBM clients, and IBM Business Partners.","language":"en","currency":"USD","id":"0738438979","title":"Leveraging DB2 10 for High Performance of Your Data Warehouse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rHzJAgAAQBAJ&source=gbs_api","authors":["Whei-Jen Chen","Scott Andrus","Bhuvana Balaji","Enzo Cialini","Michael Kwok","Roman B. Melnyk","Jessica Rockwood","IBM Redbooks"]},{"pageCount":138,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTlECgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Neo4j is a graph database that allows you to model your data as a graph and find solutions to complex real-world problems that are difficult to solve using any other type of database. This book is designed to help you understand the intricacies of modeling a graph for any domain. The book starts with an example of a graph problem and then introduces you to modeling non-graph problems using Neo4j. Concepts such as the evolution of your database, chains, access control, and recommendations are addressed, along with examples and are modeled in a graph. Throughout the book, you will discover design choices and trade-offs, and understand how and when to use them. By the end of the book, you will be able to effectively use Neo4j to model your database for efficiency and flexibility.","language":"en","currency":"USD","id":"178439730X","title":"Neo4j Graph Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTlECgAAQBAJ&source=gbs_api","authors":["Mahesh Lal"]},{"pageCount":1872,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NeBPAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Buy the print version of¿ Microsoft SQL Server 2012 Unleashed and get the eBook version for free! eBook version includes chapters 44-60 not included in the print. See inside the book for access code and details. ¿ With up-to-the-minute content, this is the industry’s most complete, useful guide to SQL Server 2012. ¿ You’ll find start-to-finish coverage of SQL Server’s core database server and management capabilities: all the real-world information, tips, guidelines, and samples you’ll need to create and manage complex database solutions. The additional online chapters add extensive coverage of SQL Server Integration Services, Reporting Services, Analysis Services, T-SQL programming, .NET Framework integration, and much more. ¿ Authored by four expert SQL Server administrators, designers, developers, architects, and consultants, this book reflects immense experience with SQL Server in production environments. Intended for intermediate-to-advanced-level SQL Server professionals, it focuses on the product’s most complex and powerful capabilities, and its newest tools and features. Understand SQL Server 2012’s newest features, licensing changes, and capabilities of each edition Manage SQL Server 2012 more effectively with SQL Server Management Studio, the SQLCMD command-line query tool, and Powershell Use Policy-Based Management to centrally configure and operate SQL Server Utilize the new Extended Events trace capabilities within SSMS Maximize performance by optimizing design, queries, analysis, and workload management Implement new best practices for SQL Server high availability Deploy AlwaysOn Availability Groups and Failover Cluster Instances to achieve enterprise-class availability and disaster recovery Leverage new business intelligence improvements, including Master Data Services, Data Quality Services and Parallel Data Warehouse Deliver better full-text search with SQL Server 2012’s new Semantic Search Improve reporting with new SQL Server 2012 Reporting Services features Download the following from informit.com\/title\/9780672336928: Sample databases and code examples ¿ ¿","language":"en","currency":"USD","id":"0133408515","title":"Microsoft SQL Server 2012 Unleashed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NeBPAgAAQBAJ&source=gbs_api","authors":["Ray Rankins","Paul Bertucci","Chris Gallelli","Alex T. Silverstein"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0f9oLxovqIMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.76,"subtitle":null,"description":"Data Modeling Essentials, Third Edition, covers the basics of data modeling while focusing on developing a facility in techniques, rather than a simple familiarization with \"the rules\". In order to enable students to apply the basics of data modeling to real models, the book addresses the realities of developing systems in real-world situations by assessing the merits of a variety of possible solutions as well as using language and diagramming methods that represent industry practice. This revised edition has been given significantly expanded coverage and reorganized for greater reader comprehension even as it retains its distinctive hallmarks of readability and usefulness. Beginning with the basics, the book provides a thorough grounding in theory before guiding the reader through the various stages of applied data modeling and database design. Later chapters address advanced subjects, including business rules, data warehousing, enterprise-wide modeling and data management. It includes an entirely new section discussing the development of logical and physical modeling, along with new material describing a powerful technique for model verification. It also provides an excellent resource for additional lectures and exercises. This text is the ideal reference for data modelers, data architects, database designers, DBAs, and systems analysts, as well as undergraduate and graduate-level students looking for a real-world perspective. Thorough coverage of the fundamentals and relevant theory. Recognition and support for the creative side of the process. Expanded coverage of applied data modeling includes new chapters on logical and physical database design. New material describing a powerful technique for model verification. Unique coverage of the practical and human aspects of modeling, such as working with business specialists, managing change, and resolving conflict.","language":"en","currency":"USD","id":"9780080488677","title":"Data Modeling Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0f9oLxovqIMC&source=gbs_api","authors":["Graeme Simsion","Graham Witt"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iJsbBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":62.49,"subtitle":null,"description":"Introduce your students to the latest that Microsoft Office has to offer with the new generation of Shelly Cashman Series books! For the past three decades, the Shelly Cashman Series has effectively introduced computer skills to millions of students. With MICROSOFT ACCESS 2013, we're continuing our history of innovation by enhancing our proven pedagogy to reflect the learning styles of today's students. In this text you'll find features that are specifically designed to engage students, improve retention, and prepare them for future success. Our trademark step-by-step, screen-by-screen approach now encourages students to expand their understanding of MICROSOFT ACCESS 2013 through experimentation, critical thought, and personalization. With these enhancements and more, the Shelly Cashman Series continues to deliver the most effective educational materials for you and your students. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","language":"en","currency":"USD","id":"128596621X","title":"Microsoft Access 2013: Complete","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iJsbBQAAQBAJ&source=gbs_api","authors":["Philip J. Pratt","Mary Z. Last"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U5LUDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Enabling Test-Driven Development, Domain-Driven Design, and Event-Driven Microservices","description":"As Python continues to grow in popularity, projects are becoming larger and more complex. Many Python developers are taking an interest in high-level software design patterns such as hexagonal\/clean architecture, event-driven architecture, and the strategic patterns prescribed by domain-driven design (DDD). But translating those patterns into Python isn’t always straightforward. With this hands-on guide, Harry Percival and Bob Gregory from MADE.com introduce proven architectural design patterns to help Python developers manage application complexity—and get the most value out of their test suites. Each pattern is illustrated with concrete examples in beautiful, idiomatic Python, avoiding some of the verbosity of Java and C# syntax. Patterns include: Dependency inversion and its links to ports and adapters (hexagonal\/clean architecture) Domain-driven design’s distinction between Entities, Value Objects, and Aggregates Repository and Unit of Work patterns for persistent storage Events, commands, and the message bus Command-query responsibility segregation (CQRS) Event-driven architecture and reactive microservices","language":"en","currency":"USD","id":"1492052159","title":"Architecture Patterns with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U5LUDwAAQBAJ&source=gbs_api","authors":["Harry Percival","Bob Gregory"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CppGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"The meanest set of MEAN stack solutions around","description":"Over 50 recipes to create full-stack high-performance web applications using pure JavaScript and the MEAN stack. About This Book Architect a fully functional stand-alone web application, including the web server, database, and front-end web application Improve the performance and maintainability of your MEAN stack application with tips for configuration and optimization Highlights MEAN Stack best practices when working with your application Who This Book Is For If you are a JavaScript developer who wants to create high-performing, modern web applications with the MEAN stack, this is the book for you. Web developers familiar with some parts of the MEAN stack will find this a comprehensive guide to fleshing out the other technologies and skills they need to build all JavaScript web applications. Developers interested in transitioning from other web application stacks to an all-JavaScript environment will find a wealth of information about how to work in a MEAN stack environment. To get the most from this book, you should have a general understanding of web servers and web applications. You are expected to have a basic understanding of running JavaScript, both in a web browser and outside it, using Node.js and the NPM package manager. What You Will Learn Bootstrap a new MEAN stack web application using Node.js and Express Build a single-page application (SPA) with Angular and Angular-CLI Improve browser performance by optimizing your web application resources using Webpack Model complex JSON object relationships in MongoDB using Mongoose Debug all the layers of a MEAN stack application, including working with source maps Build Restful APIs using Express.js and JSON Web Token (JWT) for user authentication Use automated testing to improve the reliability and quality of your MEAN stack application In Detail The MEAN Stack is a framework for web application development using JavaScript-based technologies; MongoDB, Express, Angular, and Node.js. If you want to expand your understanding of using JavaScript to produce a fully functional standalone web application, including the web server, user interface, and database, then this book can help guide you through that transition. This book begins by configuring the frontend of the MEAN stack web application using the Angular JavaScript framework. We then implement common user interface enhancements before moving on to configuring the server layer of our MEAN stack web application using Express for our backend APIs. You will learn to configure the database layer of your MEAN stack web application using MongoDB and the Mongoose framework, including modeling relationships between documents. You will explore advanced topics such as optimizing your web application using WebPack as well as the use of automated testing with the Mocha and Chai frameworks. By the end of the book, you should have acquired a level of proficiency that allows you to confidently build a full production-ready and scalable MEAN stack application. Style and Approach This book is a guide of MEAN Stack specific solutions to common web application problems and includes in-depth guides for each layer of the application stack. Readers looking to upgrade their MEAN Stack web application will find recipes within to help them transition.","language":"en","currency":"USD","id":"1787288153","title":"MEAN Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CppGDwAAQBAJ&source=gbs_api","authors":["Nicholas McClay"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":"Rapid, Confident, Maintainable Code","description":"Debunk the myth that JavaScript is not easily testable. Whether you use Node.js, Express, MongoDB, jQuery, AngularJS, or directly manipulate the DOM, you can test-drive JavaScript. Learn the craft of writing meaningful, deterministic automated tests with Karma, Mocha, and Chai. Test asynchronous JavaScript, decouple and properly mock out dependencies, measure code coverage, and create lightweight modular designs of both server-side and client-side code. Your investment in writing tests will pay high dividends as you create code that's predictable and cost-effective to change. Design and code JavaScript applications with automated tests. Writing meaningful tests is a skill that takes learning, some unlearning, and a lot of practice, and with this book, you'll hone that skill. Fire up the editor and get hands-on through practical exercises for effective automated testing and designing maintainable, modular code. Start by learning when and why to do manual testing vs. automated verification. Focus tests on the important things, like the pre-conditions, the invariants, complex logic, and gnarly edge cases. Then begin to design asynchronous functions using automated tests. Carefully decouple and mock out intricate dependencies such as the DOM, geolocation API, file and database access, and Ajax calls to remote servers. Step by step, test code that uses Node.js, Express, MongoDB, jQuery, and AngularJS. Know when and how to use tools such as Chai, Istanbul, Karma, Mocha, Protractor, and Sinon. Create tests with minimum effort and run them fast without having to spin up web servers or manually edit HTML pages to run in browsers. Then explore end-to-end testing to ensure all parts are wired and working well together. Don't just imagine creating testable code, write it. What You Need: A computer with a text editor and your favorite browser. The book provides instructions to install the necessary automated testing-related tools.","language":"en","currency":"USD","id":"1680504908","title":"Test-Driving JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cg9QDwAAQBAJ&source=gbs_api","authors":["Venkat Subramaniam"]}]