[{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dgInDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.1,"subtitle":"PHP MySQL Web Develo _5","description":"PHP and MySQL Web Development, Fifth Edition The definitive guide to building database-driven Web applications with PHP and MySQL PHP and MySQL are popular open-source technologies that are ideal for quickly developing database-driven Web applications. PHP is a powerful scripting language designed to enable developers to create highly featured Web applications quickly, and MySQL is a fast, reliable database that integrates well with PHP and is suited for dynamic Internet-based applications. PHP and MySQL Web Development shows how to use these tools together to produce effective, interactive Web applications. It clearly describes the basics of the PHP language, explains how to set up and work with a MySQL database, and then shows how to use PHP to interact with the database and the server. This practical, hands-on book consistently focuses on real-world applications, even in the introductory chapters. The authors cover important aspects of security and authentication as they relate to building a real-world website and show you how to implement these aspects in PHP and MySQL. They also introduce you to the integration of front-end and back-end technologies by using JavaScript in your application development. The final part of this book describes how to approach real-world projects and takes the reader through the design, planning, and building of several projects, including: User authentication and personalization Web-based email Social media integration Shopping cart The fifth edition of PHP and MySQL Web Development has been thoroughly updated, revised, and expanded to cover developments in PHP through versions 5.6 and 7, as well as features introduced in recent stable releases of MySQL. Free Access to Web Edition Purchase of this book in any format, electronic or print, includes free access to the corresponding Web Edition, which provides several special features: The complete text of the book online Exercises and interactive quizzes to test your understanding of the material Bonus chapters not included in the print or e-book editions Updates and corrections as they become available The Web Edition can be viewed on all types of computers and mobile devices with any modern web browser that supports HTML5. Contents at a Glance Part I: Using PHP 1 PHP Crash Course 2 Storing and Retrieving Data 3 Using Arrays 4 String Manipulation and Regular Expressions 5 Reusing Code and Writing Functions 6 Object-Oriented PHP 7 Error and Exception Handling Part II: Using MySQL 8 Designing Your Web Database 9 Creating Your Web Database 10 Working with Your MySQL Database 11 Accessing Your MySQL Database from the Web with PHP 12 Advanced MySQL Administration 13 Advanced MySQL Programming Part III: Web Application Security 14 Web Application Security Risks 15 Building a Secure Web Application 16 Implementing Authentication Methods with PHP Part IV: Advanced PHP Techniques 17 Interacting with the File System and the Server 18 Using Network and Protocol Functions 19 Managing the Date and Time 20 Internationalization and Localization 21 Generating Images 22 Using Session Control in PHP 23 Integrating JavaScript and PHP 24 Other Useful Features Part V: Building Practical PHP and MySQL Projects 25 Using PHP and MySQL for Large Projects 26 Debugging and Logging 27 Building User Authentication and Personalization 28 (Web Edition) Building a Web-Based Email Client with Laravel Part I 29 (Web Edition) Building a Web-Based Email Client with Laravel Part II 30 (Web Edition) Social Media Integration Sharing and Authentication 31 (Web Edition) Building a Shopping Cart Part VI: Appendix A Installing Apache, PHP, and MySQL","language":"en","currency":"USD","id":"0133038637","title":"PHP and MySQL Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dgInDQAAQBAJ&source=gbs_api","authors":["Luke Welling","Laura Thomson"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UHCiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.99,"subtitle":"Um Guia Conciso para o Mundo Emergente da Persistência Poliglota","description":"A necessidade de se lidar com volumes cada vez maiores de dados é um fator que motiva adotar uma nova classe de bancos de dados não relacionais, NoSQL. Os defensores dos bancos de dados NoSQL alegam que estes podem ser utilizados para criar sistemas com melhor desempenho, escalabilidade e mais fáceis de programar. NoSQL Essencial é uma introdução concisa, porém completa, a essa tecnologia emergente em rápida ascensão. Pramod J. Sadalage e Martin Fowler explicam como bancos de dados NoSQL funcionam e as formas pelas quais podem ser uma alternativa superior a um sistema tradicional de gerenciamento de banco de dados relacional. Os autores apresentam um guia rápido sobre os conceitos que você precisa conhecer para avaliar se os bancos de dados NoSQL são apropriados a suas necessidades e, se forem, quais tecnologias você deve explorar mais detalhadamente. A primeira parte do livro concentra-se em conceitos básicos, incluindo modelos de dados sem esquema, agregados, novos modelos de distribuição, teorema CAP e map-reduce. Na segunda parte, os autores exploram questões de arquitetura e projeto associadas à implementação de NoSQL. Também apresentam casos de uso reais, que mostram os bancos de dados NoSQL em ação, e fornecem exemplos representativos utilizando Riak, MongoDB, Cassandra e Neo4j. Além disso, ao trazer o trabalho pioneiro de Pramod Sadalage, NoSQL Essencial mostra como implementar projetos de forma evolutiva com migração de esquemas: uma técnica fundamental a ser utilizada em bancos de dados NoSQL. O livro termina descrevendo como o NoSQL se estabelece em uma nova era de persistência poliglota, em que diversos mundos de armazenamento de dados coexistem e os arquitetos podem escolher a tecnologia mais otimizada para cada tipo de acesso a dados.","language":"pt","currency":"USD","id":"8575227858","title":"NoSQL Essencial","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UHCiDwAAQBAJ&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":658,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HSBKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Learn the fundamentals of Node.js, and deploy and test Node.js applications on the web","description":"A comprehensive, easy-to-follow guide to creating complete Node apps and understanding how to build, deploy, and test your own apps. Key Features Entirely project-based and practical Explains the \"Why\" of Node.js features, not just the \"how\", providing you with a deep understanding and enabling you to easily apply concepts in your own applications Covers the full range of technologies around Node.js – NPM, version control with Git, and much more Book Description Learning Node.js Development is a practical, project-based book that provides you with all you need to get started as a Node.js developer. Node is a ubiquitous technology on the modern web, and an essential part of any web developers' toolkit. If you are looking to create real-world Node applications, or you want to switch careers or launch a side project to generate some extra income, then you're in the right place. This book has been written around a single goal—turning you into a professional Node developer capable of developing, testing, and deploying real-world production applications. Learning Node.js Development is built from the ground up around the latest version of Node.js (version 9.x.x). You'll be learning all the cutting-edge features available only in the latest software versions. This book cuts through the mass of information available around Node and delivers the essential skills that you need to become a Node developer. It takes you through creating complete apps and understanding how to build, deploy, and test your own Node apps. It maps out everything in a comprehensive, easy-to-follow package designed to get you up and running quickly. What you will learn Learn the fundamentals of Node Build apps that respond to user input Master working with servers Learn how to test and debug applications Deploy and update your apps in the real world Create responsive asynchronous web applications Who this book is for This book targets anyone looking to launch their own Node applications, switch careers, or freelance as a Node developer. You should have a basic understanding of JavaScript in order to follow this course.","language":"en","currency":"USD","id":"1788396340","title":"Learning Node.js Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HSBKDwAAQBAJ&source=gbs_api","authors":["Andrew Mead"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Effective data modeling, performance tuning and data visualization techniques in Neo4j","description":"Run blazingly fast queries on complex graph datasets with the power of the Neo4j graph database About This Book Get acquainted with graph database systems and apply them in real-world use cases Use Cypher query language, APOC and other Neo4j extensions to derive meaningful analysis from complex data sets. A practical guide filled with ready to use examples on querying, graph processing and visualizing information to build smarter spatial applications. Who This Book Is For This book is for developers who want an alternative way to store and process data within their applications. No previous graph database experience is required; however, some basic database knowledge will help you understand the concepts more easily. What You Will Learn Understand the science of graph theory, databases and its advantages over traditional databases. Install Neo4j, model data and learn the most common practices of traversing data Learn the Cypher query language and tailor-made procedures to analyze and derive meaningful representations of data Improve graph techniques with the help of precise procedures in the APOC library Use Neo4j advanced extensions and plugins for performance optimization. Understand how Neo4j's new security features and clustering architecture are used for large scale deployments. In Detail Neo4j is a graph database that allows traversing huge amounts of data with ease. This book aims at quickly getting you started with the popular graph database Neo4j. Starting with a brief introduction to graph theory, this book will show you the advantages of using graph databases along with data modeling techniques for graph databases. You'll gain practical hands-on experience with commonly used and lesser known features for updating graph store with Neo4j's Cypher query language. Furthermore, you'll also learn to create awesome procedures using APOC and extend Neo4j's functionality, enabling integration, algorithmic analysis, and other advanced spatial operation capabilities on data. Through the course of the book you will come across implementation examples on the latest updates in Neo4j, such as in-graph indexes, scaling, performance improvements, visualization, data refactoring techniques, security enhancements, and much more. By the end of the book, you'll have gained the skills to design and implement modern spatial applications, from graphing data to unraveling business capabilities with the help of real-world use cases. Style and approach A step-by-step approach of adopting Neo4j, the world's leading graph database. This book includes a lot of background information, helps you grasp the fundamental concepts behind this radical new way of dealing with connected data, and will give you lots of examples of use cases and environments where a graph database would be a great fit","language":"en","currency":"USD","id":"1786460084","title":"Learning Neo4j 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_xhKDwAAQBAJ&source=gbs_api","authors":["Jerome Baton","Rik Van Bruggen"]},{"pageCount":148,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cdJtDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Design and implement efficient RESTful solutions with this practical hands-on guide About This Book Create a fully featured RESTful API solution from scratch. Learn how to leverage Node.JS, Express, MongoDB and NoSQL datastores to give an extra edge to your REST API design. Use this practical guide to integrate MongoDB in your Node.js application. Who This Book Is For The ideal target audience for this book is web developers who have some experience with RESTful services. Familiarity with basic JavaScript programming techniques is required. No prior experience with Node.JS or Express.js is required. What You Will Learn Install, develop, and test your own Node.js user modules Comprehend the differences between an HTTP and a RESTful application Optimize RESTful service URI routing with best practices Eliminate third-party dependencies in your tests with mocking Learn about NoSQL data stores and integrate MongoDB in your Node.js application with Mongoose Secure your services with NoSQL database integration within Node.js applications Enrich your development skills to create scalable, server-side, RESTful applications based on the Node.js platform In Detail In this era of cloud computing, every data provisioning solution is built in a scalable and fail-safe way. Thus, when building RESTful services, the right choice for the underlying platform is vital. Node.js, with its asynchronous, event-driven architecture, is exactly the right choice to build RESTful APIs. This book will help you enrich your development skills to create scalable, server-side, RESTful applications based on the Node.js platform. Starting with the fundamentals of REST, you will understand why RESTful web services are better data provisioning solution than other technologies. You will start setting up a development environment by installing Node.js, Express.js, and other modules. Next, you will write a simple HTTP request handler and create and test Node.js modules using automated tests and mock objects. You will then have to choose the most appropriate data storage type, having options between a key\/value or document data store, and also you will implement automated tests for it. This module will evolve chapter by chapter until it turns into a full-fledged and secure Restful service. Style and approach Create state of the art RESTful API solutions leveraging Node.JS 4.x.","language":"en","currency":"USD","id":"1786463202","title":"RESTful Web API Design with Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cdJtDQAAQBAJ&source=gbs_api","authors":["Valentin Bojinov"]},{"pageCount":309,"thumbnail":"http:\/\/books.google.com\/books\/content?id=I9TBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Create Cross-Platform Mobile Apps","description":"Create iOS and Android apps with Flutter using just one codebase. App development on multiple platforms has historically been difficult and complex. This book breaks down complex concepts and tasks into easily digestible segments with examples, pictures, and hands-on labs with starters and solutions. In doing so, you'll develop a basic understanding of the Dart programming language; the entire Flutter development toolchain; the differences between stateful and stateless widgets; and a working knowledge of the architecture of apps. All the most important parts of app development with Flutter are covered in this book. Work with themes and styles. Develop custom widgets. Teach your app to respond to gestures like taps, swipes, and pinches. Design, create and control the layout of your app. Create tools to handle form data entry from users. And ultimately create killer multiscreen apps with navigation, menus, and tabs. Flutter is Google's new framework for creating mobile apps that run on iOS and Android phones both.You had to be a super-developer to write apps for iOS or Android alone. But writing for both? Forget about it! You had to be familiar with Swift, Java\/Kotlin, Xcode, Eclipse, and a bunch of other technologies simultaneously. Beginning App Development with Flutter simplifies the entire process. What You'll Learn Get the most out of great Flutter widgets Create custom widgets, both stateless and stateful Exercise expert control over your Flutter layouts Make your app respond to gestures like swiping, pinching and tapping Initiate async Ajax calls to RESTful APIs — including Google Firebase! Who This Book Is ForDevelopers who have coded in Java, C#, C++, or any similar language. It brings app development within the reach of younger developers, so STEM groups are likely to pick up the technology. Managers, product owners, and business analysts need to understand Flutter's capabilities.","language":"en","currency":"USD","id":"1484251814","title":"Beginning App Development with Flutter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=I9TBDwAAQBAJ&source=gbs_api","authors":["Rap Payne"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wZb9AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Lift Application Development Cookbook contains practical recipes on everything you will need to create secure web applications using this amazing framework.The book first teaches you basic topics such as starting a new application and gradually moves on to teach you advanced topics to achieve a certain task. Then, it explains every step in detail so that you can build your knowledge about how things work.This book is for developers who have at least some basic knowledge about Scala and who are looking for a functional, secure, and modern web framework. Prior experience with HTML and JavaScript is assumed.","language":"en","currency":"USD","id":"1849515891","title":"Lift Application Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wZb9AAAAQBAJ&source=gbs_api","authors":["Gilberto T. Garcia Jr."]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZqzEAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In this IBM® Redbooks® publication, we discuss and describe the positioning, functions, capabilities, and advanced programming techniques for IBM InfoSphereTM Streams (V2), a new paradigm and key component of IBM Big Data platform. Data has traditionally been stored in files or databases, and then analyzed by queries and applications. With stream computing, analysis is performed moment by moment as the data is in motion. In fact, the data might never be stored (perhaps only the analytic results). The ability to analyze data in motion is called real-time analytic processing (RTAP). IBM InfoSphere Streams takes a fundamentally different approach to Big Data analytics and differentiates itself with its distributed runtime platform, programming model, and tools for developing and debugging analytic applications that have a high volume and variety of data types. Using in-memory techniques and analyzing record by record enables high velocity. Volume, variety and velocity are the key attributes of Big Data. The data streams that are consumable by IBM InfoSphere Streams can originate from sensors, cameras, news feeds, stock tickers, and a variety of other sources, including traditional databases. It provides an execution platform and services for applications that ingest, filter, analyze, and correlate potentially massive volumes of continuous data streams. This book is intended for professionals that require an understanding of how to process high volumes of streaming data or need information about how to implement systems to satisfy those requirements. See: http:\/\/www.redbooks.ibm.com\/abstracts\/sg247865.html for the IBM InfoSphere Streams (V1) release.","language":"en","currency":"USD","id":"0738436151","title":"IBM InfoSphere Streams: Assembling Continuous Insight in the Information Revolution","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZqzEAgAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Kevin Foster","Andy Frenkiel","Bugra Gedik","Michael P. Koranda","Senthil Nathan","Deepak Rajan","Roger Rea","Mike Spicer","Brian Williams","Vitali N. Zoubov","IBM Redbooks"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MwwxCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Angu Java jQue All One Sa_p1","description":"Learn AngularJS, JavaScript and jQuery Web Application Development In just a short time, you can learn the basics of the JavaScript language, jQuery library, and AngularJS framework – and find out how to use them to build well-designed, reusable components for web applications. Sams Teach Yourself AngularJS, JavaScript, and jQuery All in One assumes absolutely no previous knowledge of JavaScript or jQuery. The authors begin by helping students gain the relevant JavaScript skills they need, introducing JavaScript in a way specifically designed for modern AngularJS web development. Each short, easy lesson builds on all that's come before, teaching new concepts and techniques from the ground up, through practical examples and hands-on problem solving. As you complete the lessons in this book, you'll gain a practical understanding of how to provide rich user interactions in your web pages, adding dynamic code that allows web pages to instantly react to mouse clicks and finger swipes, and interact with back-end services to store and retrieve data from the web server. Learn how to: Create powerful, highly interactive single-page web applications Leverage AngularJS’s innovative MVC approach to web development Use JavaScript in modern frameworks Implement JavaScript, jQuery, and AngularJS together in web pages Dynamically modify page elements in the browser Use browser events to interact with the user directly Implement client-side services that interact with web servers Integrate rich user interface components, including zoomable images and expandable lists Enhance user experience by creating AngularJS templates with built-in directives Bind user interface elements and events to the data model to add flexibility and support more robust interactivity Define custom AngularJS directives to extend HTML’s capabilities Build dynamic browser views to provide richer user interaction Create custom services you can integrate into many AngularJS applications Develop a well-structured code base that’s easy to reuse and maintain Contents at a Glance Part I: An Introduction to AngularJS, jQuery, and JavaScript Development 1 Introduction to Dynamic Web Programming 2 Debugging JavaScript in Web Pages 3 Understanding Dynamic Web Page Anatomy 4 Adding CSS\/CSS3 Styles to Allow Dynamic Design and Layout 5 Jumping into jQuery and JavaScript Syntax 6 Understanding and Using JavaScript Objects Part II: Implementing jQuery and JavaScript in Web Pages 7 Accessing DOM Elements Using JavaScript and jQuery Objects 8 Navigating and Manipulating jQuery Objects and DOM Elements with jQuery 9 Applying JavaScript and jQuery Events for Richly Interactive Web Pages 10 Dynamically Accessing and Manipulating Web Pages with JavaScript and jQuery 11 Working with Window, Browser, and Other Non-Web Page Elements Part III: Building Richly Interactive Web Pages with jQuery 12 Enhancing User Interaction Through jQuery Animation and Other Special Effects 13 Interacting with Web Forms in jQuery and JavaScript 14 Creating Advanced Web Page Elements in jQuery 15 Accessing Server-Side Data via JavaScript and jQuery AJAX Requests Part IV: Utilizing jQuery UI 16 Introducing jQuery UI 17 Using jQuery UI Effects 18 Advanced Interactions With jQuery UI Interaction Widgets 19 Using jQuery UI Widgets to Add Rich Interactions to Web Pages Part V: Building Web Applications with AngularJS 20 Getting Started with AngularJS 21 Understanding AngularJS Application Dynamics 22 Implementing the Scope as a Data Model 23 Using AngularJS Templates to Create Views 24 Implementing Directives in AngularJS Views 25 Creating Your Own Custom Directives to Extend HTML 26 Using Events to Interact with Data in the Model 27 Implementing AngularJS Services in Web Applications 28 Creating Your Own Custom AngularJS Services 29 Creating Rich Web Application Components the AngularJS Way","language":"en","currency":"USD","id":"0134171691","title":"AngularJS, JavaScript, and jQuery All in One, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MwwxCgAAQBAJ&source=gbs_api","authors":["Brad Dayley","Brendan Dayley"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_VfAAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication describes IBM DB2® SQL compatibility features. The latest version of DB2 includes extensive native support for the PL\/SQL procedural language, new data types, scalar functions, improved concurrency, built-in packages, OCI, SQLPlus, and more. These features can help with developing applications that run on both DB2 and Oracle and can help simplify the process of moving from Oracle to DB2. In addition, IBM now provides tools to simplify the enablement process, such as the highly scalable IBM Data Movement Tool for moving schema and data into DB2, and an Editor and Profiler for PL\/SQL provided by the IBM Data Studio tool suite. This Oracle to DB2 migration guide describes new technology, preferred practices for moving to DB2, and common scenarios that can help you as you move from Oracle to DB2. This book is intended for IT architects and developers who are converting from Oracle to DB2. DB2 compatibility with Oracle is provided through native support. The new capabilities in DB2 that provide compatibility are implemented at the lowest and most intimate levels of the database kernel, as though they were originally engineered for DB2. means that the DB2 implementation is done without the aid of an emulation layer. This intimacy leads to the scalable implementation that DB2 offers, providing identical performance between DB2 compatibility features and DB2 other language elements. For example, DB2 runs SQL PL at the same performance as PL\/SQL implementations of the same function.","language":"en","currency":"USD","id":"0738438758","title":"Oracle to DB2 Conversion Guide: Compatibility Made Easy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_VfAAgAAQBAJ&source=gbs_api","authors":["Yvonne Chan","Nick Ivanov","Olaf Mueller","IBM Redbooks"]},{"pageCount":55,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sJNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Secrets of a Successful Online Course Creator and Other Income Strategies that Really Work","description":"Discover what you need to learn to thrive and master online course creation and other income generating strategies that really work. This short book is the story of what worked and what didn’t for author Azat Mardan, giving you the best tools and inspiration to achieve your monetary, career, creative, or contributorship goals. Are you happy with your current level of passive income? Do your products or businesses make you money while you're asleep? When it comes to money and passive income, the only person you can rely on is yourself. Using Your Web Skills To Make Money will navigate you past any obstacles you may face in generating multiple income streams... especially if you're doing it for the first time. What You'll Learn Create online courses in your spare time Review apprenticeships Master one-on-one coaching Understand the value of membership communities Who This Book Is For","language":"en","currency":"USD","id":"1484239229","title":"Using Your Web Skills To Make Money","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sJNqDwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=b6_EAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"XML is one of the most common standards for the exchange of information. However, organizations find challenges in how to address the complexities of dealing with hierarchical data types, particularly as they scale to gigabytes and beyond. In this IBM® Redbooks® publication, we discuss and describe the new capabilities in IBM InfoSphere® DataStage® 8.5. These capabilities enable developers to more easily manage the design and processing requirements presented by the most challenging XML sources. Developers can use these capabilities to create powerful hierarchical transformations and to parse and compose XML data with high performance and scalability. Spanning both batch and real-time run times, these capabilities can be used to solve a broad range of business requirements. As part of the IBM InfoSphere Information Server 8.5 release, InfoSphere DataStage was enhanced with new hierarchical transformation capabilities called . XML Stage provides native XML schema support and powerful XML transformation functionality. These capabilities are based on a unique state-of-the-art technology that allows you to parse and compose any complex XML structure from and to a relational form, as well as to a separate hierarchical form. This book is targeted at an audience of systems designers and developers who focus on implementing XML integration support in their environments.","language":"en","currency":"USD","id":"0738436720","title":"InfoSphere DataStage for Enterprise XML Data Integration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=b6_EAgAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Vinay Bhat","Shruti Choudhary","Ravi Ravindranath","Enrique Amavizca Ruiz","Aaron Titus","IBM Redbooks"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PvcmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Building Full-Stack Data Analytics Applications with Spark","description":"Data science teams looking to turn research into useful analytics applications require not only the right tools, but also the right approach if they’re to succeed. With the revised second edition of this hands-on guide, up-and-coming data scientists will learn how to use the Agile Data Science development methodology to build data applications with Python, Apache Spark, Kafka, and other tools. Author Russell Jurney demonstrates how to compose a data platform for building, deploying, and refining analytics applications with Apache Kafka, MongoDB, ElasticSearch, d3.js, scikit-learn, and Apache Airflow. You’ll learn an iterative approach that lets you quickly change the kind of analysis you’re doing, depending on what the data is telling you. Publish data science work as a web application, and affect meaningful change in your organization. Build value from your data in a series of agile sprints, using the data-value pyramid Extract features for statistical models from a single dataset Visualize data with charts, and expose different aspects through interactive reports Use historical data to predict the future via classification and regression Translate predictions into actions Get feedback from users after each sprint to keep your project on track","language":"en","currency":"USD","id":"149196006X","title":"Agile Data Science 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PvcmDwAAQBAJ&source=gbs_api","authors":["Russell Jurney"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K-l1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"An expert guide to improving database scalability and availability without compromising performance, 3rd Edition","description":"Build, manage, and configure high-performing, reliable NoSQL database for your applications with Cassandra Key Features Write programs more efficiently using Cassandra's features with the help of examples Configure Cassandra and fine-tune its parameters depending on your needs Integrate Cassandra database with Apache Spark and build strong data analytics pipeline Book Description With ever-increasing rates of data creation, the demand for storing data fast and reliably becomes a need. Apache Cassandra is the perfect choice for building fault-tolerant and scalable databases. Mastering Apache Cassandra 3.x teaches you how to build and architect your clusters, configure and work with your nodes, and program in a high-throughput environment, helping you understand the power of Cassandra as per the new features. Once you’ve covered a brief recap of the basics, you’ll move on to deploying and monitoring a production setup and optimizing and integrating it with other software. You’ll work with the advanced features of CQL and the new storage engine in order to understand how they function on the server-side. You’ll explore the integration and interaction of Cassandra components, followed by discovering features such as token allocation algorithm, CQL3, vnodes, lightweight transactions, and data modelling in detail. Last but not least you will get to grips with Apache Spark. By the end of this book, you’ll be able to analyse big data, and build and manage high-performance databases for your application. What you will learn Write programs more efficiently using Cassandra's features more efficiently Exploit the given infrastructure, improve performance, and tweak the Java Virtual Machine (JVM) Use CQL3 in your application in order to simplify working with Cassandra Configure Cassandra and fine-tune its parameters depending on your needs Set up a cluster and learn how to scale it Monitor a Cassandra cluster in different ways Use Apache Spark and other big data processing tools Who this book is for Mastering Apache Cassandra 3.x is for you if you are a big data administrator, database administrator, architect, or developer who wants to build a high-performing, scalable, and fault-tolerant database. Prior knowledge of core concepts of databases is required.","language":"en","currency":"USD","id":"1789132800","title":"Mastering Apache Cassandra 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K-l1DwAAQBAJ&source=gbs_api","authors":["Aaron Ploetz","Tejaswi Malepati","Nishant Neeraj"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YCyWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Deep dive into the latest edition of the Swift programming language, 5th Edition","description":"Harness the power of the latest edition with this in-depth and comprehensive guide to the Swift language Key Features Fifth edition of this bestselling book, improved and updated to cover the latest version of the Swift 5 programming language Get to grips with popular and modern design techniques to write easy-to-manage Swift code Learn how to use core Swift features such as concurrency, generics, and copy-on-write in your code Book Description Over the years, the Mastering Swift book has established itself amongst developers as a popular choice as an in-depth and practical guide to the Swift programming language. The latest edition is fully updated and revised to cover the new version: Swift 5. Inside this book, you'll find the key features of Swift 5 easily explained with complete sets of examples. From the basics of the language to popular features such as concurrency, generics, and memory management, this definitive guide will help you develop your expertise and mastery of the Swift language. Mastering Swift 5, Fifth Edition will give you an in-depth knowledge of some of the most sophisticated elements in Swift development, including protocol extensions, error handling, and closures. It will guide you on how to use and apply them in your own projects. Later, you'll see how to leverage the power of protocol-oriented programming to write flexible and easier-to-manage code. You will also see how to add the copy-on-write feature to your custom value types and how to avoid memory management issues caused by strong reference cycles. What you will learn Understand core Swift components, including operators, collections, control flows, and functions Learn how and when to use classes, structures, and enumerations Understand how to use protocol-oriented design with extensions to write easier-to-manage code Use design patterns with Swift, to solve commonly occurring design problems Implement copy-on-write for you custom value types to improve performance Add concurrency to your applications using Grand Central Dispatch and Operation Queues Implement generics to write flexible and reusable code Who this book is for This book is for developers who want to delve into the newest version of Swift. If you are a developer and learn best by looking at and working with code, then this book is for you. A basic understanding of Apple's tools would be beneficial but not mandatory. All examples should work on the Linux platform as well.","language":"en","currency":"USD","id":"1789132738","title":"Mastering Swift 5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YCyWDwAAQBAJ&source=gbs_api","authors":["Jon Hoffman"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GivLCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.16,"subtitle":"PHP Object-Oriented Programming with Oracle","description":"Web Programming for Business: PHP Object-Oriented Programming with Oracle focuses on fundamental PHP coding, giving students practical, enduring skills to solve data and technical problems in business. Using Oracle as the backend database, the book is version-neutral, teaching students code that will still work even with changes to PHP and Oracle. The code is clean, clearly explained and solutions-oriented, allowing students to understand how technologies such as XML, RSS or AJAX can be leveraged in business applications. The book is fully illustrated with examples, and includes chapters on: Database functionality Security programming Transformation programming to move data Powerpoint slides, applied exam questions, and the raw code for all examples are available on a companion website. This book offers an innovative approach that allows anyone with basic SQL and HTML skills to learn PHP object-oriented programming.","language":"en","currency":"USD","id":"113667182X","title":"Web Programming for Business","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GivLCQAAQBAJ&source=gbs_api","authors":["David Paper"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wPd_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Make use of Node.js to learn the development of a simple yet scalable cross-platform mobile application About This Book Use Node.js to satisfy the core backend requirements of modern apps, including user management, security, data access, and real-time data communication Build practical real-world mobile applications, which will give you the necessary knowledge to build your very own mobile solutions Step-by-step development of projects using Ionic Framework as the frontend and Node.js for the backend supported by a MongoDB database Who This Book Is For This book is intended for web developers of all levels of expertise who want to deep dive into cross-platform mobile application development without going through the pains of understanding the languages and native frameworks that form an integral part of developing for different mobile platforms. This book is also for you if you are a developer who wants to capitalize on the MobileFirst strategy and so are going to use JavaScript for your complete stack. What You Will Learn Develop an API from scratch Set up a MongoDB Database as part of your mobile application backend Deploy a cross-platform mobile application from the command line Incorporate features within your mobile application that use native phone features such as a gyroscope, GPS, and accelerometer Implement mobile applications that use web-enabled APIs Build a mobile application with real-time chat messaging features Develop a secure mobile application that is capable of functioning with real-time data In Detail Node.js is a massively popular JavaScript library that lets you use JavaScript to easily program scalable network applications and web services. People approaching Node.js for the first time are often attracted by its efficiency, scalability, and the fact that it's based on JavaScript, the language of the Web, which means that developers can use the same language to write backend code. Also, it's increasingly being seen as a \"modern\" replacement for PHP in web development, which relies on fast-paced data exchange. The growing community and the large amount of available modules makes Node.js one of the most attractive development environments. This book takes a step-wise and incremental approach toward developing cross-platform mobile technologies using existing web technologies. This will allow you to truly understand and become proficient in developing cross-platform mobile applications with Node.js, Ionic Framework, and MongoDB. The book starts off by introducing all the necessary requirements and knowledge to build a mobile application with a companion web service. It covers the ability to create an API from scratch and implement a comprehensive user database that will give you the opportunity to offer a mobile application with a personalized experience. Midway through the book, you will learn the basic processes to create a successful mobile application. You will also gain higher-level knowledge, allowing you to develop a functional and secure mobile application to ensure a seamless user experience for end users. Finally, the book ends with more advanced projects, which will bring together all the knowledge and expertise developed in the previous chapters to create a practical and functional mobile-application that has useful real-world features. Style and approach This book is an easy-to-follow guide that takes a step-wise approach in giving expertise and knowledge to help you truly understand what is needed to create a memorable user experience for end users. Each topic is placed in the context of the bigger picture, that is, to create cross-platform mobile applications using existing technologies.","language":"en","currency":"USD","id":"1782175040","title":"Learning Node.js for Mobile Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wPd_CwAAQBAJ&source=gbs_api","authors":["Stefan Buttigieg","Milorad Jevdjenic"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=efRZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Learn to create robust RESTful web services with Node.js, MongoDB, and Express.js, 3rd Edition","description":"Design and implement scalable and maintainable RESTful solutions with Node.js 10 Key Features Create rich and scalable RESTful API solutions from scratch Explore the new features of Node.js 10, Express 4.0, and MongoDB Integrate MongoDB in your Node.js application to store and secure your data Book Description When building RESTful services, it is really important to choose the right framework. Node.js, with its asynchronous, event-driven architecture, is exactly the right choice for building RESTful APIs. This third edition of RESTful Web API Design with Node.js 10 will teach you to create scalable and rich RESTful applications based on the Node.js platform. You will be introduced to the latest NPM package handler and understand how to use it to customize your RESTful development process. You will begin by understanding the key principle that makes an HTTP application a RESTful-enabled application. After writing a simple HTTP request handler, you will create and test Node.js modules using automated tests and mock objects; explore using the NoSQL database, MongoDB, to store data; and get to grips with using self-descriptive URLs. You’ll learn to set accurate HTTP status codes along with understanding how to keep your applications backward-compatible. Also, while implementing a full-fledged RESTful service, you will use Swagger to document the API and implement automation tests for a REST-enabled endpoint with Mocha. Lastly, you will explore some authentication techniques to secure your application. What you will learn Install, develop, and test your own Node.js user modules Understand the differences between HTTP and RESTful applications Use self-descriptive URLs and set accurate HTTP status codes Eliminate third-party dependencies in your tests with mocking Implement automation tests for a REST-enabled endpoint with Mocha Secure your services with NoSQL database integration within Node.js applications Integrate a simple frontend using JavaScript libraries available on a CDN server Who this book is for If you are a web developer keen to enrich your development skills to create server-side RESTful applications based on the Node.js platform, this book is for you. Some knowledge of REST would be an added advantage, but is definitely not a necessity.","language":"en","currency":"USD","id":"1788629140","title":"RESTful Web API Design with Node.js 10, Third Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=efRZDwAAQBAJ&source=gbs_api","authors":["Valentin Bojinov"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PyWFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Take advantage of the improved performance and reduced memory requirements of PHP version 7, and learn to utilize the new built-in PHP functions and features such as typed variable enforcement with declare(strict_types=1) and the new available data types, scalar type declarations for function arguments and return statements, constant arrays using define(), argument unpacking with the ... operator, integer division with intdiv(), the null coalesce operator, the spaceship operator, new exception types, and improvements to existing features. Pro PHP and jQuery, Second Edition is for intermediate level programmers interested in building web applications using jQuery and PHP. Updated for PHP version 7 and the latest version of jQuery, this book teaches some advanced PHP techniques and it shows you how to take your dynamic applications to the next level by adding a JavaScript layer using the jQuery framework and APIs. After reading and using this book, you'll come away having built a fully functional PHP and jQuery web application that you can reapply as a template for your own particular web application. Pro PHP and jQuery, Second Edition is for intermediate level programmers interested in building web applications using jQuery and PHP. Updated for PHP version 7 and the latest version of jQuery, this book teaches some advanced PHP techniques and it shows you how to take your dynamic applications to the next level by adding a JavaScript layer using the jQuery framework and APIs, considered the most popular JavaScript libraries. After reading and using this book, you'll come away understanding a fully functional PHP using jQuery web application case study that you can reapply as a template for your own particular web application. Moreover, from PHP 7, you'll get uniform variable syntax, the AST-based compilation process, the added Closure::call(), bitwise shift consistency across platforms, the (null coalesce) operator, Unicode codepoint escape syntax, return type declarations, and new and easier extensions development with support for redis, MongoDB and much more.","language":"en","currency":"USD","id":"1484212304","title":"Pro PHP and jQuery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PyWFCwAAQBAJ&source=gbs_api","authors":["Keith Wald","Jason Lengstorf"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xcaiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for both novice developers in general and experienced Spring developers. It will teach you how to override Spring Boot's opinions and frees you from the need to define complicated configurations.","language":"en","currency":"USD","id":"1784397482","title":"Learning Spring Boot","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xcaiBQAAQBAJ&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1vPHAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"With the benefit of advanced analytics such as online analytical processing (OLAP), data mining, and text analytics, the IBM® InfoSphere® Warehouse Enterprise Edition brings sophisticated business intelligence (BI) to warehouse users. InfoSphere Warehouse allows you to run extreme concurrent query volumes that can help answer questions for all types of business users, while consistently meeting service level requirements. Combined with a virtualization platform and a solid BI solution, such as IBM Cognos®, you can deliver BI cloud services with improved flexibility and speed to your clients, thereby presenting a new avenue for which your services can be offered. This IBM Redbooks® publication discusses the deployment of a BI cloud solution. It includes details such as understanding the architecture of a cloud, planning implementation, integrating various software components, and understanding the preferred practices of running a cloud deployment. Essentially, this book can be used as a guide by anyone who is interested in deploying a virtualized environment for a BI cloud solution.","language":"en","currency":"USD","id":"0738437417","title":"Virtualized Business Intelligence with InfoSphere Warehouse","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1vPHAgAAQBAJ&source=gbs_api","authors":["Adriana Carvajal","Thomas Chong","IBM Redbooks"]},{"pageCount":237,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5OJ8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.95,"subtitle":null,"description":"While there have been quite a few attempts to get JavaScript working as a server-side language, Node.js (frequently just called Node) has been the first environment that's gained any traction. It's now used by companies such as Netflix, Uber and Paypal to power their web apps. Node allows for blazingly fast performance; thanks to its event loop model, common tasks like network connection and database I\/O can be executed very quickly indeed. In this book, we offer a selection of nine different practical projects that you can follow along with. It contains: Build a Simple Beginner App with Node, Bootstrap & MongoDB by James Hibbard How to Build a File Upload Form with Express and Dropzone.js by Lukas White How to Build and Structure a Node.js MVC Application by James Kolce User Authentication with the MEAN Stack by Simon Holmes & Jeremy Wilken Build a JavaScript Command Line Interface (CLI) with Node.js by Lukas White & Michael Wanyoike Building a Real-time Chat App with Sails.js by Michael Wanyoike Passport Authentication for Node.js Applications by Paul Orac Local Authentication Using Passport in Node.js by Paul Orac An Introduction to NodeBots by Patrick Catanzariti This book is for anyone who wants to start learning server-side development with Node.js. Familiarity with JavaScript is assumed.","language":"en","currency":"USD","id":"1492071099","title":"9 Practical Node.js Projects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5OJ8DwAAQBAJ&source=gbs_api","authors":["James Hibbard","James Kolce","Lukas White","Jeremy Wilken","Simon Holmes","Michael Wanyoike","Paul Orac","Patrick Catanzariti"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x7S_DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16,"subtitle":"The Power and Fragility of Networked Protest","description":"A firsthand account and incisive analysis of modern protest, revealing internet-fueled social movements’ greatest strengths and frequent challenges To understand a thwarted Turkish coup, an anti–Wall Street encampment, and a packed Tahrir Square, we must first comprehend the power and the weaknesses of using new technologies to mobilize large numbers of people. An incisive observer, writer, and participant in today’s social movements, Zeynep Tufekci explains in this accessible and compelling book the nuanced trajectories of modern protests—how they form, how they operate differently from past protests, and why they have difficulty persisting in their long-term quests for change. Tufekci speaks from direct experience, combining on-the-ground interviews with insightful analysis. She describes how the internet helped the Zapatista uprisings in Mexico, the necessity of remote Twitter users to organize medical supplies during Arab Spring, the refusal to use bullhorns in the Occupy Movement that started in New York, and the empowering effect of tear gas in Istanbul’s Gezi Park. These details from life inside social movements complete a moving investigation of authority, technology, and culture—and offer essential insights into the future of governance.","language":"en","currency":"USD","id":"0300228171","title":"Twitter and Tear Gas","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x7S_DgAAQBAJ&source=gbs_api","authors":["Zeynep Tufekci"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sYJ-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Lessons Learned on my Path from Ordinary Developer to Author of Programming Books That Sell","description":"Learn how to make an impact in the web world. This short book shows you that the best way to become an expert and a thought leader is to thoroughly research a topic and then publish a book on it. The great thing about writing a book is that you don’t have to risk anything - all you need is a few hours of writing per week and in no time you can have your own book that you can sell, give away at conferences, and prominently feature on your resume. Since author Azat Mardan published his first book, several high profile tech companies have tried to recruit him and his experience is not an exception! Write Your Way To Success covers everything that he has learned through publishing – see how you can do the same! What You'll Learn Create passive income Review the process of a ProgWriter Examine practical tips about publishing and marketing Who This Book Is For Any experts (or wannabe experts) in technical topics, tools, frameworks for web development, applied computer science, dev ops and QA.","language":"en","currency":"USD","id":"1484239709","title":"Write Your Way To Success","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sYJ-DwAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GOVOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Unlock deeper insights into Machine Leaning with this vital guide to cutting-edge predictive analytics About This Book Leverage Python's most powerful open-source libraries for deep learning, data wrangling, and data visualization Learn effective strategies and best practices to improve and optimize machine learning systems and algorithms Ask – and answer – tough questions of your data with robust statistical models, built for a range of datasets Who This Book Is For If you want to find out how to use Python to start answering critical questions of your data, pick up Python Machine Learning – whether you want to get started from scratch or want to extend your data science knowledge, this is an essential and unmissable resource. What You Will Learn Explore how to use different machine learning models to ask different questions of your data Learn how to build neural networks using Keras and Theano Find out how to write clean and elegant Python code that will optimize the strength of your algorithms Discover how to embed your machine learning model in a web application for increased accessibility Predict continuous target outcomes using regression analysis Uncover hidden patterns and structures in data with clustering Organize data using effective pre-processing techniques Get to grips with sentiment analysis to delve deeper into textual and social media data In Detail Machine learning and predictive analytics are transforming the way businesses and other organizations operate. Being able to understand trends and patterns in complex data is critical to success, becoming one of the key strategies for unlocking growth in a challenging contemporary marketplace. Python can help you deliver key insights into your data – its unique capabilities as a language let you build sophisticated algorithms and statistical models that can reveal new perspectives and answer key questions that are vital for success. Python Machine Learning gives you access to the world of predictive analytics and demonstrates why Python is one of the world's leading data science languages. If you want to ask better questions of data, or need to improve and extend the capabilities of your machine learning systems, this practical data science book is invaluable. Covering a wide range of powerful Python libraries, including scikit-learn, Theano, and Keras, and featuring guidance and tips on everything from sentiment analysis to neural networks, you'll soon be able to answer some of the most important questions facing you and your organization. Style and approach Python Machine Learning connects the fundamental theoretical principles behind machine learning to their practical application in a way that focuses you on asking and answering the right questions. It walks you through the key elements of Python and its powerful machine learning libraries, while demonstrating how to get to grips with a range of statistical models.","language":"en","currency":"USD","id":"1783555149","title":"Python Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GOVOCwAAQBAJ&source=gbs_api","authors":["Sebastian Raschka"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S2TNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. The best IT certification exam study system available Filled with hands-on exercises and practice exam questions, CompTIA Cloud Essentials+TM Certification Study Guide, Second Edition (Exam CLO-002) covers what you need to know—and shows you how to prepare—for this challenging exam. • 100% complete coverage of all official objectives for exam CLO-002 • Exam Readiness checklist—you’re ready for the exam when all objectives on the list are checked off • Exam Watch notes call attention to information about, and potential pitfalls in, the exam • Two-Minute Drills for quick review at the end of every chapter • Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all the exam topics, including: The Principles of Cloud Computing • The Business Side of Cloud Computing • Cloud Planning • Compliance and the Cloud • Cloud Storage Infrastructure • Cloud Network Infrastructure • Cloud Compute Infrastructure • Applications and Big Data in the Cloud • Cloud DevOps • Security and the Cloud • Managing Cloud Risk Online content includes: • Test engine that provides full-length practice exams and customized quizzes by chapter or by exam domain • Access to entire book PDF","language":"en","currency":"USD","id":"1260461793","title":"CompTIA Cloud Essentials+ Certification Study Guide, Second Edition (Exam CLO-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S2TNDwAAQBAJ&source=gbs_api","authors":["Daniel Lachance"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3igKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This effective self-study system delivers complete coverage of every topic on the AWS Certified Developer Associate Exam Take the challenging AWS Certified Developer Associate Exam with confidence using the comprehensive information contained in this effective test preparation guide. Written by an Amazon Web Services certified expert and experienced trainer, AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01) covers every subject on the exam and clearly explains how to create, deploy, migrate, monitor, and debug cloud-native applications. Designed to help you pass the exam with ease, this guide also serves as an ideal on-the-job reference. Covers all topics on the exam, including: Getting started with AWS Journey AWS high availability and fault tolerance Working with cloud storage Authentication and authorization Creating SQL and NoSQL databases in AWS Cloud AWS application integration and management Developing cloud-native applications in AWS Building, deploying, and debugging cloud applications Electronic content includes: 130 practice questions Test engine containing full-length practice exams and customizable quizzes","language":"en","currency":"USD","id":"1260460185","title":"AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3igKEAAAQBAJ&source=gbs_api","authors":["Kamesh Ganesan"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eUS1DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Real World Examples for Systems Administrators and Engineers","description":"OpenStack is today’s leading technology for building and integrating public and private clouds. Common OpenStack Deployments is a complete, practical guide to deploying OpenStack and understanding its internals. Key project contributor Elizabeth Joseph, with expert implementer Matt Fischer, shares up-to-date recipes for deploying OpenStack on both virtual and physical servers, and for using OpenStack to address any real-world challenge. First, Joseph and Fischer help you master OpenStack concepts and components by guiding you through small-scale, virtualized deployments. As you deepen your understanding, they guide you through building large, horizontally scalable infrastructures that integrate multiple components in a feature-rich cloud environment. Throughout, you’ll find up-to-the minute coverage of enhancements that make the OpenStack platform more mature and production ready, plus expert tips on debugging and growth. The authors conclude by introducing the broader OpenStack ecosystem, showing you how to drive value through hybrid clouds blending local and hosted solutions. Drawing on extensive personal experience, they address issues ranging from cost to data sovereignty and security. Common OpenStack Deployments is the ideal resource for all network and data center professionals who want to apply OpenStack in proof-of-concept or in production, and for every instructor or student who wants to leverage today’s hottest cloud technology. Comprehensive coverage includes Customizing, deploying, and scaling OpenStack in any environment Quickly building single-server test deployments with DevStack Making the right networking decisions for any OpenStack deployment Manually installing Nova compute, Keystone identity, Glance image storage, and Neutron networking Setting up controllers and compute nodes Deploying private compute clouds with Puppet Metering clouds with Ceilometer Implementing block and object storage clouds Provisioning on bare metal with OpenStack Ironic Controlling containers with OpenStack Magnum Troubleshooting OpenStack: error messages, logs, tools, configuration problems, Puppet debugging, and more Step-by-step virtualized reference deployment using KVM\/QEMU on Ubuntu","language":"en","currency":"USD","id":"0134084713","title":"Common OpenStack Deployments","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eUS1DAAAQBAJ&source=gbs_api","authors":["Elizabeth K. Joseph","Matt Fischer"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Sk0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Implement a High-Performance Enterprise Java Application Modernization Strategy Learn cutting-edge techniques and processes to systematically and strategically modernize legacy Java applications with predictability, consistency, and confidence. This Oracle Press guide offers an innovative blueprint that empowers corporate management teams to better understand necessary technical requirements and enables Java architects and developers to better align with agile business needs. Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio contains modernization approaches that offer end-to-end Java application portfolio visibility so that application modernization projects can stay on-schedule and within budget.","language":"en","currency":"USD","id":"0071842047","title":"Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Sk0DwAAQBAJ&source=gbs_api","authors":["G. Venkat"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tZtNCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Concepts, Drivers & Techniques","description":"“This text should be required reading for everyone in contemporary business.” --Peter Woodhull, CEO, Modus21 “The one book that clearly describes and links Big Data concepts to business utility.” --Dr. Christopher Starr, PhD “Simply, this is the best Big Data book on the market!” --Sam Rostam, Cascadian IT Group “...one of the most contemporary approaches I’ve seen to Big Data fundamentals...” --Joshua M. Davis, PhD The Definitive Plain-English Guide to Big Data for Business and Technology Professionals Big Data Fundamentals provides a pragmatic, no-nonsense introduction to Big Data. Best-selling IT author Thomas Erl and his team clearly explain key Big Data concepts, theory and terminology, as well as fundamental technologies and techniques. All coverage is supported with case study examples and numerous simple diagrams. The authors begin by explaining how Big Data can propel an organization forward by solving a spectrum of previously intractable business problems. Next, they demystify key analysis techniques and technologies and show how a Big Data solution environment can be built and integrated to offer competitive advantages. Discovering Big Data’s fundamental concepts and what makes it different from previous forms of data analysis and data science Understanding the business motivations and drivers behind Big Data adoption, from operational improvements through innovation Planning strategic, business-driven Big Data initiatives Addressing considerations such as data management, governance, and security Recognizing the 5 “V” characteristics of datasets in Big Data environments: volume, velocity, variety, veracity, and value Clarifying Big Data’s relationships with OLTP, OLAP, ETL, data warehouses, and data marts Working with Big Data in structured, unstructured, semi-structured, and metadata formats Increasing value by integrating Big Data resources with corporate performance monitoring Understanding how Big Data leverages distributed and parallel processing Using NoSQL and other technologies to meet Big Data’s distinct data processing requirements Leveraging statistical approaches of quantitative and qualitative analysis Applying computational analysis methods, including machine learning","language":"en","currency":"USD","id":"0134291204","title":"Big Data Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tZtNCwAAQBAJ&source=gbs_api","authors":["Thomas Erl","Wajid Khattak","Paul Buhler"]},{"pageCount":123,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rrkBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Big Data Scalability Series","description":"Get Started Scaling Your Database Infrastructure for High-Volume Big Data Applications “Understanding Big Data Scalability presents the fundamentals of scaling databases from a single node to large clusters. It provides a practical explanation of what ‘Big Data’ systems are, and fundamental issues to consider when optimizing for performance and scalability. Cory draws on many years of experience to explain issues involved in working with data sets that can no longer be handled with single, monolithic relational databases.... His approach is particularly relevant now that relational data models are making a comeback via SQL interfaces to popular NoSQL databases and Hadoop distributions.... This book should be especially useful to database practitioners new to scaling databases beyond traditional single node deployments.” —Brian O’Krafka, software architect Understanding Big Data Scalability presents a solid foundation for scaling Big Data infrastructure and helps you address each crucial factor associated with optimizing performance in scalable and dynamic Big Data clusters. Database expert Cory Isaacson offers practical, actionable insights for every technical professional who must scale a database tier for high-volume applications. Focusing on today’s most common Big Data applications, he introduces proven ways to manage unprecedented data growth from widely diverse sources and to deliver real-time processing at levels that were inconceivable until recently. Isaacson explains why databases slow down, reviews each major technique for scaling database applications, and identifies the key rules of database scalability that every architect should follow. You’ll find insights and techniques proven with all types of database engines and environments, including SQL, NoSQL, and Hadoop. Two start-to-finish case studies walk you through planning and implementation, offering specific lessons for formulating your own scalability strategy. Coverage includes Understanding the true causes of database performance degradation in today’s Big Data environments Scaling smoothly to petabyte-class databases and beyond Defining database clusters for maximum scalability and performance Integrating NoSQL or columnar databases that aren’t “drop-in” replacements for RDBMSes Scaling application components: solutions and options for each tier Recognizing when to scale your data tier—a decision with enormous consequences for your application environment Why data relationships may be even more important in non-relational databases Why virtually every database scalability implementation still relies on sharding, and how to choose the best approach How to set clear objectives for architecting high-performance Big Data implementations The Big Data Scalability Series is a comprehensive, four-part series, containing information on many facets of database performance and scalability. Understanding Big Data Scalability is the first book in the series. Learn more and join the conversation about Big Data scalability at bigdatascalability.com.","language":"en","currency":"USD","id":"0133599094","title":"Understanding Big Data Scalability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rrkBBAAAQBAJ&source=gbs_api","authors":["Cory Isaacson"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xRcaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Everything you need to succeed on the Google Cloud Certified Professional Cloud Architect exam in one accessible study guide Take the challenging Google Cloud Certified Professional Cloud Architect exam with confidence using the comprehensive information contained in this invaluable self-study guide. The book provides a thorough overview of cloud architecture and Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Professional Cloud Architect All-In-One Exam Guideis based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and in-depth explanations. You will discover how to design, develop, and manage robust, secure, scalable, and highly available solutions to drive business objectives. Offers 100% coverage of every objective for the Google Cloud Certified Professional Cloud Architect exam Online content includes 100 additional practice questions in the TotalTester customizable exam engine Written by a Google Cloud Certified Professional Cloud Architect","language":"en","currency":"USD","id":"1264257287","title":"Google Cloud Certified Professional Cloud Architect All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xRcaEAAAQBAJ&source=gbs_api","authors":["Iman Ghanizada"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aKAFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Build and Deploy with Kubernetes, Flannel, Cockpit, and Atomic","description":"The Practical Guide to Running Docker on Linux Systems or Cloud Environments Whether on your laptop or a remote cloud, Docker can transform how you create, test, deploy, and manage your most critical applications. In Doc ker Containers , Christopher Negus helps you master Docker containerization from the ground up. You’ll start out running a few Docker container images in Ubuntu, Fedora, RHEL, CoreOS, or Project Atomic. By the time you’ve finished, you’ll be deploying enterprise-quality, multi-container Kubernetes setups in modern Linux and cloud environments. Writing for system administrators, software developers, and technology enthusiasts, Negus touches on every aspect of working with Docker: setting up containerized applications, working with both individual and multiple containers, running containers in cloud environments, and developing containers. Teaching through realistic examples of desktop applications, system services, and games, Negus guides you through building and deploying your own Dockerized applications. As you build your expertise, you’ll also learn indispensable Docker best practices for building and integrating containers, managing Docker on a day-to-day basis, and much more: • Understanding what Docker is and what you can do with it • Installing Docker on standard Linux or specialized container operating systems such as Atomic Host and CoreOS • Setting up a container runtime environment and private Docker Registry • Creating, running, and investigating Docker images and containers • Finding, pulling, saving, loading, and tagging container images • Pulling and pushing containers between local systems and Docker Registries • Integrating Docker containers with host networking and storage • Building containers with the docker build command and Dockerfile files • Minimizing space consumption and erasing unneeded containers • Accessing special host privileges from within a container • Orchestrating multiple containers into complex applications with Kubernetes • Using super privileged containers in cloud environments • Managing containers in the cloud with Cockpit • Getting started with Docker container development • Learning container build techniques from shared Dockerfiles This book is part of the Pearson Content Update Program. As the technology changes, sections of this book will be updated or new sections will be added. The updates will be delivered to you via a free Web Edition of this book, which can be accessed with any Internet connection.","language":"en","currency":"USD","id":"0134136624","title":"Docker Containers (includes Content Update Program)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aKAFCwAAQBAJ&source=gbs_api","authors":["Christopher Negus"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g32MDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":60,"subtitle":null,"description":"Prepare for the new PenTest+ certification exam from CompTIA with this money-saving, comprehensive study package Designed as a complete self-study program, this collection offers a variety of proven resources to use in preparation for the August 2018 release of the CompTIA PenTest+ certification exam. Comprised of CompTIA PenTest+ Certification All-In-One Exam Guide (PT0-001) and CompTIA PenTest+ Certification Practice Exams (Exam CS0-001), this bundle thoroughly covers every topic on the challenging exam. CompTIA PenTest+ Certification Bundle (Exam PT0-001) contains hundreds of practice questions that match those on the live exam in content, difficulty, tone, and format. The set includes detailed coverage of performance-based questions. You will get exam-focused “Tip,” “Note,” and “Caution” elements as well as end of chapter reviews. This authoritative, cost-effective bundle serves both as a study tool AND a valuable on-the-job reference for computer security professionals. •This bundle is 25% cheaper than purchasing the books individually and includes a 10% off the exam voucher•Written by a pair of penetration testing experts•Electronic content includes 370+ practice exam questions and secured PDF copies of both books","language":"en","currency":"USD","id":"1260454193","title":"CompTIA PenTest+ Certification Bundle (Exam PT0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g32MDwAAQBAJ&source=gbs_api","authors":["Raymond Nutting","Jonathan Ammerman"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XxNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"COVERS THE NEW 2018 EXAM SAA-C01! This effective study guide provides 100% coverage of every topic on the AWS Certified Solutions Architect Associate exam. Get complete coverage of all objectives included on the February 2018 SAA-C01 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: •Design Resilient Architectures •Define Performant Architectures •Specify Secure Applications and Architectures •Design Cost-Optimized Architectures •Define Operationally Excellent Architectures Digital content includes: •130 practice exam questions•Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260108260","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide (Exam SAA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XxNqDwAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h4d7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Don’t Let the Real Test Be Your First Test! Prepare for the challenging PenTest+ exam from CompTIA using this highly effective self-study guide. The book offers accurate practice questions for all exam objectives and includes a valuable pre-assessment test that enables you to tailor a course for study. Written by a cybersecurity expert, the book supplements the CompTIA PenTest+® Certification All-in-One Exam Guide (Exam PT0-001). You will get more than 500 practice questions in the knowledge, scenario, and performance-based formats contained on the live test—all with in-depth answer explanations for both the correct and incorrect answers. CompTIA PenTest+® Certification Practice Exams (Exam PT0-001) covers: •Pre-engagement activities•Getting to know your targets•Network scanning and enumeration•Vulnerability scanning and analysis•Mobile device and application testing•Social engineering•Network-based attacks•Wireless and RF attacks•Web and database attacks•Attacking local operating systems•Physical penetration testing•Writing the pen test report•And more Digital content includes: •500+ practice exam questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260440915","title":"CompTIA PenTest+ Certification Practice Exams (Exam PT0-001)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h4d7DwAAQBAJ&source=gbs_api","authors":["Jonathan Ammerman"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Use React and React Native to build applications for desktop browsers, mobile browsers, and even as native mobile apps About This Book Build React and React Native applications using familiar component concepts Dive deep into each platform, from routing in React to creating native mobile applications that can run offline Use Facebook's Relay, React and GraphQL technologies, to create a unified architecture that powers both web and native applications Who This Book Is For This book is written for any JavaScript developer—beginner or expert—who wants to start learning how to put both of Facebook's UI libraries to work. No knowledge of React is needed, though a working knowledge of ES2015 will help you follow along better. What You Will Learn Craft reusable React components Control navigation using the React Router to help keep your UI in sync with URLs Build isomorphic web applications using Node.js Use the Flexbox layout model to create responsive mobile designs Leverage the native APIs of Android and iOS to build engaging applications with React Native Respond to gestures in a way that's intuitive for the user Use Relay to build a unified data architecture for your React UIs In Detail React and React Native allow you to build cross-platform desktop and mobile applications using Facebook's innovative UI libraries. Combined with the Flux data architecture and Relay, you can now create powerful and feature-complete applications from just one code base! This book is split into three parts. The first part shows you how to start crafting composable UIs using React, from rendering with JSX and creating reusable components through to routing and creating isomorphic applications that run on Node. We then move on to showing you how to take the concepts of React and apply them to building Native UIs using React Native. You'll find out how to build responsive and streamlined UIs that can properly handle user interactions in a mobile environment. You'll also learn how to access device-specific APIs such as the geolocation API, and how to handle offline development with React Native. Finally, we'll tie all of these skills together and shows you how you can create React applications that run on every major platform. As well as understanding application state in depth, you'll learn how to leverage Relay to make feature-complete, data-driven web and native mobile applications. Style and approach Split into three major sections to help organize your learning, this hands-on, code-first book will help you get up to speed with React and React Native—the UI framework that powers Netflix, Yahoo, and Facebook.","language":"en","currency":"USD","id":"178646957X","title":"React and React Native","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jLkrDwAAQBAJ&source=gbs_api","authors":["Adam Boduch"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EfqoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mesmerizing visualizations, analytics, and logs from your data using Elasticsearch, Logstash, and Kibana About This Book Solve all your data analytics problems with the ELK stack Explore the power of Kibana4 search and visualizations built over Elasticsearch queries and learn about the features and plugins of Logstash Develop a complete data pipeline using the ELK stack Who This Book Is For If you are a developer or DevOps engineer interested in building a system that provides amazing insights and business metrics out of data sources, of various formats and types, using the open source technology stack that ELK provides, then this book is for you. Basic knowledge of Unix or any programming language will be helpful to make the most out of this book. What You Will Learn Install, configure, and run Elasticsearch, Logstash, and Kibana Understand the need for log analytics and the current challenges in log analysis Build your own data pipeline using the ELK stack Familiarize yourself with the key features of Logstash and the variety of input, filter, and output plugins it provides Build your own custom Logstash plugin Create actionable insights using charts, histograms, and quick search features in Kibana4 Understand the role of Elasticsearch in the ELK stack In Detail The ELK stack—Elasticsearch, Logstash, and Kibana, is a powerful combination of open source tools. Elasticsearch is for deep search and data analytics. Logstash is for centralized logging, log enrichment, and parsing. Kibana is for powerful and beautiful data visualizations. In short, the Elasticsearch ELK stack makes searching and analyzing data easier than ever before. This book will introduce you to the ELK (Elasticsearch, Logstash, and Kibana) stack, starting by showing you how to set up the stack by installing the tools, and basic configuration. You'll move on to building a basic data pipeline using the ELK stack. Next, you'll explore the key features of Logstash and its role in the ELK stack, including creating Logstash plugins, which will enable you to use your own customized plugins. The importance of Elasticsearch and Kibana in the ELK stack is also covered, along with various types of advanced data analysis, and a variety of charts, tables ,and maps. Finally, by the end of the book you will be able to develop full-fledged data pipeline using the ELK stack and have a solid understanding of the role of each of the components. Style and approach This book is a step-by-step guide, complete with various examples to solve your data analytics problems by using the ELK stack to explore and visualize data.","language":"en","currency":"USD","id":"1785886703","title":"Learning ELK Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EfqoCwAAQBAJ&source=gbs_api","authors":["Saurabh Chhajed"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lhnADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Develop a full-stack web application with Python and Flask","description":"Learn all that’s needed to build a fully functional web application from scratch. Key Features Delve deep into the principle behind RESTful API Learn how to build a scalable web application with the RESTful API architecture and Flask framework Know what are the exact tools and methodology to test your applications and how to use them Book Description Python is a flexible language that can be used for much more than just script development. By knowing the Python RESTful APIs work, you can build a powerful backend for web applications and mobile applications using Python. You'll take your first steps by building a simple API and learning how the frontend web interface can communicate with the backend. You'll also learn how to serialize and deserialize objects using the marshmallow library. Then, you'll learn how to authenticate and authorize users using Flask-JWT. You'll also learn how to enhance your APIs by adding useful features, such as email, image upload, searching, and pagination. You'll wrap up the whole book by deploying your APIs to the cloud. By the end of this book, you'll have the confidence and skill to leverage the power of RESTful APIs and Python to build efficient web applications. What you will learn Understand the concept of a RESTful API Build a RESTful API using Flask and the Flask-Restful extension Manipulate a database using Flask-SQLAlchemy and Flask-Migrate Send out plaintext and HTML format emails using the Mailgun API Implement a pagination function using Flask-SQLAlchemy Use caching to improve API performance and efficiently obtain the latest information Deploy an application to Heroku and test it using Postman Who this book is for This book is ideal for aspiring software developers who have a basic-to-intermediate knowledge of Python programming and who want to develop web applications using Python. Knowledge of how web applications work will be beneficial but is not essential.","language":"en","currency":"USD","id":"1838981101","title":"Python API Development Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lhnADwAAQBAJ&source=gbs_api","authors":["Jack Chan","Ray Chung","Jack Huang"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KJpGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Over 80 recipes to help you breeze through your data analysis projects using R About This Book Analyse your data using the popular R packages like ggplot2 with ready-to-use and customizable recipes Find meaningful insights from your data and generate dynamic reports A practical guide to help you put your data analysis skills in R to practical use Who This Book Is For This book is for data scientists, analysts and even enthusiasts who want to learn and implement the various data analysis techniques using R in a practical way. Those looking for quick, handy solutions to common tasks and challenges in data analysis will find this book to be very useful. Basic knowledge of statistics and R programming is assumed. What You Will Learn Acquire, format and visualize your data using R Using R to perform an Exploratory data analysis Introduction to machine learning algorithms such as classification and regression Get started with social network analysis Generate dynamic reporting with Shiny Get started with geospatial analysis Handling large data with R using Spark and MongoDB Build Recommendation system- Collaborative Filtering, Content based and Hybrid Learn real world dataset examples- Fraud Detection and Image Recognition In Detail Data analytics with R has emerged as a very important focus for organizations of all kinds. R enables even those with only an intuitive grasp of the underlying concepts, without a deep mathematical background, to unleash powerful and detailed examinations of their data. This book will show you how you can put your data analysis skills in R to practical use, with recipes catering to the basic as well as advanced data analysis tasks. Right from acquiring your data and preparing it for analysis to the more complex data analysis techniques, the book will show you how you can implement each technique in the best possible manner. You will also visualize your data using the popular R packages like ggplot2 and gain hidden insights from it. Starting with implementing the basic data analysis concepts like handling your data to creating basic plots, you will master the more advanced data analysis techniques like performing cluster analysis, and generating effective analysis reports and visualizations. Throughout the book, you will get to know the common problems and obstacles you might encounter while implementing each of the data analysis techniques in R, with ways to overcoming them in the easiest possible way. By the end of this book, you will have all the knowledge you need to become an expert in data analysis with R, and put your skills to test in real-world scenarios. Style and Approach Hands-on recipes to walk through data science challenges using R Your one-stop solution for common and not-so-common pain points while performing real-world problems to execute a series of tasks. Addressing your common and not-so-common pain points, this is a book that you must have on the shelf","language":"en","currency":"USD","id":"1787125319","title":"R Data Analysis Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KJpGDwAAQBAJ&source=gbs_api","authors":["Kuntal Ganguly"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MpYhAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"IBM® InfoSphere® Guardium® provides the simplest, most robust solution for data security and data privacy by assuring the integrity of trusted information in your data center. InfoSphere Guardium helps you reduce support costs by automating the entire compliance auditing process across heterogeneous environments. InfoSphere Guardium offers a flexible and scalable solution to support varying customer architecture requirements. This IBM Redbooks® publication provides a guide for deploying the Guardium solutions. This book also provides a roadmap process for implementing an InfoSphere Guardium solution that is based on years of experience and best practices that were collected from various Guardium experts. We describe planning, installation, configuration, monitoring, and administrating an InfoSphere Guardium environment. We also describe use cases and how InfoSphere Guardium integrates with other IBM products. The guidance can help you successfully deploy and manage an IBM InfoSphere Guardium system. This book is intended for the system administrators and support staff who are responsible for deploying or supporting an InfoSphere Guardium environment.","language":"en","currency":"USD","id":"0738439355","title":"Deployment Guide for InfoSphere Guardium","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MpYhAwAAQBAJ&source=gbs_api","authors":["Whei-Jen Chen","Boaz Barkai","Joe M DiPietro","Vladislav Langman","Daniel Perlov","Roy Riah","Yosef Rozenblit","Abdiel Santos","IBM Redbooks"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NgRCnajQFWoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"A practical introduction to Node, the exciting new server-side JavaScript web development stack.","language":"en","currency":"USD","id":"1849515158","title":"Node Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NgRCnajQFWoC&source=gbs_api","authors":["David Herron"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vhM7BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"PHP is a server-side scripting language that enables you to develop dynamic sites that engage users in ways that are simply not possible using only HTML and CSS. PHP for Absolute Beginners takes a practical approach to teaching you how to build dynamic content for your website using PHP. You’ll quickly get started with practical PHP projects, learning how to build a dynamic image gallery. By the end of the book you’ll will have developed a personal blog complete with a password protected admin module. PHP for Absolute Beginners won't swamp you with every detail of the full PHP language up front – instead, you’ll be introduced to a small, versatile subset of PHP and learn to use it creatively to develop dynamic web sites. In the process you will learn to use variables, control structures, functions, and objects to your advantage. You will learn how to plan and create databases and how to organize your PHP scripts beautifully. At the end of the book, you will be a confident PHP user, ready to take the next steps in creating great websites.","language":"en","currency":"USD","id":"143026814X","title":"PHP for Absolute Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vhM7BAAAQBAJ&source=gbs_api","authors":["Jason Lengstorf","Thomas Blom Hansen"]},{"pageCount":822,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G0C7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Taking you to the limit in Concurrency, OOP, and the most advanced capabilities of C","description":"Push the limits of what C - and you - can do, with this high-intensity guide to the most advanced capabilities of C Key Features Make the most of C’s low-level control, flexibility, and high performance A comprehensive guide to C’s most powerful and challenging features A thought-provoking guide packed with hands-on exercises and examples Book Description There’s a lot more to C than knowing the language syntax. The industry looks for developers with a rigorous, scientific understanding of the principles and practices. Extreme C will teach you to use C’s advanced low-level power to write effective, efficient systems. This intensive, practical guide will help you become an expert C programmer. Building on your existing C knowledge, you will master preprocessor directives, macros, conditional compilation, pointers, and much more. You will gain new insight into algorithm design, functions, and structures. You will discover how C helps you squeeze maximum performance out of critical, resource-constrained applications. C still plays a critical role in 21st-century programming, remaining the core language for precision engineering, aviations, space research, and more. This book shows how C works with Unix, how to implement OO principles in C, and fully covers multi-processing. In Extreme C, Amini encourages you to think, question, apply, and experiment for yourself. The book is essential for anybody who wants to take their C to the next level. What you will learn Build advanced C knowledge on strong foundations, rooted in first principles Understand memory structures and compilation pipeline and how they work, and how to make most out of them Apply object-oriented design principles to your procedural C code Write low-level code that’s close to the hardware and squeezes maximum performance out of a computer system Master concurrency, multithreading, multi-processing, and integration with other languages Unit Testing and debugging, build systems, and inter-process communication for C programming Who this book is for Extreme C is for C programmers who want to dig deep into the language and its capabilities. It will help you make the most of the low-level control C gives you.","language":"en","currency":"USD","id":"1789341353","title":"Extreme C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G0C7DwAAQBAJ&source=gbs_api","authors":["Kamran Amini"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kvXHAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"IBM® Information Management System (IMSTM) provides leadership in performance, reliability, and security to help you implement the most strategic and critical enterprise applications. IMS, IMS utilities, and IMS tools continue to evolve to provide value and meet the needs of enterprise customers. With IMS 12, integration and open access improvements provide flexibility and support business growth requirements. Scalability improvements have been made to the well-known performance, efficiency, availability, and resilience of IMS by using 64-bit storage. In this IBM Redbooks® publication we provide IMS performance monitoring and tuning information by describing the key IMS performance functions and by showing how to monitor and tune them with traditional and new strategic applications. This book is for database administrators and system programmers. We summarize methods and tools for monitoring and tuning IMS systems, describe IMS system-wide performance, database, and transaction considerations. Based on lab measurements, we provide information about recent performance enhancements that are available with IMS 12, and advice about setting performance-related parameters.","language":"en","currency":"USD","id":"0738437565","title":"IMS 12 Selected Performance Topics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kvXHAgAAQBAJ&source=gbs_api","authors":["Paolo Bruni","Rafael Avigad","James Martin","Maiko Mizuki","Bhups Narsi","John Schlatweiler","IBM Redbooks"]},{"pageCount":396,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sNWJG30OyrIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 100 simple but incredibly effective recipes for taking control of your JSF applications.","language":"en","currency":"USD","id":"1847199534","title":"JSF 2.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sNWJG30OyrIC&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":130,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PTn2QeLMRNcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Written in an engaging, easy-to-follow style, \"Getting Started with Meteor\" is a practical guide for developing modern web applications with Meteor. This book is for developers or students who have a working knowledge of JavaScript and HTML, and want to learn how to quickly develop web applications using pure JavaScript. A basic understanding of traditional web server development and database methodologies will be helpful, but not necessary. Readers are expected to know how to program basic HTML pages and JavaScript functions, and be familiar with Terminal (basic Shell) commands.","language":"en","currency":"USD","id":"1782160833","title":"Getting Started with Meteor JavaScript Framework","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PTn2QeLMRNcC&source=gbs_api","authors":["Isaac Strack"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-jmPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Tools for Business Intelligence, data prep, and visual analytics, 3rd Edition","description":"Create powerful data visualizations and unlock intelligent business insights with Tableau Key Features Explore all the latest Tableau 2019 features and redefine business analytics for your organization Create impressive data visualizations and interactive dashboards to get insights from your data Learn effective data storytelling to transform how your business leverages data and makes decisions Book Description Tableau is the gold standard of business intelligence and visual analytics tools in every industry. It enables rapid data visualization and interpretation with charts, graphs, dashboards, and much more. Updated with the latest features of Tableau, this book takes you from the foundations of the Tableau 2019 paradigm through to advanced topics. This third edition of the bestselling guide by Tableau Zen Master, Joshua Milligan, will help you come to grips with updated features, such as set actions and transparent views. Beginning with installation, you'll create your first visualizations with Tableau and then explore practical examples and advanced techniques. You'll create bar charts, tree maps, scatterplots, time series, and a variety of other visualizations. Next, you'll discover techniques to overcome challenges presented by data structure and quality and engage in effective data storytelling and decision making with business critical information. Finally, you'll be introduced to Tableau Prep, and learn how to use it to integrate and shape data for analysis. By the end of this book, you will be equipped to leverage the powerful features of Tableau 2019 for decision making. What you will learn Develop stunning visualizations that explain complexity with clarity Explore the exciting new features of Tableau Desktop and Tableau Prep Connect to various data sources to bring all your data together Uncover techniques to prep and structure your data for easy analysis Create and use calculations to solve problems and enrich analytics Master advanced topics such as sets, LOD calcs, and much more Enable smart decisions with clustering, distribution, and forecasting Share your data stories to build a culture of trust and action Who this book is for This Tableau book is for anyone who wants to understand data. If you’re new to Tableau, don’t worry. This book builds on the foundations to help you understand how Tableau really works and then builds on that knowledge with practical examples before moving on to advanced techniques. Working experience with databases will be useful but is not necessary to get the most out of this book.","language":"en","currency":"USD","id":"1788838742","title":"Learning Tableau 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-jmPDwAAQBAJ&source=gbs_api","authors":["Joshua N. Milligan"]},{"pageCount":305,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i1fSDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"How to Integrate Your RDBMS with the Hadoop Ecosystem and Re-Architect Relational Applications to NoSQL","description":"Re-architect relational applications to NoSQL, integrate relational database management systems with the Hadoop ecosystem, and transform and migrate relational data to and from Hadoop components. This book covers the best-practice design approaches to re-architecting your relational applications and transforming your relational data to optimize concurrency, security, denormalization, and performance. Winner of IBM’s 2012 Gerstner Award for his implementation of big data and data warehouse initiatives and author of Practical Hadoop Security, author Bhushan Lakhe walks you through the entire transition process. First, he lays out the criteria for deciding what blend of re-architecting, migration, and integration between RDBMS and HDFS best meets your transition objectives. Then he demonstrates how to design your transition model. Lakhe proceeds to cover the selection criteria for ETL tools, the implementation steps for migration with SQOOP- and Flume-based data transfers, and transition optimization techniques for tuning partitions, scheduling aggregations, and redesigning ETL. Finally, he assesses the pros and cons of data lakes and Lambda architecture as integrative solutions and illustrates their implementation with real-world case studies. Hadoop\/NoSQL solutions do not offer by default certain relational technology features such as role-based access control, locking for concurrent updates, and various tools for measuring and enhancing performance. Practical Hadoop Migration shows how to use open-source tools to emulate such relational functionalities in Hadoop ecosystem components. What You'll Learn Decide whether you should migrate your relational applications to big data technologies or integrate them Transition your relational applications to Hadoop\/NoSQL platforms in terms of logical design and physical implementation Discover RDBMS-to-HDFS integration, data transformation, and optimization techniques Consider when to use Lambda architecture and data lake solutions Select and implement Hadoop-based components and applications to speed transition, optimize integrated performance, and emulate relational functionalities Who This Book Is For Database developers, database administrators, enterprise architects, Hadoop\/NoSQL developers, and IT leaders. Its secondary readership is project and program managers and advanced students of database and management information systems.","language":"en","currency":"USD","id":"1484212878","title":"Practical Hadoop Migration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i1fSDAAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Vop4CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Tools and Technologies for Storing Your Company’s Data","description":"Network Storage: Tools and Technologies for Storing Your Company’s Data explains the changes occurring in storage, what they mean, and how to negotiate the minefields of conflicting technologies that litter the storage arena, all in an effort to help IT managers create a solid foundation for coming decades. The book begins with an overview of the current state of storage and its evolution from the network perspective, looking closely at the different protocols and connection schemes and how they differentiate in use case and operational behavior. The book explores the software changes that are motivating this evolution, ranging from data management, to in-stream processing and storage in virtual systems, and changes in the decades-old OS stack. It explores Software-Defined Storage as a way to construct storage networks, the impact of Big Data, high-performance computing, and the cloud on storage networking. As networks and data integrity are intertwined, the book looks at how data is split up and moved to the various appliances holding that dataset and its impact. Because data security is often neglected, users will find a comprehensive discussion on security issues that offers remedies that can be applied. The book concludes with a look at technologies on the horizon that will impact storage and its networks, such as NVDIMMs, The Hybrid Memory Cube, VSANs, and NAND Killers. Puts all the new developments in storage networking in a clear perspective for near-term and long-term planning Offers a complete overview of storage networking, serving as a go-to resource for creating a coherent implementation plan Provides the details needed to understand the area, and clears a path through the confusion and hype that surrounds such a radical revolution of the industry","language":"en","currency":"USD","id":"0128038659","title":"Network Storage","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Vop4CgAAQBAJ&source=gbs_api","authors":["James O'Reilly"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O6SWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"15th International Conference, BDAS 2019, Ustroń, Poland, May 28–31, 2019, Proceedings","description":"This book constitutes the refereed proceedings of the 15th International Conference entitled Beyond Databases, Architectures and Structures, BDAS 2019, held in Ustroń, Poland, in May 2019. It consists of 26 carefully reviewed papers selected from 69 submissions. The papers are organized in topical sections, namely big data and cloud computing; architectures, structures and algorithms for efficient data processing and analysis; artificial intelligence, data mining and knowledge discovery; image analysis and multimedia mining; bioinformatics and biomedical data analysis; industrial applications; networks and security.","language":"en","currency":"USD","id":"3030190935","title":"Beyond Databases, Architectures and Structures. Paving the Road to Smart Data Processing and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O6SWDwAAQBAJ&source=gbs_api","authors":["Stanisław Kozielski","Dariusz Mrozek","Paweł Kasprowski","Bożena Małysiak-Mrozek","Daniel Kostrzewa"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gVPhY0fT2FcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Annotation Are you looking at new ways to write better, more efficient tests? Are you struggling to add automated testing to your existing system? The Python unit testing framework, originally referred to as \"PyUnit\" and now known as unittest, is a framework that makes it easier for you to write automated test suites efficiently in Python. This book will show you exactly how to squeeze every ounce of value out of automated testing. The Python Testing Cookbook will empower you to write tests using lots of Python test tools, code samples, screenshots, and detailed explanations. By learning how and when to write tests at every level, you can vastly improve the quality of your code and your personal skill set. Packed with lots of test examples, this will become your go-to book for writing good tests. This practical cookbook covers lots of test styles including unit-level, test discovery, doctest, BDD, acceptance, smoke, and load testing. It will guide you to use popular Python tools effectively and discover how to write custom extensions. You will learn how to use popular continuous integration systems like Jenkins (formerly known as Hudson) and TeamCity to automatically test your code upon check in. This book explores Python's built-in ability to run code found embedded in doc strings and also plugging in to popular web testing tools like Selenium. By the end of this book, you will be proficient in many test tactics and be ready to apply them to new applications as well as legacy ones. A practical guide, this cookbook will ensure you fully utilize Python testing tools to write tests efficiently.","language":"en","currency":"USD","id":"1849514674","title":"Python Testing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gVPhY0fT2FcC&source=gbs_api","authors":["Greg L. Turnquist"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a52BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build performant and concurrent Unix and Linux systems with C++17","description":"A hands-on guide to making system programming with C++ easy Key Features Write system-level code leveraging C++17 Learn the internals of the Linux Application Binary Interface (ABI) and apply it to system programming Explore C++ concurrency to take advantage of server-level constructs Book Description C++ is a general-purpose programming language with a bias toward system programming as it provides ready access to hardware-level resources, efficient compilation, and a versatile approach to higher-level abstractions. This book will help you understand the benefits of system programming with C++17. You will gain a firm understanding of various C, C++, and POSIX standards, as well as their respective system types for both C++ and POSIX. After a brief refresher on C++, Resource Acquisition Is Initialization (RAII), and the new C++ Guideline Support Library (GSL), you will learn to program Linux and Unix systems along with process management. As you progress through the chapters, you will become acquainted with C++'s support for IO. You will then study various memory management methods, including a chapter on allocators and how they benefit system programming. You will also explore how to program file input and output and learn about POSIX sockets. This book will help you get to grips with safely setting up a UDP and TCP server\/client. Finally, you will be guided through Unix time interfaces, multithreading, and error handling with C++ exceptions. By the end of this book, you will be comfortable with using C++ to program high-quality systems. What you will learn Understand the benefits of using C++ for system programming Program Linux\/Unix systems using C++ Discover the advantages of Resource Acquisition Is Initialization (RAII) Program both console and file input and output Uncover the POSIX socket APIs and understand how to program them Explore advanced system programming topics, such as C++ allocators Use POSIX and C++ threads to program concurrent systems Grasp how C++ can be used to create performant system applications Who this book is for If you are a fresh developer with intermediate knowledge of C++ but little or no knowledge of Unix and Linux system programming, this book will help you learn system programming with C++ in a practical way.","language":"en","currency":"USD","id":"1789131774","title":"Hands-On System Programming with C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a52BDwAAQBAJ&source=gbs_api","authors":["Dr. Rian Quinn"]},{"pageCount":550,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H6a-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":"Perform powerful penetration testing using Kali Linux, Metasploit, Nessus, Nmap, and Wireshark","description":"Explore the latest ethical hacking tools and techniques in Kali Linux 2019 to perform penetration testing from scratch Key Features Get up and running with Kali Linux 2019.2 Gain comprehensive insights into security concepts such as social engineering, wireless network exploitation, and web application attacks Learn to use Linux commands in the way ethical hackers do to gain control of your environment Book Description The current rise in hacking and security breaches makes it more important than ever to effectively pentest your environment, ensuring endpoint protection. This book will take you through the latest version of Kali Linux and help you use various tools and techniques to efficiently deal with crucial security aspects. Through real-world examples, you’ll understand how to set up a lab and later explore core penetration testing concepts. Throughout the course of this book, you’ll get up to speed with gathering sensitive information and even discover different vulnerability assessment tools bundled in Kali Linux 2019. In later chapters, you’ll gain insights into concepts such as social engineering, attacking wireless networks, exploitation of web applications and remote access connections to further build on your pentesting skills. You’ll also focus on techniques such as bypassing controls, attacking the end user and maintaining persistence access through social media. Finally, this pentesting book covers best practices for performing complex penetration testing techniques in a highly secured environment. By the end of this book, you’ll be able to use Kali Linux to detect vulnerabilities and secure your system by applying penetration testing techniques of varying complexity. What you will learn Explore the fundamentals of ethical hacking Learn how to install and configure Kali Linux Get up to speed with performing wireless network pentesting Gain insights into passive and active information gathering Understand web application pentesting Decode WEP, WPA, and WPA2 encryptions using a variety of methods, such as the fake authentication attack, the ARP request replay attack, and the dictionary attack Who this book is for If you are an IT security professional or a security consultant who wants to get started with penetration testing using Kali Linux 2019.2, then this book is for you. The book will also help if you’re simply looking to learn more about ethical hacking and various security breaches. Although prior knowledge of Kali Linux is not necessary, some understanding of cybersecurity will be useful.","language":"en","currency":"USD","id":"1789612624","title":"Learn Kali Linux 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H6a-DwAAQBAJ&source=gbs_api","authors":["Glen D. Singh"]},{"pageCount":532,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k6isDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The truth about DevOps by the people on the front line","description":"Discover DevOps secrets from leading experts. Viktor Farcic interviews DevOps industries voices including Mike Kail, Greg Bledsoe, Jeff Sussna, James Turnbull, Kohsuke Kawaguchi, Liz Keogh, and more. Key Features Leading DevOps experts share their insights into modern DevOps practice Engage with the real-world challenges of putting DevOps to work Strengthen your DevOps practices now and prepare for future DevOps trends Book Description DevOps promises to break down silos, uniting organizations to deliver high quality output in a cross-functional way. In reality it often results in confusion and new silos: pockets of DevOps practitioners fight the status quo, senior decision-makers demand DevOps paint jobs without committing to true change. Even a clear definition of what DevOps is remains elusive. In DevOps Paradox, top DevOps consultants, industry leaders, and founders reveal their own approaches to all aspects of DevOps implementation and operation. Surround yourself with expert DevOps advisors. Viktor Farcic draws on experts from across the industry to discuss how to introduce DevOps to chaotic organizations, align incentives between teams, and make use of the latest tools and techniques. With each expert offering their own opinions on what DevOps is and how to make it work, you will be able to form your own informed view of the importance and value of DevOps as we enter a new decade. If you want to see how real DevOps experts address the challenges and resolve the paradoxes, this book is for you. What you will learn Expert opinions on: Introducing DevOps into real-world, chaotic business environments Deciding between adopting cutting edge tools or sticking with tried-and-tested methods Initiating necessary business change without positional power Managing and overcoming fear of change in DevOps implementations Anticipating future trends in DevOps and how to prepare for them Getting the most from Kubernetes, Docker, Puppet, Chef, and Ansible Creating the right incentives for DevOps success across an organization The impact of new techniques, such as Lambda, serverless, and schedulers, on DevOps practice Who this book is for Anybody interested in DevOps will gain a lot from this book. If you want to get beyond the simplistic ideals and engage with the deep challenges of putting DevOps to work in the real world, this book is for you.","language":"en","currency":"USD","id":"1789138809","title":"DevOps Paradox","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k6isDwAAQBAJ&source=gbs_api","authors":["Viktor Farcic"]},{"pageCount":144,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uEgTfiURlcQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is a step-by-step tutorial that will enable you to leverage the flexible search functionality of Apache Solr together with the Big Data power of Apache Hadoop.Scaling Big Data with Hadoop and Solr provides guidance to developers who wish to build high-speed enterprise search platforms using Hadoop and Solr. This book is primarily aimed at Java programmers who wish to extend the Hadoop platform to make it run as an enterprise search without any prior knowledge of Apache Hadoop and Solr.","language":"en","currency":"USD","id":"1783281383","title":"Scaling Big Data with Hadoop and Solr","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uEgTfiURlcQC&source=gbs_api","authors":["Hrishikesh Karambelkar"]},{"pageCount":430,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z82qDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get up to date with the finer points of Ubuntu Server using this comprehensive guide About This Book Get well-versed with newly-added features in Ubuntu 16.04 Master the art of installing, managing, and troubleshooting Ubuntu Server A practical easy-to-understand book that will help you enhance your existing skills. Who This Book Is For This book is intended for readers with intermediate or advanced-beginner skills with Linux, who would like to learn all about setting up servers with Ubuntu Server. This book assumes that the reader knows the basics of Linux, such as editing configuration files and running basic commands. What You Will Learn Learn how to manage users, groups, and permissions Encrypt and decrypt disks with Linux Unified Key Setup \/Luks Setup SSH for remote access, and connect it to other nodes Understand how to add, remove, and search for packages Use NFS and Samba to share directories with other users Get to know techniques for managing Apache and MariaDB Explore best practices and troubleshooting techniques In Detail Ubuntu is a Debian-based Linux operating system, and has various versions targeted at servers, desktops, phones, tablets and televisions. The Ubuntu Server Edition, also called Ubuntu Server, offers support for several common configurations, and also simplifies common Linux server deployment processes. With this book as their guide, readers will be able to configure and deploy Ubuntu Servers using Ubuntu Server 16.04, with all the skills necessary to manage real servers. The book begins with the concept of user management, group management, as well as file-system permissions. To manage your storage on Ubuntu Server systems, you will learn how to add and format storage and view disk usage. Later, you will also learn how to configure network interfaces, manage IP addresses, deploy Network Manager in order to connect to networks, and manage network interfaces. Furthermore, you will understand how to start and stop services so that you can manage running processes on Linux servers. The book will then demonstrate how to access and share files to or from Ubuntu Servers. You will learn how to create and manage databases using MariaDB and share web content with Apache. To virtualize hosts and applications, you will be shown how to set up KVM\/Qemu and Docker and manage virtual machines with virt-manager. Lastly, you will explore best practices and troubleshooting techniques when working with Ubuntu Servers. By the end of the book, you will be an expert Ubuntu Server user well-versed in its advanced concepts. Style and Approach This book is an advanced guide that will show readers how to administer, manage, and deploy Ubuntu server and will also provide expert-level knowledge on advanced security and backup techniques.","language":"en","currency":"USD","id":"1785287133","title":"Mastering Ubuntu Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z82qDQAAQBAJ&source=gbs_api","authors":["Jay LaCroix"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xNRJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The easiest way to build Python RESTful APIs and web services with Django","description":"Design, build and test RESTful web services with the Django framework and Python Key Features Create efficient real-world RESTful web services with the latest Django framework Authenticate, secure, and integrate third-party packages efficiently in your Web Services Leverage the power of Python for faster Web Service development Book Description Django is a Python web framework that makes the web development process very easy. It reduces the amount of trivial code, which simplifies the creation of web applications and results in faster development. It is very powerful and a great choice for creating RESTful web services. If you are a Python developer and want to efficiently create RESTful web services with Django for your apps, then this is the right book for you. The book starts off by showing you how to install and configure the environment, required software, and tools to create RESTful web services with Django and the Django REST framework. We then move on to working with advanced serialization and migrations to interact with SQLite and non-SQL data sources. We will use the features included in the Django REST framework to improve our simple web service. Further, we will create API views to process diverse HTTP requests on objects, go through relationships and hyperlinked API management, and then discover the necessary steps to include security and permissions related to data models and APIs. We will also apply throttling rules and run tests to check that versioning works as expected. Next we will run automated tests to improve code coverage. By the end of the book, you will be able to build RESTful web services with Django. What you will learn The best way to build a RESTful Web Service or API with Django and the Django REST Framework Develop complex RESTful APIs from scratch with Django and the Django REST Framework Work with either SQL or NoSQL data sources Design RESTful Web Services based on application requirements Use third-party packages and extensions to perform common tasks Create automated tests for RESTful web services Debug, test, and profile RESTful web services with Django and the Django REST Framework Who this book is for This book is for Python developers who want to create RESTful web services with Django; you need to have a basic working knowledge of Django but no previous experience with RESTful web services is required.","language":"en","currency":"USD","id":"1788835573","title":"Django RESTful Web Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xNRJDwAAQBAJ&source=gbs_api","authors":["Gaston C. Hillar"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FhlKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Efficiently secure critical infrastructure systems","description":"Your one-step guide to understanding industrial cyber security, its control systems, and its operations. About This Book Learn about endpoint protection such as anti-malware implementation, updating, monitoring, and sanitizing user workloads and mobile devices Filled with practical examples to help you secure critical infrastructure systems efficiently A step-by-step guide that will teach you the techniques and methodologies of building robust infrastructure systems Who This Book Is For If you are a security professional and want to ensure a robust environment for critical infrastructure systems, this book is for you. IT professionals interested in getting into the cyber security domain or who are looking at gaining industrial cyber security certifications will also find this book useful. What You Will Learn Understand industrial cybersecurity, its control systems and operations Design security-oriented architectures, network segmentation, and security support services Configure event monitoring systems, anti-malware applications, and endpoint security Gain knowledge of ICS risks, threat detection, and access management Learn about patch management and life cycle management Secure your industrial control systems from design through retirement In Detail With industries expanding, cyber attacks have increased significantly. Understanding your control system's vulnerabilities and learning techniques to defend critical infrastructure systems from cyber threats is increasingly important. With the help of real-world use cases, this book will teach you the methodologies and security measures necessary to protect critical infrastructure systems and will get you up to speed with identifying unique challenges.Industrial cybersecurity begins by introducing Industrial Control System (ICS) technology, including ICS architectures, communication media, and protocols. This is followed by a presentation on ICS (in) security. After presenting an ICS-related attack scenario, securing of the ICS is discussed, including topics such as network segmentation, defense-in-depth strategies, and protective solutions. Along with practical examples for protecting industrial control systems, this book details security assessments, risk management, and security program development. It also covers essential cybersecurity aspects, such as threat detection and access management. Topics related to endpoint hardening such as monitoring, updating, and anti-malware implementations are also discussed. Style and approach A step-by-step guide to implement Industrial Cyber Security effectively.","language":"en","currency":"USD","id":"1788395980","title":"Industrial Cybersecurity","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FhlKDwAAQBAJ&source=gbs_api","authors":["Pascal Ackerman"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HjhPAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"Real-Time Big Data Management for the Enterprise","description":"Master Oracle NoSQL Database Enable highly reliable, scalable, and available data. Oracle NoSQL Database: Real-Time Big Data Management for the Enterprise shows you how to take full advantage of this cost-effective solution for storing, retrieving, and updating high-volume, unstructured data. The book covers installation, configuration, application development, capacity planning and sizing, and integration with other enterprise data center products. Real-world examples illustrate the concepts presented in this Oracle Press guide. Understand Oracle NoSQL Database architecture and the underlying data storage engine, Oracle Berkeley DB Install and configure Oracle NoSQL Database for optimal performance Develop complex, distributed applications using a rich set of APIs Read and write data into the Oracle NoSQL Database key-value store Apply an Avro schema to the value portion of the key-value pair using Avro bindings Learn best practices for capacity planning and sizing an enterpriselevel Oracle NoSQL Database deployment Integrate Oracle NoSQL Database with Oracle Database, Oracle Event Processing, and Hadoop Code examples from the book are available for download at www.OraclePressBooks.com.","language":"en","currency":"USD","id":"0071816542","title":"Oracle NoSQL Database","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HjhPAgAAQBAJ&source=gbs_api","authors":["Maqsood Alam","Aalok Muley","Chaitanya Kadaru","Ashok Joshi"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y1qWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A guide to developing efficient and elegant T-SQL code","description":"Troubleshoot query performance issues, identify anti-patterns in code, and write efficient T-SQL queries Key Features Discover T-SQL functionalities and services that help you interact with relational databases Understand the roles, tasks and responsibilities of a T-SQL developer Explore solutions for carrying out database querying tasks, database administration, and troubleshooting Book Description Transact-SQL (T-SQL) is Microsoft's proprietary extension to the SQL language that is used with Microsoft SQL Server and Azure SQL Database. This book will be a useful guide to learning the art of writing efficient T-SQL code in modern SQL Server versions, as well as the Azure SQL Database. The book will get you started with query processing fundamentals to help you write powerful, performant T-SQL queries. You will then focus on query execution plans and learn how to leverage them for troubleshooting. In the later chapters, you will learn how to identify various T-SQL patterns and anti-patterns. This will help you analyze execution plans to gain insights into current performance, and determine whether or not a query is scalable. You will also learn to build diagnostic queries using dynamic management views (DMVs) and dynamic management functions (DMFs) to address various challenges in T-SQL execution. Next, you will study how to leverage the built-in tools of SQL Server to shorten the time taken to address query performance and scalability issues. In the concluding chapters, the book will guide you through implementing various features, such as Extended Events, Query Store, and Query Tuning Assistant using hands-on examples. By the end of this book, you will have the skills to determine query performance bottlenecks, avoid pitfalls, and discover the anti-patterns in use. Foreword by Conor Cunningham, Partner Architect – SQL Server and Azure SQL – Microsoft What you will learn Use Query Store to understand and easily change query performance Recognize and eliminate bottlenecks that lead to slow performance Deploy quick fixes and long-term solutions to improve query performance Implement best practices to minimize performance risk using T-SQL Achieve optimal performance by ensuring careful query and index design Use the latest performance optimization features in SQL Server 2017 and SQL Server 2019 Protect query performance during upgrades to newer versions of SQL Server Who this book is for This book is for database administrators, database developers, data analysts, data scientists, and T-SQL practitioners who want to get started with writing T-SQL code and troubleshooting query performance issues, through the help of practical examples. Previous knowledge of T-SQL querying is not required to get started on this book.","language":"en","currency":"USD","id":"178934297X","title":"Learn T-SQL Querying","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y1qWDwAAQBAJ&source=gbs_api","authors":["Pedro Lopes","Pam Lahoud"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ESf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.68,"subtitle":null,"description":"Apache HAWQ是一个SQL-on-Hadoop产品，它非常适合用于Hadoop平台上快速构建数据仓库系统。HAWQ具有大规模并行处理、完善的SQL兼容性、支持存储过程和事务、出色的性能表现等特性，还可与开源数据挖掘库MADlib轻松整合，从而使用SQL就能进行数据挖掘与机器学习。 本书内容分技术解析、实战演练与数据挖掘三个部分共27章。技术解析部分说明HAWQ的基础架构与功能特性，包括安装、连接、对象与资源管理、查询优化、备份恢复、高可用性等。实战演练部分用一个完整的示例，说明如何使用HAWQ取代传统数据仓库，包括ETL处理、自动调度系统、维度表与事实表技术、OLAP与数据的图形化表示等。数据挖掘部分用实例说明HAWQ与MADlib整合，实现降维、协同过滤、关联规则、回归、聚类、分类等常见数据挖掘与机器学习方法。 本书适合数据库管理员、大数据技术人员、Hadoop技术人员、数据仓库技术人员，也适合高等院校和培训机构相关专业的师生教学参考。","language":"zh-CN","currency":"USD","id":"7302498024","title":"HAWQ数据仓库与数据挖掘实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ESf7DwAAQBAJ&source=gbs_api","authors":["王雪迎著"]},{"pageCount":54,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T75KDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.57,"subtitle":null,"description":"Bachelorarbeit aus dem Jahr 2015 im Fachbereich Informatik - Software, Note: 1,7, Frankfurt University of Applied Sciences, ehem. Fachhochschule Frankfurt am Main, Sprache: Deutsch, Abstract: Für viele Unternehmen sind sie elementar wichtig, für Benutzer von Smartphones, Social Media-Anwendungen, Online-Shops sowie diverser Plattformen sind sie dagegen nicht von großer Bedeutung. Die Rede ist von \"Daten\". Da Daten aus Unternehmenssicht wichtige Informationen, wie zum Beispiel das Kaufverhalten eines Kunden reflektieren, spielen sie heutzutage eine wichtige Rolle bei der Gewinngenerierung. Beispielsweise versuchen Unternehmen anhand von verschiedenen BI-Lösungen, diese gespeicherten Daten auszuwerten, um eine Gewinnmaximierung zu erzielen. Laut der Digital-Universe-Studie von IDC verdoppelt sich der komplette Datenbestand alle zweieinhalb Jahre und soll im Jahre 2020 in Westeuropa auf fünf Zetabyte anwachsen. Die Studie besagt zudem, dass das Datenvolumen 2020 auf dem gesamten Globus 44 Zetabyte betragen wird. An einigen Beispielen lässt sich der explosiv wachsende Datenbestand aufzeigen: (1) Derzeit wären acht Jahre nötig, um alle Videos in YouTube, die täglich hochgeladen werden, anzuschauen. (2) Es werden in Facebook pro Minute 2,46 Millionen Inhalte geteilt. (3) Die Summe der Datensätze ist aktuell größer als die Zahl aller Sterne im Universum. Solch große Datenansammlungen, die aufgrund des Web 2.0 entstanden sind, brachten vor einigen Jahren das Trendwort \"BIG DATA\" hervor. Die Entwicklung von Big Data brachte vielen Unternehmen nicht nur profitable Informationen, sondern ließ auch deren Datenbanken und Datenbank-Management-Systeme an ihre Grenzen stoßen. Herausforderungen, wie z. B. die schnelle Verarbeitung vieler Datensätze, sind aufgrund der Komplexität und der Datenstruktur von relationalen Datenbank-Management-Systemen nicht mehr leicht zu bewältigen. Diese Herausforderungen stießen den Durchbruch der NoSQL-Datenbanken an. Diese Bachelorarbeit befasst sich mit folgendem Thema: Implementation und Test einer kleinen Videodatenbank mit CouchDB.","language":"de","currency":"USD","id":"3668630348","title":"Implementation und Test einer kleinen Videodatenbank mit CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T75KDwAAQBAJ&source=gbs_api","authors":["Taylan Basmara"]},{"pageCount":8,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fjxNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Studienarbeit aus dem Jahr 2017 im Fachbereich Informatik - Allgemeines, Note: 1,6, Universität Rostock, Sprache: Deutsch, Abstract: Die Begriffe „Data Science“ und „Big Data“ sind neben der „Cloud“ und „KI“ die wohl am häufigsten genutzten Buzzwords der letzten Jahre. Sie werden in Verbindung gebracht mit dem exzessiven Datensammelwahn großer Konzerne und werfen Datenschutzbedenken auf und bieten gleichzeitig unendliche Möglichkeiten zur Vorhersage und Analyse von Verhalten. Die Wichtigkeit von Big Data und den damit verbundenen Technologien erreicht mittlerweile immer mehr Unternehmen und macht so eine Verbindung zwischen Geschäftswelt und Wissenschaft nötig.","language":"de","currency":"USD","id":"3668642672","title":"Data Science und Big Data. Eine Übersicht","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fjxNDwAAQBAJ&source=gbs_api","authors":["Robert Bastei"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHg5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Become a developer superhero and build stunning cross-platform apps with Delphi About This Book A one-stop guide on Delphi to help you build cross-platform apps This book covers important concepts such as the FireMonkey library, shows you how to interact with the Internet of Things, and enables you to integrate with Cloud services The code is explained in detail with observations on how to create native apps for Ios and Android with a single code base Who This Book Is For If you want to create stunning applications for mobile, desktop, the cloud, and the Internet of Things, then this book is for you. This book is for developers who would like to build native cross-platform apps with a single codebase for iOS and Android. A basic knowledge of Delphi is assumed, although we do cover a primer on the language. What You Will Learn Understand the basics of Delphi and the FireMonkey application platform as well as the specifics of Android and iOS platforms Complete complex apps quickly with access to platform features and APIs using a single, easy-to-maintain code base Work with local data sources, including embedded SQL databases, REST servers, and Backend-as-a-Service providers Take full advantage of mobile hardware capabilities by working with sensors and Internet of Things gadgets and devices Integrate with cloud services and data using REST APIs and scalable multi-tier frameworks for outstanding multi-user and social experience Architect and deploy powerful mobile back-end services and get super-productive by leveraging Delphi IDE agile functionality Get to know the best practices for writing a high-quality, reliable, and maintainable codebase in the Delphi Object Pascal language In Detail Delphi is the most powerful Object Pascal IDE and component library for cross-platform native app development. It enables building natively compiled, blazingly fast apps for all major platforms including Android, iOS, Windows, Mac, and Linux. If you want to build server-side applications, create web services, and have clear GUIs for your project, then this book is for you. The book begins with a basic primer on Delphi helping you get accustomed to the IDE and the Object Pascal language and will then quickly move on to advanced-level concepts. Through this book, we'll help you understand the architecture of applications and will teach you the important concepts of the FireMonkey library, show you how to build server-side services, and enable you to interact with the Internet of Things. Towards the end, you will learn to integrate your app with various web services and deploy them. By the end of the book, you will be able to build powerful, cross-platform, native apps for iOS and Android with a single code base. Style and approach This book will help you build cross-platform mobile apps with Delphi using a step-by-step approach.","language":"en","currency":"USD","id":"1786465841","title":"Expert Delphi","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHg5DwAAQBAJ&source=gbs_api","authors":["Pawel Glowacki"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FtCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A comprehensive guide to building computer vision and image processing applications with C++, 3rd Edition","description":"Work on practical computer vision projects covering advanced object detector techniques and modern deep learning and machine learning algorithms Key Features Learn about the new features that help unlock the full potential of OpenCV 4 Build face detection applications with a cascade classifier using face landmarks Create an optical character recognition (OCR) model using deep learning and convolutional neural networks Book Description Mastering OpenCV, now in its third edition, targets computer vision engineers taking their first steps toward mastering OpenCV. Keeping the mathematical formulations to a solid but bare minimum, the book delivers complete projects from ideation to running code, targeting current hot topics in computer vision such as face recognition, landmark detection and pose estimation, and number recognition with deep convolutional networks. You’ll learn from experienced OpenCV experts how to implement computer vision products and projects both in academia and industry in a comfortable package. You’ll get acquainted with API functionality and gain insights into design choices in a complete computer vision project. You’ll also go beyond the basics of computer vision to implement solutions for complex image processing projects. By the end of the book, you will have created various working prototypes with the help of projects in the book and be well versed with the new features of OpenCV4. What you will learn Build real-world computer vision problems with working OpenCV code samples Uncover best practices in engineering and maintaining OpenCV projects Explore algorithmic design approaches for complex computer vision tasks Work with OpenCV’s most updated API (v4.0.0) through projects Understand 3D scene reconstruction and Structure from Motion (SfM) Study camera calibration and overlay AR using the ArUco Module Who this book is for This book is for those who have a basic knowledge of OpenCV and are competent C++ programmers. You need to have an understanding of some of the more theoretical\/mathematical concepts, as we move quite quickly throughout the book.","language":"en","currency":"USD","id":"1789539269","title":"Mastering OpenCV 4","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FtCBDwAAQBAJ&source=gbs_api","authors":["Roy Shilkrot","David Millán Escrivá"]},{"pageCount":362,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z-mvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A beginner's guide to developing interactive business intelligence solutions using Microsoft Power BI","description":"Solve business challenges with Microsoft Power BI's advanced visualization and data analysis techniques Key Features Create effective storytelling reports by implementing simple-to-intermediate Power BI features Develop powerful analytical models to extract key insights for changing business needs Build, publish, and share impressive dashboards for your organization Book Description To succeed in today's transforming business world, organizations need business intelligence capabilities to make smarter decisions faster than ever before. This Power BI book is an entry-level guide that will get you up and running with data modeling, visualization, and analytical techniques from scratch. You'll find this book handy if you want to get well-versed with the extensive Power BI ecosystem. You'll start by covering the basics of business intelligence and installing Power BI. You'll then learn the wide range of Power BI features to unlock business insights. As you progress, the book will take you through how to use Power Query to ingest, cleanse, and shape your data, and use Power BI DAX to create simple to complex calculations. You'll also be able to add a variety of interactive visualizations to your reports to bring your data to life. Finally, you'll gain hands-on experience in creating visually stunning reports that speak to business decision makers, and see how you can securely share these reports and collaborate with others. By the end of this book, you'll be ready to create simple, yet effective, BI reports and dashboards using the latest features of Power BI. What you will learn Explore the different features of Power BI to create interactive dashboards Use the Query Editor to import and transform data Perform simple and complex DAX calculations to enhance analysis Discover business insights and tell a story with your data using Power BI Explore data and learn to manage datasets, dataflows, and data gateways Use workspaces to collaborate with others and publish your reports Who this book is for If you’re an IT manager, data analyst, or BI user new to using Power BI for solving business intelligence problems, this book is for you. You’ll also find this book useful if you want to migrate from other BI tools to create powerful and interactive dashboards. No experience of working with Power BI is expected.","language":"en","currency":"USD","id":"1838646655","title":"Learn Power BI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z-mvDwAAQBAJ&source=gbs_api","authors":["Greg Deckler"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sbpmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":132,"subtitle":"Trends and Challenges","description":"The topic of NoSQL databases has recently emerged, to face the Big Data challenge, namely the ever increasing volume of data to be handled. It is now recognized that relational databases are not appropriate in this context, implying that new database models and techniques are needed. This book presents recent research works, covering the following basic aspects: semantic data management, graph databases, and big data management in cloud environments. The chapters in this book report on research about the evolution of basic concepts such as data models, query languages, and new challenges regarding implementation issues.","language":"en","currency":"USD","id":"1119544130","title":"NoSQL Data Models","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sbpmDwAAQBAJ&source=gbs_api","authors":["Olivier Pivert"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zBdiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.99,"subtitle":null,"description":"O NodeJS é uma poderosa plataforma para construir de forma rápida e fácil aplicações de rede escaláveis. Utiliza um modelo de single thread, faz I\/O não bloqueante e por isso trabalha sempre de forma assíncrona. Construindo aplicações com NodeJS abrange: •O que é o NodeJS e o que pode ser feito com essa plataforma. •Conceitos de bancos de dados relacionais como modelagem e formas normais. •Conceitos de REST e boas práticas para um bom design de API. •Como construir, testar e documentar uma API RESTful com NodeJS. Você aprenderá a construir uma API RESTful funcional, com testes unitários e documentação dos endpoints, que estará pronta para ser publicada seguindo boas práticas e otimizações. Será utilizada uma estrutura robusta, testável e expansível, que poderá servir como base para implementar outras aplicações HTTP com NodeJS.","language":"pt","currency":"USD","id":"857522686X","title":"Construindo aplicações com NodeJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zBdiDwAAQBAJ&source=gbs_api","authors":["William Bruno Moraes"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Q68AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Mastering Apache Cassandra is a practical, hands-on guide with step-by-step instructions. The smooth and easy tutorial approach focuses on showing people how to utilize Cassandra to its full potential.This book is aimed at intermediate Cassandra users. It is best suited for startups where developers have to wear multiple hats: programmer, DevOps, release manager, convincing clients, and handling failures. No prior knowledge of Cassandra is required.","language":"en","currency":"USD","id":"1782162690","title":"Mastering Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Q68AQAAQBAJ&source=gbs_api","authors":["Nishant Neeraj"]},{"pageCount":590,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVt1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build a modern, full-stack web application using Spring Boot and Vuex","description":"Become efficient in both frontend and backend web development with Spring and Vue Key Features Connect application’s frontend and backend with Vue, Vuex, and Spring Boot Leverage the latest web standards to enhance code performance, readability, and cross-compatibility Build secure full-stack web applications with Spring Security Book Description Building Applications with Spring 5 and Vue.js 2, with its practical approach, helps you become a full-stack web developer. As well as knowing how to write frontend and backend code, a developer has to tackle all problems encountered in the application development life cycle – starting from the simple idea of an application, to the UI and technical designs, and all the way to implementation, testing, production deployment, and monitoring. With the help of this book, you'll get to grips with Spring 5 and Vue.js 2 as you learn how to develop a web application. From the initial structuring to full deployment, you’ll be guided at every step of developing a web application from scratch with Vue.js 2 and Spring 5. You’ll learn how to create different components of your application as you progress through each chapter, followed by exploring different tools in these frameworks to expedite your development cycle. By the end of this book, you’ll have gained a complete understanding of the key design patterns and best practices that underpin professional full-stack web development. What you will learn Analyze requirements and design data models Develop a single-page application using Vue.js 2 and Spring 5 Practice concept, logical, and physical data modeling Design, implement, secure, and test RESTful API Add test cases to improve reliability of an application Monitor and deploy your application to production Who this book is for Building Applications with Spring 5.0 and Vue.js 2.0 is for you if you are developer who is new to Vue.js or Spring. It is assumed that you have some knowledge of HTML, CSS, and Java.","language":"en","currency":"USD","id":"178883125X","title":"Building Applications with Spring 5 and Vue.js 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVt1DwAAQBAJ&source=gbs_api","authors":["James J. Ye"]},{"pageCount":410,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RLZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Design and create your own IoT applications using Raspberry Pi 3","description":"Augment your IoT skills with the help of engaging and enlightening tutorials designed for Raspberry Pi 3 Key Features Design and implement state-of-the-art solutions for the Internet of Things Build complex projects using motions detectors, controllers, sensors, and Raspberry Pi 3 A hands-on guide that provides interoperable solutions for sensors, actuators, and controllers Book Description The Internet of Things (IoT) is the fastest growing technology market. Industries are embracing IoT technologies to improve operational expenses, product life, and people's well-being. Mastering Internet of Things starts by presenting IoT fundamentals and the smart city. You will learn the important technologies and protocols that are used for the Internet of Things, their features, corresponding security implications, and practical examples on how to use them. This book focuses on creating applications and services for the Internet of Things. Further, you will learn to create applications and services for the Internet of Things. You will be discover various interesting projects and understand how to publish sensor data, control devices, and react to asynchronous events using the XMPP protocol. The book also introduces chat, to interact with your devices. You will learn how to automate your tasks by using Internet of Things Service Platforms as the base for an application. You will understand the subject of privacy, requirements they should be familiar with, and how to avoid violating any of the important new regulations being introduced. At the end of the book, you will have mastered creating open, interoperable and secure networks of things, protecting the privacy and integrity of your users and their information. What you will learn Create your own project, run and debug it Master different communication patterns using the MQTT, HTTP, CoAP, LWM2M and XMPP protocols Build trust-based as hoc networks for open, secure and interoperable communication Explore the IoT Service Platform Manage the entire product life cycle of devices Understand and set up the security and privacy features required for your system Master interoperability, and how it is solved in the realms of HTTP,CoAP, LWM2M and XMPP Who this book is for If you're a developer or electronic engineer and are curious about the Internet of Things, this is the book for you. With only a rudimentary understanding of electronics and Raspberry Pi 3, and some programming experience using managed code, such as C# or Java, you will be taught to develop state-of-the-art solutions for the Internet of Things.","language":"en","currency":"USD","id":"1788397436","title":"Mastering Internet of Things","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RLZTDwAAQBAJ&source=gbs_api","authors":["Peter Waher"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nPBZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Master the art of container management by using the power of Kubernetes, 2nd Edition","description":"Exploit design, deployment, and management of large-scale containers Key Features Explore the latest features available in Kubernetes 1.10 Ensure that your clusters are always available, scalable, and up to date Master the skills of designing and deploying large clusters on various cloud platforms Book Description Kubernetes is an open source system that is used to automate the deployment, scaling, and management of containerized applications. If you are running more containers or want automated management of your containers, you need Kubernetes at your disposal. To put things into perspective, Mastering Kubernetes walks you through the advanced management of Kubernetes clusters. To start with, you will learn the fundamentals of both Kubernetes architecture and Kubernetes design in detail. You will discover how to run complex stateful microservices on Kubernetes including advanced features such as horizontal pod autoscaling, rolling updates, resource quotas, and persistent storage backend. Using real-world use cases, you will explore the options for network configuration, and understand how to set up, operate, and troubleshoot various Kubernetes networking plugins. In addition to this, you will get to grips with custom resource development and utilization in automation and maintenance workflows. To scale up your knowledge of Kubernetes, you will encounter some additional concepts based on the Kubernetes 1.10 release, such as Promethus, Role-based access control, API aggregation, and more. By the end of this book, you’ll know everything you need to graduate from intermediate to advanced level of understanding Kubernetes. What you will learn Architect a robust Kubernetes cluster for long-time operation Discover the advantages of running Kubernetes on GCE, AWS, Azure, and bare metal Understand the identity model of Kubernetes, along with the options for cluster federation Monitor and troubleshoot Kubernetes clusters and run a highly available Kubernetes Create and configure custom Kubernetes resources and use third-party resources in your automation workflows Enjoy the art of running complex stateful applications in your container environment Deliver applications as standard packages Who this book is for Mastering Kubernetes is for you if you are a system administrator or a developer who has an intermediate understanding of Kubernetes and wish to master its advanced features. Basic knowledge of networking would also be helpful. In all, this advanced-level book provides a smooth pathway to mastering Kubernetes.","language":"en","currency":"USD","id":"1788999975","title":"Mastering Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nPBZDwAAQBAJ&source=gbs_api","authors":["Gigi Sayfan"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build highly effective analytics solutions to gain valuable insight into your big data","description":"Explore big data concepts, platforms, analytics, and their applications using the power of Hadoop 3 Key Features Learn Hadoop 3 to build effective big data analytics solutions on-premise and on cloud Integrate Hadoop with other big data tools such as R, Python, Apache Spark, and Apache Flink Exploit big data using Hadoop 3 with real-world examples Book Description Apache Hadoop is the most popular platform for big data processing, and can be combined with a host of other big data tools to build powerful analytics solutions. Big Data Analytics with Hadoop 3 shows you how to do just that, by providing insights into the software as well as its benefits with the help of practical examples. Once you have taken a tour of Hadoop 3’s latest features, you will get an overview of HDFS, MapReduce, and YARN, and how they enable faster, more efficient big data processing. You will then move on to learning how to integrate Hadoop with the open source tools, such as Python and R, to analyze and visualize data and perform statistical computing on big data. As you get acquainted with all this, you will explore how to use Hadoop 3 with Apache Spark and Apache Flink for real-time data analytics and stream processing. In addition to this, you will understand how to use Hadoop to build analytics solutions on the cloud and an end-to-end pipeline to perform big data analysis using practical use cases. By the end of this book, you will be well-versed with the analytical capabilities of the Hadoop ecosystem. You will be able to build powerful solutions to perform big data analytics and get insight effortlessly. What you will learn Explore the new features of Hadoop 3 along with HDFS, YARN, and MapReduce Get well-versed with the analytical capabilities of Hadoop ecosystem using practical examples Integrate Hadoop with R and Python for more efficient big data processing Learn to use Hadoop with Apache Spark and Apache Flink for real-time data analytics Set up a Hadoop cluster on AWS cloud Perform big data analytics on AWS using Elastic Map Reduce Who this book is for Big Data Analytics with Hadoop 3 is for you if you are looking to build high-performance analytics solutions for your enterprise or business using Hadoop 3’s powerful features, or you’re new to big data analytics. A basic understanding of the Java programming language is required.","language":"en","currency":"USD","id":"1788624955","title":"Big Data Analytics with Hadoop 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHxeDwAAQBAJ&source=gbs_api","authors":["Sridhar Alla"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VvFsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Design and architect highly scalable, robust, and high-performance Java applications","description":"Discover how different software architectural models can help you solve problems, and learn best practices for the software development cycle Key Features Learn concepts related to software architecture and embrace them using the latest features of Spring 5 Discover architectural models and learn when to apply them Gain knowledge of architectural principles and how they can be used to provide accountability and rationale for architectural decisions Book Description Spring 5 and its ecosystem can be used to build robust architectures effectively. Software architecture is the underlying piece that helps us accomplish our business goals whilst supporting the features that a product demands. This book explains in detail how to choose the right architecture and apply best practices during your software development cycle to avoid technical debt and support every business requirement. Choosing the right architecture model to support your business requirements is one of the key decisions you need to take when a new product is being created from scratch or is being refactored to support new business demands. This book gives you insights into the most common architectural models and guides you when and where they can be used. During this journey, you’ll see cutting-edge technologies surrounding the Spring products, and understand how to use agile techniques such as DevOps and continuous delivery to take your software to production effectively. By the end of this book, you’ll not only know the ins and outs of Spring, but also be able to make critical design decisions that surpass your clients’ expectations. What you will learn Understand the key principles of software architecture Uncover the most common architectural models available Analyze scenarios where an architecture model should be used Implement agile techniques to take your software to production Secure the products you are working on Master tricks that will help you build high-performant applications Use cutting-edge technologies to build products Who this book is for If you’re an experienced Spring developer aspiring to become an architect of enterprise-grade applications, this book is for you. It’s also ideal for software architects who want to leverage Spring to create effective application blueprints.","language":"en","currency":"USD","id":"1788996739","title":"Software Architecture with Spring 5.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VvFsDwAAQBAJ&source=gbs_api","authors":["René Enríquez","Alberto Salazar"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=108oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build stunning, maintainable, cross-platform mobile application user interfaces with the power of Xamarin About This Book Create, configure, and customize stunning platform-specific features as well as cross-platform UIs with the power of Xamarin Forms. Maximize the testability, flexibility, and overall quality of your Xamarin apps. Get the most out of Xamarin.Forms and create your own reusable templates with C# scripting in Xamarin. Who This Book Is For If you are a mobile developer with basic knowledge of Xamarin and C# coding, then this book is for you. What You Will Learn Develop stunning native cross-platform apps using the Xamarin.Forms framework Work with the different UI layouts to create customized layouts using the C# programming language and tweak it for a given platform Customize the user interface using DataTemplates and CustomRenderers and the Platform Effects API to change the appearance of control elements Build hybrid apps using the Razor Template Engine and create Razor Models that communicate with a SQLite database Use location based features within your app to display the user's current location Work with the Xamarin.Forms Map control to display Pin placeholders based on the stored latitude and longitude coordinates Understand and use the MVVM pattern architecture to navigate between each of your ViewModels and implement Data Binding to display and update information Work with the Microsoft Azure Platform to incorporate API Data Access using Microsoft Azure App Services and the RESTful API Incorporate third-party features within your app using the Facebook SDK and the Open Graph API Perform unit testing and profile your Xamarin.Forms applications Deploy your apps to the Google Play Store and Apple App Store In Detail Xamarin is the most powerful cross-platform mobile development framework. If you are interested in creating stunning user interfaces for the iOS and Android mobile platforms using the power of Xamarin and Xamarin.Forms, then this is your ticket. This book will provide you the practical skills required to develop real-world Xamarin applications. You will learn how to implement UI structures and layouts, create customized elements, and write C# scripts to customize layouts. You will create UI layouts from scratch so that you can tweak and customize a given UI layout to suit your needs by using Data Templates. Moving on, you will use third-party libraries – such as the Razor template engine that allows you to create your own HTML5 templates within the Xamarin environment – to build a book library Hybrid solution that uses the SQLite.Net library to store, update, retrieve, and delete information within a SQLite local database. You'll also implement key data-binding techniques that will make your user interfaces dynamic, and create personalized animations and visual effects within your user interfaces using Custom Renderers and the PlatformEffects API to customize and change the appearance of control elements. At the end of this book, you will test your application UI for robust and consistent behavior and then explore techniques to deploy to different platforms. Style and approach This easy to follow guide will walk you through building a real world Xamarin.Forms mobile app from start to finish. Each chapter builds upon the app using a step-by-step methodology that applies new advanced functionalities, design patterns, and best practices.","language":"en","currency":"USD","id":"178646487X","title":"Mastering Xamarin UI Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=108oDwAAQBAJ&source=gbs_api","authors":["Steven F. Daniel"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pyZKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Infrastructure security with Red Team and Blue Team tactics","description":"Enhance your organization’s secure posture by improving your attack and defense strategies Key Features Gain a clear understanding of the attack methods, and patterns to recognize abnormal behavior within your organization with Blue Team tactics. Learn to unique techniques to gather exploitation intelligence, identify risk and demonstrate impact with Red Team and Blue Team strategies. A practical guide that will give you hands-on experience to mitigate risks and prevent attackers from infiltrating your system. Book Description The book will start talking about the security posture before moving to Red Team tactics, where you will learn the basic syntax for the Windows and Linux tools that are commonly used to perform the necessary operations. You will also gain hands-on experience of using new Red Team techniques with powerful tools such as python and PowerShell, which will enable you to discover vulnerabilities in your system and how to exploit them. Moving on, you will learn how a system is usually compromised by adversaries, and how they hack user's identity, and the various tools used by the Red Team to find vulnerabilities in a system. In the next section, you will learn about the defense strategies followed by the Blue Team to enhance the overall security of a system. You will also learn about an in-depth strategy to ensure that there are security controls in each network layer, and how you can carry out the recovery process of a compromised system. Finally, you will learn how to create a vulnerability management strategy and the different techniques for manual log analysis. By the end of this book, you will be well-versed with Red Team and Blue Team techniques and will have learned the techniques used nowadays to attack and defend systems. What you will learn Learn the importance of having a solid foundation for your security posture Understand the attack strategy using cyber security kill chain Learn how to enhance your defense strategy by improving your security policies, hardening your network, implementing active sensors, and leveraging threat intelligence Learn how to perform an incident investigation Get an in-depth understanding of the recovery process Understand continuous security monitoring and how to implement a vulnerability management strategy Learn how to perform log analysis to identify suspicious activities Who this book is for This book aims at IT professional who want to venture the IT security domain. IT pentester, Security consultants, and ethical hackers will also find this course useful. Prior knowledge of penetration testing would be beneficial.","language":"en","currency":"USD","id":"178847385X","title":"Cybersecurity ??? Attack and Defense Strategies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pyZKDwAAQBAJ&source=gbs_api","authors":["Yuri Diogenes","Dr. Erdal Ozkaya"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VsxPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"One stop solution for DBAs to monitor, manage, and maintain enterprise databases","description":"Implement and administer successful database solution with SQL Server 2017 About This Book Master the required skills to successfully set up, administer, and maintain your SQL Server 2017 database solution Design and configure, manage, and secure a rock-solid SQL server Comprehensive guide in keeping your SQL server disaster proof and all-time availability Who This Book Is For This book targets database administrators with an interest in SQL Server 2017 administration. Readers are expected to have some experience with previous SQL Server versions. What You Will Learn Learn about the new features of SQL Server 2017 and how to implement them Build a stable and fast SQL Server environment Fix performance issues by optimizing queries and making use of indexes Perform a health check of an existing troublesome database environment Design and use an optimal database management strategy Implement efficient backup and recovery techniques in-line with security policies Combine SQL Server 2017 and Azure and manage your solution by various automation techniques Perform data migration, cluster upgradation and server consolidation In Detail Take advantage of the real power of SQL Server 2017 with all its new features, in addition to covering core database administration tasks. This book will give you a competitive advantage by helping you quickly learn how to design, manage, and secure your database solution. You will learn how to set up your SQL Server and configure new (and existing) environments for optimal use. After covering the designing aspect, the book delves into performance-tuning aspects by teaching you how to effectively use indexes. The book will also teach you about certain choices that need to be made about backups and how to implement a rock-solid security policy and keep your environment healthy. Finally, you will learn about the techniques you should use when things go wrong, and other important topics - such as migration, upgrading, and consolidation - are covered in detail. Integration with Azure is also covered in depth. Whether you are an administrator or thinking about entering the field, this book will provide you with all the skills you need to successfully create, design, and deploy databases using SQL Server 2017. Style and approach A comprehensive guide for database professionals, covering a wide range of topics from installation, maintenance, and configuration to managing systems for operational efficiency and high availability; best practices for maintaining a highly reliable database solution are also supplied from industry experts.","language":"en","currency":"USD","id":"1786467321","title":"SQL Server 2017 Administrator's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VsxPDwAAQBAJ&source=gbs_api","authors":["Marek Chmel","Vladimir Muzny"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ci59DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A developer's guide to creating decentralized applications using Bitcoin, Ethereum, and Hyperledger","description":"Implement decentralized blockchain applications to build scalable Dapps Key Features Understand the blockchain ecosystem and its terminologies Implement smart contracts, wallets, and consensus protocols Design and develop decentralized applications using Bitcoin, Ethereum, and Hyperledger Book Description The Blockchain is a revolution promising a new world without middlemen. Technically, it is an immutable and tamper-proof distributed ledger of all transactions across a peer-to-peer network. With this book, you will get to grips with the blockchain ecosystem to build real-world projects. This book will walk you through the process of building multiple blockchain projects with different complexity levels and hurdles. Each project will teach you just enough about the field's leading technologies, Bitcoin, Ethereum, Quorum, and Hyperledger in order to be productive from the outset. As you make your way through the chapters, you will cover the major challenges that are associated with blockchain ecosystems such as scalability, integration, and distributed file management. In the concluding chapters, you’ll learn to build blockchain projects for business, run your ICO, and even create your own cryptocurrency. Blockchain by Example also covers a range of projects such as Bitcoin payment systems, supply chains on Hyperledger, and developing a Tontine Bank Every is using Ethereum. By the end of this book, you will not only be able to tackle common issues in the blockchain ecosystem, but also design and build reliable and scalable distributed systems. What you will learn Grasp decentralized technology fundamentals to master blockchain principles Build blockchain projects on Bitcoin, Ethereum, and Hyperledger Create your currency and a payment application using Bitcoin Implement decentralized apps and supply chain systems using Hyperledger Write smart contracts, run your ICO, and build a Tontine decentralized app using Ethereum Implement distributed file management with blockchain Integrate blockchain into existing systems in your organization Who this book is for If you are keen on learning how to build your own blockchain decentralized applications from scratch, then this book is for you. It explains all the basic concepts required to develop intermediate projects and will teach you to implement the building blocks of a blockchain ecosystem.","language":"en","currency":"USD","id":"1788473914","title":"Blockchain By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ci59DwAAQBAJ&source=gbs_api","authors":["Bellaj Badr","Richard Horrocks","Xun (Brian) Wu"]},{"pageCount":312,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ipplDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A practical guide to applying deep learning architectures to your NLP applications","description":"Foster your NLP applications with the help of deep learning, NLTK, and TensorFlow Key Features Weave neural networks into linguistic applications across various platforms Perform NLP tasks and train its models using NLTK and TensorFlow Boost your NLP models with strong deep learning architectures such as CNNs and RNNs Book Description Natural language processing (NLP) has found its application in various domains, such as web search, advertisements, and customer services, and with the help of deep learning, we can enhance its performances in these areas. Hands-On Natural Language Processing with Python teaches you how to leverage deep learning models for performing various NLP tasks, along with best practices in dealing with today’s NLP challenges. To begin with, you will understand the core concepts of NLP and deep learning, such as Convolutional Neural Networks (CNNs), recurrent neural networks (RNNs), semantic embedding, Word2vec, and more. You will learn how to perform each and every task of NLP using neural networks, in which you will train and deploy neural networks in your NLP applications. You will get accustomed to using RNNs and CNNs in various application areas, such as text classification and sequence labeling, which are essential in the application of sentiment analysis, customer service chatbots, and anomaly detection. You will be equipped with practical knowledge in order to implement deep learning in your linguistic applications using Python's popular deep learning library, TensorFlow. By the end of this book, you will be well versed in building deep learning-backed NLP applications, along with overcoming NLP challenges with best practices developed by domain experts. What you will learn Implement semantic embedding of words to classify and find entities Convert words to vectors by training in order to perform arithmetic operations Train a deep learning model to detect classification of tweets and news Implement a question-answer model with search and RNN models Train models for various text classification datasets using CNN Implement WaveNet a deep generative model for producing a natural-sounding voice Convert voice-to-text and text-to-voice Train a model to convert speech-to-text using DeepSpeech Who this book is for Hands-on Natural Language Processing with Python is for you if you are a developer, machine learning or an NLP engineer who wants to build a deep learning application that leverages NLP techniques. This comprehensive guide is also useful for deep learning users who want to extend their deep learning skills in building NLP applications. All you need is the basics of machine learning and Python to enjoy the book.","language":"en","currency":"USD","id":"1789135915","title":"Hands-On Natural Language Processing with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ipplDwAAQBAJ&source=gbs_api","authors":["Rajesh Arumugam","Rajalingappaa Shanmugamani"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ut18DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Gain business data insights from operational intelligence","description":"Learn how to architect, implement, and administer a complex Splunk Enterprise environment and extract valuable insights from business data. Key Features Understand the various components of Splunk and how they work together to provide a powerful Big Data analytics solution. Collect and index data from a wide variety of common machine data sources Design searches, reports, and dashboard visualizations to provide business data insights Book Description Splunk is a leading platform and solution for collecting, searching, and extracting value from ever increasing amounts of big data - and big data is eating the world! This book covers all the crucial Splunk topics and gives you the information and examples to get the immediate job done. You will find enough insights to support further research and use Splunk to suit any business environment or situation. Splunk 7.x Quick Start Guide gives you a thorough understanding of how Splunk works. You will learn about all the critical tasks for architecting, implementing, administering, and utilizing Splunk Enterprise to collect, store, retrieve, format, analyze, and visualize machine data. You will find step-by-step examples based on real-world experience and practical use cases that are applicable to all Splunk environments. There is a careful balance between adequate coverage of all the critical topics with short but relevant deep-dives into the configuration options and steps to carry out the day-to-day tasks that matter. By the end of the book, you will be a confident and proficient Splunk architect and administrator. What you will learn Design and implement a complex Splunk Enterprise solution Configure your Splunk environment to get machine data in and indexed Build searches to get and format data for analysis and visualization Build reports, dashboards, and alerts to deliver critical insights Create knowledge objects to enhance the value of your data Install Splunk apps to provide focused views into key technologies Monitor, troubleshoot, and manage your Splunk environment Who this book is for This book is intended for experienced IT personnel who are just getting started working with Splunk and want to quickly become proficient with its usage. Data analysts who need to leverage Splunk to extract critical business insights from application logs and other machine data sources will also benefit from this book.","language":"en","currency":"USD","id":"1789538025","title":"Splunk 7.x Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ut18DwAAQBAJ&source=gbs_api","authors":["James H. Baxter"]},{"pageCount":229,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XOCgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Models, Languages, Consistency Options and Architectures for Big Data Management","description":"This book offers a comprehensive introduction to relational (SQL) and non-relational (NoSQL) databases. The authors thoroughly review the current state of database tools and techniques, and examine coming innovations. The book opens with a broad look at data management, including an overview of information systems and databases, and an explanation of contemporary database types: SQL and NoSQL databases, and their respective management systems The nature and uses of Big Data A high-level view of the organization of data management Data Modeling and Consistency Chapter-length treatment is afforded Data Modeling in both relational and graph databases, including enterprise-wide data architecture, and formulas for database design. Coverage of languages extends from an overview of operators, to SQL and and QBE (Query by Example), to integrity constraints and more. A full chapter probes the challenges of Ensuring Data Consistency, covering: Multi-User Operation Troubleshooting Consistency in Massive Distributed Data Comparison of the ACID and BASE consistency models, and more System Architecture also gets from its own chapter, which explores Processing of Homogeneous and Heterogeneous Data; Storage and Access Structures; Multi-dimensional Data Structures and Parallel Processing with MapReduce, among other topics. Post-Relational and NoSQL Databases The chapter on post-relational databases discusses the limits of SQL – and what lies beyond, including Multi-Dimensional Databases, Knowledge Bases and and Fuzzy Databases. A final chapter covers NoSQL Databases, along with Development of Non-Relational Technologies, Key-Value, Column-Family and Document Stores XML Databases and Graphic Databases, and more The book includes more than 100 tables, examples and illustrations, and each chapter offers a list of resources for further reading. SQL & NoSQL Databases conveys the strengths and weaknesses of relational and non-relational approaches, and shows how to undertake development for big data applications. The book benefits readers including students and practitioners working across the broad field of applied information technology. This textbook has been recommended and developed for university courses in Germany, Austria and Switzerland.","language":"en","currency":"USD","id":"3658245492","title":"SQL & NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XOCgDwAAQBAJ&source=gbs_api","authors":["Andreas Meier","Michael Kaufmann"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lppVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, secure, and deploy enterprise ready serverless applications with AWS to improve developer productivity","description":"Get started with designing your serverless application using optimum design patterns and industry standard practices Key Features Learn the details of popular software patterns and how they are applied to serverless applications Understand key concepts and components in serverless designs Walk away with a thorough understanding of architecting serverless applications Book Description Serverless applications handle many problems that developers face when running systems and servers. The serverless pay-per-invocation model can also result in drastic cost savings, contributing to its popularity. While it's simple to create a basic serverless application, it's critical to structure your software correctly to ensure it continues to succeed as it grows. Serverless Design Patterns and Best Practices presents patterns that can be adapted to run in a serverless environment. You will learn how to develop applications that are scalable, fault tolerant, and well-tested. The book begins with an introduction to the different design pattern categories available for serverless applications. You will learn the trade-offs between GraphQL and REST and how they fare regarding overall application design in a serverless ecosystem. The book will also show you how to migrate an existing API to a serverless backend using AWS API Gateway. You will learn how to build event-driven applications using queuing and streaming systems, such as AWS Simple Queuing Service (SQS) and AWS Kinesis. Patterns for data-intensive serverless application are also explained, including the lambda architecture and MapReduce. This book will equip you with the knowledge and skills you need to develop scalable and resilient serverless applications confidently. What you will learn Comprehend the popular design patterns currently being used with serverless architectures Understand the various design options and corresponding implementations for serverless web application APIs Learn multiple patterns for data-intensive serverless systems and pipelines, including MapReduce and Lambda Architecture Learn how to leverage hosted databases, queues, streams, storage services, and notification services Understand error handling and system monitoring in a serverless architecture a serverless architecture Learn how to set up a serverless application for continuous integration, continuous delivery, and continuous deployment Who this book is for If you're a software architect, engineer, or someone who wants to build serverless applications, which are non-trivial in complexity and scope, then this book is for you. Basic knowledge of programming and serverless computing concepts are assumed.","language":"en","currency":"USD","id":"1788624386","title":"Serverless Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lppVDwAAQBAJ&source=gbs_api","authors":["Brian Zambrano"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gj0PEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":"Database for Storage and Retrieval of Data in Cloud","description":"This book discusses the advanced databases for the cloud-based application known as NoSQL. It will explore the recent advancements in NoSQL database technology. Chapters on structured, unstructured and hybrid databases will be included to explore bigdata analytics, bigdata storage and processing. The book is likely to cover a wide range of topics such as cloud computing, social computing, bigdata and advanced databases processing techniques.","language":"en","currency":"USD","id":"1498784372","title":"NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gj0PEAAAQBAJ&source=gbs_api","authors":["Ganesh Chandra Deka"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eVjBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"A fun and hands-on introduction to machine learning, reinforcement learning, deep learning, and artificial intelligence with Python","description":"This friendly and accessible guide to AI theory and programming in Python requires no maths or data science background. Key Features Roll up your sleeves and start programming AI models No math, data science, or machine learning background required Packed with hands-on examples, illustrations, and clear step-by-step instructions 5 hands-on working projects put ideas into action and show step-by-step how to build intelligent software Book Description AI is changing the world – and with this book, anyone can start building intelligent software! Through his best-selling video courses, Hadelin de Ponteves has taught hundreds of thousands of people to write AI software. Now, for the first time, his hands-on, energetic approach is available as a book. Taking a graduated approach that starts with the basics before easing readers into more complicated formulas and notation, Hadelin helps you understand what you really need to build AI systems with reinforcement learning and deep learning. Five full working projects put the ideas into action, showing step-by-step how to build intelligent software using the best and easiest tools for AI programming: Google Colab Python TensorFlow Keras PyTorch AI Crash Course teaches everyone to build an AI to work in their applications. Once you’ve read this book, you’re only limited by your imagination. What you will learn Master the key skills of deep learning, reinforcement learning, and deep reinforcement learning Understand Q-learning and deep Q-learning Learn from friendly, plain English explanations and practical activities Build fun projects, including a virtual-self-driving car Use AI to solve real-world business problems and win classic video games Build an intelligent, virtual robot warehouse worker Who this book is for If you want to add AI to your skillset, this book is for you. It doesn’t require data science or machine learning knowledge. Just maths basics (high school level).","language":"en","currency":"USD","id":"1838645551","title":"AI Crash Course","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eVjBDwAAQBAJ&source=gbs_api","authors":["Hadelin de Ponteves"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pF9dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Complete guide to automating Big Data solutions using Artificial Intelligence techniques","description":"Build next-generation Artificial Intelligence systems with Java Key Features Implement AI techniques to build smart applications using Deeplearning4j Perform big data analytics to derive quality insights using Spark MLlib Create self-learning systems using neural networks, NLP, and reinforcement learning Book Description In this age of big data, companies have larger amount of consumer data than ever before, far more than what the current technologies can ever hope to keep up with. However, Artificial Intelligence closes the gap by moving past human limitations in order to analyze data. With the help of Artificial Intelligence for big data, you will learn to use Machine Learning algorithms such as k-means, SVM, RBF, and regression to perform advanced data analysis. You will understand the current status of Machine and Deep Learning techniques to work on Genetic and Neuro-Fuzzy algorithms. In addition, you will explore how to develop Artificial Intelligence algorithms to learn from data, why they are necessary, and how they can help solve real-world problems. By the end of this book, you'll have learned how to implement various Artificial Intelligence algorithms for your big data systems and integrate them into your product offerings such as reinforcement learning, natural language processing, image recognition, genetic algorithms, and fuzzy logic systems. What you will learn Manage Artificial Intelligence techniques for big data with Java Build smart systems to analyze data for enhanced customer experience Learn to use Artificial Intelligence frameworks for big data Understand complex problems with algorithms and Neuro-Fuzzy systems Design stratagems to leverage data using Machine Learning process Apply Deep Learning techniques to prepare data for modeling Construct models that learn from data using open source tools Analyze big data problems using scalable Machine Learning algorithms Who this book is for This book is for you if you are a data scientist, big data professional, or novice who has basic knowledge of big data and wish to get proficiency in Artificial Intelligence techniques for big data. Some competence in mathematics is an added advantage in the field of elementary linear algebra and calculus.","language":"en","currency":"USD","id":"1788476018","title":"Artificial Intelligence for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pF9dDwAAQBAJ&source=gbs_api","authors":["Anand Deshpande","Manish Kumar"]},{"pageCount":515,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R_pmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"SQL and NoSQL Data Storage Using MySQL for Python Programmers","description":"Move data back and forth between database and application. The must-have knowledge in this book helps programmers learn how to use the official driver, MySQL Connector\/Python, by which Python programs communicate with the MySQL database. This book takes you from the initial installation of the connector through basic query execution, then through more advanced topics, error handing, and troubleshooting. The book covers both the traditional API as well as the new X DevAPI. The X DevAPI is part of MySQL 8.0 and is an API that can be used with connectors for several programming languages and is used from the command-line interface known as MySQL Shell. You will learn to use the connector by working through code examples and following a discussion of how the API calls work. By the end of the book, you will be able to use MySQL as the back-end storage for your Python programs, and you’ll even have the option of choosing between SQL and NoSQL interfaces. What You'll Learn Install MySQL Connector\/Python Connect to MySQL and configure database access Execute SQL and NoSQL queries from your Python program Trap errors and troubleshoot problems Store data from different languages using MySQL’s character set support Work in the X DevAPI that underlies all of MySQL’s language connectors Who This Book Is For Developers familiar with Python who are looking at using MySQL as the back-end database. No prior knowledge of Connector\/Python is assumed, but readers should be familiar with databases and the Python programming language.","language":"en","currency":"USD","id":"1484236947","title":"MySQL Connector\/Python Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R_pmDwAAQBAJ&source=gbs_api","authors":["Jesper Wisborg Krogh"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7gxTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Maximize your business productivity through modern financial management in Dynamics 365, 3rd Edition","description":"Boost your accounting and financial skills with Microsoft Dynamics 365 Key Features Make real-time data-driven decisions for your enterprise with Microsoft Dynamics 365 Enterprise edition Configure and set up the Microsoft Dynamics 365 financial module via highly useful tips and tricks Administer customer relations and plan enterprise resources with this systematic guide Book Description Microsoft Dynamics 365 for finance and operations is a rapidly growing application and is widely used in enterprise organizations. Because of its ability to maximize business productivity, it is a fast-growing business application package in the ERP market. We will start by looking into ERP concepts, implementation needs, and interface design, giving you basic knowledge of financial management aspects and explaining key concepts along the way. To begin with, you'll be taken through the general ledger and financial dimension functions. You'll later learn about the sales tax mechanism and multi-currency in Microsoft Dynamics 365. We tackle each topic with focused examples and explanations on topics such as payable\/receivable accounts, forecasting, cash and bank management, budgeting planning\/control, and fixed assets. Finally, we walk you through intercompany, consolidation, costing basics, and financial reporting. By the end of this book, your finance team will have a much richer understanding of Microsoft Dynamics 365 for finance and operations and its powerful capabilities. What you will learn Examine the business logic behind the financial functionalities of Microsoft Dynamics 365 FFO Set up and configure the core modules of financial management Grasp the key control points of financial management Explore intercompany and consolidation in Microsoft Dynamics 365 FFO Understand multi-currency sales, tax mechanisms, and budgeting capabilities in Microsoft Dynamics 365 FFO Get to grips with month\/year-end period close functionality Understand the account payable and receivable module Use Microsoft Dynamics 365 to create financial reports Who this book is for This book is for application consultants, solution architects, controllers, CFOs, pre-sales and other professionals who are involved in a Microsoft Dynamics 365 for finance and operation implementation. Basic knowledge of financial terms, concepts, and terminologies is required.","language":"en","currency":"USD","id":"1788839595","title":"Microsoft Dynamics 365 Enterprise Edition – Financial Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7gxTDwAAQBAJ&source=gbs_api","authors":["Mohamed Aamer Ala El Din"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QZRRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build enterprise-ready, modular Vue.js applications with Vuex and Nuxt","description":"Become an expert Vue developer by understanding design patterns and the component architecture of Vue.js to write clean and maintainable code Key Features Craft highly modular applications by exploring design patterns and the component architecture of Vue.js Enforce a Flux-like application architecture in your Vue.js applications with Vuex Easy-to-follow examples that can be used to create reusable code and extensible designs Book Description Vue.js 2 Design Patterns and Best Practices starts by comparing Vue.js with other frameworks and setting up the development environment for your application, and gradually moves on to writing and styling clean, maintainable, and reusable Vue.js components that can be used across your application. Further on, you'll look at common UI patterns, Vue form submission, and various modifiers such as lazy binding, number typecasting, and string trimming to create better UIs. You will also explore best practices for integrating HTTP into Vue.js applications to create an application with dynamic data. Routing is a vitally important part of any SPA, so you will focus on the vue-router and explore routing a user between multiple pages. Next, you'll also explore state management with Vuex, write testable code for your application, and create performant, server-side rendered applications with Nuxt. Toward the end, we'll look at common antipatterns to avoid, saving you from a lot of trial and error and development headaches. By the end of this book, you'll be on your way to becoming an expert Vue developer who can leverage design patterns to efficiently architect the design of your application and write clean and maintainable code. What you will learn Understand the theory and patterns of Vue.js Build scalable and modular Vue.js applications Take advantage of Vuex for reactive state management Create single page applications with vue-router Use Nuxt for FAST server-side rendered Vue applications Convert your application to a Progressive Web App (PWA) and add ServiceWorkers and offline support Build your app with Vue.js by following best practices and explore the common anti-patterns to avoid Who this book is for This book is for Vue developers who are familiar with framework design principles and utilize commonly found design patterns in developing web applications.","language":"en","currency":"USD","id":"1788831012","title":"Vue.js 2 Design Patterns and Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QZRRDwAAQBAJ&source=gbs_api","authors":["Paul Halliday"]},{"pageCount":54,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_eP7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. It’s an Instant Starter guide.Instant Cassandra Query Language is great for those who are working with Cassandra databases and who want to either learn CQL to check data from the console or build serious applications using CQL. If you’re looking for something that helps you get started with CQL in record time and you hate the idea of learning a new language syntax, then this book is for you.","language":"en","currency":"USD","id":"178328272X","title":"Instant Cassandra Query Language","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_eP7AAAAQBAJ&source=gbs_api","authors":["Amresh Singh"]},{"pageCount":45,"thumbnail":"http:\/\/books.google.com\/books\/content?id=25a4DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3,"subtitle":null,"description":"Fatigué d'essayer d'apprendre à programmer? Prêt à vraiment apprendre comment programmer? Si vous avez essayé d'apprendre à programmer par le passé, mais n'avez pas eu beaucoup de succès, tentez le coup avec le livre « Programmer en JavaScript ». Il vous apprendra exactement ce que vous devez savoir sur le langage de script le plus largement utilisé dans le monde aujourd'hui. Vous commencerez par le début et le livre vous permettra de progresser en vous basant sur ce que vous aurez acquis au fur et à mesure. Apprenez le JavaScript une fois, utilisez-le encore et encore... Même si le JavaScript est de loin le langage de programmation côté client le plus populaire en usage aujourd'hui, il peut aussi être utilisé côté serveur. Node.js, Meteor, Wakanda, CouchDB et MongoDB ne sont que quelques exemples de frameworks avec lesquels vous serez en mesure d'utiliser JavaScript côté serveur. Le temps que vous à apprendre le JavaScript peut être doublement payant du fait que le JavaScript continue d’évoluer dans de plus en plus de domaines de l'informatique. Si vous cherchez à améliorer votre CV pour votre carrière, la maîtrise du JavaScript est une compétence inestimable. Les compétences JavaScript sont très fortement demandées et le besoin de personnes sachant programmer en JavaScript est en constante augmentation. Si vous cherchez à percer dans un domaine technique, quoi de mieux à ajouter sur votre CV que quelque chose qui peut être utilisé pratiquement partout? Vous voulez travailler sur le front-end (l’interface) de sites Web? Apprenez le JavaScript. Prêt à attaquer la programmation back-end pour les applications Web et réseau? Apprenez le JavaScript. Vous souhaitez travailler sur les technologies de bases de données les plus récentes? Apprenez le JavaScript. Apprenez le JavaScript de la bonne manière - une fois pour toutes... Peu importe si","language":"fr","currency":"USD","id":"1507139721","title":"Programmer en JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=25a4DQAAQBAJ&source=gbs_api","authors":["Preston Prescott"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JWfRAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication describes visual development, visualization, adapters, analytics, and accelerators for IBM InfoSphere® Streams (V3), a key component of the IBM Big Data platform. Streams was designed to analyze data in motion, and can perform analysis on incredibly high volumes with high velocity, using a wide variety of analytic functions and data types. The Visual Development environment extends Streams Studio with drag-and-drop development, provides round tripping with existing text editors, and is ideal for rapid prototyping. Adapters facilitate getting data in and out of Streams, and V3 supports WebSphere MQ, Apache Hadoop Distributed File System, and IBM InfoSphere DataStage. Significant analytics include the native Streams Processing Language, SPSS Modeler analytics, Complex Event Processing, TimeSeries Toolkit for machine learning and predictive analytics, Geospatial Toolkit for location-based applications, and Annotation Query Language for natural language processing applications. Accelerators for Social Media Analysis and Telecommunications Event Data Analysis sample programs can be modified to build production level applications. Want to learn how to analyze high volumes of streaming data or implement systems requiring high performance across nodes in a cluster? Then this book is for you.","language":"en","currency":"USD","id":"0738439193","title":"IBM InfoSphere Streams: Accelerating Deployments with Analytic Accelerators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JWfRAgAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Oliver Brandt","Bharath Devaraju","Daniel Farrell","Kevin Foster","Chris Howard","Peter Nicholls","Ankit Pasricha","Roger Rea","Norbert Schulz","Tetsuya Shimada","John Thorson","Sandra Tucker","Robert Uleman","IBM Redbooks"]},{"pageCount":554,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gHteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Practical solutions to container orchestration, 2nd Edition","description":"Learn how to automate and manage your containers and reduce the overall operation burden on your system. Key Features Use containers to manage, scale and orchestrate apps in your organization Transform the latest concept of Kubernetes 1.10 into examples Expert techniques for orchestrating containers effectively Book Description Kubernetes is an open source orchestration platform to manage containers in a cluster environment. With Kubernetes, you can configure and deploy containerized applications easily. This book gives you a quick brush up on how Kubernetes works with containers, and an overview of main Kubernetes concepts, such as Pods, Deployments, Services and etc. This book explains how to create Kubernetes clusters and run applications with proper authentication and authorization configurations. With real-world recipes, you'll learn how to create high availability Kubernetes clusters on AWS, GCP and in on-premise datacenters with proper logging and monitoring setup. You'll also learn some useful tips about how to build a continuous delivery pipeline for your application. Upon completion of this book, you will be able to use Kubernetes in production and will have a better understanding of how to manage containers using Kubernetes. What you will learn Build your own container cluster Deploy and manage highly scalable, containerized applications with Kubernetes Build high-availability Kubernetes clusters Build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration Who this book is for This book is for system administrators, developers, DevOps engineers, or any stakeholder who wants to understand how Kubernetes works using a recipe-based approach. Basic knowledge of Kubernetes and Containers is required.","language":"en","currency":"USD","id":"1788836871","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gHteDwAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":271,"thumbnail":"http:\/\/books.google.com\/books\/content?id=okCwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Comprehensive guide to learn Node.js","description":"Develop attractive and efficient dynamic web applications using Node.js DESCRIPTION The Node.js Guidebook is written and designed keeping in mind readers of varies technical and academic inclinations. Every concept has been explained in detail with appropriate examples and demonstrations with images as applicable. Topics have been aligned from simple to complex for the benefit of a beginner in understanding the technology. The logic of all codes in the examples have been explained appropriately. Concepts have been described in a simple language for easy understanding along with real-world applications of the same. Node.js Guidebook aims to introduce readers to the world of Node.js. Node.js is an open source JavaScript run-time environment that executes JavaScript on server-side. Earlier, JavaScript was used only for client-side scripting, but Node.js supports the creation of dynamic Web applications by using JavaScript for server-side scripting. Node.js has taken the world by a storm by simplifying Web application development thorough the use of readily available and pluggable modules, thus, reducing the overall development time. Whether you are a beginner or an experienced developer, you can learn to design and develop attractive and efficient Web applications using Node.js. KEY FEATURES Assumes a practical approach of learning. Ample of examples are given along with assignments. Book covers a wide range of topics in Node.js, emphasising on real-world. Simple language is used with clear presentation of topics including Node.js modules, npm, event handling. WHAT WILL YOU LEARN This book will help developers to easily develop attractive and efficient dynamic web applications using Node.js. It will be a great source of reference for developers for migrating applications to open source technologies such as HTML5, Node.js, and MySQL. WHO THIS BOOK IS FOR This book will prove to be a “must have” for beginners as well as experienced professionals as it is a stepping stone for learning new technology. Table of Contents ﻿1. Introduction to Node.js 2. Modules in Node.js 3. File system module 4. NPM in node.js 5. Event handling in Node.js 6. Node.js with MySQL 7. Express and Node.js","language":"en","currency":"USD","id":"9387284433","title":"NS Guidebookode.J","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=okCwDwAAQBAJ&source=gbs_api","authors":["Dhruti Shah"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YKMLCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"For SQL, NoSQL, Cloud and Distributed Databases","description":"Advanced data management has always been at the core of efficient database and information systems. Recent trends like big data and cloud computing have aggravated the need for sophisticated and flexible data storage and processing solutions. This book provides a comprehensive coverage of the principles of data management developed in the last decades with a focus on data structures and query languages. It treats a wealth of different data models and surveys the foundations of structuring, processing, storing and querying data according these models. Starting off with the topic of database design, it further discusses weaknesses of the relational data model, and then proceeds to convey the basics of graph data, tree-structured XML data, key-value pairs and nested, semi-structured JSON data, columnar and record-oriented data as well as object-oriented data. The final chapters round the book off with an analysis of fragmentation, replication and consistency strategies for data management in distributed databases as well as recommendations for handling polyglot persistence in multi-model databases and multi-database architectures. While primarily geared towards students of Master-level courses in Computer Science and related areas, this book may also be of benefit to practitioners looking for a reference book on data modeling and query processing. It provides both theoretical depth and a concise treatment of open source technologies currently on the market.","language":"en","currency":"USD","id":"3110441411","title":"Advanced Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YKMLCwAAQBAJ&source=gbs_api","authors":["Lena Wiese"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DDc9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":148,"subtitle":null,"description":"Relational databases have been predominant for many years and are used throughout various industries. The current system faces challenges related to size and variety of data thus the NoSQL databases emerged. By joining these two database models, there is room for crucial developments in the field of computer science. Bridging Relational and NoSQL Databases is an innovative source of academic content on the convergence process between databases and describes key features of the next database generation. Featuring coverage on a wide variety of topics and perspectives such as BASE approach, CAP theorem, and hybrid and native solutions, this publication is ideally designed for professionals and researchers interested in the features and collaboration of relational and NoSQL databases.","language":"en","currency":"USD","id":"1522533869","title":"Bridging Relational and NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DDc9DwAAQBAJ&source=gbs_api","authors":["Gaspar, Drazena","Coric, Ivica"]},{"pageCount":1063,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jRTNCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":295.2,"subtitle":"SocProS 2015","description":"The proceedings of SocProS 2015 will serve as an academic bonanza for scientists and researchers working in the field of Soft Computing. This book contains theoretical as well as practical aspects using fuzzy logic, neural networks, evolutionary algorithms, swarm intelligence algorithms, etc., with many applications under the umbrella of ‘Soft Computing’. The book will be beneficial for young as well as experienced researchers dealing across complex and intricate real world problems for which finding a solution by traditional methods is a difficult task. The different application areas covered in the proceedings are: Image Processing, Cryptanalysis, Industrial Optimization, Supply Chain Management, Newly Proposed Nature Inspired Algorithms, Signal Processing, Problems related to Medical and Health Care, Networking Optimization Problems, etc.","language":"en","currency":"USD","id":"981100448X","title":"Proceedings of Fifth International Conference on Soft Computing for Problem Solving","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jRTNCwAAQBAJ&source=gbs_api","authors":["Millie Pant","Kusum Deep","Jagdish Chand Bansal","Atulya Nagar","Kedar Nath Das"]}]