[{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Implement continuous delivery and integration in the AWS environment, 2nd Edition","description":"Scale and maintain outstanding performance in your AWS-based infrastructure using DevOps principles Key Features Implement continuous integration and continuous deployment pipelines on AWS Gain insight from an expert who has worked with Silicon Valley's most high-profile companies Implement DevOps principles to take full advantage of the AWS stack and services Book Description The DevOps movement has transformed the way modern tech companies work. Amazon Web Services (AWS), which has been at the forefront of the cloud computing revolution, has also been a key contributor to the DevOps movement, creating a huge range of managed services that help you implement DevOps principles. Effective DevOps with AWS, Second Edition will help you to understand how the most successful tech start-ups launch and scale their services on AWS, and will teach you how you can do the same. This book explains how to treat infrastructure as code, meaning you can bring resources online and offline as easily as you control your software. You will also build a continuous integration and continuous deployment pipeline to keep your app up to date. Once you have gotten to grips will all this, we'll move on to how to scale your applications to offer maximum performance to users even when traffic spikes, by using the latest technologies, such as containers. In addition to this, you'll get insights into monitoring and alerting, so you can make sure your users have the best experience when using your service. In the concluding chapters, we'll cover inbuilt AWS tools such as CodeDeploy and CloudFormation, which are used by many AWS administrators to perform DevOps. By the end of this book, you'll have learned how to ensure the security of your platform and data, using the latest and most prominent AWS tools. What you will learn Implement automatic AWS instance provisioning using CloudFormation Deploy your application on a provisioned infrastructure with Ansible Manage infrastructure using Terraform Build and deploy a CI\/CD pipeline with Automated Testing on AWS Understand the container journey for a CI\/CD pipeline using AWS ECS Monitor and secure your AWS environment Who this book is for Effective DevOps with AWS is for you if you are a developer, DevOps engineer, or you work in a team which wants to build and use AWS for software infrastructure. Basic computer science knowledge is required to get the most out of this book.","language":"en","currency":"USD","id":"1789539692","title":"Effective DevOps with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bP1wDwAAQBAJ&source=gbs_api","authors":["Yogesh Raheja","Giuseppe Borgese","Nathaniel Felsen"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UFBVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of ICCAN 2017","description":"The book focuses to foster new and original research ideas and results in three broad areas: computing, analytics, and networking with its prospective applications in the various interdisciplinary domains of engineering. This is an exciting and emerging interdisciplinary area in which a wide range of theory and methodologies are being investigated and developed to tackle complex and challenging real world problems. It also provides insights into the International Conference on Computing Analytics and Networking (ICCAN 2017) which is a premier international open forum for scientists, researchers and technocrats in academia as well as in industries from different parts of the world to present, interact, and exchange the state of art of concepts, prototypes, innovative research ideas in several diversified fields. The book includes invited keynote papers and paper presentations from both academia and industry to initiate and ignite our young minds in the meadow of momentous research and thereby enrich their existing knowledge. The book aims at postgraduate students and researchers working in the discipline of Computer Science & Engineering. It will be also useful for the researchers working in the domain of electronics as it contains some hardware technologies and forthcoming communication technologies.","language":"en","currency":"USD","id":"9811078718","title":"Progress in Computing, Analytics and Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UFBVDwAAQBAJ&source=gbs_api","authors":["Prasant Kumar Pattnaik","Siddharth Swarup Rautaray","Himansu Das","Janmenjoy Nayak"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Automate and control administrative tasks using DevOps principles","description":"Enhance your skills in expert module development, deployment, security, DevOps, and cloud Key Features A step-by-step guide to get you started with PowerShell Core 6.0 Harness the capabilities of PowerShell Core 6.0 to perform simple to complex administration tasks Learn core administrative concepts such as scripting, pipelines, and DSC Book Description Beginning with an overview of the different versions of PowerShell, Learn PowerShell Core 6.0 introduces you to VSCode and then dives into helping you understand the basic techniques in PowerShell scripting. You will cover advanced coding techniques, learn how to write reusable code as well as store and load data with PowerShell. This book will help you understand PowerShell security and Just Enough Administration, enabling you to create your own PowerShell repository. The last set of chapters will guide you in setting up, configuring, and working with Release Pipelines in VSCode and VSTS, and help you understand PowerShell DSC. In addition to this, you will learn how to use PowerShell with Windows, Azure, Microsoft Online Services, SCCM, and SQL Server. The final chapter will provide you with some use cases and pro tips. By the end of this book, you will be able to create professional reusable code using security insight and knowledge of working with PowerShell Core 6.0 and its most important capabilities. What you will learn Get to grips with Powershell Core 6.0 Explore basic and advanced PowerShell scripting techniques Get to grips with Windows PowerShell Security Work with centralization and DevOps with PowerShell Implement PowerShell in your organization through real-life examples Learn to create GUIs and use DSC in production Who this book is for If you are a Windows administrator or a DevOps user who wants to leverage PowerShell to automate simple to complex tasks, then this book is for you. Whether you know nothing about PowerShell or just enough to get by, this guide will give you what you need to go to take your scripting to the next level. You’ll also find this book useful if you’re a PowerShell expert looking to expand your knowledge in areas such as PowerShell Security and DevOps.","language":"en","currency":"USD","id":"1788835476","title":"Learn PowerShell Core 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLFmDwAAQBAJ&source=gbs_api","authors":["David das Neves","Jan-Hendrik Peters"]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript è un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e può aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di più... Anche se JavaScript è il linguaggio di programmazione client side al giorno d'oggi più diffuso, può essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo può darvi un risultato doppio, perché questo linguaggio continua ad espandersi in sempre più aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo è ciò che vi darà questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si può usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perché sono così comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fcfarreMQ9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book will lead you, step by step and with illustrative screenshots, through a real example. Are you writing two websites - one for mobile and one for larger displays? Or perhaps you've heard of Responsive Design but are unsure how to bring HTML5, CSS3, or responsive design all together. If so, this book provides everything you need to take your web pages to the next level - before all your competitors do!","language":"en","currency":"USD","id":"1849693196","title":"Responsive Web Design with HTML5 and CSS3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fcfarreMQ9sC&source=gbs_api","authors":["Ben Frain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOb2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Datenaustauschformate, Datenbankentwicklung und verteilte Anwendungen","description":"Wenn Sie bereits komplexe Java-Applikationen für den Desktop-Bereich schreiben, können Sie sich an Unternehmensanwendungen als weitere Herausforderung wagen. Dabei kommen Sie früher oder später mit Datenbanken, den Datenformaten XML oder JSON und auch mit verteilten Applikationen in Berührung. Das notwendige Wissen für einen effizienten Einstieg erlangen Sie in diesem Buch. Michael Inden macht Sie zunächst mit den Grundlagen der professionellen Erstellung von Unternehmensanwendungen vertraut und vermittelt Ihnen substanzielle Kenntnisse zum Informationsaustausch basierend auf XML oder JSON. Darüber hinaus bietet er eine fundierte Einführung in die Persistenz mit relationalen Datenbanken mithilfe von SQL, JDBC und JPA. Schließlich thematisiert der Autor die Datenverarbeitung mit den immer populärer werdenden NoSQL-Datenbanken anhand von MongoDB. Im Praxisalltag kommt oftmals der Wunsch auf, Funktionalität auch im Netzwerk bereitzustellen. Hierfür existieren vielfältige Technologien. Das Buch fokussiert auf die populären \"RESTful Webservices\" und zeigt Ihnen exemplarisch die Entwicklung von einfachen Client-Server-Applikationen mithilfe von JAX-RS.","language":"de","currency":"USD","id":"3864919606","title":"Der Java-Profi: Persistenzlösungen und REST-Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOb2DwAAQBAJ&source=gbs_api","authors":["Michael Inden"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uDnlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn to code like a professional with Python – an open source, versatile, and powerful programming language About This Book Learn the fundamentals of programming with Python – one of the best languages ever created Develop a strong set of programming skills that you will be able to express in any situation, on every platform, thanks to Python's portability Create outstanding applications of all kind, from websites to scripting, and from GUIs to data science Who This Book Is For Python is the most popular introductory teaching language in U.S. top computer science universities, so if you are new to software development, or maybe you have little experience, and would like to start off on the right foot, then this language and this book are what you need. Its amazing design and portability will help you become productive regardless of the environment you choose to work with. What You Will Learn Get Python up and running on Windows, Mac, and Linux in no time Grasp the fundamental concepts of coding, along with the basics of data structures and control flow. Write elegant, reusable, and efficient code in any situation Understand when to use the functional or the object oriented programming approach Create bulletproof, reliable software by writing tests to support your code Explore examples of GUIs, scripting, data science and web applications Learn to be independent, capable of fetching any resource you need, as well as dig deeper In Detail Learning Python has a dynamic and varied nature. It reads easily and lays a good foundation for those who are interested in digging deeper. It has a practical and example-oriented approach through which both the introductory and the advanced topics are explained. Starting with the fundamentals of programming and Python, it ends by exploring very different topics, like GUIs, web apps and data science. The book takes you all the way to creating a fully fledged application. The book begins by exploring the essentials of programming, data structures and teaches you how to manipulate them. It then moves on to controlling the flow of a program and writing reusable and error proof code. You will then explore different programming paradigms that will allow you to find the best approach to any situation, and also learn how to perform performance optimization as well as effective debugging. Throughout, the book steers you through the various types of applications, and it concludes with a complete mini website built upon all the concepts that you learned. Style and approach This book is an easy-to-follow guide that will take you from a novice to the proficient level at a comfortable pace, using a lot of simple but effective examples. Each topic is explained thoroughly, and pointers are left for the more inquisitive readers to dig deeper and expand their knowledge.","language":"en","currency":"USD","id":"1785284576","title":"Learning Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uDnlCwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PwZDDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Distribute Actionable, Timely BI with Microsoft® SQL Server® 2016 and Power BI Drive better, faster, more informed decision making across your organization using the expert tips and best practices featured in this hands-on guide. Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition, shows, step-by-step, how to distribute high-performance, custom analytics to users enterprise-wide. Discover how to build BI Semantic Models, create data marts and OLAP cubes, write MDX and DAX scripts, and share insights using Microsoft client tools. The book includes coverage of self-service business intelligence with Power BI. • Understand the goals and components of successful BI • Build data marts, OLAP cubes, and Tabular models • Load and cleanse data with SQL Server Integration Services • Manipulate and analyze data using MDX and DAX scripts and queries • Work with SQL Server Analysis Services and the BI Semantic Model • Author interactive reports using SQL Server Data Tools • Create KPIs and digital dashboards • Implement time-based analytics • Embed data model content in custom applications using ADOMD.NET • Use Power BI to gather, model, and visualize data in a self-service environment","language":"en","currency":"USD","id":"125964149X","title":"Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PwZDDQAAQBAJ&source=gbs_api","authors":["Brian Larson"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WAr5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.9,"subtitle":"Objetos y arrays – Conversaciones - XMLHttpRequest","description":"JSON es un estándar para el intercambio de datos entre las aplicaciones cliente-servidor, que deriva de la notación de objetos existente en JavaScript. Debido a que, para comunicarnos con un servidor web, necesitamos manipular solo texto plano, JSON resulta una alternativa muy interesante para enviar datos entre aplicaciones de la Web, comunicar tecnologías backend y frontend, manejar bases de datos no relacionales, mandar información de bases de datos relacionales, como MySQL, e incluso, crear APIs REST, un tipo de servicios que cada día se ve más en el mercado. JSON es fácil de comprender por los seres humanos y sencillo de escribir. Se trata de una alternativa a XML, siendo ya considerado independiente del lenguaje JavaScript. En el Volumen 2 veremos como integrar JSON en aplicaciones cliente-servidor. Crear peticiones a un servidor. Trabajar con JSON en proyectos JavaScript, HTML y bases de datos relacionales. Cómo transformar los datos JSON en formato JavaScript.","language":"es","currency":"USD","id":"9874757981","title":"JSON - Vol. 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WAr5DwAAQBAJ&source=gbs_api","authors":["Santiago Aguirre"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DQFwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to automate and manage your Linux containers and improve the overall performance of your system About This Book Are you using containers in your organization and want to better manage, scale, and orchestrate apps on the container? Use the recipes in the book to find a reliable solution from experts This is the first and only book on the market on Kubernetes, and it will show how to manage your containers in production using Kubernetes Buy this book, simply follow the recipes, and you will be the master of your Linux containers Who This Book Is For The book is aimed at system administrators who have intermediate level of knowledge with Kubernetes and want to better manage their applications deployed over containers. Also, it will help those administrators who want to maintain and scale applications on these containers. What You Will Learn Get to know how to build your own container cluster Deploy and manage highly scalable applications using Kubernetes Discover how to build high availability Kubernetes clusters Find out how to build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration In Detail Kubernetes is Google's solution to managing a cluster of containers. Kubernetes provides a declarative API to manage clusters while giving us a lot of flexibility. This book will provide you with recipes to better manage containers in different scenarios in production using Kubernetes. We will start by giving you a quick brush up on how Kubernetes works with containers along with an overview of the main Kubernetes features such as Pods, Replication Controllers, and more. Next, we will teach you how to create Kubernetes cluster and how to run programs on Kubernetes. We'll explain features such as High Availability Kubernetes master setup, using Kubernetes with Docker, and orchestration with Kubernetes using AWS. Later, will show you how to use Kubernetes-UI, and how to set up and manage Kubernetes clusters on the cloud and bare metal. Upon completion of this book, you will be able use Kubernetes in production and will have a better understanding of how to manage your containers using Kubernetes. Style and approach This recipe-based book precisely teaches you how to use Kubernetes in production and how to better manage your containers using Kubernetes.","language":"en","currency":"USD","id":"1785886045","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DQFwDQAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UprcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the full potential of Entity Framework with this collection of powerful and easy-to-follow recipes About This Book Learn how to use the new features of Entity Framework Core 1 Improve your queries by leveraging some of the advanced features Avoid common pitfalls Make the best of your .NET APIs by integrating with Entity Framework Who This Book Is For This book is for .NET developers who work with relational databases on a daily basis and understand the basics of Entity Framework, but now want to use it in a more efficient manner. You are expected to have some prior knowledge of Entity Framework. What You Will Learn Master the technique of using sequence key generators Validate groups of entities that are to be saved \/ updated Improve MVC applications that cover applications developed using ASP.NET MVC Core 1 Retrieve database information (table, column names, and so on) for entities Discover optimistic concurrency control and pessimistic concurrency control. Implement Multilatency on the data side of things. Enhance the performance and\/or scalability of Entity Framework Core Explore and overcome the pitfalls of Entity Framework Core In Detail Entity Framework is a highly recommended Object Relation Mapping tool used to build complex systems. In order to survive in this growing market, the knowledge of a framework that helps provide easy access to databases, that is, Entity Framework has become a necessity. This book will provide .NET developers with this knowledge and guide them through working efficiently with data using Entity Framework Core. You will start off by learning how to efficiently use Entity Framework in practical situations. You will gain a deep understanding of mapping properties and find out how to handle validation in Entity Framework. The book will then explain how to work with transactions and stored procedures along with improving Entity Framework using query libraries. Moving on, you will learn to improve complex query scenarios and implement transaction and concurrency control. You will then be taught to improve and develop Entity Framework in complex business scenarios. With the concluding chapter on performance and scalability, this book will get you ready to use Entity Framework proficiently. Style and approach Filled with rich code-based examples, this book takes a recipe-based approach that will teach .NET developers to improve their understanding of Entity Framework and help them effortlessly apply this knowledge in everyday situations.","language":"en","currency":"USD","id":"1785880586","title":"Entity Framework Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UprcDgAAQBAJ&source=gbs_api","authors":["Ricardo Peres"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Implement continuous delivery and integration in the AWS environment, 2nd Edition","description":"Scale and maintain outstanding performance in your AWS-based infrastructure using DevOps principles Key Features Implement continuous integration and continuous deployment pipelines on AWS Gain insight from an expert who has worked with Silicon Valley's most high-profile companies Implement DevOps principles to take full advantage of the AWS stack and services Book Description The DevOps movement has transformed the way modern tech companies work. Amazon Web Services (AWS), which has been at the forefront of the cloud computing revolution, has also been a key contributor to the DevOps movement, creating a huge range of managed services that help you implement DevOps principles. Effective DevOps with AWS, Second Edition will help you to understand how the most successful tech start-ups launch and scale their services on AWS, and will teach you how you can do the same. This book explains how to treat infrastructure as code, meaning you can bring resources online and offline as easily as you control your software. You will also build a continuous integration and continuous deployment pipeline to keep your app up to date. Once you have gotten to grips will all this, we'll move on to how to scale your applications to offer maximum performance to users even when traffic spikes, by using the latest technologies, such as containers. In addition to this, you'll get insights into monitoring and alerting, so you can make sure your users have the best experience when using your service. In the concluding chapters, we'll cover inbuilt AWS tools such as CodeDeploy and CloudFormation, which are used by many AWS administrators to perform DevOps. By the end of this book, you'll have learned how to ensure the security of your platform and data, using the latest and most prominent AWS tools. What you will learn Implement automatic AWS instance provisioning using CloudFormation Deploy your application on a provisioned infrastructure with Ansible Manage infrastructure using Terraform Build and deploy a CI\/CD pipeline with Automated Testing on AWS Understand the container journey for a CI\/CD pipeline using AWS ECS Monitor and secure your AWS environment Who this book is for Effective DevOps with AWS is for you if you are a developer, DevOps engineer, or you work in a team which wants to build and use AWS for software infrastructure. Basic computer science knowledge is required to get the most out of this book.","language":"en","currency":"USD","id":"1789539692","title":"Effective DevOps with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bP1wDwAAQBAJ&source=gbs_api","authors":["Yogesh Raheja","Giuseppe Borgese","Nathaniel Felsen"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UFBVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of ICCAN 2017","description":"The book focuses to foster new and original research ideas and results in three broad areas: computing, analytics, and networking with its prospective applications in the various interdisciplinary domains of engineering. This is an exciting and emerging interdisciplinary area in which a wide range of theory and methodologies are being investigated and developed to tackle complex and challenging real world problems. It also provides insights into the International Conference on Computing Analytics and Networking (ICCAN 2017) which is a premier international open forum for scientists, researchers and technocrats in academia as well as in industries from different parts of the world to present, interact, and exchange the state of art of concepts, prototypes, innovative research ideas in several diversified fields. The book includes invited keynote papers and paper presentations from both academia and industry to initiate and ignite our young minds in the meadow of momentous research and thereby enrich their existing knowledge. The book aims at postgraduate students and researchers working in the discipline of Computer Science & Engineering. It will be also useful for the researchers working in the domain of electronics as it contains some hardware technologies and forthcoming communication technologies.","language":"en","currency":"USD","id":"9811078718","title":"Progress in Computing, Analytics and Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UFBVDwAAQBAJ&source=gbs_api","authors":["Prasant Kumar Pattnaik","Siddharth Swarup Rautaray","Himansu Das","Janmenjoy Nayak"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Automate and control administrative tasks using DevOps principles","description":"Enhance your skills in expert module development, deployment, security, DevOps, and cloud Key Features A step-by-step guide to get you started with PowerShell Core 6.0 Harness the capabilities of PowerShell Core 6.0 to perform simple to complex administration tasks Learn core administrative concepts such as scripting, pipelines, and DSC Book Description Beginning with an overview of the different versions of PowerShell, Learn PowerShell Core 6.0 introduces you to VSCode and then dives into helping you understand the basic techniques in PowerShell scripting. You will cover advanced coding techniques, learn how to write reusable code as well as store and load data with PowerShell. This book will help you understand PowerShell security and Just Enough Administration, enabling you to create your own PowerShell repository. The last set of chapters will guide you in setting up, configuring, and working with Release Pipelines in VSCode and VSTS, and help you understand PowerShell DSC. In addition to this, you will learn how to use PowerShell with Windows, Azure, Microsoft Online Services, SCCM, and SQL Server. The final chapter will provide you with some use cases and pro tips. By the end of this book, you will be able to create professional reusable code using security insight and knowledge of working with PowerShell Core 6.0 and its most important capabilities. What you will learn Get to grips with Powershell Core 6.0 Explore basic and advanced PowerShell scripting techniques Get to grips with Windows PowerShell Security Work with centralization and DevOps with PowerShell Implement PowerShell in your organization through real-life examples Learn to create GUIs and use DSC in production Who this book is for If you are a Windows administrator or a DevOps user who wants to leverage PowerShell to automate simple to complex tasks, then this book is for you. Whether you know nothing about PowerShell or just enough to get by, this guide will give you what you need to go to take your scripting to the next level. You’ll also find this book useful if you’re a PowerShell expert looking to expand your knowledge in areas such as PowerShell Security and DevOps.","language":"en","currency":"USD","id":"1788835476","title":"Learn PowerShell Core 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLFmDwAAQBAJ&source=gbs_api","authors":["David das Neves","Jan-Hendrik Peters"]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript è un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e può aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di più... Anche se JavaScript è il linguaggio di programmazione client side al giorno d'oggi più diffuso, può essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo può darvi un risultato doppio, perché questo linguaggio continua ad espandersi in sempre più aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo è ciò che vi darà questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si può usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perché sono così comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fcfarreMQ9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book will lead you, step by step and with illustrative screenshots, through a real example. Are you writing two websites - one for mobile and one for larger displays? Or perhaps you've heard of Responsive Design but are unsure how to bring HTML5, CSS3, or responsive design all together. If so, this book provides everything you need to take your web pages to the next level - before all your competitors do!","language":"en","currency":"USD","id":"1849693196","title":"Responsive Web Design with HTML5 and CSS3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fcfarreMQ9sC&source=gbs_api","authors":["Ben Frain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOb2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Datenaustauschformate, Datenbankentwicklung und verteilte Anwendungen","description":"Wenn Sie bereits komplexe Java-Applikationen für den Desktop-Bereich schreiben, können Sie sich an Unternehmensanwendungen als weitere Herausforderung wagen. Dabei kommen Sie früher oder später mit Datenbanken, den Datenformaten XML oder JSON und auch mit verteilten Applikationen in Berührung. Das notwendige Wissen für einen effizienten Einstieg erlangen Sie in diesem Buch. Michael Inden macht Sie zunächst mit den Grundlagen der professionellen Erstellung von Unternehmensanwendungen vertraut und vermittelt Ihnen substanzielle Kenntnisse zum Informationsaustausch basierend auf XML oder JSON. Darüber hinaus bietet er eine fundierte Einführung in die Persistenz mit relationalen Datenbanken mithilfe von SQL, JDBC und JPA. Schließlich thematisiert der Autor die Datenverarbeitung mit den immer populärer werdenden NoSQL-Datenbanken anhand von MongoDB. Im Praxisalltag kommt oftmals der Wunsch auf, Funktionalität auch im Netzwerk bereitzustellen. Hierfür existieren vielfältige Technologien. Das Buch fokussiert auf die populären \"RESTful Webservices\" und zeigt Ihnen exemplarisch die Entwicklung von einfachen Client-Server-Applikationen mithilfe von JAX-RS.","language":"de","currency":"USD","id":"3864919606","title":"Der Java-Profi: Persistenzlösungen und REST-Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOb2DwAAQBAJ&source=gbs_api","authors":["Michael Inden"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uDnlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn to code like a professional with Python – an open source, versatile, and powerful programming language About This Book Learn the fundamentals of programming with Python – one of the best languages ever created Develop a strong set of programming skills that you will be able to express in any situation, on every platform, thanks to Python's portability Create outstanding applications of all kind, from websites to scripting, and from GUIs to data science Who This Book Is For Python is the most popular introductory teaching language in U.S. top computer science universities, so if you are new to software development, or maybe you have little experience, and would like to start off on the right foot, then this language and this book are what you need. Its amazing design and portability will help you become productive regardless of the environment you choose to work with. What You Will Learn Get Python up and running on Windows, Mac, and Linux in no time Grasp the fundamental concepts of coding, along with the basics of data structures and control flow. Write elegant, reusable, and efficient code in any situation Understand when to use the functional or the object oriented programming approach Create bulletproof, reliable software by writing tests to support your code Explore examples of GUIs, scripting, data science and web applications Learn to be independent, capable of fetching any resource you need, as well as dig deeper In Detail Learning Python has a dynamic and varied nature. It reads easily and lays a good foundation for those who are interested in digging deeper. It has a practical and example-oriented approach through which both the introductory and the advanced topics are explained. Starting with the fundamentals of programming and Python, it ends by exploring very different topics, like GUIs, web apps and data science. The book takes you all the way to creating a fully fledged application. The book begins by exploring the essentials of programming, data structures and teaches you how to manipulate them. It then moves on to controlling the flow of a program and writing reusable and error proof code. You will then explore different programming paradigms that will allow you to find the best approach to any situation, and also learn how to perform performance optimization as well as effective debugging. Throughout, the book steers you through the various types of applications, and it concludes with a complete mini website built upon all the concepts that you learned. Style and approach This book is an easy-to-follow guide that will take you from a novice to the proficient level at a comfortable pace, using a lot of simple but effective examples. Each topic is explained thoroughly, and pointers are left for the more inquisitive readers to dig deeper and expand their knowledge.","language":"en","currency":"USD","id":"1785284576","title":"Learning Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uDnlCwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PwZDDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Distribute Actionable, Timely BI with Microsoft® SQL Server® 2016 and Power BI Drive better, faster, more informed decision making across your organization using the expert tips and best practices featured in this hands-on guide. Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition, shows, step-by-step, how to distribute high-performance, custom analytics to users enterprise-wide. Discover how to build BI Semantic Models, create data marts and OLAP cubes, write MDX and DAX scripts, and share insights using Microsoft client tools. The book includes coverage of self-service business intelligence with Power BI. • Understand the goals and components of successful BI • Build data marts, OLAP cubes, and Tabular models • Load and cleanse data with SQL Server Integration Services • Manipulate and analyze data using MDX and DAX scripts and queries • Work with SQL Server Analysis Services and the BI Semantic Model • Author interactive reports using SQL Server Data Tools • Create KPIs and digital dashboards • Implement time-based analytics • Embed data model content in custom applications using ADOMD.NET • Use Power BI to gather, model, and visualize data in a self-service environment","language":"en","currency":"USD","id":"125964149X","title":"Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PwZDDQAAQBAJ&source=gbs_api","authors":["Brian Larson"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WAr5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.9,"subtitle":"Objetos y arrays – Conversaciones - XMLHttpRequest","description":"JSON es un estándar para el intercambio de datos entre las aplicaciones cliente-servidor, que deriva de la notación de objetos existente en JavaScript. Debido a que, para comunicarnos con un servidor web, necesitamos manipular solo texto plano, JSON resulta una alternativa muy interesante para enviar datos entre aplicaciones de la Web, comunicar tecnologías backend y frontend, manejar bases de datos no relacionales, mandar información de bases de datos relacionales, como MySQL, e incluso, crear APIs REST, un tipo de servicios que cada día se ve más en el mercado. JSON es fácil de comprender por los seres humanos y sencillo de escribir. Se trata de una alternativa a XML, siendo ya considerado independiente del lenguaje JavaScript. En el Volumen 2 veremos como integrar JSON en aplicaciones cliente-servidor. Crear peticiones a un servidor. Trabajar con JSON en proyectos JavaScript, HTML y bases de datos relacionales. Cómo transformar los datos JSON en formato JavaScript.","language":"es","currency":"USD","id":"9874757981","title":"JSON - Vol. 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WAr5DwAAQBAJ&source=gbs_api","authors":["Santiago Aguirre"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DQFwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to automate and manage your Linux containers and improve the overall performance of your system About This Book Are you using containers in your organization and want to better manage, scale, and orchestrate apps on the container? Use the recipes in the book to find a reliable solution from experts This is the first and only book on the market on Kubernetes, and it will show how to manage your containers in production using Kubernetes Buy this book, simply follow the recipes, and you will be the master of your Linux containers Who This Book Is For The book is aimed at system administrators who have intermediate level of knowledge with Kubernetes and want to better manage their applications deployed over containers. Also, it will help those administrators who want to maintain and scale applications on these containers. What You Will Learn Get to know how to build your own container cluster Deploy and manage highly scalable applications using Kubernetes Discover how to build high availability Kubernetes clusters Find out how to build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration In Detail Kubernetes is Google's solution to managing a cluster of containers. Kubernetes provides a declarative API to manage clusters while giving us a lot of flexibility. This book will provide you with recipes to better manage containers in different scenarios in production using Kubernetes. We will start by giving you a quick brush up on how Kubernetes works with containers along with an overview of the main Kubernetes features such as Pods, Replication Controllers, and more. Next, we will teach you how to create Kubernetes cluster and how to run programs on Kubernetes. We'll explain features such as High Availability Kubernetes master setup, using Kubernetes with Docker, and orchestration with Kubernetes using AWS. Later, will show you how to use Kubernetes-UI, and how to set up and manage Kubernetes clusters on the cloud and bare metal. Upon completion of this book, you will be able use Kubernetes in production and will have a better understanding of how to manage your containers using Kubernetes. Style and approach This recipe-based book precisely teaches you how to use Kubernetes in production and how to better manage your containers using Kubernetes.","language":"en","currency":"USD","id":"1785886045","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DQFwDQAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UprcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the full potential of Entity Framework with this collection of powerful and easy-to-follow recipes About This Book Learn how to use the new features of Entity Framework Core 1 Improve your queries by leveraging some of the advanced features Avoid common pitfalls Make the best of your .NET APIs by integrating with Entity Framework Who This Book Is For This book is for .NET developers who work with relational databases on a daily basis and understand the basics of Entity Framework, but now want to use it in a more efficient manner. You are expected to have some prior knowledge of Entity Framework. What You Will Learn Master the technique of using sequence key generators Validate groups of entities that are to be saved \/ updated Improve MVC applications that cover applications developed using ASP.NET MVC Core 1 Retrieve database information (table, column names, and so on) for entities Discover optimistic concurrency control and pessimistic concurrency control. Implement Multilatency on the data side of things. Enhance the performance and\/or scalability of Entity Framework Core Explore and overcome the pitfalls of Entity Framework Core In Detail Entity Framework is a highly recommended Object Relation Mapping tool used to build complex systems. In order to survive in this growing market, the knowledge of a framework that helps provide easy access to databases, that is, Entity Framework has become a necessity. This book will provide .NET developers with this knowledge and guide them through working efficiently with data using Entity Framework Core. You will start off by learning how to efficiently use Entity Framework in practical situations. You will gain a deep understanding of mapping properties and find out how to handle validation in Entity Framework. The book will then explain how to work with transactions and stored procedures along with improving Entity Framework using query libraries. Moving on, you will learn to improve complex query scenarios and implement transaction and concurrency control. You will then be taught to improve and develop Entity Framework in complex business scenarios. With the concluding chapter on performance and scalability, this book will get you ready to use Entity Framework proficiently. Style and approach Filled with rich code-based examples, this book takes a recipe-based approach that will teach .NET developers to improve their understanding of Entity Framework and help them effortlessly apply this knowledge in everyday situations.","language":"en","currency":"USD","id":"1785880586","title":"Entity Framework Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UprcDgAAQBAJ&source=gbs_api","authors":["Ricardo Peres"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Implement continuous delivery and integration in the AWS environment, 2nd Edition","description":"Scale and maintain outstanding performance in your AWS-based infrastructure using DevOps principles Key Features Implement continuous integration and continuous deployment pipelines on AWS Gain insight from an expert who has worked with Silicon Valley's most high-profile companies Implement DevOps principles to take full advantage of the AWS stack and services Book Description The DevOps movement has transformed the way modern tech companies work. Amazon Web Services (AWS), which has been at the forefront of the cloud computing revolution, has also been a key contributor to the DevOps movement, creating a huge range of managed services that help you implement DevOps principles. Effective DevOps with AWS, Second Edition will help you to understand how the most successful tech start-ups launch and scale their services on AWS, and will teach you how you can do the same. This book explains how to treat infrastructure as code, meaning you can bring resources online and offline as easily as you control your software. You will also build a continuous integration and continuous deployment pipeline to keep your app up to date. Once you have gotten to grips will all this, we'll move on to how to scale your applications to offer maximum performance to users even when traffic spikes, by using the latest technologies, such as containers. In addition to this, you'll get insights into monitoring and alerting, so you can make sure your users have the best experience when using your service. In the concluding chapters, we'll cover inbuilt AWS tools such as CodeDeploy and CloudFormation, which are used by many AWS administrators to perform DevOps. By the end of this book, you'll have learned how to ensure the security of your platform and data, using the latest and most prominent AWS tools. What you will learn Implement automatic AWS instance provisioning using CloudFormation Deploy your application on a provisioned infrastructure with Ansible Manage infrastructure using Terraform Build and deploy a CI\/CD pipeline with Automated Testing on AWS Understand the container journey for a CI\/CD pipeline using AWS ECS Monitor and secure your AWS environment Who this book is for Effective DevOps with AWS is for you if you are a developer, DevOps engineer, or you work in a team which wants to build and use AWS for software infrastructure. Basic computer science knowledge is required to get the most out of this book.","language":"en","currency":"USD","id":"1789539692","title":"Effective DevOps with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bP1wDwAAQBAJ&source=gbs_api","authors":["Yogesh Raheja","Giuseppe Borgese","Nathaniel Felsen"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UFBVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of ICCAN 2017","description":"The book focuses to foster new and original research ideas and results in three broad areas: computing, analytics, and networking with its prospective applications in the various interdisciplinary domains of engineering. This is an exciting and emerging interdisciplinary area in which a wide range of theory and methodologies are being investigated and developed to tackle complex and challenging real world problems. It also provides insights into the International Conference on Computing Analytics and Networking (ICCAN 2017) which is a premier international open forum for scientists, researchers and technocrats in academia as well as in industries from different parts of the world to present, interact, and exchange the state of art of concepts, prototypes, innovative research ideas in several diversified fields. The book includes invited keynote papers and paper presentations from both academia and industry to initiate and ignite our young minds in the meadow of momentous research and thereby enrich their existing knowledge. The book aims at postgraduate students and researchers working in the discipline of Computer Science & Engineering. It will be also useful for the researchers working in the domain of electronics as it contains some hardware technologies and forthcoming communication technologies.","language":"en","currency":"USD","id":"9811078718","title":"Progress in Computing, Analytics and Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UFBVDwAAQBAJ&source=gbs_api","authors":["Prasant Kumar Pattnaik","Siddharth Swarup Rautaray","Himansu Das","Janmenjoy Nayak"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Automate and control administrative tasks using DevOps principles","description":"Enhance your skills in expert module development, deployment, security, DevOps, and cloud Key Features A step-by-step guide to get you started with PowerShell Core 6.0 Harness the capabilities of PowerShell Core 6.0 to perform simple to complex administration tasks Learn core administrative concepts such as scripting, pipelines, and DSC Book Description Beginning with an overview of the different versions of PowerShell, Learn PowerShell Core 6.0 introduces you to VSCode and then dives into helping you understand the basic techniques in PowerShell scripting. You will cover advanced coding techniques, learn how to write reusable code as well as store and load data with PowerShell. This book will help you understand PowerShell security and Just Enough Administration, enabling you to create your own PowerShell repository. The last set of chapters will guide you in setting up, configuring, and working with Release Pipelines in VSCode and VSTS, and help you understand PowerShell DSC. In addition to this, you will learn how to use PowerShell with Windows, Azure, Microsoft Online Services, SCCM, and SQL Server. The final chapter will provide you with some use cases and pro tips. By the end of this book, you will be able to create professional reusable code using security insight and knowledge of working with PowerShell Core 6.0 and its most important capabilities. What you will learn Get to grips with Powershell Core 6.0 Explore basic and advanced PowerShell scripting techniques Get to grips with Windows PowerShell Security Work with centralization and DevOps with PowerShell Implement PowerShell in your organization through real-life examples Learn to create GUIs and use DSC in production Who this book is for If you are a Windows administrator or a DevOps user who wants to leverage PowerShell to automate simple to complex tasks, then this book is for you. Whether you know nothing about PowerShell or just enough to get by, this guide will give you what you need to go to take your scripting to the next level. You’ll also find this book useful if you’re a PowerShell expert looking to expand your knowledge in areas such as PowerShell Security and DevOps.","language":"en","currency":"USD","id":"1788835476","title":"Learn PowerShell Core 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLFmDwAAQBAJ&source=gbs_api","authors":["David das Neves","Jan-Hendrik Peters"]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript è un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e può aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di più... Anche se JavaScript è il linguaggio di programmazione client side al giorno d'oggi più diffuso, può essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo può darvi un risultato doppio, perché questo linguaggio continua ad espandersi in sempre più aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo è ciò che vi darà questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si può usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perché sono così comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fcfarreMQ9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book will lead you, step by step and with illustrative screenshots, through a real example. Are you writing two websites - one for mobile and one for larger displays? Or perhaps you've heard of Responsive Design but are unsure how to bring HTML5, CSS3, or responsive design all together. If so, this book provides everything you need to take your web pages to the next level - before all your competitors do!","language":"en","currency":"USD","id":"1849693196","title":"Responsive Web Design with HTML5 and CSS3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fcfarreMQ9sC&source=gbs_api","authors":["Ben Frain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOb2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Datenaustauschformate, Datenbankentwicklung und verteilte Anwendungen","description":"Wenn Sie bereits komplexe Java-Applikationen für den Desktop-Bereich schreiben, können Sie sich an Unternehmensanwendungen als weitere Herausforderung wagen. Dabei kommen Sie früher oder später mit Datenbanken, den Datenformaten XML oder JSON und auch mit verteilten Applikationen in Berührung. Das notwendige Wissen für einen effizienten Einstieg erlangen Sie in diesem Buch. Michael Inden macht Sie zunächst mit den Grundlagen der professionellen Erstellung von Unternehmensanwendungen vertraut und vermittelt Ihnen substanzielle Kenntnisse zum Informationsaustausch basierend auf XML oder JSON. Darüber hinaus bietet er eine fundierte Einführung in die Persistenz mit relationalen Datenbanken mithilfe von SQL, JDBC und JPA. Schließlich thematisiert der Autor die Datenverarbeitung mit den immer populärer werdenden NoSQL-Datenbanken anhand von MongoDB. Im Praxisalltag kommt oftmals der Wunsch auf, Funktionalität auch im Netzwerk bereitzustellen. Hierfür existieren vielfältige Technologien. Das Buch fokussiert auf die populären \"RESTful Webservices\" und zeigt Ihnen exemplarisch die Entwicklung von einfachen Client-Server-Applikationen mithilfe von JAX-RS.","language":"de","currency":"USD","id":"3864919606","title":"Der Java-Profi: Persistenzlösungen und REST-Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOb2DwAAQBAJ&source=gbs_api","authors":["Michael Inden"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uDnlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn to code like a professional with Python – an open source, versatile, and powerful programming language About This Book Learn the fundamentals of programming with Python – one of the best languages ever created Develop a strong set of programming skills that you will be able to express in any situation, on every platform, thanks to Python's portability Create outstanding applications of all kind, from websites to scripting, and from GUIs to data science Who This Book Is For Python is the most popular introductory teaching language in U.S. top computer science universities, so if you are new to software development, or maybe you have little experience, and would like to start off on the right foot, then this language and this book are what you need. Its amazing design and portability will help you become productive regardless of the environment you choose to work with. What You Will Learn Get Python up and running on Windows, Mac, and Linux in no time Grasp the fundamental concepts of coding, along with the basics of data structures and control flow. Write elegant, reusable, and efficient code in any situation Understand when to use the functional or the object oriented programming approach Create bulletproof, reliable software by writing tests to support your code Explore examples of GUIs, scripting, data science and web applications Learn to be independent, capable of fetching any resource you need, as well as dig deeper In Detail Learning Python has a dynamic and varied nature. It reads easily and lays a good foundation for those who are interested in digging deeper. It has a practical and example-oriented approach through which both the introductory and the advanced topics are explained. Starting with the fundamentals of programming and Python, it ends by exploring very different topics, like GUIs, web apps and data science. The book takes you all the way to creating a fully fledged application. The book begins by exploring the essentials of programming, data structures and teaches you how to manipulate them. It then moves on to controlling the flow of a program and writing reusable and error proof code. You will then explore different programming paradigms that will allow you to find the best approach to any situation, and also learn how to perform performance optimization as well as effective debugging. Throughout, the book steers you through the various types of applications, and it concludes with a complete mini website built upon all the concepts that you learned. Style and approach This book is an easy-to-follow guide that will take you from a novice to the proficient level at a comfortable pace, using a lot of simple but effective examples. Each topic is explained thoroughly, and pointers are left for the more inquisitive readers to dig deeper and expand their knowledge.","language":"en","currency":"USD","id":"1785284576","title":"Learning Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uDnlCwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PwZDDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Distribute Actionable, Timely BI with Microsoft® SQL Server® 2016 and Power BI Drive better, faster, more informed decision making across your organization using the expert tips and best practices featured in this hands-on guide. Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition, shows, step-by-step, how to distribute high-performance, custom analytics to users enterprise-wide. Discover how to build BI Semantic Models, create data marts and OLAP cubes, write MDX and DAX scripts, and share insights using Microsoft client tools. The book includes coverage of self-service business intelligence with Power BI. • Understand the goals and components of successful BI • Build data marts, OLAP cubes, and Tabular models • Load and cleanse data with SQL Server Integration Services • Manipulate and analyze data using MDX and DAX scripts and queries • Work with SQL Server Analysis Services and the BI Semantic Model • Author interactive reports using SQL Server Data Tools • Create KPIs and digital dashboards • Implement time-based analytics • Embed data model content in custom applications using ADOMD.NET • Use Power BI to gather, model, and visualize data in a self-service environment","language":"en","currency":"USD","id":"125964149X","title":"Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PwZDDQAAQBAJ&source=gbs_api","authors":["Brian Larson"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WAr5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.9,"subtitle":"Objetos y arrays – Conversaciones - XMLHttpRequest","description":"JSON es un estándar para el intercambio de datos entre las aplicaciones cliente-servidor, que deriva de la notación de objetos existente en JavaScript. Debido a que, para comunicarnos con un servidor web, necesitamos manipular solo texto plano, JSON resulta una alternativa muy interesante para enviar datos entre aplicaciones de la Web, comunicar tecnologías backend y frontend, manejar bases de datos no relacionales, mandar información de bases de datos relacionales, como MySQL, e incluso, crear APIs REST, un tipo de servicios que cada día se ve más en el mercado. JSON es fácil de comprender por los seres humanos y sencillo de escribir. Se trata de una alternativa a XML, siendo ya considerado independiente del lenguaje JavaScript. En el Volumen 2 veremos como integrar JSON en aplicaciones cliente-servidor. Crear peticiones a un servidor. Trabajar con JSON en proyectos JavaScript, HTML y bases de datos relacionales. Cómo transformar los datos JSON en formato JavaScript.","language":"es","currency":"USD","id":"9874757981","title":"JSON - Vol. 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WAr5DwAAQBAJ&source=gbs_api","authors":["Santiago Aguirre"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DQFwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to automate and manage your Linux containers and improve the overall performance of your system About This Book Are you using containers in your organization and want to better manage, scale, and orchestrate apps on the container? Use the recipes in the book to find a reliable solution from experts This is the first and only book on the market on Kubernetes, and it will show how to manage your containers in production using Kubernetes Buy this book, simply follow the recipes, and you will be the master of your Linux containers Who This Book Is For The book is aimed at system administrators who have intermediate level of knowledge with Kubernetes and want to better manage their applications deployed over containers. Also, it will help those administrators who want to maintain and scale applications on these containers. What You Will Learn Get to know how to build your own container cluster Deploy and manage highly scalable applications using Kubernetes Discover how to build high availability Kubernetes clusters Find out how to build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration In Detail Kubernetes is Google's solution to managing a cluster of containers. Kubernetes provides a declarative API to manage clusters while giving us a lot of flexibility. This book will provide you with recipes to better manage containers in different scenarios in production using Kubernetes. We will start by giving you a quick brush up on how Kubernetes works with containers along with an overview of the main Kubernetes features such as Pods, Replication Controllers, and more. Next, we will teach you how to create Kubernetes cluster and how to run programs on Kubernetes. We'll explain features such as High Availability Kubernetes master setup, using Kubernetes with Docker, and orchestration with Kubernetes using AWS. Later, will show you how to use Kubernetes-UI, and how to set up and manage Kubernetes clusters on the cloud and bare metal. Upon completion of this book, you will be able use Kubernetes in production and will have a better understanding of how to manage your containers using Kubernetes. Style and approach This recipe-based book precisely teaches you how to use Kubernetes in production and how to better manage your containers using Kubernetes.","language":"en","currency":"USD","id":"1785886045","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DQFwDQAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UprcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the full potential of Entity Framework with this collection of powerful and easy-to-follow recipes About This Book Learn how to use the new features of Entity Framework Core 1 Improve your queries by leveraging some of the advanced features Avoid common pitfalls Make the best of your .NET APIs by integrating with Entity Framework Who This Book Is For This book is for .NET developers who work with relational databases on a daily basis and understand the basics of Entity Framework, but now want to use it in a more efficient manner. You are expected to have some prior knowledge of Entity Framework. What You Will Learn Master the technique of using sequence key generators Validate groups of entities that are to be saved \/ updated Improve MVC applications that cover applications developed using ASP.NET MVC Core 1 Retrieve database information (table, column names, and so on) for entities Discover optimistic concurrency control and pessimistic concurrency control. Implement Multilatency on the data side of things. Enhance the performance and\/or scalability of Entity Framework Core Explore and overcome the pitfalls of Entity Framework Core In Detail Entity Framework is a highly recommended Object Relation Mapping tool used to build complex systems. In order to survive in this growing market, the knowledge of a framework that helps provide easy access to databases, that is, Entity Framework has become a necessity. This book will provide .NET developers with this knowledge and guide them through working efficiently with data using Entity Framework Core. You will start off by learning how to efficiently use Entity Framework in practical situations. You will gain a deep understanding of mapping properties and find out how to handle validation in Entity Framework. The book will then explain how to work with transactions and stored procedures along with improving Entity Framework using query libraries. Moving on, you will learn to improve complex query scenarios and implement transaction and concurrency control. You will then be taught to improve and develop Entity Framework in complex business scenarios. With the concluding chapter on performance and scalability, this book will get you ready to use Entity Framework proficiently. Style and approach Filled with rich code-based examples, this book takes a recipe-based approach that will teach .NET developers to improve their understanding of Entity Framework and help them effortlessly apply this knowledge in everyday situations.","language":"en","currency":"USD","id":"1785880586","title":"Entity Framework Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UprcDgAAQBAJ&source=gbs_api","authors":["Ricardo Peres"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Implement continuous delivery and integration in the AWS environment, 2nd Edition","description":"Scale and maintain outstanding performance in your AWS-based infrastructure using DevOps principles Key Features Implement continuous integration and continuous deployment pipelines on AWS Gain insight from an expert who has worked with Silicon Valley's most high-profile companies Implement DevOps principles to take full advantage of the AWS stack and services Book Description The DevOps movement has transformed the way modern tech companies work. Amazon Web Services (AWS), which has been at the forefront of the cloud computing revolution, has also been a key contributor to the DevOps movement, creating a huge range of managed services that help you implement DevOps principles. Effective DevOps with AWS, Second Edition will help you to understand how the most successful tech start-ups launch and scale their services on AWS, and will teach you how you can do the same. This book explains how to treat infrastructure as code, meaning you can bring resources online and offline as easily as you control your software. You will also build a continuous integration and continuous deployment pipeline to keep your app up to date. Once you have gotten to grips will all this, we'll move on to how to scale your applications to offer maximum performance to users even when traffic spikes, by using the latest technologies, such as containers. In addition to this, you'll get insights into monitoring and alerting, so you can make sure your users have the best experience when using your service. In the concluding chapters, we'll cover inbuilt AWS tools such as CodeDeploy and CloudFormation, which are used by many AWS administrators to perform DevOps. By the end of this book, you'll have learned how to ensure the security of your platform and data, using the latest and most prominent AWS tools. What you will learn Implement automatic AWS instance provisioning using CloudFormation Deploy your application on a provisioned infrastructure with Ansible Manage infrastructure using Terraform Build and deploy a CI\/CD pipeline with Automated Testing on AWS Understand the container journey for a CI\/CD pipeline using AWS ECS Monitor and secure your AWS environment Who this book is for Effective DevOps with AWS is for you if you are a developer, DevOps engineer, or you work in a team which wants to build and use AWS for software infrastructure. Basic computer science knowledge is required to get the most out of this book.","language":"en","currency":"USD","id":"1789539692","title":"Effective DevOps with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bP1wDwAAQBAJ&source=gbs_api","authors":["Yogesh Raheja","Giuseppe Borgese","Nathaniel Felsen"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UFBVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of ICCAN 2017","description":"The book focuses to foster new and original research ideas and results in three broad areas: computing, analytics, and networking with its prospective applications in the various interdisciplinary domains of engineering. This is an exciting and emerging interdisciplinary area in which a wide range of theory and methodologies are being investigated and developed to tackle complex and challenging real world problems. It also provides insights into the International Conference on Computing Analytics and Networking (ICCAN 2017) which is a premier international open forum for scientists, researchers and technocrats in academia as well as in industries from different parts of the world to present, interact, and exchange the state of art of concepts, prototypes, innovative research ideas in several diversified fields. The book includes invited keynote papers and paper presentations from both academia and industry to initiate and ignite our young minds in the meadow of momentous research and thereby enrich their existing knowledge. The book aims at postgraduate students and researchers working in the discipline of Computer Science & Engineering. It will be also useful for the researchers working in the domain of electronics as it contains some hardware technologies and forthcoming communication technologies.","language":"en","currency":"USD","id":"9811078718","title":"Progress in Computing, Analytics and Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UFBVDwAAQBAJ&source=gbs_api","authors":["Prasant Kumar Pattnaik","Siddharth Swarup Rautaray","Himansu Das","Janmenjoy Nayak"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Automate and control administrative tasks using DevOps principles","description":"Enhance your skills in expert module development, deployment, security, DevOps, and cloud Key Features A step-by-step guide to get you started with PowerShell Core 6.0 Harness the capabilities of PowerShell Core 6.0 to perform simple to complex administration tasks Learn core administrative concepts such as scripting, pipelines, and DSC Book Description Beginning with an overview of the different versions of PowerShell, Learn PowerShell Core 6.0 introduces you to VSCode and then dives into helping you understand the basic techniques in PowerShell scripting. You will cover advanced coding techniques, learn how to write reusable code as well as store and load data with PowerShell. This book will help you understand PowerShell security and Just Enough Administration, enabling you to create your own PowerShell repository. The last set of chapters will guide you in setting up, configuring, and working with Release Pipelines in VSCode and VSTS, and help you understand PowerShell DSC. In addition to this, you will learn how to use PowerShell with Windows, Azure, Microsoft Online Services, SCCM, and SQL Server. The final chapter will provide you with some use cases and pro tips. By the end of this book, you will be able to create professional reusable code using security insight and knowledge of working with PowerShell Core 6.0 and its most important capabilities. What you will learn Get to grips with Powershell Core 6.0 Explore basic and advanced PowerShell scripting techniques Get to grips with Windows PowerShell Security Work with centralization and DevOps with PowerShell Implement PowerShell in your organization through real-life examples Learn to create GUIs and use DSC in production Who this book is for If you are a Windows administrator or a DevOps user who wants to leverage PowerShell to automate simple to complex tasks, then this book is for you. Whether you know nothing about PowerShell or just enough to get by, this guide will give you what you need to go to take your scripting to the next level. You’ll also find this book useful if you’re a PowerShell expert looking to expand your knowledge in areas such as PowerShell Security and DevOps.","language":"en","currency":"USD","id":"1788835476","title":"Learn PowerShell Core 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLFmDwAAQBAJ&source=gbs_api","authors":["David das Neves","Jan-Hendrik Peters"]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript è un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e può aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di più... Anche se JavaScript è il linguaggio di programmazione client side al giorno d'oggi più diffuso, può essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo può darvi un risultato doppio, perché questo linguaggio continua ad espandersi in sempre più aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo è ciò che vi darà questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si può usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perché sono così comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fcfarreMQ9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book will lead you, step by step and with illustrative screenshots, through a real example. Are you writing two websites - one for mobile and one for larger displays? Or perhaps you've heard of Responsive Design but are unsure how to bring HTML5, CSS3, or responsive design all together. If so, this book provides everything you need to take your web pages to the next level - before all your competitors do!","language":"en","currency":"USD","id":"1849693196","title":"Responsive Web Design with HTML5 and CSS3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fcfarreMQ9sC&source=gbs_api","authors":["Ben Frain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOb2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Datenaustauschformate, Datenbankentwicklung und verteilte Anwendungen","description":"Wenn Sie bereits komplexe Java-Applikationen für den Desktop-Bereich schreiben, können Sie sich an Unternehmensanwendungen als weitere Herausforderung wagen. Dabei kommen Sie früher oder später mit Datenbanken, den Datenformaten XML oder JSON und auch mit verteilten Applikationen in Berührung. Das notwendige Wissen für einen effizienten Einstieg erlangen Sie in diesem Buch. Michael Inden macht Sie zunächst mit den Grundlagen der professionellen Erstellung von Unternehmensanwendungen vertraut und vermittelt Ihnen substanzielle Kenntnisse zum Informationsaustausch basierend auf XML oder JSON. Darüber hinaus bietet er eine fundierte Einführung in die Persistenz mit relationalen Datenbanken mithilfe von SQL, JDBC und JPA. Schließlich thematisiert der Autor die Datenverarbeitung mit den immer populärer werdenden NoSQL-Datenbanken anhand von MongoDB. Im Praxisalltag kommt oftmals der Wunsch auf, Funktionalität auch im Netzwerk bereitzustellen. Hierfür existieren vielfältige Technologien. Das Buch fokussiert auf die populären \"RESTful Webservices\" und zeigt Ihnen exemplarisch die Entwicklung von einfachen Client-Server-Applikationen mithilfe von JAX-RS.","language":"de","currency":"USD","id":"3864919606","title":"Der Java-Profi: Persistenzlösungen und REST-Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOb2DwAAQBAJ&source=gbs_api","authors":["Michael Inden"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uDnlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn to code like a professional with Python – an open source, versatile, and powerful programming language About This Book Learn the fundamentals of programming with Python – one of the best languages ever created Develop a strong set of programming skills that you will be able to express in any situation, on every platform, thanks to Python's portability Create outstanding applications of all kind, from websites to scripting, and from GUIs to data science Who This Book Is For Python is the most popular introductory teaching language in U.S. top computer science universities, so if you are new to software development, or maybe you have little experience, and would like to start off on the right foot, then this language and this book are what you need. Its amazing design and portability will help you become productive regardless of the environment you choose to work with. What You Will Learn Get Python up and running on Windows, Mac, and Linux in no time Grasp the fundamental concepts of coding, along with the basics of data structures and control flow. Write elegant, reusable, and efficient code in any situation Understand when to use the functional or the object oriented programming approach Create bulletproof, reliable software by writing tests to support your code Explore examples of GUIs, scripting, data science and web applications Learn to be independent, capable of fetching any resource you need, as well as dig deeper In Detail Learning Python has a dynamic and varied nature. It reads easily and lays a good foundation for those who are interested in digging deeper. It has a practical and example-oriented approach through which both the introductory and the advanced topics are explained. Starting with the fundamentals of programming and Python, it ends by exploring very different topics, like GUIs, web apps and data science. The book takes you all the way to creating a fully fledged application. The book begins by exploring the essentials of programming, data structures and teaches you how to manipulate them. It then moves on to controlling the flow of a program and writing reusable and error proof code. You will then explore different programming paradigms that will allow you to find the best approach to any situation, and also learn how to perform performance optimization as well as effective debugging. Throughout, the book steers you through the various types of applications, and it concludes with a complete mini website built upon all the concepts that you learned. Style and approach This book is an easy-to-follow guide that will take you from a novice to the proficient level at a comfortable pace, using a lot of simple but effective examples. Each topic is explained thoroughly, and pointers are left for the more inquisitive readers to dig deeper and expand their knowledge.","language":"en","currency":"USD","id":"1785284576","title":"Learning Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uDnlCwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PwZDDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Distribute Actionable, Timely BI with Microsoft® SQL Server® 2016 and Power BI Drive better, faster, more informed decision making across your organization using the expert tips and best practices featured in this hands-on guide. Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition, shows, step-by-step, how to distribute high-performance, custom analytics to users enterprise-wide. Discover how to build BI Semantic Models, create data marts and OLAP cubes, write MDX and DAX scripts, and share insights using Microsoft client tools. The book includes coverage of self-service business intelligence with Power BI. • Understand the goals and components of successful BI • Build data marts, OLAP cubes, and Tabular models • Load and cleanse data with SQL Server Integration Services • Manipulate and analyze data using MDX and DAX scripts and queries • Work with SQL Server Analysis Services and the BI Semantic Model • Author interactive reports using SQL Server Data Tools • Create KPIs and digital dashboards • Implement time-based analytics • Embed data model content in custom applications using ADOMD.NET • Use Power BI to gather, model, and visualize data in a self-service environment","language":"en","currency":"USD","id":"125964149X","title":"Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PwZDDQAAQBAJ&source=gbs_api","authors":["Brian Larson"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WAr5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.9,"subtitle":"Objetos y arrays – Conversaciones - XMLHttpRequest","description":"JSON es un estándar para el intercambio de datos entre las aplicaciones cliente-servidor, que deriva de la notación de objetos existente en JavaScript. Debido a que, para comunicarnos con un servidor web, necesitamos manipular solo texto plano, JSON resulta una alternativa muy interesante para enviar datos entre aplicaciones de la Web, comunicar tecnologías backend y frontend, manejar bases de datos no relacionales, mandar información de bases de datos relacionales, como MySQL, e incluso, crear APIs REST, un tipo de servicios que cada día se ve más en el mercado. JSON es fácil de comprender por los seres humanos y sencillo de escribir. Se trata de una alternativa a XML, siendo ya considerado independiente del lenguaje JavaScript. En el Volumen 2 veremos como integrar JSON en aplicaciones cliente-servidor. Crear peticiones a un servidor. Trabajar con JSON en proyectos JavaScript, HTML y bases de datos relacionales. Cómo transformar los datos JSON en formato JavaScript.","language":"es","currency":"USD","id":"9874757981","title":"JSON - Vol. 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WAr5DwAAQBAJ&source=gbs_api","authors":["Santiago Aguirre"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DQFwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to automate and manage your Linux containers and improve the overall performance of your system About This Book Are you using containers in your organization and want to better manage, scale, and orchestrate apps on the container? Use the recipes in the book to find a reliable solution from experts This is the first and only book on the market on Kubernetes, and it will show how to manage your containers in production using Kubernetes Buy this book, simply follow the recipes, and you will be the master of your Linux containers Who This Book Is For The book is aimed at system administrators who have intermediate level of knowledge with Kubernetes and want to better manage their applications deployed over containers. Also, it will help those administrators who want to maintain and scale applications on these containers. What You Will Learn Get to know how to build your own container cluster Deploy and manage highly scalable applications using Kubernetes Discover how to build high availability Kubernetes clusters Find out how to build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration In Detail Kubernetes is Google's solution to managing a cluster of containers. Kubernetes provides a declarative API to manage clusters while giving us a lot of flexibility. This book will provide you with recipes to better manage containers in different scenarios in production using Kubernetes. We will start by giving you a quick brush up on how Kubernetes works with containers along with an overview of the main Kubernetes features such as Pods, Replication Controllers, and more. Next, we will teach you how to create Kubernetes cluster and how to run programs on Kubernetes. We'll explain features such as High Availability Kubernetes master setup, using Kubernetes with Docker, and orchestration with Kubernetes using AWS. Later, will show you how to use Kubernetes-UI, and how to set up and manage Kubernetes clusters on the cloud and bare metal. Upon completion of this book, you will be able use Kubernetes in production and will have a better understanding of how to manage your containers using Kubernetes. Style and approach This recipe-based book precisely teaches you how to use Kubernetes in production and how to better manage your containers using Kubernetes.","language":"en","currency":"USD","id":"1785886045","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DQFwDQAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UprcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the full potential of Entity Framework with this collection of powerful and easy-to-follow recipes About This Book Learn how to use the new features of Entity Framework Core 1 Improve your queries by leveraging some of the advanced features Avoid common pitfalls Make the best of your .NET APIs by integrating with Entity Framework Who This Book Is For This book is for .NET developers who work with relational databases on a daily basis and understand the basics of Entity Framework, but now want to use it in a more efficient manner. You are expected to have some prior knowledge of Entity Framework. What You Will Learn Master the technique of using sequence key generators Validate groups of entities that are to be saved \/ updated Improve MVC applications that cover applications developed using ASP.NET MVC Core 1 Retrieve database information (table, column names, and so on) for entities Discover optimistic concurrency control and pessimistic concurrency control. Implement Multilatency on the data side of things. Enhance the performance and\/or scalability of Entity Framework Core Explore and overcome the pitfalls of Entity Framework Core In Detail Entity Framework is a highly recommended Object Relation Mapping tool used to build complex systems. In order to survive in this growing market, the knowledge of a framework that helps provide easy access to databases, that is, Entity Framework has become a necessity. This book will provide .NET developers with this knowledge and guide them through working efficiently with data using Entity Framework Core. You will start off by learning how to efficiently use Entity Framework in practical situations. You will gain a deep understanding of mapping properties and find out how to handle validation in Entity Framework. The book will then explain how to work with transactions and stored procedures along with improving Entity Framework using query libraries. Moving on, you will learn to improve complex query scenarios and implement transaction and concurrency control. You will then be taught to improve and develop Entity Framework in complex business scenarios. With the concluding chapter on performance and scalability, this book will get you ready to use Entity Framework proficiently. Style and approach Filled with rich code-based examples, this book takes a recipe-based approach that will teach .NET developers to improve their understanding of Entity Framework and help them effortlessly apply this knowledge in everyday situations.","language":"en","currency":"USD","id":"1785880586","title":"Entity Framework Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UprcDgAAQBAJ&source=gbs_api","authors":["Ricardo Peres"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bP1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Implement continuous delivery and integration in the AWS environment, 2nd Edition","description":"Scale and maintain outstanding performance in your AWS-based infrastructure using DevOps principles Key Features Implement continuous integration and continuous deployment pipelines on AWS Gain insight from an expert who has worked with Silicon Valley's most high-profile companies Implement DevOps principles to take full advantage of the AWS stack and services Book Description The DevOps movement has transformed the way modern tech companies work. Amazon Web Services (AWS), which has been at the forefront of the cloud computing revolution, has also been a key contributor to the DevOps movement, creating a huge range of managed services that help you implement DevOps principles. Effective DevOps with AWS, Second Edition will help you to understand how the most successful tech start-ups launch and scale their services on AWS, and will teach you how you can do the same. This book explains how to treat infrastructure as code, meaning you can bring resources online and offline as easily as you control your software. You will also build a continuous integration and continuous deployment pipeline to keep your app up to date. Once you have gotten to grips will all this, we'll move on to how to scale your applications to offer maximum performance to users even when traffic spikes, by using the latest technologies, such as containers. In addition to this, you'll get insights into monitoring and alerting, so you can make sure your users have the best experience when using your service. In the concluding chapters, we'll cover inbuilt AWS tools such as CodeDeploy and CloudFormation, which are used by many AWS administrators to perform DevOps. By the end of this book, you'll have learned how to ensure the security of your platform and data, using the latest and most prominent AWS tools. What you will learn Implement automatic AWS instance provisioning using CloudFormation Deploy your application on a provisioned infrastructure with Ansible Manage infrastructure using Terraform Build and deploy a CI\/CD pipeline with Automated Testing on AWS Understand the container journey for a CI\/CD pipeline using AWS ECS Monitor and secure your AWS environment Who this book is for Effective DevOps with AWS is for you if you are a developer, DevOps engineer, or you work in a team which wants to build and use AWS for software infrastructure. Basic computer science knowledge is required to get the most out of this book.","language":"en","currency":"USD","id":"1789539692","title":"Effective DevOps with AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bP1wDwAAQBAJ&source=gbs_api","authors":["Yogesh Raheja","Giuseppe Borgese","Nathaniel Felsen"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UFBVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":"Proceedings of ICCAN 2017","description":"The book focuses to foster new and original research ideas and results in three broad areas: computing, analytics, and networking with its prospective applications in the various interdisciplinary domains of engineering. This is an exciting and emerging interdisciplinary area in which a wide range of theory and methodologies are being investigated and developed to tackle complex and challenging real world problems. It also provides insights into the International Conference on Computing Analytics and Networking (ICCAN 2017) which is a premier international open forum for scientists, researchers and technocrats in academia as well as in industries from different parts of the world to present, interact, and exchange the state of art of concepts, prototypes, innovative research ideas in several diversified fields. The book includes invited keynote papers and paper presentations from both academia and industry to initiate and ignite our young minds in the meadow of momentous research and thereby enrich their existing knowledge. The book aims at postgraduate students and researchers working in the discipline of Computer Science & Engineering. It will be also useful for the researchers working in the domain of electronics as it contains some hardware technologies and forthcoming communication technologies.","language":"en","currency":"USD","id":"9811078718","title":"Progress in Computing, Analytics and Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UFBVDwAAQBAJ&source=gbs_api","authors":["Prasant Kumar Pattnaik","Siddharth Swarup Rautaray","Himansu Das","Janmenjoy Nayak"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Automate and control administrative tasks using DevOps principles","description":"Enhance your skills in expert module development, deployment, security, DevOps, and cloud Key Features A step-by-step guide to get you started with PowerShell Core 6.0 Harness the capabilities of PowerShell Core 6.0 to perform simple to complex administration tasks Learn core administrative concepts such as scripting, pipelines, and DSC Book Description Beginning with an overview of the different versions of PowerShell, Learn PowerShell Core 6.0 introduces you to VSCode and then dives into helping you understand the basic techniques in PowerShell scripting. You will cover advanced coding techniques, learn how to write reusable code as well as store and load data with PowerShell. This book will help you understand PowerShell security and Just Enough Administration, enabling you to create your own PowerShell repository. The last set of chapters will guide you in setting up, configuring, and working with Release Pipelines in VSCode and VSTS, and help you understand PowerShell DSC. In addition to this, you will learn how to use PowerShell with Windows, Azure, Microsoft Online Services, SCCM, and SQL Server. The final chapter will provide you with some use cases and pro tips. By the end of this book, you will be able to create professional reusable code using security insight and knowledge of working with PowerShell Core 6.0 and its most important capabilities. What you will learn Get to grips with Powershell Core 6.0 Explore basic and advanced PowerShell scripting techniques Get to grips with Windows PowerShell Security Work with centralization and DevOps with PowerShell Implement PowerShell in your organization through real-life examples Learn to create GUIs and use DSC in production Who this book is for If you are a Windows administrator or a DevOps user who wants to leverage PowerShell to automate simple to complex tasks, then this book is for you. Whether you know nothing about PowerShell or just enough to get by, this guide will give you what you need to go to take your scripting to the next level. You’ll also find this book useful if you’re a PowerShell expert looking to expand your knowledge in areas such as PowerShell Security and DevOps.","language":"en","currency":"USD","id":"1788835476","title":"Learn PowerShell Core 6.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLFmDwAAQBAJ&source=gbs_api","authors":["David das Neves","Jan-Hendrik Peters"]},{"pageCount":27,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EcwnBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Imparate il JavaScript JavaScript è un linguaggio di programmazione dinamico che viene spesso usato nei browser per controllare il comportamento delle pagine web e per interagire con gli utenti; permette la comunicazione asincrona e può aggiornare parti delle pagine web o addirittura sostituirne completamente il contenuto. Vedrete JavaScript usato per visualizzare informazioni sulla data e l'ora, per fare delle animazioni su un sito web, per validare i dati inseriti in un form, per suggerire dei risultati mentre l'utente scrive in un campo di ricerca e molto altro. JavaScript viene usato sempre di più... Anche se JavaScript è il linguaggio di programmazione client side al giorno d'oggi più diffuso, può essere usato anche come linguaggio server side; ne sono alcuni esempi Node.js, Meteor, Wakanda, CouchDB e MongoDB. Il tempo che investirete imparandolo può darvi un risultato doppio, perché questo linguaggio continua ad espandersi in sempre più aree dell'informatica. Imparate i fondamentali del linguaggio di programmazione JavaScript Non importa se volete usare JavaScript in un browser web come linguaggio client, come linguaggio server o entrambi, dovrete impararne prima i fondamenti. Questo è ciò che vi darà questo libro; quando finirete di leggerlo, vi sentirete a vostro agio nel programmare in JavaScript. Ecco alcune cose che imparerete leggendo questo libro: Quando si può usare JavaScript Come impostare il computer in modo che sia facile e comodo programmare in JavaScript Quali strumenti vi servono per programmare in JavaScript Le basi di HTML... Cosa sono le variabili e come usarle Come gestire i numeri e fare le operazioni matematiche Come e quando usare i condizionali Cosa sono le funzioni, perché sono così comode e come farne buon uso Strutture di dati avanzate come gli array associativi Molto altro... Tornate s","language":"it","currency":"USD","id":"1633398862","title":"Javascript: Un Manuale Per Imparare La Programmazione In Javascript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EcwnBgAAQBAJ&source=gbs_api","authors":["Troy Dimes"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Learn the art of bringing the Internet of Things into your projects with the power of JavaScript About This Book This is a practical guide to help you configure and build a complete distributed IoT system from scratch using JavaScript Utilize the power of Node and HTML5 to develop web services and a centralized web server, enabling high-level communication between connected devices Control all your connected devices from the browser by setting up a common dashboard Who This Book Is For This book is for developers who are interested in learning how to communicate with connected devices in JavaScript to set up an IoT system. Some basic knowledge of JavaScript is expected. Hobbyists who want to explore the potential of IoT in JavaScript will also find this book useful. What You Will Learn Develop the skills to connected devices prepared the field to interact with the devices in a network system Internet of Things Find out how to connect sensors and actuators to the devices Send data to a web server connected devices Understand Internet of things using web services and database Configure a dashboard using HTML5 and JavaScript Control devices connected from a dashboard Monitor different devices from the dashboard Build an app for a smartphone to control different devices In Detail The Internet of Things (IoT) is an entirely new platform for developers and engineers, but one thing that remains consistent as we move into this new world, are the programming languages. JavaScript is the most widely used language over the Internet, and with IoT gaining momentum, you will learn how to harness the power of JavaScript to interact with connected devices. This book will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface to control all connected devices. This book begins with setting up a centralized web server that serves as a hub for all connected devices. The book then progresses further towards building web services to facilitate high-level communication between connected devices. Using Arduino and Raspberry Pi Zero as endpoint devices, the book will show you how devices can communicate with each other, perform a wide range of tasks, and also be controlled from a centralized location using JavaScript. The book ends with creating a hybrid app to control the devices that can be run from a browser or installed on a smartphone. Style and approach This book offers step-by-step guidance on how to set up a distributed IoT system using JavaScript. It will teach you how to interact with endpoint devices by developing web services in JavaScript and also set up an interface for controlling all connected devices.","language":"en","currency":"USD","id":"1785884867","title":"Internet of Things Programming with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R1QoDwAAQBAJ&source=gbs_api","authors":["Ruben Oliva Ramos"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fcfarreMQ9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book will lead you, step by step and with illustrative screenshots, through a real example. Are you writing two websites - one for mobile and one for larger displays? Or perhaps you've heard of Responsive Design but are unsure how to bring HTML5, CSS3, or responsive design all together. If so, this book provides everything you need to take your web pages to the next level - before all your competitors do!","language":"en","currency":"USD","id":"1849693196","title":"Responsive Web Design with HTML5 and CSS3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fcfarreMQ9sC&source=gbs_api","authors":["Ben Frain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOb2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":33.99,"subtitle":"Datenaustauschformate, Datenbankentwicklung und verteilte Anwendungen","description":"Wenn Sie bereits komplexe Java-Applikationen für den Desktop-Bereich schreiben, können Sie sich an Unternehmensanwendungen als weitere Herausforderung wagen. Dabei kommen Sie früher oder später mit Datenbanken, den Datenformaten XML oder JSON und auch mit verteilten Applikationen in Berührung. Das notwendige Wissen für einen effizienten Einstieg erlangen Sie in diesem Buch. Michael Inden macht Sie zunächst mit den Grundlagen der professionellen Erstellung von Unternehmensanwendungen vertraut und vermittelt Ihnen substanzielle Kenntnisse zum Informationsaustausch basierend auf XML oder JSON. Darüber hinaus bietet er eine fundierte Einführung in die Persistenz mit relationalen Datenbanken mithilfe von SQL, JDBC und JPA. Schließlich thematisiert der Autor die Datenverarbeitung mit den immer populärer werdenden NoSQL-Datenbanken anhand von MongoDB. Im Praxisalltag kommt oftmals der Wunsch auf, Funktionalität auch im Netzwerk bereitzustellen. Hierfür existieren vielfältige Technologien. Das Buch fokussiert auf die populären \"RESTful Webservices\" und zeigt Ihnen exemplarisch die Entwicklung von einfachen Client-Server-Applikationen mithilfe von JAX-RS.","language":"de","currency":"USD","id":"3864919606","title":"Der Java-Profi: Persistenzlösungen und REST-Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOb2DwAAQBAJ&source=gbs_api","authors":["Michael Inden"]},{"pageCount":485,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2IfDCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development. The JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side. While no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly u seful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores. The libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash. Written from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro. Enrich your development skills with JavaScript Frameworks for Modern Web Dev today.","language":"en","currency":"USD","id":"1484206622","title":"JavaScript Frameworks for Modern Web Dev","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2IfDCgAAQBAJ&source=gbs_api","authors":["Tim Ambler","Nicholas Cloud"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uDnlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn to code like a professional with Python – an open source, versatile, and powerful programming language About This Book Learn the fundamentals of programming with Python – one of the best languages ever created Develop a strong set of programming skills that you will be able to express in any situation, on every platform, thanks to Python's portability Create outstanding applications of all kind, from websites to scripting, and from GUIs to data science Who This Book Is For Python is the most popular introductory teaching language in U.S. top computer science universities, so if you are new to software development, or maybe you have little experience, and would like to start off on the right foot, then this language and this book are what you need. Its amazing design and portability will help you become productive regardless of the environment you choose to work with. What You Will Learn Get Python up and running on Windows, Mac, and Linux in no time Grasp the fundamental concepts of coding, along with the basics of data structures and control flow. Write elegant, reusable, and efficient code in any situation Understand when to use the functional or the object oriented programming approach Create bulletproof, reliable software by writing tests to support your code Explore examples of GUIs, scripting, data science and web applications Learn to be independent, capable of fetching any resource you need, as well as dig deeper In Detail Learning Python has a dynamic and varied nature. It reads easily and lays a good foundation for those who are interested in digging deeper. It has a practical and example-oriented approach through which both the introductory and the advanced topics are explained. Starting with the fundamentals of programming and Python, it ends by exploring very different topics, like GUIs, web apps and data science. The book takes you all the way to creating a fully fledged application. The book begins by exploring the essentials of programming, data structures and teaches you how to manipulate them. It then moves on to controlling the flow of a program and writing reusable and error proof code. You will then explore different programming paradigms that will allow you to find the best approach to any situation, and also learn how to perform performance optimization as well as effective debugging. Throughout, the book steers you through the various types of applications, and it concludes with a complete mini website built upon all the concepts that you learned. Style and approach This book is an easy-to-follow guide that will take you from a novice to the proficient level at a comfortable pace, using a lot of simple but effective examples. Each topic is explained thoroughly, and pointers are left for the more inquisitive readers to dig deeper and expand their knowledge.","language":"en","currency":"USD","id":"1785284576","title":"Learning Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uDnlCwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PwZDDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Distribute Actionable, Timely BI with Microsoft® SQL Server® 2016 and Power BI Drive better, faster, more informed decision making across your organization using the expert tips and best practices featured in this hands-on guide. Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition, shows, step-by-step, how to distribute high-performance, custom analytics to users enterprise-wide. Discover how to build BI Semantic Models, create data marts and OLAP cubes, write MDX and DAX scripts, and share insights using Microsoft client tools. The book includes coverage of self-service business intelligence with Power BI. • Understand the goals and components of successful BI • Build data marts, OLAP cubes, and Tabular models • Load and cleanse data with SQL Server Integration Services • Manipulate and analyze data using MDX and DAX scripts and queries • Work with SQL Server Analysis Services and the BI Semantic Model • Author interactive reports using SQL Server Data Tools • Create KPIs and digital dashboards • Implement time-based analytics • Embed data model content in custom applications using ADOMD.NET • Use Power BI to gather, model, and visualize data in a self-service environment","language":"en","currency":"USD","id":"125964149X","title":"Delivering Business Intelligence with Microsoft SQL Server 2016, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PwZDDQAAQBAJ&source=gbs_api","authors":["Brian Larson"]},{"pageCount":112,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WAr5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.9,"subtitle":"Objetos y arrays – Conversaciones - XMLHttpRequest","description":"JSON es un estándar para el intercambio de datos entre las aplicaciones cliente-servidor, que deriva de la notación de objetos existente en JavaScript. Debido a que, para comunicarnos con un servidor web, necesitamos manipular solo texto plano, JSON resulta una alternativa muy interesante para enviar datos entre aplicaciones de la Web, comunicar tecnologías backend y frontend, manejar bases de datos no relacionales, mandar información de bases de datos relacionales, como MySQL, e incluso, crear APIs REST, un tipo de servicios que cada día se ve más en el mercado. JSON es fácil de comprender por los seres humanos y sencillo de escribir. Se trata de una alternativa a XML, siendo ya considerado independiente del lenguaje JavaScript. En el Volumen 2 veremos como integrar JSON en aplicaciones cliente-servidor. Crear peticiones a un servidor. Trabajar con JSON en proyectos JavaScript, HTML y bases de datos relacionales. Cómo transformar los datos JSON en formato JavaScript.","language":"es","currency":"USD","id":"9874757981","title":"JSON - Vol. 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WAr5DwAAQBAJ&source=gbs_api","authors":["Santiago Aguirre"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DQFwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to automate and manage your Linux containers and improve the overall performance of your system About This Book Are you using containers in your organization and want to better manage, scale, and orchestrate apps on the container? Use the recipes in the book to find a reliable solution from experts This is the first and only book on the market on Kubernetes, and it will show how to manage your containers in production using Kubernetes Buy this book, simply follow the recipes, and you will be the master of your Linux containers Who This Book Is For The book is aimed at system administrators who have intermediate level of knowledge with Kubernetes and want to better manage their applications deployed over containers. Also, it will help those administrators who want to maintain and scale applications on these containers. What You Will Learn Get to know how to build your own container cluster Deploy and manage highly scalable applications using Kubernetes Discover how to build high availability Kubernetes clusters Find out how to build a continuous delivery pipeline for your application Track metrics and logs for every container running in your cluster Streamline the way you deploy and manage your applications with large-scale container orchestration In Detail Kubernetes is Google's solution to managing a cluster of containers. Kubernetes provides a declarative API to manage clusters while giving us a lot of flexibility. This book will provide you with recipes to better manage containers in different scenarios in production using Kubernetes. We will start by giving you a quick brush up on how Kubernetes works with containers along with an overview of the main Kubernetes features such as Pods, Replication Controllers, and more. Next, we will teach you how to create Kubernetes cluster and how to run programs on Kubernetes. We'll explain features such as High Availability Kubernetes master setup, using Kubernetes with Docker, and orchestration with Kubernetes using AWS. Later, will show you how to use Kubernetes-UI, and how to set up and manage Kubernetes clusters on the cloud and bare metal. Upon completion of this book, you will be able use Kubernetes in production and will have a better understanding of how to manage your containers using Kubernetes. Style and approach This recipe-based book precisely teaches you how to use Kubernetes in production and how to better manage your containers using Kubernetes.","language":"en","currency":"USD","id":"1785886045","title":"Kubernetes Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DQFwDQAAQBAJ&source=gbs_api","authors":["Hideto Saito","Hui-Chuan Chloe Lee","Ke-Jou Carol Hsu"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UprcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Leverage the full potential of Entity Framework with this collection of powerful and easy-to-follow recipes About This Book Learn how to use the new features of Entity Framework Core 1 Improve your queries by leveraging some of the advanced features Avoid common pitfalls Make the best of your .NET APIs by integrating with Entity Framework Who This Book Is For This book is for .NET developers who work with relational databases on a daily basis and understand the basics of Entity Framework, but now want to use it in a more efficient manner. You are expected to have some prior knowledge of Entity Framework. What You Will Learn Master the technique of using sequence key generators Validate groups of entities that are to be saved \/ updated Improve MVC applications that cover applications developed using ASP.NET MVC Core 1 Retrieve database information (table, column names, and so on) for entities Discover optimistic concurrency control and pessimistic concurrency control. Implement Multilatency on the data side of things. Enhance the performance and\/or scalability of Entity Framework Core Explore and overcome the pitfalls of Entity Framework Core In Detail Entity Framework is a highly recommended Object Relation Mapping tool used to build complex systems. In order to survive in this growing market, the knowledge of a framework that helps provide easy access to databases, that is, Entity Framework has become a necessity. This book will provide .NET developers with this knowledge and guide them through working efficiently with data using Entity Framework Core. You will start off by learning how to efficiently use Entity Framework in practical situations. You will gain a deep understanding of mapping properties and find out how to handle validation in Entity Framework. The book will then explain how to work with transactions and stored procedures along with improving Entity Framework using query libraries. Moving on, you will learn to improve complex query scenarios and implement transaction and concurrency control. You will then be taught to improve and develop Entity Framework in complex business scenarios. With the concluding chapter on performance and scalability, this book will get you ready to use Entity Framework proficiently. Style and approach Filled with rich code-based examples, this book takes a recipe-based approach that will teach .NET developers to improve their understanding of Entity Framework and help them effortlessly apply this knowledge in everyday situations.","language":"en","currency":"USD","id":"1785880586","title":"Entity Framework Core Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UprcDgAAQBAJ&source=gbs_api","authors":["Ricardo Peres"]}]