[{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0osSaJy5ahwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Strategic Planning to Enterprise Integration with Tools, Techniques, NoSQL, and Graph","description":"Big Data Analytics will assist managers in providing an overview of the drivers for introducing big data technology into the organization and for understanding the types of business problems best suited to big data analytics solutions, understanding the value drivers and benefits, strategic planning, developing a pilot, and eventually planning to integrate back into production within the enterprise. Guides the reader in assessing the opportunities and value proposition Overview of big data hardware and software architectures Presents a variety of technologies and how they fit into the big data ecosystem","language":"en","currency":"USD","id":"0124186645","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0osSaJy5ahwC&source=gbs_api","authors":["David Loshin"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":229,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XOCgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Models, Languages, Consistency Options and Architectures for Big Data Management","description":"This book offers a comprehensive introduction to relational (SQL) and non-relational (NoSQL) databases. The authors thoroughly review the current state of database tools and techniques, and examine coming innovations. The book opens with a broad look at data management, including an overview of information systems and databases, and an explanation of contemporary database types: SQL and NoSQL databases, and their respective management systems The nature and uses of Big Data A high-level view of the organization of data management Data Modeling and Consistency Chapter-length treatment is afforded Data Modeling in both relational and graph databases, including enterprise-wide data architecture, and formulas for database design. Coverage of languages extends from an overview of operators, to SQL and and QBE (Query by Example), to integrity constraints and more. A full chapter probes the challenges of Ensuring Data Consistency, covering: Multi-User Operation Troubleshooting Consistency in Massive Distributed Data Comparison of the ACID and BASE consistency models, and more System Architecture also gets from its own chapter, which explores Processing of Homogeneous and Heterogeneous Data; Storage and Access Structures; Multi-dimensional Data Structures and Parallel Processing with MapReduce, among other topics. Post-Relational and NoSQL Databases The chapter on post-relational databases discusses the limits of SQL – and what lies beyond, including Multi-Dimensional Databases, Knowledge Bases and and Fuzzy Databases. A final chapter covers NoSQL Databases, along with Development of Non-Relational Technologies, Key-Value, Column-Family and Document Stores XML Databases and Graphic Databases, and more The book includes more than 100 tables, examples and illustrations, and each chapter offers a list of resources for further reading. SQL & NoSQL Databases conveys the strengths and weaknesses of relational and non-relational approaches, and shows how to undertake development for big data applications. The book benefits readers including students and practitioners working across the broad field of applied information technology. This textbook has been recommended and developed for university courses in Germany, Austria and Switzerland.","language":"en","currency":"USD","id":"3658245492","title":"SQL & NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XOCgDwAAQBAJ&source=gbs_api","authors":["Andreas Meier","Michael Kaufmann"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gj0PEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":"Database for Storage and Retrieval of Data in Cloud","description":"This book discusses the advanced databases for the cloud-based application known as NoSQL. It will explore the recent advancements in NoSQL database technology. Chapters on structured, unstructured and hybrid databases will be included to explore bigdata analytics, bigdata storage and processing. The book is likely to cover a wide range of topics such as cloud computing, social computing, bigdata and advanced databases processing techniques.","language":"en","currency":"USD","id":"1498784372","title":"NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gj0PEAAAQBAJ&source=gbs_api","authors":["Ganesh Chandra Deka"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vNNJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Hands-on techniques to implement enterprise analytics and machine learning using Hadoop, Spark, NoSQL and R","description":"Get command of your organizational Big Data using the power of data science and analytics Key Features A perfect companion to boost your Big Data storing, processing, analyzing skills to help you take informed business decisions Work with the best tools such as Apache Hadoop, R, Python, and Spark for NoSQL platforms to perform massive online analyses Get expert tips on statistical inference, machine learning, mathematical modeling, and data visualization for Big Data Book Description Big Data analytics relates to the strategies used by organizations to collect, organize and analyze large amounts of data to uncover valuable business insights that otherwise cannot be analyzed through traditional systems. Crafting an enterprise-scale cost-efficient Big Data and machine learning solution to uncover insights and value from your organization's data is a challenge. Today, with hundreds of new Big Data systems, machine learning packages and BI Tools, selecting the right combination of technologies is an even greater challenge. This book will help you do that. With the help of this guide, you will be able to bridge the gap between the theoretical world of technology with the practical ground reality of building corporate Big Data and data science platforms. You will get hands-on exposure to Hadoop and Spark, build machine learning dashboards using R and R Shiny, create web-based apps using NoSQL databases such as MongoDB and even learn how to write R code for neural networks. By the end of the book, you will have a very clear and concrete understanding of what Big Data analytics means, how it drives revenues for organizations, and how you can develop your own Big Data analytics solution using different tools and methods articulated in this book. What you will learn - Get a 360-degree view into the world of Big Data, data science and machine learning - Broad range of technical and business Big Data analytics topics that caters to the interests of the technical experts as well as corporate IT executives - Get hands-on experience with industry-standard Big Data and machine learning tools such as Hadoop, Spark, MongoDB, KDB+ and R - Create production-grade machine learning BI Dashboards using R and R Shiny with step-by-step instructions - Learn how to combine open-source Big Data, machine learning and BI Tools to create low-cost business analytics applications - Understand corporate strategies for successful Big Data and data science projects - Go beyond general-purpose analytics to develop cutting-edge Big Data applications using emerging technologies Who this book is for The book is intended for existing and aspiring Big Data professionals who wish to become the go-to person in their organization when it comes to Big Data architecture, analytics, and governance. While no prior knowledge of Big Data or related technologies is assumed, it will be helpful to have some programming experience.","language":"en","currency":"USD","id":"1783554401","title":"Practical Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vNNJDwAAQBAJ&source=gbs_api","authors":["Nataraj Dasgupta"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Effective data processing with MySQL 8, Hadoop, NoSQL APIs, and other Big Data tools","description":"Uncover the power of MySQL 8 for Big Data About This Book Combine the powers of MySQL and Hadoop to build a solid Big Data solution for your organization Integrate MySQL with different NoSQL APIs and Big Data tools such as Apache Sqoop A comprehensive guide with practical examples on building a high performance Big Data pipeline with MySQL Who This Book Is For This book is intended for MySQL database administrators and Big Data professionals looking to integrate MySQL 8 and Hadoop to implement a high performance Big Data solution. Some previous experience with MySQL will be helpful, although the book will highlight the newer features introduced in MySQL 8. What You Will Learn Explore the features of MySQL 8 and how they can be leveraged to handle Big Data Unlock the new features of MySQL 8 for managing structured and unstructured Big Data Integrate MySQL 8 and Hadoop for efficient data processing Perform aggregation using MySQL 8 for optimum data utilization Explore different kinds of join and union in MySQL 8 to process Big Data efficiently Accelerate Big Data processing with Memcached Integrate MySQL with the NoSQL API Implement replication to build highly available solutions for Big Data In Detail With organizations handling large amounts of data on a regular basis, MySQL has become a popular solution to handle this structured Big Data. In this book, you will see how DBAs can use MySQL 8 to handle billions of records, and load and retrieve data with performance comparable or superior to commercial DB solutions with higher costs. Many organizations today depend on MySQL for their websites and a Big Data solution for their data archiving, storage, and analysis needs. However, integrating them can be challenging. This book will show you how to implement a successful Big Data strategy with Apache Hadoop and MySQL 8. It will cover real-time use case scenario to explain integration and achieve Big Data solutions using technologies such as Apache Hadoop, Apache Sqoop, and MySQL Applier. Also, the book includes case studies on Apache Sqoop and real-time event processing. By the end of this book, you will know how to efficiently use MySQL 8 to manage data for your Big Data applications. Style and approach Step by Step guide filled with real-world practical examples.","language":"en","currency":"USD","id":"1788390423","title":"MySQL 8 for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xhKDwAAQBAJ&source=gbs_api","authors":["Shabbir Challawala","Jaydip Lakhatariya","Chintan Mehta","Kandarp Patel"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1VlLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Design, process, and analyze large sets of complex data in real time About This Book Get acquainted with transformations and database-level interactions, and ensure the reliability of messages processed using Storm Implement strategies to solve the challenges of real-time data processing Load datasets, build queries, and make recommendations using Spark SQL Who This Book Is For If you are a Big Data architect, developer, or a programmer who wants to develop applications\/frameworks to implement real-time analytics using open source technologies, then this book is for you. What You Will Learn Explore big data technologies and frameworks Work through practical challenges and use cases of real-time analytics versus batch analytics Develop real-word use cases for processing and analyzing data in real-time using the programming paradigm of Apache Storm Handle and process real-time transactional data Optimize and tune Apache Storm for varied workloads and production deployments Process and stream data with Amazon Kinesis and Elastic MapReduce Perform interactive and exploratory data analytics using Spark SQL Develop common enterprise architectures\/applications for real-time and batch analytics In Detail Enterprise has been striving hard to deal with the challenges of data arriving in real time or near real time. Although there are technologies such as Storm and Spark (and many more) that solve the challenges of real-time data, using the appropriate technology\/framework for the right business use case is the key to success. This book provides you with the skills required to quickly design, implement and deploy your real-time analytics using real-world examples of big data use cases. From the beginning of the book, we will cover the basics of varied real-time data processing frameworks and technologies. We will discuss and explain the differences between batch and real-time processing in detail, and will also explore the techniques and programming concepts using Apache Storm. Moving on, we'll familiarize you with “Amazon Kinesis” for real-time data processing on cloud. We will further develop your understanding of real-time analytics through a comprehensive review of Apache Spark along with the high-level architecture and the building blocks of a Spark program. You will learn how to transform your data, get an output from transformations, and persist your results using Spark RDDs, using an interface called Spark SQL to work with Spark. At the end of this book, we will introduce Spark Streaming, the streaming library of Spark, and will walk you through the emerging Lambda Architecture (LA), which provides a hybrid platform for big data processing by combining real-time and precomputed batch data to provide a near real-time view of incoming data. Style and approach This step-by-step is an easy-to-follow, detailed tutorial, filled with practical examples of basic and advanced features. Each topic is explained sequentially and supported by real-world examples and executable code snippets.","language":"en","currency":"USD","id":"1784397407","title":"Real-Time Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1VlLDAAAQBAJ&source=gbs_api","authors":["Sumit Gupta","Shilpi,"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sbpmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":132,"subtitle":"Trends and Challenges","description":"The topic of NoSQL databases has recently emerged, to face the Big Data challenge, namely the ever increasing volume of data to be handled. It is now recognized that relational databases are not appropriate in this context, implying that new database models and techniques are needed. This book presents recent research works, covering the following basic aspects: semantic data management, graph databases, and big data management in cloud environments. The chapters in this book report on research about the evolution of basic concepts such as data models, query languages, and new challenges regarding implementation issues.","language":"en","currency":"USD","id":"1119544130","title":"NoSQL Data Models","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sbpmDwAAQBAJ&source=gbs_api","authors":["Olivier Pivert"]},{"pageCount":141,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q6xPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A practitioners guide to choosing relevant Big Data architecture","description":"This book highlights the different types of data architecture and illustrates the many possibilities hidden behind the term \"Big Data\", from the usage of No-SQL databases to the deployment of stream analytics architecture, machine learning, and governance. Scalable Big Data Architecture covers real-world, concrete industry use cases that leverage complex distributed applications , which involve web applications, RESTful API, and high throughput of large amount of data stored in highly scalable No-SQL data stores such as Couchbase and Elasticsearch. This book demonstrates how data processing can be done at scale from the usage of NoSQL datastores to the combination of Big Data distribution. When the data processing is too complex and involves different processing topology like long running jobs, stream processing, multiple data sources correlation, and machine learning, it’s often necessary to delegate the load to Hadoop or Spark and use the No-SQL to serve processed data in real time. This book shows you how to choose a relevant combination of big data technologies available within the Hadoop ecosystem. It focuses on processing long jobs, architecture, stream data patterns, log analysis, and real time analytics. Every pattern is illustrated with practical examples, which use the different open sourceprojects such as Logstash, Spark, Kafka, and so on. Traditional data infrastructures are built for digesting and rendering data synthesis and analytics from large amount of data. This book helps you to understand why you should consider using machine learning algorithms early on in the project, before being overwhelmed by constraints imposed by dealing with the high throughput of Big data. Scalable Big Data Architecture is for developers, data architects, and data scientists looking for a better understanding of how to choose the most relevant pattern for a Big Data project and which tools to integrate into that pattern.","language":"en","currency":"USD","id":"1484213262","title":"Scalable Big Data Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q6xPCwAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=irZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Get up and running with the fundamentals and functionalities of seven of the most popular NoSQL databases","description":"A beginner's guide to get you up and running with Cassandra, DynamoDB, HBase, InfluxDB, MongoDB, Neo4j, and Redis Key Features Covers the basics of 7 NoSQL databases and how they are used in the enterprises Quick introduction to MongoDB, DynamoDB, Redis, Cassandra, Neo4j, InfluxDB, and HBase Includes effective techniques for database querying and management Book Description This is the golden age of open source NoSQL databases. With enterprises having to work with large amounts of unstructured data and moving away from expensive monolithic architecture, the adoption of NoSQL databases is rapidly increasing. Being familiar with the popular NoSQL databases and knowing how to use them is a must for budding DBAs and developers. This book introduces you to the different types of NoSQL databases and gets you started with seven of the most popular NoSQL databases used by enterprises today. We start off with a brief overview of what NoSQL databases are, followed by an explanation of why and when to use them. The book then covers the seven most popular databases in each of these categories: MongoDB, Amazon DynamoDB, Redis, HBase, Cassandra, InfluxDB, and Neo4j. The book doesn't go into too much detail about each database but teaches you enough to get started with them. By the end of this book, you will have a thorough understanding of the different NoSQL databases and their functionalities, empowering you to select and use the right database according to your needs. What you will learn Understand how MongoDB provides high-performance, high-availability, and automatic scaling Interact with your Neo4j instances via database queries, Python scripts, and Java application code Get familiar with common querying and programming methods to interact with Redis Study the different types of problems Cassandra can solve Work with HBase components to support common operations such as creating tables and reading\/writing data Discover data models and work with CRUD operations using DynamoDB Discover what makes InfluxDB a great choice for working with time-series data Who this book is for If you are a budding DBA or a developer who wants to get started with the fundamentals of NoSQL databases, this book is for you. Relational DBAs who want to get insights into the various offerings of popular NoSQL databases will also find this book to be very useful.","language":"en","currency":"USD","id":"1787127141","title":"Seven NoSQL Databases in a Week","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=irZTDwAAQBAJ&source=gbs_api","authors":["Xun (Brian) Wu","Sudarshan Kadambi","Devram Kandhare","Aaron Ploetz"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=s-nUDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Utilize R to uncover hidden patterns in your Big Data About This Book Perform computational analyses on Big Data to generate meaningful results Get a practical knowledge of R programming language while working on Big Data platforms like Hadoop, Spark, H2O and SQL\/NoSQL databases, Explore fast, streaming, and scalable data analysis with the most cutting-edge technologies in the market Who This Book Is For This book is intended for Data Analysts, Scientists, Data Engineers, Statisticians, Researchers, who want to integrate R with their current or future Big Data workflows. It is assumed that readers have some experience in data analysis and understanding of data management and algorithmic processing of large quantities of data, however they may lack specific skills related to R. What You Will Learn Learn about current state of Big Data processing using R programming language and its powerful statistical capabilities Deploy Big Data analytics platforms with selected Big Data tools supported by R in a cost-effective and time-saving manner Apply the R language to real-world Big Data problems on a multi-node Hadoop cluster, e.g. electricity consumption across various socio-demographic indicators and bike share scheme usage Explore the compatibility of R with Hadoop, Spark, SQL and NoSQL databases, and H2O platform In Detail Big Data analytics is the process of examining large and complex data sets that often exceed the computational capabilities. R is a leading programming language of data science, consisting of powerful functions to tackle all problems related to Big Data processing. The book will begin with a brief introduction to the Big Data world and its current industry standards. With introduction to the R language and presenting its development, structure, applications in real world, and its shortcomings. Book will progress towards revision of major R functions for data management and transformations. Readers will be introduce to Cloud based Big Data solutions (e.g. Amazon EC2 instances and Amazon RDS, Microsoft Azure and its HDInsight clusters) and also provide guidance on R connectivity with relational and non-relational databases such as MongoDB and HBase etc. It will further expand to include Big Data tools such as Apache Hadoop ecosystem, HDFS and MapReduce frameworks. Also other R compatible tools such as Apache Spark, its machine learning library Spark MLlib, as well as H2O. Style and approach This book will serve as a practical guide to tackling Big Data problems using R programming language and its statistical environment. Each section of the book will present you with concise and easy-to-follow steps on how to process, transform and analyse large data sets.","language":"en","currency":"USD","id":"1786463725","title":"Big Data Analytics with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=s-nUDQAAQBAJ&source=gbs_api","authors":["Simon Walkowiak"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kJ8ygww4E14C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":52,"subtitle":null,"description":"Transform Big Data into Insight \"In this book, some of Oracle's best engineers and architects explain how you can make use of big data. They'll tell you how you can integrate your existing Oracle solutions with big data systems, using each where appropriate and moving data between them as needed.\" -- Doug Cutting, co-creator of Apache Hadoop Cowritten by members of Oracle's big data team, Oracle Big Data Handbook provides complete coverage of Oracle's comprehensive, integrated set of products for acquiring, organizing, analyzing, and leveraging unstructured data. The book discusses the strategies and technologies essential for a successful big data implementation, including Apache Hadoop, Oracle Big Data Appliance, Oracle Big Data Connectors, Oracle NoSQL Database, Oracle Endeca, Oracle Advanced Analytics, and Oracle's open source R offerings. Best practices for migrating from legacy systems and integrating existing data warehousing and analytics solutions into an enterprise big data infrastructure are also included in this Oracle Press guide. Understand the value of a comprehensive big data strategy Maximize the distributed processing power of the Apache Hadoop platform Discover the advantages of using Oracle Big Data Appliance as an engineered system for Hadoop and Oracle NoSQL Database Configure, deploy, and monitor Hadoop and Oracle NoSQL Database using Oracle Big Data Appliance Integrate your existing data warehousing and analytics infrastructure into a big data architecture Share data among Hadoop and relational databases using Oracle Big Data Connectors Understand how Oracle NoSQL Database integrates into the Oracle Big Data architecture Deliver faster time to value using in-database analytics Analyze data with Oracle Advanced Analytics (Oracle R Enterprise and Oracle Data Mining), Oracle R Distribution, ROracle, and Oracle R Connector for Hadoop Analyze disparate data with Oracle Endeca Information Discovery Plan and implement a big data governance strategy and develop an architecture and roadmap","language":"en","currency":"USD","id":"0071827277","title":"Oracle Big Data Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kJ8ygww4E14C&source=gbs_api","authors":["Tom Plunkett","Brian Macdonald","Bruce Nelson","Mark Hornick","Helen Sun","Khader Mohiuddin","Debra Harding","Gokula Mishra","Robert Stackowiak","Keith Laker","David Segleau"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gAJiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":45.6,"subtitle":"The Practical Guide to Storing, Managing and Analyzing Big and Small Data","description":"This comprehensive textbook teaches the fundamentals of database design, modeling, systems, data storage, and the evolving world of data warehousing, governance and more. Written by experienced educators and experts in big data, analytics, data quality, and data integration, it provides an up-to-date approach to database management. This full-color, illustrated text has a balanced theory-practice focus, covering essential topics, from established database technologies to recent trends, like Big Data, NoSQL, and more. Fundamental concepts are supported by real-world examples, query and code walkthroughs, and figures, making it perfect for introductory courses for advanced undergraduates and graduate students in information systems or computer science. These examples are further supported by an online playground with multiple learning environments, including MySQL; MongoDB; Neo4j Cypher; and tree structure visualization. This combined learning approach connects key concepts throughout the text to the important, practical tools to get started in database management.","language":"en","currency":"USD","id":"1316946754","title":"Principles of Database Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gAJiDwAAQBAJ&source=gbs_api","authors":["Wilfried Lemahieu","Seppe vanden Broucke","Bart Baesens"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HjhPAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"Real-Time Big Data Management for the Enterprise","description":"Master Oracle NoSQL Database Enable highly reliable, scalable, and available data. Oracle NoSQL Database: Real-Time Big Data Management for the Enterprise shows you how to take full advantage of this cost-effective solution for storing, retrieving, and updating high-volume, unstructured data. The book covers installation, configuration, application development, capacity planning and sizing, and integration with other enterprise data center products. Real-world examples illustrate the concepts presented in this Oracle Press guide. Understand Oracle NoSQL Database architecture and the underlying data storage engine, Oracle Berkeley DB Install and configure Oracle NoSQL Database for optimal performance Develop complex, distributed applications using a rich set of APIs Read and write data into the Oracle NoSQL Database key-value store Apply an Avro schema to the value portion of the key-value pair using Avro bindings Learn best practices for capacity planning and sizing an enterpriselevel Oracle NoSQL Database deployment Integrate Oracle NoSQL Database with Oracle Database, Oracle Event Processing, and Hadoop Code examples from the book are available for download at www.OraclePressBooks.com.","language":"en","currency":"USD","id":"0071816542","title":"Oracle NoSQL Database","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HjhPAgAAQBAJ&source=gbs_api","authors":["Maqsood Alam","Aalok Muley","Chaitanya Kadaru","Ashok Joshi"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oPiT-V2eYTsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"As with all Packt books this guide will use practical examples to impart information to the reader. Getting Started with NoSQL is a great resource for someone starting with NoSQL and an indispensable guide for technology decision makers. It is assumed that you have a background in RDBMS modeling and SQL and have had exposure to at least one of the programming languages - Java or JavaScript.","language":"en","currency":"USD","id":"1849694990","title":"Getting Started with Nosql","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oPiT-V2eYTsC&source=gbs_api","authors":["Gaurav Vaish"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BM_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"For SQL, NoSQL, Cloud and Distributed Databases","description":"Advanced data management has always been at the core of efficient database and information systems. Recent trends like big data and cloud computing have aggravated the need for sophisticated and flexible data storage and processing solutions. This book provides a comprehensive coverage of the principles of data management developed in the last decades with a focus on data structures and query languages. It treats a wealth of different data models and surveys the foundations of structuring, processing, storing and querying data according these models. Starting off with the topic of database design, it further discusses weaknesses of the relational data model, and then proceeds to convey the basics of graph data, tree-structured XML data, key-value pairs and nested, semi-structured JSON data, columnar and record-oriented data as well as object-oriented data. The final chapters round the book off with an analysis of fragmentation, replication and consistency strategies for data management in distributed databases as well as recommendations for handling polyglot persistence in multi-model databases and multi-database architectures. While primarily geared towards students of Master-level courses in Computer Science and related areas, this book may also be of benefit to practitioners looking for a reference book on data modeling and query processing. It provides both theoretical depth and a concise treatment of open source technologies currently on the market.","language":"en","currency":"USD","id":"3110433079","title":"Advanced Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BM_CwAAQBAJ&source=gbs_api","authors":["Lena Wiese"]},{"pageCount":249,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7iI3CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Architecting, Developing, and Administering MongoDB","description":"The \"one-size-fits-all\" thinking regarding traditional RDBMSs has been challenged in the last few years by the emergence of diversified NoSQL databases. More than 120 NoSQL databases are now available in the market, and the market leader by far is MongoDB. With so many companies opting for MongoDB as their NoSQL database of choice, there's a need for a practical how-to combined with expert advice for getting the most out of the software. Beginning with a short introduction to the basics of NoSQL databases, MongoDB experts Navin Sabharwal and Shankatala Gupta Edward introduce readers to MongoDB – the leading document based NoSQL database, acquainting them step by step with all aspects of MongoDB. They cover the data model, underlying architecture, how to code using Mongo Shell, and administration of the MongoDB platform, among other topics. The book also provides clear guidelines and practical examples for architecting and developing applications using the MongoDB platform and deploying them. Database developers, architects, and database administrators will find useful information covering all aspects of the MongoDB platform and how to put it to use practically. Practical Guide to MongoDB provides readers with: A solid understanding of NoSQL databases An understanding of how to get started with MongoDB Methodical coverage of the architecture, development, and administration of MongoDB A plethora of \"How to’s\" enabling you to use the technology most efficiently to solve the problems you face Practical MongoDB is for those just starting to learning to work with NoSQL databases in general and MongoDB in particular. Skills in these areas are in demand, making this book essential reading for those who want to work more productively or break into big data work. It will prove equally useful for entrepreneurs and others who like to work with new tech nologies.","language":"en","currency":"USD","id":"1484206479","title":"Practical MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7iI3CwAAQBAJ&source=gbs_api","authors":["Shakuntala Gupta Edward","Navin Sabharwal"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jugCDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.95,"subtitle":"Visualize Structure and Meaning","description":"Master a graph data modeling technique superior to traditional data modeling for both relational and NoSQL databases (graph, document, key-value, and column), leveraging cognitive psychology to improve big data designs. From Karen Lopez’s Foreword: In this book, Thomas Frisendal raises important questions about the continued usefulness of traditional data modeling notations and approaches: Are Entity Relationship Diagrams (ERDs) relevant to analytical data requirements? Are ERDs relevant in the new world of Big Data? Are ERDs still the best way to work with business users to understand their needs? Are Logical and Physical Data Models too closely coupled? Are we correct in using the same notations for communicating with business users and developers? Should we refine our existing notations and tools to meet these new needs, or should we start again from a blank page? What new notations and approaches will we need? How will we use those to build enterprise database systems? Frisendal takes us through the history of data modeling, enterprise data models and traditional modeling methods. He points out, quite contentiously, where he feels we have gone wrong and in a few places where we got it right. He then maps out the psychology of meaning and context, while identifying important issues about where data modeling may or may not fit in business modeling. The main subject of this work is a proposal for a new exploration-driven modeling approach and new modeling notations for business concept models, business solutions models, and physical data models with examples on how to leverage those for implementing into any target database or datastore. These new notations are based on a property graph approach to modeling data.","language":"en","currency":"USD","id":"1634621239","title":"Graph Data Modeling for NoSQL and SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jugCDQAAQBAJ&source=gbs_api","authors":["Thomas Frisendal"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UmzQCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Bringing Together Data, Semantics, and Software","description":"How do we design for data when traditional design techniques cannot extend to new database technologies? In this era of big data and the Internet of Things, it is essential that we have the tools we need to understand the data coming to us faster than ever before, and to design databases and data processing systems that can adapt easily to ever-changing data schemas and ever-changing business requirements. There must be no intellectual disconnect between data and the software that manages it. It must be possible to extract meaning and knowledge from data to drive artificial intelligence applications. Novel NoSQL data organization techniques must be used side-by-side with traditional SQL databases. Are existing data modeling techniques ready for all of this? The Concept and Object Modeling Notation (COMN) is able to cover the full spectrum of analysis and design. A single COMN model can represent the objects and concepts in the problem space, logical data design, and concrete NoSQL and SQL document, key-value, columnar, and relational database implementations. COMN models enable an unprecedented level of traceability of requirements to implementation. COMN models can also represent the static structure of software and the predicates that represent the patterns of meaning in databases. This book will teach you: the simple and familiar graphical notation of COMN with its three basic shapes and four line styles how to think about objects, concepts, types, and classes in the real world, using the ordinary meanings of English words that aren’t tangled with confused techno-speak how to express logical data designs that are freer from implementation considerations than is possible in any other notation how to understand key-value, document, columnar, and table-oriented database designs in logical and physical terms how to use COMN to specify physical database implementations in any NoSQL or SQL database with the precision necessary for model-driven development","language":"en","currency":"USD","id":"1634621115","title":"NoSQL and SQL Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UmzQCwAAQBAJ&source=gbs_api","authors":["Ted Hills"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pF9dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Complete guide to automating Big Data solutions using Artificial Intelligence techniques","description":"Build next-generation Artificial Intelligence systems with Java Key Features Implement AI techniques to build smart applications using Deeplearning4j Perform big data analytics to derive quality insights using Spark MLlib Create self-learning systems using neural networks, NLP, and reinforcement learning Book Description In this age of big data, companies have larger amount of consumer data than ever before, far more than what the current technologies can ever hope to keep up with. However, Artificial Intelligence closes the gap by moving past human limitations in order to analyze data. With the help of Artificial Intelligence for big data, you will learn to use Machine Learning algorithms such as k-means, SVM, RBF, and regression to perform advanced data analysis. You will understand the current status of Machine and Deep Learning techniques to work on Genetic and Neuro-Fuzzy algorithms. In addition, you will explore how to develop Artificial Intelligence algorithms to learn from data, why they are necessary, and how they can help solve real-world problems. By the end of this book, you'll have learned how to implement various Artificial Intelligence algorithms for your big data systems and integrate them into your product offerings such as reinforcement learning, natural language processing, image recognition, genetic algorithms, and fuzzy logic systems. What you will learn Manage Artificial Intelligence techniques for big data with Java Build smart systems to analyze data for enhanced customer experience Learn to use Artificial Intelligence frameworks for big data Understand complex problems with algorithms and Neuro-Fuzzy systems Design stratagems to leverage data using Machine Learning process Apply Deep Learning techniques to prepare data for modeling Construct models that learn from data using open source tools Analyze big data problems using scalable Machine Learning algorithms Who this book is for This book is for you if you are a data scientist, big data professional, or novice who has basic knowledge of big data and wish to get proficiency in Artificial Intelligence techniques for big data. Some competence in mathematics is an added advantage in the field of elementary linear algebra and calculus.","language":"en","currency":"USD","id":"1788476018","title":"Artificial Intelligence for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pF9dDwAAQBAJ&source=gbs_api","authors":["Anand Deshpande","Manish Kumar"]},{"pageCount":123,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rrkBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Big Data Scalability Series","description":"Get Started Scaling Your Database Infrastructure for High-Volume Big Data Applications “Understanding Big Data Scalability presents the fundamentals of scaling databases from a single node to large clusters. It provides a practical explanation of what ‘Big Data’ systems are, and fundamental issues to consider when optimizing for performance and scalability. Cory draws on many years of experience to explain issues involved in working with data sets that can no longer be handled with single, monolithic relational databases.... His approach is particularly relevant now that relational data models are making a comeback via SQL interfaces to popular NoSQL databases and Hadoop distributions.... This book should be especially useful to database practitioners new to scaling databases beyond traditional single node deployments.” —Brian O’Krafka, software architect Understanding Big Data Scalability presents a solid foundation for scaling Big Data infrastructure and helps you address each crucial factor associated with optimizing performance in scalable and dynamic Big Data clusters. Database expert Cory Isaacson offers practical, actionable insights for every technical professional who must scale a database tier for high-volume applications. Focusing on today’s most common Big Data applications, he introduces proven ways to manage unprecedented data growth from widely diverse sources and to deliver real-time processing at levels that were inconceivable until recently. Isaacson explains why databases slow down, reviews each major technique for scaling database applications, and identifies the key rules of database scalability that every architect should follow. You’ll find insights and techniques proven with all types of database engines and environments, including SQL, NoSQL, and Hadoop. Two start-to-finish case studies walk you through planning and implementation, offering specific lessons for formulating your own scalability strategy. Coverage includes Understanding the true causes of database performance degradation in today’s Big Data environments Scaling smoothly to petabyte-class databases and beyond Defining database clusters for maximum scalability and performance Integrating NoSQL or columnar databases that aren’t “drop-in” replacements for RDBMSes Scaling application components: solutions and options for each tier Recognizing when to scale your data tier—a decision with enormous consequences for your application environment Why data relationships may be even more important in non-relational databases Why virtually every database scalability implementation still relies on sharding, and how to choose the best approach How to set clear objectives for architecting high-performance Big Data implementations The Big Data Scalability Series is a comprehensive, four-part series, containing information on many facets of database performance and scalability. Understanding Big Data Scalability is the first book in the series. Learn more and join the conversation about Big Data scalability at bigdatascalability.com.","language":"en","currency":"USD","id":"0133599094","title":"Understanding Big Data Scalability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rrkBBAAAQBAJ&source=gbs_api","authors":["Cory Isaacson"]},{"pageCount":271,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qy5nBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"11th European Workshop, EPEW 2014, Florence, Italy, September 11-12, 2014, Proceedings","description":"This book constitutes the proceedings of the 11th European Workshop on Performance Engineering, EPEW 2014, held in Florence, Italy, in September 2014. The 18 full papers presented in this volume were carefully reviewed and selected from 30 submissions. The papers are organized in topical sections named: cloud performance modelling; queueing and fluid models; performance of computation and programming; fitting; urban traffic modelling; decision making; and Markovian models, above and beyond.","language":"en","currency":"USD","id":"3319108859","title":"Computer Performance Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qy5nBAAAQBAJ&source=gbs_api","authors":["Andrs Horvth","Katinka Wolter"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kmlCAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Introduction to Large-Scale Data & Analytics","description":"Making Big Data Work: Real-World Use Cases and Examples, Practical Code, Detailed Solutions Large-scale data analysis is now vitally important to virtually every business. Mobile and social technologies are generating massive datasets; distributed cloud computing offers the resources to store and analyze them; and professionals have radically new technologies at their command, including NoSQL databases. Until now, however, most books on “Big Data” have been little more than business polemics or product catalogs. Data Just Right is different: It’s a completely practical and indispensable guide for every Big Data decision-maker, implementer, and strategist. Michael Manoochehri, a former Google engineer and data hacker, writes for professionals who need practical solutions that can be implemented with limited resources and time. Drawing on his extensive experience, he helps you focus on building applications, rather than infrastructure, because that’s where you can derive the most value. Manoochehri shows how to address each of today’s key Big Data use cases in a cost-effective way by combining technologies in hybrid solutions. You’ll find expert approaches to managing massive datasets, visualizing data, building data pipelines and dashboards, choosing tools for statistical analysis, and more. Throughout, the author demonstrates techniques using many of today’s leading data analysis tools, including Hadoop, Hive, Shark, R, Apache Pig, Mahout, and Google BigQuery. Coverage includes Mastering the four guiding principles of Big Data success—and avoiding common pitfalls Emphasizing collaboration and avoiding problems with siloed data Hosting and sharing multi-terabyte datasets efficiently and economically “Building for infinity” to support rapid growth Developing a NoSQL Web app with Redis to collect crowd-sourced data Running distributed queries over massive datasets with Hadoop, Hive, and Shark Building a data dashboard with Google BigQuery Exploring large datasets with advanced visualization Implementing efficient pipelines for transforming immense amounts of data Automating complex processing with Apache Pig and the Cascading Java library Applying machine learning to classify, recommend, and predict incoming information Using R to perform statistical analysis on massive datasets Building highly efficient analytics workflows with Python and Pandas Establishing sensible purchasing strategies: when to build, buy, or outsource Previewing emerging trends and convergences in scalable data technologies and the evolving role of the Data Scientist","language":"en","currency":"USD","id":"0133359077","title":"Data Just Right","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kmlCAgAAQBAJ&source=gbs_api","authors":["Michael Manoochehri"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wfnOBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Easy, Common-Sense Guide to Solving Real Problems with NoSQL The Mere Mortals  tutorials have earned worldwide praise as the clearest, simplest way to master essential database technologies. Now, there’s one for today’s exciting new NoSQL databases. NoSQL for Mere Mortals guides you through solving real problems with NoSQL and achieving unprecedented scalability, cost efficiency, flexibility, and availability. Drawing on 20+ years of cutting-edge database experience, Dan Sullivan explains the advantages, use cases, and terminology associated with all four main categories of NoSQL databases: key-value, document, column family, and graph databases. For each, he introduces pragmatic best practices for building high-value applications. Through step-by-step examples, you’ll discover how to choose the right database for each task, and use it the right way. Coverage includes --Getting started: What NoSQL databases are, how they differ from relational databases, when to use them, and when not to Data management principles and design criteria: Essential knowledge for creating any database solution, NoSQL or relational --Key-value databases: Gaining more utility from data structures --Document databases: Schemaless databases, normalization and denormalization, mutable documents, indexing, and design patterns --Column family databases: Google’s BigTable design, table design, indexing, partitioning, and Big Data Graph databases: Graph\/network modeling, design tips, query methods, and traps to avoid Whether you’re a database developer, data modeler, database user, or student, learning NoSQL can open up immense new opportunities. As thousands of database professionals already know, For Mere Mortals is the fastest, easiest route to mastery.","language":"en","currency":"USD","id":"0134029887","title":"NoSQL for Mere Mortals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wfnOBwAAQBAJ&source=gbs_api","authors":["Dan Sullivan"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3plGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the most out of the popular Java libraries and tools to perform efficient data analysis About This Book Get your basics right for data analysis with Java and make sense of your data through effective visualizations. Use various Java APIs and tools such as Rapidminer and WEKA for effective data analysis and machine learning. This is your companion to understanding and implementing a solid data analysis solution using Java Who This Book Is For If you are a student or Java developer or a budding data scientist who wishes to learn the fundamentals of data analysis and learn to perform data analysis with Java, this book is for you. Some familiarity with elementary statistics and relational databases will be helpful but is not mandatory, to get the most out of this book. A firm understanding of Java is required. What You Will Learn Develop Java programs that analyze data sets of nearly any size, including text Implement important machine learning algorithms such as regression, classification, and clustering Interface with and apply standard open source Java libraries and APIs to analyze and visualize data Process data from both relational and non-relational databases and from time-series data Employ Java tools to visualize data in various forms Understand multimedia data analysis algorithms and implement them in Java. In Detail Data analysis is a process of inspecting, cleansing, transforming, and modeling data with the aim of discovering useful information. Java is one of the most popular languages to perform your data analysis tasks. This book will help you learn the tools and techniques in Java to conduct data analysis without any hassle. After getting a quick overview of what data science is and the steps involved in the process, you'll learn the statistical data analysis techniques and implement them using the popular Java APIs and libraries. Through practical examples, you will also learn the machine learning concepts such as classification and regression. In the process, you'll familiarize yourself with tools such as Rapidminer and WEKA and see how these Java-based tools can be used effectively for analysis. You will also learn how to analyze text and other types of multimedia. Learn to work with relational, NoSQL, and time-series data. This book will also show you how you can utilize different Java-based libraries to create insightful and easy to understand plots and graphs. By the end of this book, you will have a solid understanding of the various data analysis techniques, and how to implement them using Java. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy-to-follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787286401","title":"Java Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3plGDwAAQBAJ&source=gbs_api","authors":["John R. Hubbard"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l_lmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":132,"subtitle":"Trends and Challenges","description":"The topic of NoSQL databases has recently emerged, to face the Big Data challenge, namely the ever increasing volume of data to be handled. It is now recognized that relational databases are not appropriate in this context, implying that new database models and techniques are needed. This book presents recent research works, covering the following basic aspects: semantic data management, graph databases, and big data management in cloud environments. The chapters in this book report on research about the evolution of basic concepts such as data models, query languages, and new challenges regarding implementation issues.","language":"en","currency":"USD","id":"1119544149","title":"NoSQL Data Models","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l_lmDwAAQBAJ&source=gbs_api","authors":["Olivier Pivert"]},{"pageCount":570,"thumbnail":"http:\/\/books.google.com\/books\/content?id=m95GAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":276,"subtitle":null,"description":"Clouds are being positioned as the next-generation consolidated, centralized, yet federated IT infrastructure for hosting all kinds of IT platforms and for deploying, maintaining, and managing a wider variety of personal, as well as professional applications and services. Handbook of Research on Cloud Infrastructures for Big Data Analytics focuses exclusively on the topic of cloud-sponsored big data analytics for creating flexible and futuristic organizations. This book helps researchers and practitioners, as well as business entrepreneurs, to make informed decisions and consider appropriate action to simplify and streamline the arduous journey towards smarter enterprises.","language":"en","currency":"USD","id":"1466658657","title":"Handbook of Research on Cloud Infrastructures for Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=m95GAwAAQBAJ&source=gbs_api","authors":["Raj, Pethuru"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FI3XBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Building Well-Designed and Supportable MongoDB Databases","description":"Congratulations! You completed the MongoDB application within the given tight timeframe and there is a party to celebrate your application’s release into production. Although people are congratulating you at the celebration, you are feeling some uneasiness inside. To complete the project on time required making a lot of assumptions about the data, such as what terms meant and how calculations are derived. In addition, the poor documentation about the application will be of limited use to the support team, and not investigating all of the inherent rules in the data may eventually lead to poorly-performing structures in the not-so-distant future. Now, what if you had a time machine and could go back and read this book. You would learn that even NoSQL databases like MongoDB require some level of data modeling. Data modeling is the process of learning about the data, and regardless of technology, this process must be performed for a successful application. You would learn the value of conceptual, logical, and physical data modeling and how each stage increases our knowledge of the data and reduces assumptions and poor design decisions. Read this book to learn how to do data modeling for MongoDB applications, and accomplish these five objectives: Understand how data modeling contributes to the process of learning about the data, and is, therefore, a required technique, even when the resulting database is not relational. That is, NoSQL does not mean NoDataModeling! Know how NoSQL databases differ from traditional relational databases, and where MongoDB fits. Explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts, and learn the basics of adding, querying, updating, and deleting data in MongoDB. Practice a streamlined, template-driven approach to performing conceptual, logical, and physical data modeling. Recognize that data modeling does not always have to lead to traditional data models! Distinguish top-down from bottom-up development approaches and complete a top-down case study which ties all of the modeling techniques together. This book is written for anyone who is working with, or will be working with MongoDB, including business analysts, data modelers, database administrators, developers, project managers, and data scientists. There are three sections: In Section I, Getting Started, we will reveal the power of data modeling and the tight connections to data models that exist when designing any type of database (Chapter 1), compare NoSQL with traditional relational databases and where MongoDB fits (Chapter 2), explore each MongoDB object and comprehend how each compares to their data modeling and traditional relational database counterparts (Chapter 3), and explain the basics of adding, querying, updating, and deleting data in MongoDB (Chapter 4). In Section II, Levels of Granularity, we cover Conceptual Data Modeling (Chapter 5), Logical Data Modeling (Chapter 6), and Physical Data Modeling (Chapter 7). Notice the “ing” at the end of each of these chapters. We focus on the process of building each of these models, which is where we gain essential business knowledge. In Section III, Case Study, we will explain both top down and bottom up development approaches and go through a top down case study where we start with business requirements and end with the MongoDB database. This case study will tie together all of the techniques in the previous seven chapters. Nike Senior Data Architect Ryan Smith wrote the foreword. Key points are included at the end of each chapter as a way to reinforce concepts. In addition, this book is loaded with hands-on exercises, along with their answers provided in Appendix A. Appendix B contains all of the book’s references and Appendix C contains a glossary of the terms used throughout the text.","language":"en","currency":"USD","id":"1634620410","title":"Data Modeling for MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FI3XBgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ErrLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":172,"subtitle":null,"description":"Business and medical professionals rely on large data sets to identify trends or other knowledge that can be gleaned from the collection of it. New technologies concentrate on data’s management, but do not facilitate users’ extraction of meaningful outcomes. Pattern and Data Analysis in Healthcare Settings investigates the approaches to shift computing from analysis on-demand to knowledge on-demand. By providing innovative tactics to apply data and pattern analysis, these practices are optimized into pragmatic sources of knowledge for healthcare professionals. This publication is an exhaustive source for policy makers, developers, business professionals, healthcare providers, and graduate students concerned with data retrieval and analysis.","language":"en","currency":"USD","id":"1522505377","title":"Pattern and Data Analysis in Healthcare Settings","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ErrLDAAAQBAJ&source=gbs_api","authors":["Tiwari, Vivek","Tiwari, Basant","Thakur, Ramjeevan Singh","Gupta, Shailendra"]},{"pageCount":60,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BsJADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Eine Einfhrung in relationale und nicht-relationale Datenbanken","description":"Das essential fhrt in Big Data ein und erlutert die wichtigsten Werkzeuge zur Nutzung von SQL- wie NoSQL-Technologien. Neben semantischer Datenmodellierung, Abfragesprachen, Konsistenzgewhrung mit ACID oder BASE werden NoSQL-Datenbanken vorgestellt und organisatorische Aspekte des Datenmanagements erlutert. Der Leser erhlt mit diesem Kompendium die wichtigsten Grundlagen sowohl zu SQL- wie auch zu NoSQL-Datenbanken.","language":"de","currency":"USD","id":"3658203374","title":"Werkzeuge der digitalen Wirtschaft: Big Data, NoSQL & Co.","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BsJADwAAQBAJ&source=gbs_api","authors":["Andreas Meier"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vVOiDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":156,"subtitle":null,"description":"“Big data” has become a commonly used term to describe large-scale and complex data sets which are difficult to manage and analyze using standard data management methodologies. With applications across sectors and fields of study, the implementation and possible uses of big data are limitless. Effective Big Data Management and Opportunities for Implementation explores emerging research on the ever-growing field of big data and facilitates further knowledge development on methods for handling and interpreting large data sets. Providing multi-disciplinary perspectives fueled by international research, this publication is designed for use by data analysts, IT professionals, researchers, and graduate-level students interested in learning about the latest trends and concepts in big data.","language":"en","currency":"USD","id":"1522501835","title":"Effective Big Data Management and Opportunities for Implementation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vVOiDAAAQBAJ&source=gbs_api","authors":["Singh, Manoj Kumar","G., Dileep Kumar"]},{"pageCount":84,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5_88BpVaMPkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Extreme Scalability at Your Fingertips","description":"CouchDB is a new breed of database for the Internet, geared to meet the needs of today’s dynamic web applications. With this concise introduction, you’ll learn how CouchDB’s simple model for storing, processing, and accessing data makes it ideal for the type of data and rapid response users now demand from your applications—and how easy CouchDB is to set up, deploy, maintain, and scale. The code-packed examples in this book will help you learn how to work with documents, populate a simple database, replicate data from one database to another, and a host of other tasks. Install CouchDB on Linux, Mac OS X, Windows, or (if you must) from the source code Interact with data through CouchDB’s RESTful API, and use standard HTTP operations, such as PUT, GET, POST, and DELETE Use Futon—CouchDB’s web-based interface— to manage databases and documents, and to configure replications Learn how to create, update, and delete documents in JSON format, and how to create and delete databases Work with design documents to get the formatting and indexing your application requires","language":"en","currency":"USD","id":"1449329578","title":"Getting Started with CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5_88BpVaMPkC&source=gbs_api","authors":["MC Brown"]},{"pageCount":303,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iNhCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":"A Roadmap for Usage and Exploitation of Big Data in Europe","description":"In this book readers will find technological discussions on the existing and emerging technologies across the different stages of the big data value chain. They will learn about legal aspects of big data, the social impact, and about education needs and requirements. And they will discover the business perspective and how big data technology can be exploited to deliver value within different sectors of the economy. The book is structured in four parts: Part I “The Big Data Opportunity” explores the value potential of big data with a particular focus on the European context. It also describes the legal, business and social dimensions that need to be addressed, and briefly introduces the European Commission’s BIG project. Part II “The Big Data Value Chain” details the complete big data lifecycle from a technical point of view, ranging from data acquisition, analysis, curation and storage, to data usage and exploitation. Next, Part III “Usage and Exploitation of Big Data” illustrates the value creation possibilities of big data applications in various sectors, including industry, healthcare, finance, energy, media and public services. Finally, Part IV “A Roadmap for Big Data Research” identifies and prioritizes the cross-sectorial requirements for big data research, and outlines the most urgent and challenging technological, economic, political and societal issues for big data in Europe. This compendium summarizes more than two years of work performed by a leading group of major European research centers and industries in the context of the BIG project. It brings together research findings, forecasts and estimates related to this challenging technological context that is becoming the major axis of the new digitally transformed business environment.","language":"en","currency":"USD","id":"3319215698","title":"New Horizons for a Data-Driven Economy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iNhCDwAAQBAJ&source=gbs_api","authors":["Jos Mara Cavanillas","Edward Curry","Wolfgang Wahlster"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FonwCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is perfect for developers, analysts, architects or managers who would like to perform big data analytics with Hadoop for the financial sector. This book is also helpful for technology professionals from other industry sectors who have recently switched or like to switch their business domain to financial sector. Familiarity with big data, Java programming, database and data warehouse, and business intelligence would be beneficial.","language":"en","currency":"USD","id":"178439632X","title":"Hadoop for Finance Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FonwCAAAQBAJ&source=gbs_api","authors":["Rajiv Tiwari"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FonwCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is perfect for developers, analysts, architects or managers who would like to perform big data analytics with Hadoop for the financial sector. This book is also helpful for technology professionals from other industry sectors who have recently switched or like to switch their business domain to financial sector. Familiarity with big data, Java programming, database and data warehouse, and business intelligence would be beneficial.","language":"en","currency":"USD","id":"178439632X","title":"Hadoop for Finance Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FonwCAAAQBAJ&source=gbs_api","authors":["Rajiv Tiwari"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OHg5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Explore the power of distributed computing to write concurrent, scalable applications in Java About This Book Make the best of Java 9 features to write succinct code Handle large amounts of data using HPC Make use of AWS and Google App Engine along with Java to establish a powerful remote computation system Who This Book Is For This book is for basic to intermediate level Java developers who is aware of object-oriented programming and Java basic concepts. What You Will Learn Understand the basic concepts of parallel and distributed computing\/programming Achieve performance improvement using parallel processing, multithreading, concurrency, memory sharing, and hpc cluster computing Get an in-depth understanding of Enterprise Messaging concepts with Java Messaging Service and Web Services in the context of Enterprise Integration Patterns Work with Distributed Database technologies Understand how to develop and deploy a distributed application on different cloud platforms including Amazon Web Service and Docker CaaS Concepts Explore big data technologies Effectively test and debug distributed systems Gain thorough knowledge of security standards for distributed applications including two-way Secure Socket Layer In Detail Distributed computing is the concept with which a bigger computation process is accomplished by splitting it into multiple smaller logical activities and performed by diverse systems, resulting in maximized performance in lower infrastructure investment. This book will teach you how to improve the performance of traditional applications through the usage of parallelism and optimized resource utilization in Java 9. After a brief introduction to the fundamentals of distributed and parallel computing, the book moves on to explain different ways of communicating with remote systems\/objects in a distributed architecture. You will learn about asynchronous messaging with enterprise integration and related patterns, and how to handle large amount of data using HPC and implement distributed computing for databases. Moving on, it explains how to deploy distributed applications on different cloud platforms and self-contained application development. You will also learn about big data technologies and understand how they contribute to distributed computing. The book concludes with the detailed coverage of testing, debugging, troubleshooting, and security aspects of distributed applications so the programs you build are robust, efficient, and secure. Style and approach This is a step-by-step practical guide with real-world examples.","language":"en","currency":"USD","id":"1787122735","title":"Distributed Computing in Java 9","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OHg5DwAAQBAJ&source=gbs_api","authors":["Raja Malleswara Rao Pattamsetti"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O4wwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"19th International Conference, DaWaK 2017, Lyon, France, August 28–31, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 19th International Conference on Big Data Analytics and Knowledge Discovery, DaWaK 2017, held in Lyon, France, in August 2017. The 24 revised full papers and 11 short papers presented were carefully reviewed and selected from 97 submissions. The papers are organized in the following topical sections: new generation data warehouses design; cloud and NoSQL databases; advanced programming paradigms; non-functional requirements satisfaction; machine learning; social media and twitter analysis; sentiment analysis and user influence; knowledge discovery; and data flow management and optimization.","language":"en","currency":"USD","id":"3319642839","title":"Big Data Analytics and Knowledge Discovery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O4wwDwAAQBAJ&source=gbs_api","authors":["Ladjel Bellatreche","Sharma Chakravarthy"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tJm2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":null,"description":"This book provides a comprehensive survey of techniques, technologies and applications of Big Data and its analysis. The Big Data phenomenon is increasingly impacting all sectors of business and industry, producing an emerging new information ecosystem. On the applications front, the book offers detailed descriptions of various application areas for Big Data Analytics in the important domains of Social Semantic Web Mining, Banking and Financial Services, Capital Markets, Insurance, Advertisement, Recommendation Systems, Bio-Informatics, the IoT and Fog Computing, before delving into issues of security and privacy. With regard to machine learning techniques, the book presents all the standard algorithms for learning – including supervised, semi-supervised and unsupervised techniques such as clustering and reinforcement learning techniques to perform collective Deep Learning. Multi-layered and nonlinear learning for Big Data are also covered. In turn, the book highlights real-life case studies on successful implementations of Big Data Analytics at large IT companies such as Google, Facebook, LinkedIn and Microsoft. Multi-sectorial case studies on domain-based companies such as Deutsche Bank, the power provider Opower, Delta Airlines and a Chinese City Transportation application represent a valuable addition. Given its comprehensive coverage of Big Data Analytics, the book offers a unique resource for undergraduate and graduate students, researchers, educators and IT professionals alike.","language":"en","currency":"USD","id":"9811500940","title":"Big Data Analytics: Systems, Algorithms, Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tJm2DwAAQBAJ&source=gbs_api","authors":["C.S.R. Prabhu","Aneesh Sreevallabh Chivukula","Aditya Mogadala","Rohit Ghosh","L.M. Jenila Livingston"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NAGzCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book is aimed at developers, designers, and architects who would like to build big data enterprise search solutions for their customers or organizations. No prior knowledge of Apache Hadoop and Apache Solr\/Lucene technologies is required.","language":"en","currency":"USD","id":"1783553405","title":"Scaling Big Data with Hadoop and Solr - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NAGzCAAAQBAJ&source=gbs_api","authors":["Hrishikesh Vijay Karambelkar"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t2dBlNfKk6gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Practical Use Cases with the Leading NoSQL Database","description":"Whether you’re building a social media site or an internal-use enterprise application, this hands-on guide shows you the connection between MongoDB and the business problems it’s designed to solve. You’ll learn how to apply MongoDB design patterns to several challenging domains, such as ecommerce, content management, and online gaming. Using Python and JavaScript code examples, you’ll discover how MongoDB lets you scale your data model while simplifying the development process. Many businesses launch NoSQL databases without understanding the techniques for using their features most effectively. This book demonstrates the benefits of document embedding, polymorphic schemas, and other MongoDB patterns for tackling specific big data use cases, including: Operational intelligence: Perform real-time analytics of business data Ecommerce: Use MongoDB as a product catalog master or inventory management system Content management: Learn methods for storing content nodes, binary assets, and discussions Online advertising networks: Apply techniques for frequency capping ad impressions, and keyword targeting and bidding Social networking: Learn how to store a complex social graph, modeled after Google+ Online gaming: Provide concurrent access to character and world data for a multiplayer role-playing game","language":"en","currency":"USD","id":"1449340075","title":"MongoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t2dBlNfKk6gC&source=gbs_api","authors":["Rick Copeland"]},{"pageCount":895,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SsQ2DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":215.2,"subtitle":null,"description":"This handbook offers comprehensive coverage of recent advancements in Big Data technologies and related paradigms. Chapters are authored by international leading experts in the field, and have been reviewed and revised for maximum reader value. The volume consists of twenty-five chapters organized into four main parts. Part one covers the fundamental concepts of Big Data technologies including data curation mechanisms, data models, storage models, programming models and programming platforms. It also dives into the details of implementing Big SQL query engines and big stream processing systems. Part Two focuses on the semantic aspects of Big Data management including data integration and exploratory ad hoc analysis in addition to structured querying and pattern matching techniques. Part Three presents a comprehensive overview of large scale graph processing. It covers the most recent research in large scale graph processing platforms, introducing several scalable graph querying and mining mechanisms in domains such as social networks. Part Four details novel applications that have been made possible by the rapid emergence of Big Data technologies such as Internet-of-Things (IOT), Cognitive Computing and SCADA Systems. All parts of the book discuss open research problems, including potential opportunities, that have arisen from the rapid progress of Big Data technologies and the associated increasing requirements of application domains. Designed for researchers, IT professionals and graduate students, this book is a timely contribution to the growing Big Data field. Big Data has been recognized as one of leading emerging technologies that will have a major contribution and impact on the various fields of science and varies aspect of the human society over the coming decades. Therefore, the content in this book will be an essential tool to help readers understand the development and future of the field.","language":"en","currency":"USD","id":"331949340X","title":"Handbook of Big Data Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SsQ2DgAAQBAJ&source=gbs_api","authors":["Albert Y. Zomaya","Sherif Sakr"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wJApAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Let Hadoop For Dummies help harness the power of yourdata and rein in the information overload Big data has become big business, and companies and organizationsof all sizes are struggling to find ways to retrieve valuableinformation from their massive data sets with becoming overwhelmed.Enter Hadoop and this easy-to-understand For Dummiesguide. Hadoop For Dummies helps readers understand thevalue of big data, make a business case for using Hadoop, navigatethe Hadoop ecosystem, and build and manage Hadoop applications andclusters. Explains the origins of Hadoop, its economic benefits, and itsfunctionality and practical applications Helps you find your way around the Hadoop ecosystem, programMapReduce, utilize design patterns, and get your Hadoop cluster upand running quickly and easily Details how to use Hadoop applications for data mining, webanalytics and personalization, large-scale text processing, datascience, and problem-solving Shows you how to improve the value of your Hadoop cluster,maximize your investment in Hadoop, and avoid common pitfalls whenbuilding your Hadoop cluster From programmers challenged with building and maintainingaffordable, scaleable data systems to administrators who must dealwith huge volumes of information effectively and efficiently, thishow-to has something to help you with Hadoop.","language":"en","currency":"USD","id":"1118652207","title":"Hadoop For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wJApAgAAQBAJ&source=gbs_api","authors":["Dirk deRoos"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XPkAEFXo7VgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Find the right big data solution for your business ororganization Big data management is one of the major challenges facingbusiness, industry, and not-for-profit organizations. Data setssuch as customer transactions for a mega-retailer, weather patternsmonitored by meteorologists, or social network activity can quicklyoutpace the capacity of traditional data management tools. If youneed to develop or manage big data solutions, you'll appreciate howthese four experts define, explain, and guide you through this newand often confusing concept. You'll learn what it is, why itmatters, and how to choose and implement solutions that work. Effectively managing big data is an issue of growing importanceto businesses, not-for-profit organizations, government, and ITprofessionals Authors are experts in information management, big data, and avariety of solutions Explains big data in detail and discusses how to select andimplement a solution, security concerns to consider, data storageand presentation issues, analytics, and much more Provides essential information in a no-nonsense,easy-to-understand style that is empowering Big Data For Dummies cuts through the confusion and helpsyou take charge of big data solutions for your organization.","language":"en","currency":"USD","id":"1118644174","title":"Big Data For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XPkAEFXo7VgC&source=gbs_api","authors":["Judith S. Hurwitz","Alan Nugent","Fern Halper","Marcia Kaufman"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R2J5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"4th International Symposium, UNet 2018, Hammamet, Tunisia, May 2 – 5, 2018, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 4th International Symposium on Ubiquitous Networking, UNet 2018, held in Hammamet, Morocco, in May 2018. The 35 full papers presented together with 5 short papers in this volume were carefully reviewed and selected from 87 submissions. The focus of UNet is on technical challenges and solutions related to such a widespread adoption of networking technologies, including broadband multimedia, machine-to-machine applications, Internet of things, security and privacy, data engineering, sensor networks and RFID technologies.","language":"en","currency":"USD","id":"3030028496","title":"Ubiquitous Networking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R2J5DwAAQBAJ&source=gbs_api","authors":["Noureddine Boudriga","Mohamed-Slim Alouini","Slim Rekhis","Essaid Sabir","Sofie Pollin"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUhiQxUXVpMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Random Access to Your Planet-Size Data","description":"If you're looking for a scalable storage solution to accommodate a virtually endless amount of data, this book shows you how Apache HBase can fulfill your needs. As the open source implementation of Google's BigTable architecture, HBase scales to billions of rows and millions of columns, while ensuring that write and read performance remain constant. Many IT executives are asking pointed questions about HBase. This book provides meaningful answers, whether you’re evaluating this non-relational database or planning to put it into practice right away. Discover how tight integration with Hadoop makes scalability with HBase easier Distribute large datasets across an inexpensive cluster of commodity servers Access HBase with native Java clients, or with gateway servers providing REST, Avro, or Thrift APIs Get details on HBase’s architecture, including the storage format, write-ahead log, background processes, and more Integrate HBase with Hadoop's MapReduce framework for massively parallelized data processing jobs Learn how to tune clusters, design schemas, copy tables, import bulk data, decommission nodes, and many other tasks","language":"en","currency":"USD","id":"1449315224","title":"HBase: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUhiQxUXVpMC&source=gbs_api","authors":["Lars George"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bFywDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"With SQL and NOSQL Databases","description":"Designed to provide an insight into the SQL and MySQL database concepts using python DESCRIPTION Python is becoming increasingly popular among data scientists. However, analysis and visualization tools need to interact with the data stored in various formats such as relational and NOSQL databases. This book aims to make the reader proficient in interacting with databases such as MySQL, SQLite, MongoDB, and Cassandra. This book assumes that the reader has no prior knowledge of programming. Hence, basic programming concepts, key concepts of OOP, serialization and data persistence have been explained in such a way that it is easy to understand. NOSQL is an emerging technology. Using MongoDB and Cassandra, the two widely used NOSQL databases are explained in detail. The knowhow of handling databases using Python will certainly be helpful for readers pursuing a career in Data Science. KEY FEATURES A practical approach Ample code examples A Quick Start Guide to Python for beginners WHAT WILL YOU LEARN Python basics and programming fundamentals Serialization libraries pickle, CSV, JSON, and XML DB-AP and, SQLAlchemy Python with Excel documents Python with MongoDB and Cassandra WHO THIS BOOK IS FOR Students and professionals who want to become proficient at database tools for a successful career in data science. Table of Contents 1. Getting Started 2. Program Flow Control 3. Structured Python 4. Python – OOP 5. File IO 6. Object Serialization 7. RDBMS Concepts 8. Python DB-API 9. Python – SQLAlchemy 10. Python and Excel 11. Python – PyMongo 12. Python – Cassandra","language":"en","currency":"USD","id":"9388511751","title":"Python Data Persistence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bFywDwAAQBAJ&source=gbs_api","authors":["Malhar Lathkar"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2_aVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.96,"subtitle":"A Primer for the Data Scientist","description":"Over the past 5 years, the concept of big data has matured, data science has grown exponentially, and data architecture has become a standard part of organizational decision-making. Throughout all this change, the basic principles that shape the architecture of data have remained the same. There remains a need for people to take a look at the \"bigger picture\" and to understand where their data fit into the grand scheme of things. Data Architecture: A Primer for the Data Scientist, Second Edition addresses the larger architectural picture of how big data fits within the existing information infrastructure or data warehousing systems. This is an essential topic not only for data scientists, analysts, and managers but also for researchers and engineers who increasingly need to deal with large and complex sets of data. Until data are gathered and can be placed into an existing framework or architecture, they cannot be used to their full potential. Drawing upon years of practical experience and using numerous examples and case studies from across various industries, the authors seek to explain this larger picture into which big data fits, giving data scientists the necessary context for how pieces of the puzzle should fit together. New case studies include expanded coverage of textual management and analytics New chapters on visualization and big data Discussion of new visualizations of the end-state architecture","language":"en","currency":"USD","id":"0128169176","title":"Data Architecture: A Primer for the Data Scientist","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2_aVDwAAQBAJ&source=gbs_api","authors":["W.H. Inmon","Daniel Linstedt","Mary Levins"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o2ovDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Discover how data science can help you gain in-depth insight into your business - the easy way! Jobs in data science abound, but few people have the data science skills needed to fill these increasingly important roles. Data Science For Dummies is the perfect starting point for IT professionals and students who want a quick primer on all areas of the expansive data science space. With a focus on business cases, the book explores topics in big data, data science, and data engineering, and how these three areas are combined to produce tremendous value. If you want to pick-up the skills you need to begin a new career or initiate a new project, reading this book will help you understand what technologies, programming languages, and mathematical methods on which to focus. While this book serves as a wildly fantastic guide through the broad, sometimes intimidating field of big data and data science, it is not an instruction manual for hands-on implementation. Here’s what to expect: Provides a background in big data and data engineering before moving on to data science and how it's applied to generate value Includes coverage of big data frameworks like Hadoop, MapReduce, Spark, MPP platforms, and NoSQL Explains machine learning and many of its algorithms as well as artificial intelligence and the evolution of the Internet of Things Details data visualization techniques that can be used to showcase, summarize, and communicate the data insights you generate It's a big, big data world out there—let Data Science For Dummies help you harness its power and gain a competitive edge for your organization.","language":"en","currency":"USD","id":"1119327652","title":"Data Science For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o2ovDgAAQBAJ&source=gbs_api","authors":["Lillian Pierson"]},{"pageCount":972,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tvCODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":271.2,"subtitle":null,"description":"This book includes a selection of articles from The 2019 World Conference on Information Systems and Technologies (WorldCIST’19), held from April 16 to 19, at La Toja, Spain. WorldCIST is a global forum for researchers and practitioners to present and discuss recent results and innovations, current trends, professional experiences and challenges in modern information systems and technologies research, together with their technological development and applications. The book covers a number of topics, including A) Information and Knowledge Management; B) Organizational Models and Information Systems; C) Software and Systems Modeling; D) Software Systems, Architectures, Applications and Tools; E) Multimedia Systems and Applications; F) Computer Networks, Mobility and Pervasive Systems; G) Intelligent and Decision Support Systems; H) Big Data Analytics and Applications; I) Human–Computer Interaction; J) Ethics, Computers & Security; K) Health Informatics; L) Information Technologies in Education; M) Information Technologies in Radiocommunications; and N) Technologies for Biomedical Applications.","language":"en","currency":"USD","id":"3030161811","title":"New Knowledge in Information Systems and Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tvCODwAAQBAJ&source=gbs_api","authors":["lvaro Rocha","Hojjat Adeli","Lus Paulo Reis","Sandra Costanzo"]},{"pageCount":181,"thumbnail":"http:\/\/books.google.com\/books\/content?id=32_cW_MGRUEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"First International Conference, BDA 2012, New Delhi, India, December 24-26, 2012, Proceedings","description":"This book constitutes the refereed proceedings of the First International Conference on Big Data Analytics, BDA 2012, held in New Delhi, India, in December 2012. The 5 regular papers and 5 short papers presented were carefully reviewed and selected from 42 submissions. The volume also contains two tutorial papers in the section perspectives on big data analytics. The regular contributions are organized in topical sections on: data analytics applications; knowledge discovery through information extraction; and data models in analytics.","language":"en","currency":"USD","id":"3642355420","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=32_cW_MGRUEC&source=gbs_api","authors":["Srinath Srinivasa","Vasudha Bhatnagar"]},{"pageCount":60,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vqDCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.05,"subtitle":null,"description":"Master's Thesis from the year 2018 in the subject Computer Science - Internet, New Technologies, grade: 8, , course: Master of Computer Application, language: English, abstract: This book aims to describe how data analytics works for big data and how they are used in business. It gives an overview of existing technologies and ap-proaches to building data analytics infrastructures. It also defines points that should be taken into consideration while choosing the most suitable software solution for a particular use case. The research is done by studying architectural principles of big data sys-tems and investigating the market of data analytics software. The result of this work is a composite report including comparison of several technologies and a list of criteria considered. The final report can be used as a guideline for choosing the most suitable technology for implementing an analytical platform in a broad variety of organizations. With a growing amount of data generated, their changing and evolving, the concept of big data has become incredibly popular in last years. It provides a set of new approaches and techniques allowing to work e ciently with huge volumes of records. Nowadays, information is one of the most important resources; it can help with decision making and business processes optimization. However, to get actual insights and unlock a potential of data, it is necessary to process them and discover the information hidden inside it which is a goal of data analytics. Data analytic platforms allow to manipulate with raw data in order to find out what exactly they contain. These systems are complex and includes multiple components therefore their designing requires comprehensive analysis of available options.","language":"en","currency":"USD","id":"3346079090","title":"SQL Engines for Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vqDCDwAAQBAJ&source=gbs_api","authors":["Ajit Singh"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":353,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7iD4gPDke6IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"Since the 1990s Grid Computing has emerged as a paradigm for accessing and managing distributed, heterogeneous and geographically spread resources, promising that we will be able to access computer power as easily as we can access the electric power grid. Later on, Cloud Computing brought the promise of providing easy and inexpensive access to remote hardware and storage resources. Exploiting pay-per-use models and virtualization for resource provisioning, cloud computing has been rapidly accepted and used by researchers, scientists and industries. In this volume, contributions from internationally recognized experts describe the latest findings on challenging topics related to grid and cloud database management. By exploring current and future developments, they provide a thorough understanding of the principles and techniques involved in these fields. The presented topics are well balanced and complementary, and they range from well-known research projects and real case studies to standards and specifications, and non-functional aspects such as security, performance and scalability. Following an initial introduction by the editors, the contributions are organized into four sections: Open Standards and Specifications, Research Efforts in Grid Database Management, Cloud Data Management, and Scientific Case Studies. With this presentation, the book serves mostly researchers and graduate students, both as an introduction to and as a technical reference for grid and cloud database management. The detailed descriptions of research prototypes dealing with spatiotemporal or genomic data will also be useful for application engineers in these fields.","language":"en","currency":"USD","id":"3642200451","title":"Grid and Cloud Database Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7iD4gPDke6IC&source=gbs_api","authors":["Sandro Fiore","Giovanni Aloisio"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q9AGBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"If you are an intermediate NoSQL developer or have a few big data projects under your belt, you will learn how to increase your chances of a successful and useful NoSQL application by mastering the design patterns described in the book. The HBase design patterns apply equally well to Cassandra, MongoDB, and so on.","language":"en","currency":"USD","id":"1783981059","title":"HBase Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q9AGBgAAQBAJ&source=gbs_api","authors":["Mark Kerzner","Sujee Maniyam"]},{"pageCount":636,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JiPcBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.16,"subtitle":"Processing and Management","description":"Large Scale and Big Data: Processing and Management provides readers with a central source of reference on the data management techniques currently available for large-scale data processing. Presenting chapters written by leading researchers, academics, and practitioners, it addresses the fundamental challenges associated with Big Data processing t","language":"en","currency":"USD","id":"1466581514","title":"Large Scale and Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JiPcBQAAQBAJ&source=gbs_api","authors":["Sherif Sakr","Mohamed Gaber"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qRERCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Application Development, Table Design, and Best Practices","description":"Get up to speed on Apache Accumulo, the flexible, high-performance key\/value store created by the National Security Agency (NSA) and based on Google’s BigTable data storage system. Written by former NSA team members, this comprehensive tutorial and reference covers Accumulo architecture, application development, table design, and cell-level security. With clear information on system administration, performance tuning, and best practices, this book is ideal for developers seeking to write Accumulo applications, administrators charged with installing and maintaining Accumulo, and other professionals interested in what Accumulo has to offer. You will find everything you need to use this system fully. Get a high-level introduction to Accumulo’s architecture and data model Take a rapid tour through single- and multiple-node installations, data ingest, and query Learn how to write Accumulo applications for several use cases, based on examples Dive into Accumulo internals, including information not available in the documentation Get detailed information for installing, administering, tuning, and measuring performance Learn best practices based on successful implementations in the field Find answers to common questions that every new Accumulo user asks","language":"en","currency":"USD","id":"149194692X","title":"Accumulo","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qRERCgAAQBAJ&source=gbs_api","authors":["Aaron Cordova","Billie Rinaldi","Michael Wall"]},{"pageCount":516,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kLW8BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"Theory and Methods of Database Mappings, Programming Languages, and Semantics","description":"This book presents a novel approach to database concepts, describing a categorical logic for database schema mapping based on views, within a framework for database integration\/exchange and peer-to-peer. Database mappings, database programming languages, and denotational and operational semantics are discussed in depth. An analysis method is also developed that combines techniques from second order logic, data modeling, co-algebras and functorial categorial semantics. Features: provides an introduction to logics, co-algebras, databases, schema mappings and category theory; describes the core concepts of big data integration theory, with examples; examines the properties of the DB category; defines the categorial RDB machine; presents full operational semantics for database mappings; discusses matching and merging operators for databases, universal algebra considerations and algebraic lattices of the databases; explores the relationship of the database weak monoidal topos w.r.t. intuitionistic logic.","language":"en","currency":"USD","id":"3319041568","title":"Big Data Integration Theory","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kLW8BAAAQBAJ&source=gbs_api","authors":["Zoran Majki"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J94WBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":"Discovering, Analyzing, Visualizing and Presenting Data","description":"Data Science and Big Data Analytics is about harnessing the power of data for new insights. The book covers the breadth of activities and methods and tools that Data Scientists use. The content focuses on concepts, principles and practical applications that are applicable to any industry and technology environment, and the learning is supported and explained with examples that you can replicate using open-source software. This book will help you: Become a contributor on a data science team Deploy a structured lifecycle approach to data analytics problems Apply appropriate analytic techniques and tools to analyzing big data Learn how to tell a compelling story with data to drive business action Prepare for EMC Proven Professional Data Science Certification Corresponding data sets are available from the book’s page at Wiley which you can find on the Wiley site by searching for the ISBN 9781118876138. Get started discovering, analyzing, visualizing, and presenting data in a meaningful way today!","language":"en","currency":"USD","id":"1118876059","title":"Data Science and Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J94WBgAAQBAJ&source=gbs_api","authors":["EMC Education Services"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JpuoCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Big Data Processing and Analysis Using PowerBI in Excel 2013","description":"In Beginning Big Data with Power BI and Excel 2013, you will learn to solve business problems by tapping the power of Microsoft’s Excel and Power BI to import data from NoSQL and SQL databases and other sources, create relational data models, and analyze business problems through sophisticated dashboards and data-driven maps. While Beginning Big Data with Power BI and Excel 2013 covers prominent tools such as Hadoop and the NoSQL databases, it recognizes that most small and medium-sized businesses don’t have the Big Data processing needs of a Netflix, Target, or Facebook. Instead, it shows how to import data and use the self-service analytics available in Excel with Power BI. As you’ll see through the book’s numerous case examples, these tools—which you already know how to use—can perform many of the same functions as the higher-end Apache tools many people believe are required to carry out in Big Data projects. Through instruction, insight, advice, and case studies, Beginning Big Data with Power BI and Excel 2013 will show you how to: Import and mash up data from web pages, SQL and NoSQL databases, the Azure Marketplace and other sources. Tap into the analytical power of PivotTables and PivotCharts and develop relational data models to track trends and make predictions based on a wide range of data. Understand basic statistics and use Excel with PowerBI to do sophisticated statistical analysis—including identifying trends and correlations. Use SQL within Excel to do sophisticated queries across multiple tables, including NoSQL databases. Create complex formulas to solve real-world business problems using Data Analysis Expressions (DAX).","language":"en","currency":"USD","id":"1484205294","title":"Beginning Big Data with Power BI and Excel 2013","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JpuoCgAAQBAJ&source=gbs_api","authors":["Neil Dunlop"]},{"pageCount":193,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p9TkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"The unprecedented scale at which data is both produced and consumed today has generated a large demand for scalable data management solutions facilitating fast access from all over the world. As one consequence, a plethora of non-relational, distributed NoSQL database systems have risen in recent years and today’s data management system landscape has thus become somewhat hard to overlook. As another consequence, complex polyglot designs and elaborate schemes for data distribution and delivery have become the norm for building applications that connect users and organizations across the globe – but choosing the right combination of systems for a given use case has become increasingly difficult as well. To help practitioners stay on top of that challenge, this book presents a comprehensive overview and classification of the current system landscape in cloud data management as well as a survey of the state-of-the-art approaches for efficient data distribution and delivery to end-user devices. The topics covered thus range from NoSQL storage systems and polyglot architectures (backend) over distributed transactions and Web caching (network) to data access and rendering performance in the client (end-user). By distinguishing popular data management systems by data model, consistency guarantees, and other dimensions of interest, this book provides an abstract framework for reasoning about the overall design space and the individual positions claimed by each of the systems therein. Building on this classification, this book further presents an application-driven decision guidance tool that breaks the process of choosing a set of viable system candidates for a given application scenario down into a straightforward decision tree.","language":"en","currency":"USD","id":"3030435067","title":"Fast and Scalable Cloud Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p9TkDwAAQBAJ&source=gbs_api","authors":["Felix Gessert","Wolfram Wingerath","Norbert Ritter"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JpuoCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Big Data Processing and Analysis Using PowerBI in Excel 2013","description":"In Beginning Big Data with Power BI and Excel 2013, you will learn to solve business problems by tapping the power of Microsoft’s Excel and Power BI to import data from NoSQL and SQL databases and other sources, create relational data models, and analyze business problems through sophisticated dashboards and data-driven maps. While Beginning Big Data with Power BI and Excel 2013 covers prominent tools such as Hadoop and the NoSQL databases, it recognizes that most small and medium-sized businesses don’t have the Big Data processing needs of a Netflix, Target, or Facebook. Instead, it shows how to import data and use the self-service analytics available in Excel with Power BI. As you’ll see through the book’s numerous case examples, these tools—which you already know how to use—can perform many of the same functions as the higher-end Apache tools many people believe are required to carry out in Big Data projects. Through instruction, insight, advice, and case studies, Beginning Big Data with Power BI and Excel 2013 will show you how to: Import and mash up data from web pages, SQL and NoSQL databases, the Azure Marketplace and other sources. Tap into the analytical power of PivotTables and PivotCharts and develop relational data models to track trends and make predictions based on a wide range of data. Understand basic statistics and use Excel with PowerBI to do sophisticated statistical analysis—including identifying trends and correlations. Use SQL within Excel to do sophisticated queries across multiple tables, including NoSQL databases. Create complex formulas to solve real-world business problems using Data Analysis Expressions (DAX).","language":"en","currency":"USD","id":"1484205294","title":"Beginning Big Data with Power BI and Excel 2013","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JpuoCgAAQBAJ&source=gbs_api","authors":["Neil Dunlop"]},{"pageCount":193,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p9TkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"The unprecedented scale at which data is both produced and consumed today has generated a large demand for scalable data management solutions facilitating fast access from all over the world. As one consequence, a plethora of non-relational, distributed NoSQL database systems have risen in recent years and today’s data management system landscape has thus become somewhat hard to overlook. As another consequence, complex polyglot designs and elaborate schemes for data distribution and delivery have become the norm for building applications that connect users and organizations across the globe – but choosing the right combination of systems for a given use case has become increasingly difficult as well. To help practitioners stay on top of that challenge, this book presents a comprehensive overview and classification of the current system landscape in cloud data management as well as a survey of the state-of-the-art approaches for efficient data distribution and delivery to end-user devices. The topics covered thus range from NoSQL storage systems and polyglot architectures (backend) over distributed transactions and Web caching (network) to data access and rendering performance in the client (end-user). By distinguishing popular data management systems by data model, consistency guarantees, and other dimensions of interest, this book provides an abstract framework for reasoning about the overall design space and the individual positions claimed by each of the systems therein. Building on this classification, this book further presents an application-driven decision guidance tool that breaks the process of choosing a set of viable system candidates for a given application scenario down into a straightforward decision tree.","language":"en","currency":"USD","id":"3030435067","title":"Fast and Scalable Cloud Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p9TkDwAAQBAJ&source=gbs_api","authors":["Felix Gessert","Wolfram Wingerath","Norbert Ritter"]},{"pageCount":398,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gD5qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"20th International Conference, DaWaK 2018, Regensburg, Germany, September 3–6, 2018, Proceedings","description":"This book constitutes the refereed proceedings of the 20th International Conference on Big Data Analytics and Knowledge Discovery, DaWaK 2018, held in Regensburg, Germany, in September 2018. The 13 revised full papers and 17 short papers presented were carefully reviewed and selected from 76 submissions. The papers are organized in the following topical sections: Graph analytics; case studies; classification and clustering; pre-processing; sequences; cloud and database systems; and data mining.","language":"en","currency":"USD","id":"3319985396","title":"Big Data Analytics and Knowledge Discovery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gD5qDwAAQBAJ&source=gbs_api","authors":["Carlos Ordonez","Ladjel Bellatreche"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FF86BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":null,"description":"Hone your analytic talents and become part of the next big thing Getting a Big Data Job For Dummies is the ultimate guide to landing a position in one of the fastest-growing fields in the modern economy. Learn exactly what \"big data\" means, why it's so important across all industries, and how you can obtain one of the most sought-after skill sets of the decade. This book walks you through the process of identifying your ideal big data job, shaping the perfect resume, and nailing the interview, all in one easy-to-read guide. Companies from all industries, including finance, technology, medicine, and defense, are harnessing massive amounts of data to reap a competitive advantage. The demand for big data professionals is growing every year, and experts forecast an estimated 1.9 million additional U.S. jobs in big data by 2015. Whether your niche is developing the technology, handling the data, or analyzing the results, turning your attention to a career in big data can lead to a more secure, more lucrative career path. Getting a Big Data Job For Dummies provides an overview of the big data career arc, and then shows you how to get your foot in the door with topics like: The education you need to succeed The range of big data career path options An overview of major big data employers A plan to develop your job-landing strategy Your analytic inclinations may be your ticket to long-lasting success. In a highly competitive job market, developing your data skills can create a situation where you pick your employer rather than the other way around. If you're ready to get in on the ground floor of the next big thing, Getting a Big Data Job For Dummies will teach you everything you need to know to get started today.","language":"en","currency":"USD","id":"1118903846","title":"Getting a Big Data Job For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FF86BAAAQBAJ&source=gbs_api","authors":["Jason Williamson"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G81PCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.17,"subtitle":"From Keywords to Key-objects","description":"The WWW era made billions of people dramatically dependent on the progress of data technologies, out of which Internet search and Big Data are arguably the most notable. Structured Search paradigm connects them via a fundamental concept of key-objects evolving out of keywords as the units of search. The key-object data model and KeySQL revamp the data independence principle making it applicable for Big Data and complement NoSQL with full-blown structured querying functionality. The ultimate goal is extracting Big Information from the Big Data. As a Big Data Consultant, Mikhail Gilula combines academic background with 20 years of industry experience in the database and data warehousing technologies working as a Sr. Data Architect for Teradata, Alcatel-Lucent, and PayPal, among others. He has authored three books, including The Set Model for Database and Information Systems and holds four US Patents in Structured Search and Data Integration. Conceptualizes structured search as a technology for querying multiple data sources in an independent and scalable manner. Explains how NoSQL and KeySQL complement each other and serve different needs with respect to big data Shows the place of structured search in the internet evolution and describes its implementations including the real-time structured internet search","language":"en","currency":"USD","id":"012804652X","title":"Structured Search for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G81PCgAAQBAJ&source=gbs_api","authors":["Mikhail Gilula"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Js2LAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":"Value Creation for Business Leaders and Practitioners","description":"With big data analytics comes big insights into profitability Big data is big business. But having the data and the computational power to process it isn't nearly enough to produce meaningful results. Big Data, Data Mining, and Machine Learning: Value Creation for Business Leaders and Practitioners is a complete resource for technology and marketing executives looking to cut through the hype and produce real results that hit the bottom line. Providing an engaging, thorough overview of the current state of big data analytics and the growing trend toward high performance computing architectures, the book is a detail-driven look into how big data analytics can be leveraged to foster positive change and drive efficiency. With continued exponential growth in data and ever more competitive markets, businesses must adapt quickly to gain every competitive advantage available. Big data analytics can serve as the linchpin for initiatives that drive business, but only if the underlying technology and analysis is fully understood and appreciated by engaged stakeholders. This book provides a view into the topic that executives, managers, and practitioners require, and includes: A complete overview of big data and its notable characteristics Details on high performance computing architectures for analytics, massively parallel processing (MPP), and in-memory databases Comprehensive coverage of data mining, text analytics, and machine learning algorithms A discussion of explanatory and predictive modeling, and how they can be applied to decision-making processes Big Data, Data Mining, and Machine Learning provides technology and marketing executives with the complete resource that has been notably absent from the veritable libraries of published books on the topic. Take control of your organization's big data analytics to produce real results with a resource that is comprehensive in scope and light on hyperbole.","language":"en","currency":"USD","id":"1118920708","title":"Big Data, Data Mining, and Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Js2LAwAAQBAJ&source=gbs_api","authors":["Jared Dean"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_e59BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Big Data, Data Warehouse and Data Vault","description":"Today, the world is trying to create and educate data scientists because of the phenomenon of Big Data. And everyone is looking deeply into this technology. But no one is looking at the larger architectural picture of how Big Data needs to fit within the existing systems (data warehousing systems). Taking a look at the larger picture into which Big Data fits gives the data scientist the necessary context for how pieces of the puzzle should fit together. Most references on Big Data look at only one tiny part of a much larger whole. Until data gathered can be put into an existing framework or architecture it can’t be used to its full potential. Data Architecture a Primer for the Data Scientist addresses the larger architectural picture of how Big Data fits with the existing information infrastructure, an essential topic for the data scientist. Drawing upon years of practical experience and using numerous examples and an easy to understand framework. W.H. Inmon, and Daniel Linstedt define the importance of data architecture and how it can be used effectively to harness big data within existing systems. You’ll be able to: Turn textual information into a form that can be analyzed by standard tools. Make the connection between analytics and Big Data Understand how Big Data fits within an existing systems environment Conduct analytics on repetitive and non-repetitive data Discusses the value in Big Data that is often overlooked, non-repetitive data, and why there is significant business value in using it Shows how to turn textual information into a form that can be analyzed by standard tools Explains how Big Data fits within an existing systems environment Presents new opportunities that are afforded by the advent of Big Data Demystifies the murky waters of repetitive and non-repetitive data in Big Data","language":"en","currency":"USD","id":"0128020911","title":"Data Architecture: A Primer for the Data Scientist","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_e59BAAAQBAJ&source=gbs_api","authors":["W.H. Inmon","Daniel Linstedt"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wqdhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A guide to building proficiency in tools and systems used by leading big data experts","description":"A comprehensive end-to-end guide that gives hands-on practice in big data and Artificial Intelligence Key Features Learn to build and run a big data application with sample code Explore examples to implement activities that a big data architect performs Use Machine Learning and AI for structured and unstructured data Book Description The big data architects are the “masters” of data, and hold high value in today’s market. Handling big data, be it of good or bad quality, is not an easy task. The prime job for any big data architect is to build an end-to-end big data solution that integrates data from different sources and analyzes it to find useful, hidden insights. Big Data Architect’s Handbook takes you through developing a complete, end-to-end big data pipeline, which will lay the foundation for you and provide the necessary knowledge required to be an architect in big data. Right from understanding the design considerations to implementing a solid, efficient, and scalable data pipeline, this book walks you through all the essential aspects of big data. It also gives you an overview of how you can leverage the power of various big data tools such as Apache Hadoop and ElasticSearch in order to bring them together and build an efficient big data solution. By the end of this book, you will be able to build your own design system which integrates, maintains, visualizes, and monitors your data. In addition, you will have a smooth design flow in each process, putting insights in action. What you will learn Learn Hadoop Ecosystem and Apache projects Understand, compare NoSQL database and essential software architecture Cloud infrastructure design considerations for big data Explore application scenario of big data tools for daily activities Learn to analyze and visualize results to uncover valuable insights Build and run a big data application with sample code from end to end Apply Machine Learning and AI to perform big data intelligence Practice the daily activities performed by big data architects Who this book is for Big Data Architect’s Handbook is for you if you are an aspiring data professional, developer, or IT enthusiast who aims to be an all-round architect in big data. This book is your one-stop solution to enhance your knowledge and carry out easy to complex activities required to become a big data architect.","language":"en","currency":"USD","id":"1788836383","title":"Big Data Architect’s Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wqdhDwAAQBAJ&source=gbs_api","authors":["Syed Muhammad Fahad Akhtar"]},{"pageCount":784,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4JN4CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.49,"subtitle":null,"description":"Readers gain a solid foundation in database design and implementation with the practical and easy-to-understand approach in DATABASE SYSTEMS: DESIGN, IMPLEMENTATION, AND MANAGEMENT, 12E. Filled with diagrams, illustrations, and tables, this market-leading text provides in-depth coverage of database design. Readers learn the key to successful database implementation: proper design of databases to fit within a larger strategic view of the data environment. Renowned for its clear, straightforward writing style, this text provides an outstanding balance of theory and practice. Updates include the latest coverage of cloud data services and a new chapter on Big Data Analytics and NoSQL, including related Hadoop technologies. In addition, new review questions, problem sets, and cases offer multiple opportunities to test understanding and develop useful design skills. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","language":"en","currency":"USD","id":"1305886844","title":"Database Systems: Design, Implementation, & Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4JN4CgAAQBAJ&source=gbs_api","authors":["Carlos Coronel","Steven Morris"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ethXBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"NoSQL database usage is growing at a stunning 50% per year, as organizations discover NoSQL's potential to address even the most challenging Big Data and real-time database problems. Every NoSQL database is different, but one is the most popular by far: MongoDB. Now, in just 24 lessons of one hour or less, you can learn how to leverage MongoDB's immense power. Each short, easy lesson builds on all that's come before, teaching NoSQL concepts and MongoDB techniques from the ground up. Sams Teach Yourself NoSQL with MongoDB in 24 Hours covers all this, and much more: Learning how NoSQL is different, when to use it, and when to use traditional RDBMSes instead Designing and implementing MongoDB databases of diverse types and sizes Storing and interacting with data via Java, PHP, Python, and Node.js\/Mongoose Choosing the right NoSQL distribution model for your application Installing and configuring MongoDB Designing MongoDB data models, including collections, indexes, and GridFS Balancing consistency, performance, and durability Leveraging the immense power of Map-Reduce Administering, monitoring, securing, backing up, and repairing MongoDB databases Mastering advanced techniques such as sharding and replication Optimizing performance","language":"en","currency":"USD","id":"0133844412","title":"NoSQL with MongoDB in 24 Hours, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ethXBAAAQBAJ&source=gbs_api","authors":["Brad Dayley"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ISLwAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":null,"description":"Tap the power of Big Data with Microsoft technologies Big Data is here, and Microsoft's new Big Data platform is a valuable tool to help your company get the very most out of it. This timely book shows you how to use HDInsight along with HortonWorks Data Platform for Windows to store, manage, analyze, and share Big Data throughout the enterprise. Focusing primarily on Microsoft and HortonWorks technologies but also covering open source tools, Microsoft Big Data Solutions explains best practices, covers on-premises and cloud-based solutions, and features valuable case studies. Best of all, it helps you integrate these new solutions with technologies you already know, such as SQL Server and Hadoop. Walks you through how to integrate Big Data solutions in your company using Microsoft's HDInsight Server, HortonWorks Data Platform for Windows, and open source tools Explores both on-premises and cloud-based solutions Shows how to store, manage, analyze, and share Big Data through the enterprise Covers topics such as Microsoft's approach to Big Data, installing and configuring HortonWorks Data Platform for Windows, integrating Big Data with SQL Server, visualizing data with Microsoft and HortonWorks BI tools, and more Helps you build and execute a Big Data plan Includes contributions from the Microsoft and HortonWorks Big Data product teams If you need a detailed roadmap for designing and implementing a fully deployed Big Data solution, you'll want Microsoft Big Data Solutions.","language":"en","currency":"USD","id":"1118729552","title":"Microsoft Big Data Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ISLwAgAAQBAJ&source=gbs_api","authors":["Adam Jorgensen","James Rowland-Jones","John Welch","Dan Clark","Christopher Price","Brian Mitchell"]},{"pageCount":1152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R46dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":null,"description":"This book contains 112 papers selected from about 250 submissions to the 6th World Congress on Global Optimization (WCGO 2019) which takes place on July 8–10, 2019 at University of Lorraine, Metz, France. The book covers both theoretical and algorithmic aspects of Nonconvex Optimization, as well as its applications to modeling and solving decision problems in various domains. It is composed of 10 parts, each of them deals with either the theory and\/or methods in a branch of optimization such as Continuous optimization, DC Programming and DCA, Discrete optimization & Network optimization, Multiobjective programming, Optimization under uncertainty, or models and optimization methods in a specific application area including Data science, Economics & Finance, Energy & Water management, Engineering systems, Transportation, Logistics, Resource allocation & Production management. The researchers and practitioners working in Nonconvex Optimization and several application areas can find here many inspiring ideas and useful tools & techniques for their works.","language":"en","currency":"USD","id":"3030218031","title":"Optimization of Complex Systems: Theory, Models, Algorithms and Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R46dDwAAQBAJ&source=gbs_api","authors":["Hoai An Le Thi","Hoai Minh Le","Tao Pham Dinh"]},{"pageCount":307,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SuK2BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"A Practical Introduction","description":"This easy-to-read textbook\/reference presents a comprehensive introduction to databases, opening with a concise history of databases and of data as an organisational asset. As relational database management systems are no longer the only database solution, the book takes a wider view of database technology, encompassing big data, NoSQL, object and object-relational and in-memory databases. The text also examines the issues of scalability, availability, performance and security encountered when building and running a database in the real world. Topics and features: presents review and discussion questions at the end of each chapter, in addition to skill-building, hands-on exercises; introduces the fundamental concepts and technologies in database systems, placing these in an historic context; describes the challenges faced by database professionals; reviews the use of a variety of database types in business environments; discusses areas for further research within this fast-moving domain.","language":"en","currency":"USD","id":"1447156013","title":"Concise Guide to Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SuK2BAAAQBAJ&source=gbs_api","authors":["Peter Lake","Paul Crowther"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.39,"subtitle":"Elements of Reusable Object-Oriented Software (Adobe Reader)","description":"Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.","language":"en","currency":"USD","id":"9780321700698","title":"Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6oHuKQe3TjQC&source=gbs_api","authors":["Erich Gamma","Richard Helm","Ralph Johnson","John Vlissides"]},{"pageCount":319,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0l_wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":"Tools and Applications","description":"The idea behind this book is to simplify the journey of aspiring readers and researchers to understand Big Data, IoT and Machine Learning. It also includes various real-time\/offline applications and case studies in the fields of engineering, computer science, information security and cloud computing using modern tools. This book consists of two sections: Section I contains the topics related to Applications of Machine Learning, and Section II addresses issues about Big Data, the Cloud and the Internet of Things. This brings all the related technologies into a single source so that undergraduate and postgraduate students, researchers, academicians and people in industry can easily understand them. Features Addresses the complete data science technologies workflow Explores basic and high-level concepts and services as a manual for those in the industry and at the same time can help beginners to understand both basic and advanced aspects of machine learning Covers data processing and security solutions in IoT and Big Data applications Offers adaptive, robust, scalable and reliable applications to develop solutions for day-to-day problems Presents security issues and data migration techniques of NoSQL databases","language":"en","currency":"USD","id":"1000098281","title":"Big Data, IoT, and Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0l_wDwAAQBAJ&source=gbs_api","authors":["Rashmi Agrawal","Marcin Paprzycki","Neha Gupta"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4tGgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Framework for Better Human Experiences and Business Success","description":"If you’re an executive, manager, or anyone interested in leveraging AI within your organization, this is your guide. You’ll understand exactly what AI is, learn how to identify AI opportunities, and develop and execute a successful AI vision and strategy. Alex Castrounis, business consultant and former IndyCar engineer and race strategist, examines the value of AI and shows you how to develop an AI vision and strategy that benefits both people and business. AI is exciting, powerful, and game changing—but too many AI initiatives end in failure. With this book, you’ll explore the risks, considerations, trade-offs, and constraints for pursuing an AI initiative. You’ll learn how to create better human experiences and greater business success through winning AI solutions and human-centered products. Use the book’s AIPB Framework to conduct end-to-end, goal-driven innovation and value creation with AI Define a goal-aligned AI vision and strategy for stakeholders, including businesses, customers, and users Leverage AI successfully by focusing on concepts such as scientific innovation and AI readiness and maturity Understand the importance of executive leadership for pursuing AI initiatives \"A must read for business executives and managers interested in learning about AI and unlocking its benefits. Alex Castrounis has simplified complex topics so that anyone can begin to leverage AI within their organization.\" - Dan Park, GM & Director, Uber \"Alex Castrounis has been at the forefront of helping organizations understand the promise of AI and leverage its benefits, while avoiding the many pitfalls that can derail success. In this essential book, he shares his expertise with the rest of us.\" - Dean Wampler, Ph.D., VP, Fast Data Engineering at Lightbend","language":"en","currency":"USD","id":"1492036528","title":"AI for People and Business","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4tGgDwAAQBAJ&source=gbs_api","authors":["Alex Castrounis"]},{"pageCount":333,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EY1jDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":null,"description":"The book contains the latest trend in IT industry 'BigData and Hadoop'. It explains how big is 'Big Data' and why everybody is trying to implement this into their IT project.It includes research work on various topics, theoretical and practical approach, each component of the architecture is described along with current industry trends.Big Data and Hadoop have taken together are a new skill as per the industry standards. Readers will get a compact book along with the industry experience and would be a reference to help readers.KEY FEATURES Overview Of Big Data, Basics of Hadoop, Hadoop Distributed File System, HBase, MapReduce, HIVE: The Dataware House Of Hadoop, PIG: The Higher Level Programming Environment, SQOOP: Importing Data From Heterogeneous Sources, Flume, Ozzie, Zookeeper & Big Data Stream Mining, Chapter-wise Questions & Previous Years Questions","language":"en","currency":"USD","id":"9387284832","title":"BIG DATA AND HADOOP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EY1jDwAAQBAJ&source=gbs_api","authors":["Mayank Bhusan"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WZdqU45XfkkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Enterprise Big Data Warehouse, BI Implementations and Analytics","description":"Big Data Imperatives, focuses on resolving the key questions on everyone’s mind: Which data matters? Do you have enough data volume to justify the usage? How you want to process this amount of data? How long do you really need to keep it active for your analysis, marketing, and BI applications? Big data is emerging from the realm of one-off projects to mainstream business adoption; however, the real value of big data is not in the overwhelming size of it, but more in its effective use. This book addresses the following big data characteristics: Very large, distributed aggregations of loosely structured data – often incomplete and inaccessible Petabytes\/Exabytes of data Millions\/billions of people providing\/contributing to the context behind the data Flat schema's with few complex interrelationships Involves time-stamped events Made up of incomplete data Includes connections between data elements that must be probabilistically inferred Big Data Imperatives explains 'what big data can do'. It can batch process millions and billions of records both unstructured and structured much faster and cheaper. Big data analytics provide a platform to merge all analysis which enables data analysis to be more accurate, well-rounded, reliable and focused on a specific business capability. Big Data Imperatives describes the complementary nature of traditional data warehouses and big-data analytics platforms and how they feed each other. This book aims to bring the big data and analytics realms together with a greater focus on architectures that leverage the scale and power of big data and the ability to integrate and apply analytics principles to data which earlier was not accessible. This book can also be used as a handbook for practitioners; helping them on methodology,technical architecture, analytics techniques and best practices. At the same time, this book intends to hold the interest of those new to big data and analytics by giving them a deep insight into the realm of big data.","language":"en","currency":"USD","id":"1430248734","title":"Big Data Imperatives","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WZdqU45XfkkC&source=gbs_api","authors":["Soumendra Mohanty","Madhu Jagadeesh","Harsha Srivatsa"]},{"pageCount":331,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6_BUCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A NoSQL Platform for the Enterprise","description":"Pro Couchbase Development: A NoSQL Platform for the Enterprise discusses programming for Couchbase using Java and scripting languages, querying and searching, handling migration, and integrating Couchbase with Hadoop, HDFS, and JSON. It also discusses migration from other NoSQL databases like MongoDB. This book is for big data developers who use Couchbase NoSQL database or want to use Couchbase for their web applications as well as for those migrating from other NoSQL databases like MongoDB and Cassandra. For example, a reason to migrate from Cassandra is that it is not based on the JSON document model with support for a flexible schema without having to define columns and supercolumns. The target audience is largely Java developers but the book also supports PHP and Ruby developers who want to learn about Couchbase. The author supplies examples in Java, PHP, Ruby, and JavaScript. After reading and using this hands-on guide for developing with Couchbase, you'll be able to build complex enterprise, database and cloud applications that leverage this powerful platform.","language":"en","currency":"USD","id":"148421434X","title":"Pro Couchbase Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6_BUCgAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W-WSBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"CompTIA Security+ Exam Cram, Fourth Edition, is the perfect study guide to help you pass CompTIA’s newly updated version of the Security+ exam. It provides coverage and practice questions for every exam topic. The book contains a set of 200 questions in two full practice exams. The CD-ROM contains the powerful Pearson IT Certification Practice Test engine that provides real-time practice and feedback with all the questions so you can simulate the exam. Covers the critical information you need to know to score higher on your Security+ exam! --Categorize types of attacks, threats, and risks to your systems --Secure devices, communications, and network infrastructure -- Troubleshoot issues related to networking components -- Effectively manage risks associated with a global business environment -- Differentiate between control methods used to secure the physical domain -- Identify solutions to secure hosts, data, and applications -- Compare techniques to mitigate risks in static environments -- Determine relevant access control, authorization, and authentication procedures -- Select appropriate mitigation techniques in response to attacks and vulnerabilities -- Apply principles of cryptography and effectively deploy related solutions --Implement security practices from both a technical and an organizational standpoint","language":"en","currency":"USD","id":"0133836444","title":"CompTIA Security+ SY0-401 Exam Cram","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W-WSBgAAQBAJ&source=gbs_api","authors":["Diane Barrett","Martin Weiss","Kirk Hausman"]},{"pageCount":22,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-OQ2q5JqOdEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"We've all heard it: according to Hal Varian, statistics is the next sexy job. Five years ago, in What is Web 2.0, Tim O'Reilly said that \"data is the next Intel Inside.\" But what does that statement mean? Why do we suddenly care about statistics and about data? This report examines the many sides of data science -- the technologies, the companies and the unique skill sets.The web is full of \"data-driven apps.\" Almost any e-commerce application is a data-driven application. There's a database behind a web front end, and middleware that talks to a number of other databases and data services (credit card processing companies, banks, and so on). But merely using data isn't really what we mean by \"data science.\" A data application acquires its value from the data itself, and creates more data as a result. It's not just an application with data; it's a data product. Data science enables the creation of data products.","language":"en","currency":"USD","id":"1449336094","title":"What Is Data Science?","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-OQ2q5JqOdEC&source=gbs_api","authors":["Mike Loukides"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tZtNCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Concepts, Drivers & Techniques","description":"“This text should be required reading for everyone in contemporary business.” --Peter Woodhull, CEO, Modus21 “The one book that clearly describes and links Big Data concepts to business utility.” --Dr. Christopher Starr, PhD “Simply, this is the best Big Data book on the market!” --Sam Rostam, Cascadian IT Group “...one of the most contemporary approaches I’ve seen to Big Data fundamentals...” --Joshua M. Davis, PhD The Definitive Plain-English Guide to Big Data for Business and Technology Professionals Big Data Fundamentals provides a pragmatic, no-nonsense introduction to Big Data. Best-selling IT author Thomas Erl and his team clearly explain key Big Data concepts, theory and terminology, as well as fundamental technologies and techniques. All coverage is supported with case study examples and numerous simple diagrams. The authors begin by explaining how Big Data can propel an organization forward by solving a spectrum of previously intractable business problems. Next, they demystify key analysis techniques and technologies and show how a Big Data solution environment can be built and integrated to offer competitive advantages. Discovering Big Data’s fundamental concepts and what makes it different from previous forms of data analysis and data science Understanding the business motivations and drivers behind Big Data adoption, from operational improvements through innovation Planning strategic, business-driven Big Data initiatives Addressing considerations such as data management, governance, and security Recognizing the 5 “V” characteristics of datasets in Big Data environments: volume, velocity, variety, veracity, and value Clarifying Big Data’s relationships with OLTP, OLAP, ETL, data warehouses, and data marts Working with Big Data in structured, unstructured, semi-structured, and metadata formats Increasing value by integrating Big Data resources with corporate performance monitoring Understanding how Big Data leverages distributed and parallel processing Using NoSQL and other technologies to meet Big Data’s distinct data processing requirements Leveraging statistical approaches of quantitative and qualitative analysis Applying computational analysis methods, including machine learning","language":"en","currency":"USD","id":"0134291204","title":"Big Data Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tZtNCwAAQBAJ&source=gbs_api","authors":["Thomas Erl","Wajid Khattak","Paul Buhler"]},{"pageCount":305,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i1fSDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"How to Integrate Your RDBMS with the Hadoop Ecosystem and Re-Architect Relational Applications to NoSQL","description":"Re-architect relational applications to NoSQL, integrate relational database management systems with the Hadoop ecosystem, and transform and migrate relational data to and from Hadoop components. This book covers the best-practice design approaches to re-architecting your relational applications and transforming your relational data to optimize concurrency, security, denormalization, and performance. Winner of IBM’s 2012 Gerstner Award for his implementation of big data and data warehouse initiatives and author of Practical Hadoop Security, author Bhushan Lakhe walks you through the entire transition process. First, he lays out the criteria for deciding what blend of re-architecting, migration, and integration between RDBMS and HDFS best meets your transition objectives. Then he demonstrates how to design your transition model. Lakhe proceeds to cover the selection criteria for ETL tools, the implementation steps for migration with SQOOP- and Flume-based data transfers, and transition optimization techniques for tuning partitions, scheduling aggregations, and redesigning ETL. Finally, he assesses the pros and cons of data lakes and Lambda architecture as integrative solutions and illustrates their implementation with real-world case studies. Hadoop\/NoSQL solutions do not offer by default certain relational technology features such as role-based access control, locking for concurrent updates, and various tools for measuring and enhancing performance. Practical Hadoop Migration shows how to use open-source tools to emulate such relational functionalities in Hadoop ecosystem components. What You'll Learn Decide whether you should migrate your relational applications to big data technologies or integrate them Transition your relational applications to Hadoop\/NoSQL platforms in terms of logical design and physical implementation Discover RDBMS-to-HDFS integration, data transformation, and optimization techniques Consider when to use Lambda architecture and data lake solutions Select and implement Hadoop-based components and applications to speed transition, optimize integrated performance, and emulate relational functionalities Who This Book Is For Database developers, database administrators, enterprise architects, Hadoop\/NoSQL developers, and IT leaders. Its secondary readership is project and program managers and advanced students of database and management information systems.","language":"en","currency":"USD","id":"1484212878","title":"Practical Hadoop Migration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i1fSDAAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZnteDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A beginner's guide to creating scalable, globally distributed, and highly responsive applications using Cosmos DB","description":"Gain an in-depth understanding of Azure Cosmos DB — a multi-model database from Microsoft Key Features Develop your skills to build and scale applications using the power of Azure CosmosDB. Learn how to store and access data with a variety of APIs including MongoDB, Gremlin, SQL, Azure Tables and much more. Fast paced guide to have a better understanding of the features with the practical approach mentioned. Book Description Microsoft has introduced a new globally distributed database, called Azure Cosmos DB. It is a superset of Microsoft's existing NoSQL Document DB service. Azure Cosmos DB enables you to scale throughput and storage elastically and independently across any number of Azure's geographic regions. This book is a must-have for anyone who wants to get introduced to the world of Cosmos DB. This book will focus on building globally-distributed applications without the hassle of complex, multiple datacenter configurations. This book will shed light on how Cosmos DB offers multimodal NoSQL database capabilities in the cloud at a scale that is one product with different database engines, such as key-value, document, graph, and wide column store. We will cover detailed practical examples on how to create a CRUD application using Cosmos DB with a frontend framework of your choice. This book will empower developers to choose their favorite database engines to perform integration, along with other systems that utilize the most popular languages, such as Node.js. This book will take you through the tips and trick, of Cosmos DB deployment, management, and the security offered by Azure Cosmos DB in order to detect, prevent, and respond to database breaches. By the end of this book, you will not only be aware of the best capabilities of relational and non-relational databases, but you will also be able to build scalable, globally distributed, and highly responsive applications. What you will learn Build highly responsive and mission-critical applications Understand how distributed databases are important for global scale and low latency Understand how to write globally distributed applications the right way Implement comprehensive SLAs for throughput, latency, consistency, and availability Implement multiple data models and popular APIs for accessing and querying data Implement best practices covering data security in order to detect, prevent and respond to database breaches Who this book is for This book is intended to anyone who wants to get well versed with Microsoft's new NoSQL database called Azure Cosmos DB. Get the database into work with the practical examples mentioned.","language":"en","currency":"USD","id":"1788472403","title":"Learning Azure Cosmos DB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZnteDwAAQBAJ&source=gbs_api","authors":["Shahid Shaikh"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VOtODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 80 hand-picked recipes for effective Redis development and administration","description":"Leverage the power of Redis 4.x to develop, optimize and administer your Redis solutions with ease Key Features Build, deploy and administer high performance and scalable applications in Redis Covers a range of important tasks - including development and administration of Redis A practical guide that takes your understanding of Redis to the next level Book Description Redis is considered the world's most popular key-value store database. Its versatility and the wide variety of use cases it enables have made it a popular choice of database for many enterprises. Based on the latest version of Redis, this book provides both step-by-step recipes and relevant the background information required to utilize its features to the fullest. It covers everything from a basic understanding of Redis data types to advanced aspects of Redis high availability, clustering, administration, and troubleshooting. This book will be your great companion to master all aspects of Redis. The book starts off by installing and configuring Redis for you to get started with ease. Moving on, all the data types and features of Redis are introduced in detail. Next, you will learn how to develop applications with Redis in Java, Python, and the Spring Boot web framework. You will also learn replication tasks, which will help you to troubleshoot replication issues. Furthermore, you will learn the steps that need to be undertaken to ensure high availability on your cluster and during production deployment. Toward the end of the book, you will learn the topmost tasks that will help you to troubleshoot your ecosystem efficiently, along with extending Redis by using different modules. What you will learn Install and configure your Redis instance Explore various data types and commands in Redis Build client-side applications as well as a Big Data framework with Redis Manage data replication and persistence in Redis Implement high availability and data sharding in Redis Extend Redis with Redis Module Benchmark, debug, fine-tune and troubleshoot various issues in Redis Who this book is for This book is for database administrators, developers and architects who want to tackle the common and not so common problems associated with the different development and administration-related tasks in Redis. A fundamental understanding of Redis is expected to get the best out of this book.","language":"en","currency":"USD","id":"1783988177","title":"Redis 4.x Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VOtODwAAQBAJ&source=gbs_api","authors":["Pengcheng Huang","Zuofei Wang"]},{"pageCount":569,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oh6HDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"First International Conference, DMBD 2016, Bali, Indonesia, June 25-30, 2016. Proceedings","description":"The LNCS volume LNCS 9714 constitutes the refereed proceedings of the International Conference on Data Mining and Big Data, DMBD 2016, held in Bali, Indonesia, in June 2016. The 57 papers presented in this volume were carefully reviewed and selected from 115 submissions. The theme of DMBD 2016 is \"Serving Life with Data Science\". Data mining refers to the activity of going through big data sets to look for relevant or pertinent information.The papers are organized in 10 cohesive sections covering all major topics of the research and development of data mining and big data and one Workshop on Computational Aspects of Pattern Recognition and Computer Vision.","language":"en","currency":"USD","id":"3319409735","title":"Data Mining and Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oh6HDAAAQBAJ&source=gbs_api","authors":["Ying Tan","Yuhui Shi"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8YLoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Mitigate exploits, malware, phishing, and other social engineering attacks","description":"After scrutinizing numerous cybersecurity strategies, Microsoft’s former Global Chief Security Advisor provides unique insights on the evolution of the threat landscape and how enterprises can address modern cybersecurity challenges. Key Features Protect your organization from cybersecurity threats with field-tested strategies by the former most senior security advisor at Microsoft Discover the most common ways enterprises initially get compromised Measure the effectiveness of your organization’s current cybersecurity program against cyber attacks Book Description Cybersecurity Threats, Malware Trends, and Strategies shares numerous insights about the threats that both public and private sector organizations face and the cybersecurity strategies that can mitigate them. The book provides an unprecedented long-term view of the global threat landscape by examining the twenty-year trend in vulnerability disclosures and exploitation, nearly a decade of regional differences in malware infections, the socio-economic factors that underpin them, and how global malware has evolved. This will give you further perspectives into malware protection for your organization. It also examines internet-based threats that CISOs should be aware of. The book will provide you with an evaluation of the various cybersecurity strategies that have ultimately failed over the past twenty years, along with one or two that have actually worked. It will help executives and security and compliance professionals understand how cloud computing is a game changer for them. By the end of this book, you will know how to measure the effectiveness of your organization’s cybersecurity strategy and the efficacy of the vendors you employ to help you protect your organization and yourself. What you will learn Discover cybersecurity strategies and the ingredients critical to their success Improve vulnerability management by reducing risks and costs for your organization Learn how malware and other threats have evolved over the past decade Mitigate internet-based threats, phishing attacks, and malware distribution sites Weigh the pros and cons of popular cybersecurity strategies of the past two decades Implement and then measure the outcome of a cybersecurity strategy Learn how the cloud provides better security capabilities than on-premises IT environments Who this book is for This book is for senior management at commercial sector and public sector organizations, including Chief Information Security Officers (CISOs) and other senior managers of cybersecurity groups, Chief Information Officers (CIOs), Chief Technology Officers (CTOs) and senior IT managers who want to explore the entire spectrum of cybersecurity, from threat hunting and security risk management to malware analysis. Governance, risk, and compliance professionals will also benefit. Cybersecurity experts that pride themselves on their knowledge of the threat landscape will come to use this book as a reference.","language":"en","currency":"USD","id":"1800205899","title":"Cybersecurity Threats, Malware Trends, and Strategies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8YLoDwAAQBAJ&source=gbs_api","authors":["Tim Rains"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4S7WBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a data analyst, developer, or simply someone who wants to use Hive to explore and analyze data in Hadoop, this is the book for you. Whether you are new to big data or an expert, with this book, you will be able to master both the basic and the advanced features of Hive. Since Hive is an SQL-like language, some previous experience with the SQL language and databases is useful to have a better understanding of this book.","language":"en","currency":"USD","id":"1782175059","title":"Apache Hive Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4S7WBgAAQBAJ&source=gbs_api","authors":["Dayong Du"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K-l1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"An expert guide to improving database scalability and availability without compromising performance, 3rd Edition","description":"Build, manage, and configure high-performing, reliable NoSQL database for your applications with Cassandra Key Features Write programs more efficiently using Cassandra's features with the help of examples Configure Cassandra and fine-tune its parameters depending on your needs Integrate Cassandra database with Apache Spark and build strong data analytics pipeline Book Description With ever-increasing rates of data creation, the demand for storing data fast and reliably becomes a need. Apache Cassandra is the perfect choice for building fault-tolerant and scalable databases. Mastering Apache Cassandra 3.x teaches you how to build and architect your clusters, configure and work with your nodes, and program in a high-throughput environment, helping you understand the power of Cassandra as per the new features. Once you’ve covered a brief recap of the basics, you’ll move on to deploying and monitoring a production setup and optimizing and integrating it with other software. You’ll work with the advanced features of CQL and the new storage engine in order to understand how they function on the server-side. You’ll explore the integration and interaction of Cassandra components, followed by discovering features such as token allocation algorithm, CQL3, vnodes, lightweight transactions, and data modelling in detail. Last but not least you will get to grips with Apache Spark. By the end of this book, you’ll be able to analyse big data, and build and manage high-performance databases for your application. What you will learn Write programs more efficiently using Cassandra's features more efficiently Exploit the given infrastructure, improve performance, and tweak the Java Virtual Machine (JVM) Use CQL3 in your application in order to simplify working with Cassandra Configure Cassandra and fine-tune its parameters depending on your needs Set up a cluster and learn how to scale it Monitor a Cassandra cluster in different ways Use Apache Spark and other big data processing tools Who this book is for Mastering Apache Cassandra 3.x is for you if you are a big data administrator, database administrator, architect, or developer who wants to build a high-performing, scalable, and fault-tolerant database. Prior knowledge of core concepts of databases is required.","language":"en","currency":"USD","id":"1789132800","title":"Mastering Apache Cassandra 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K-l1DwAAQBAJ&source=gbs_api","authors":["Aaron Ploetz","Tejaswi Malepati","Nishant Neeraj"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n8FffirFaQIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Data Warehouse and Query Language for Hadoop","description":"Need to move a relational database application to Hadoop? This comprehensive guide introduces you to Apache Hive, Hadoop’s data warehouse infrastructure. You’ll quickly learn how to use Hive’s SQL dialect—HiveQL—to summarize, query, and analyze large datasets stored in Hadoop’s distributed filesystem. This example-driven guide shows you how to set up and configure Hive in your environment, provides a detailed overview of Hadoop and MapReduce, and demonstrates how Hive works within the Hadoop ecosystem. You’ll also find real-world case studies that describe how companies have used Hive to solve unique problems involving petabytes of data. Use Hive to create, alter, and drop databases, tables, views, functions, and indexes Customize data formats and storage options, from files to external databases Load and extract data from tables—and use queries, grouping, filtering, joining, and other conventional query methods Gain best practices for creating user defined functions (UDFs) Learn Hive patterns you should use and anti-patterns you should avoid Integrate Hive with other data processing programs Use storage handlers for NoSQL databases and other datastores Learn the pros and cons of running Hive on Amazon’s Elastic MapReduce","language":"en","currency":"USD","id":"1449326978","title":"Programming Hive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n8FffirFaQIC&source=gbs_api","authors":["Edward Capriolo","Dean Wampler","Jason Rutherglen"]},{"pageCount":289,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C6cSBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"10th International Workshop, DNIS 2015, Aizu, Japan, March 23-25, 2015, Proceedings","description":"This book constitutes the refereed proceedings of the 10th International Workshop on Databases in Networked Information Systems, DNIS 2015, held in Aizu-Wakamatsu, Japan, March 2015. The 14 revised full papers presented together with 7 invited papers were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on big data analysis, information and knowledge management, business data analytics and visualization, networked information resources, and business data analytics in astronomy and sciences.","language":"en","currency":"USD","id":"3319163132","title":"Databases in Networked Information Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C6cSBwAAQBAJ&source=gbs_api","authors":["Wanming Chu","Shinji Kikuchi","Subhash Bhalla"]},{"pageCount":203,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f525BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"First Workshop, WBDB 2012, San Jose, CA, USA, May 8-9, 2012 and Second Workshop, WBDB 2012, Pune, India, December 17-18, 2012, Revised Selected Papers","description":"This book constitutes the thoroughly refereed revised selected papers of the First Workshop on Big Data Benchmarks, WBDB 2012, held in San Jose, CA, USA, in May 2012 and the Second Workshop on Big Data Benchmarks, WBDB 2012, held in Pune, India, in December 2012. The 14 revised papers presented were carefully reviewed and selected from 60 submissions. The papers are organized in topical sections on benchmarking, foundations and tools; domain specific benchmarking; benchmarking hardware and end-to-end big data benchmarks.","language":"en","currency":"USD","id":"3642539742","title":"Specifying Big Data Benchmarks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f525BQAAQBAJ&source=gbs_api","authors":["Tilmann Rabl","Meikel Poess","Chaitan Baru","Hans-Arno Jacobsen"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UYZqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"What Every SQL Professional Needs to Know about Non-Relational Databases","description":"Joe Celko's Complete Guide to NoSQL provides a complete overview of non-relational technologies so that you can become more nimble to meet the needs of your organization. As data continues to explode and grow more complex, SQL is becoming less useful for querying data and extracting meaning. In this new world of bigger and faster data, you will need to leverage non-relational technologies to get the most out of the information you have. Learn where, when, and why the benefits of NoSQL outweigh those of SQL with Joe Celko's Complete Guide to NoSQL. This book covers three areas that make today's new data different from the data of the past: velocity, volume and variety. When information is changing faster than you can collect and query it, it simply cannot be treated the same as static data. Celko will help you understand velocity, to equip you with the tools to drink from a fire hose. Old storage and access models do not work for big data. Celko will help you understand volume, as well as different ways to store and access data such as petabytes and exabytes. Not all data can fit into a relational model, including genetic data, semantic data, and data generated by social networks. Celko will help you understand variety, as well as the alternative storage, query, and management frameworks needed by certain kinds of data. Gain a complete understanding of the situations in which SQL has more drawbacks than benefits so that you can better determine when to utilize NoSQL technologies for maximum benefit Recognize the pros and cons of columnar, streaming, and graph databases Make the transition to NoSQL with the expert guidance of best-selling SQL expert Joe Celko","language":"en","currency":"USD","id":"0124072208","title":"Joe Celko’s Complete Guide to NoSQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UYZqAAAAQBAJ&source=gbs_api","authors":["Joe Celko"]}]