[{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=faPPDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Designing and Building Big Data Systems using the Hadoop Ecosystem","description":"Learn advanced analytical techniques and leverage existing tool kits to make your analytic applications more powerful, precise, and efficient. This book provides the right combination of architecture, design, and implementation information to create analytical systems that go beyond the basics of classification, clustering, and recommendation. Pro Hadoop Data Analytics emphasizes best practices to ensure coherent, efficient development. A complete example system will be developed using standard third-party components that consist of the tool kits, libraries, visualization and reporting code, as well as support glue to provide a working and extensible end-to-end system. The book also highlights the importance of end-to-end, flexible, configurable, high-performance data pipeline systems with analytical components as well as appropriate visualization results. You'll discover the importance of mix-and-match or hybrid systems, using different analytical components in one application. This hybrid approach will be prominent in the examples. What You'll Learn Build big data analytic systems with the Hadoop ecosystem Use libraries, tool kits, and algorithms to make development easier and more effective Apply metrics to measure performance and efficiency of components and systems Connect to standard relational databases, noSQL data sources, and more Follow case studies with example components to create your own systems Who This Book Is For Software engineers, architects, and data scientists with an interest in the design and implementation of big data analytical systems using Hadoop, the Hadoop ecosystem, and other associated technologies.","language":"en","currency":"USD","id":"1484219104","title":"Pro Hadoop Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=faPPDQAAQBAJ&source=gbs_api","authors":["Kerry Koitzsch"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2tEGBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"If you are interested in Cassandra and want to develop real-world analysis applications, then this book is perfect for you. It would be helpful to have prior knowledge of NoSQL database.","language":"en","currency":"USD","id":"1783988894","title":"Cassandra Data Modeling and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2tEGBgAAQBAJ&source=gbs_api","authors":["C.Y. Kan"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KJqLBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"The Object-Oriented Approach","description":"A comprehensive Java guide, with samples, exercises, casestudies, and step-by-step instruction Beginning Java Programming: The Object Oriented Approachis a straightforward resource for getting started with one of theworld's most enduringly popular programming languages. Based onclasses taught by the authors, the book starts with the basics andgradually builds into more advanced concepts. The approach utilizesan integrated development environment that allows readers toimmediately apply what they learn, and includes step-by-stepinstruction with plenty of sample programs. Each chapter containsexercises based on real-world business and educational scenarios,and the final chapter uses case studies to combine several conceptsand put readers' new skills to the test. Beginning Java Programming: The Object Oriented Approachprovides both the information and the tools beginners need todevelop Java skills, from the general concepts of object-orientedprogramming. Learn to: Understand the Java language and object-oriented conceptimplementation Use Java to access and manipulate external data Make applications accessible to users with GUIs Streamline workflow with object-oriented patterns The book is geared for those who want to use Java in an appliedenvironment while learning at the same time. Useful as either acourse text or a stand-alone self-study program, Beginning JavaProgramming is a thorough, comprehensive guide.","language":"en","currency":"USD","id":"1118739353","title":"Beginning Java Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KJqLBgAAQBAJ&source=gbs_api","authors":["Bart Baesens","Aimee Backiel","Seppe vanden Broucke"]},{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"An expert's guide to building fault-tolerant MongoDB applications","description":"An expert's guide to build fault tolerant MongoDB application About This Book Master the advanced modeling, querying, and administration techniques in MongoDB and become a MongoDB expert Covers the latest updates and Big Data features frequently used by professional MongoDB developers and administrators If your goal is to become a certified MongoDB professional, this book is your perfect companion Who This Book Is For Mastering MongoDB is a book for database developers, architects, and administrators who want to learn how to use MongoDB more effectively and productively. If you have experience in, and are interested in working with, NoSQL databases to build apps and websites, then this book is for you. What You Will Learn Get hands-on with advanced querying techniques such as indexing, expressions, arrays, and more. Configure, monitor, and maintain highly scalable MongoDB environment like an expert. Master replication and data sharding to optimize read\/write performance. Design secure and robust applications based on MongoDB. Administer MongoDB-based applications on-premise or in the cloud Scale MongoDB to achieve your design goals Integrate MongoDB with big data sources to process huge amounts of data In Detail MongoDB has grown to become the de facto NoSQL database with millions of users—from small startups to Fortune 500 companies. Addressing the limitations of SQL schema-based databases, MongoDB pioneered a shift of focus for DevOps and offered sharding and replication maintainable by DevOps teams. The book is based on MongoDB 3.x and covers topics ranging from database querying using the shell, built in drivers, and popular ODM mappers to more advanced topics such as sharding, high availability, and integration with big data sources. You will get an overview of MongoDB and how to play to its strengths, with relevant use cases. After that, you will learn how to query MongoDB effectively and make use of indexes as much as possible. The next part deals with the administration of MongoDB installations on-premise or in the cloud. We deal with database internals in the next section, explaining storage systems and how they can affect performance. The last section of this book deals with replication and MongoDB scaling, along with integration with heterogeneous data sources. By the end this book, you will be equipped with all the required industry skills and knowledge to become a certified MongoDB developer and administrator. Style and approach This book takes a practical, step-by-step approach to explain the concepts of MongoDB. Practical use-cases involving real-world examples are used throughout the book to clearly explain theoretical concepts.","language":"en","currency":"USD","id":"1783982616","title":"Mastering MongoDB 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JkBPDwAAQBAJ&source=gbs_api","authors":["Alex Giamas"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5b6zCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Deliver continuous access to timely and accurate BI across your enterprise using the detailed information in this Oracle Press guide. Through clear explanations and practical examples, a team of Oracle experts shows how to assimilate data from disparate sources into a single, unified view. Find out how to transform data in real time, handle replication and migration, and deploy Oracle Data Integrator and Oracle GoldenGate. Oracle Data Integration: Tools for Harnessing Data offers complete coverage of the latest “big data” hardware and software solutions. · Efficiently move data both inside and outside an Oracle environment · Map sources to database fields using Data Merge and ETL · Export schema through transportable tablespaces and Oracle Data Pump · Capture and apply changes across heterogeneous systems with Oracle GoldenGate · Seamlessly exchange information between databases using Oracle Data Integrator · Correct errors and maximize quality through data cleansing and validation · Plan and execute successful Oracle Database migrations and replications · Handle high-volume transactions with Oracle Big Data Appliance, Oracle NoSQL, and third-party utilities","language":"en","currency":"USD","id":"0071841660","title":"Oracle Data Integration: Tools for Harnessing Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5b6zCgAAQBAJ&source=gbs_api","authors":["Michelle Malcher","Bobby Curtis","Chris Lawless"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4ogx82US4fwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"The NoSQL Database for Cloud and Desktop Computing","description":"MongoDB, a cross-platform NoSQL database, is the fastest-growing new database in the world. MongoDB provides a rich document-oriented structure with dynamic queries that you’ll recognize from RDBMS offerings such as MySQL. In other words, this is a book about a NoSQL database that does not require the SQL crowd to re-learn how the database world works! MongoDB has reached 1.0 and boasts 50,000+ users. The community is strong and vibrant and MongoDB is improving at a fast rate. With scalable and fast databases becoming critical for today’s applications, this book shows you how to install, administer and program MongoDB without pretending SQL never existed.","language":"en","currency":"USD","id":"1430230525","title":"The Definitive Guide to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4ogx82US4fwC&source=gbs_api","authors":["Peter Membrey","Eelco Plugge","DUPTim Hawkins"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zvPtDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":96,"subtitle":null,"description":"Software Architecture for Big Data and the Cloud is designed to be a single resource that brings together research on how software architectures can solve the challenges imposed by building big data software systems. The challenges of big data on the software architecture can relate to scale, security, integrity, performance, concurrency, parallelism, and dependability, amongst others. Big data handling requires rethinking architectural solutions to meet functional and non-functional requirements related to volume, variety and velocity. The book's editors have varied and complementary backgrounds in requirements and architecture, specifically in software architectures for cloud and big data, as well as expertise in software engineering for cloud and big data. This book brings together work across different disciplines in software engineering, including work expanded from conference tracks and workshops led by the editors. Discusses systematic and disciplined approaches to building software architectures for cloud and big data with state-of-the-art methods and techniques Presents case studies involving enterprise, business, and government service deployment of big data applications Shares guidance on theory, frameworks, methodologies, and architecture for cloud and big data","language":"en","currency":"USD","id":"0128093382","title":"Software Architecture for Big Data and the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zvPtDQAAQBAJ&source=gbs_api","authors":["Ivan Mistrik","Rami Bahsoon","Nour Ali","Maritta Heisel","Bruce Maxim"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LauMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"with Big Data and Artificial Intelligence Case Studies","description":"The professional programmer’s Deitel® guide to Python® with introductory artificial intelligence case studies Written for programmers with a background in another high-level language, Python for Programmers uses hands-on instruction to teach today’s most compelling, leading-edge computing technologies and programming in Python–one of the world’s most popular and fastest-growing languages. Please read the Table of Contents diagram inside the front cover and the Preface for more details. In the context of 500+, real-world examples ranging from individual snippets to 40 large scripts and full implementation case studies, you’ll use the interactive IPython interpreter with code in Jupyter Notebooks to quickly master the latest Python coding idioms. After covering Python Chapters 1-5 and a few key parts of Chapters 6-7, you’ll be able to handle significant portions of the hands-on introductory AI case studies in Chapters 11-16, which are loaded with cool, powerful, contemporary examples. These include natural language processing, data mining Twitter® for sentiment analysis, cognitive computing with IBM® Watson™, supervised machine learning with classification and regression, unsupervised machine learning with clustering, computer vision through deep learning and convolutional neural networks, deep learning with recurrent neural networks, big data with Hadoop®, Spark™ and NoSQL databases, the Internet of Things and more. You’ll also work directly or indirectly with cloud-based services, including Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub and more. Features 500+ hands-on, real-world, live-code examples from snippets to case studies IPython + code in Jupyter® Notebooks Library-focused: Uses Python Standard Library and data science libraries to accomplish significant tasks with minimal code Rich Python coverage: Control statements, functions, strings, files, JSON serialization, CSV, exceptions Procedural, functional-style and object-oriented programming Collections: Lists, tuples, dictionaries, sets, NumPy arrays, pandas Series & DataFrames Static, dynamic and interactive visualizations Data experiences with real-world datasets and data sources Intro to Data Science sections: AI, basic stats, simulation, animation, random variables, data wrangling, regression AI, big data and cloud data science case studies: NLP, data mining Twitter®, IBM® Watson™, machine learning, deep learning, computer vision, Hadoop®, Spark™, NoSQL, IoT Open-source libraries: NumPy, pandas, Matplotlib, Seaborn, Folium, SciPy, NLTK, TextBlob, spaCy, Textatistic, Tweepy, scikit-learn®, Keras and more Accompanying code examples are available here: http:\/\/ptgmedia.pearsoncmg.com\/imprint_downloads\/informit\/bookreg\/9780135224335\/9780135224335_examples.zip. Register your product for convenient access to downloads, updates, and\/or corrections as they become available. See inside book for more information.","language":"en","currency":"USD","id":"0135231345","title":"Python for Programmers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LauMDwAAQBAJ&source=gbs_api","authors":["Paul J. Deitel","Harvey Deitel"]},{"pageCount":343,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-qIvCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A complete guide to dealing with Big Data using MongoDB","description":"The Definitive Guide to MongoDB, Third Edition, is updated for MongoDB 3 and includes all of the latest MongoDB features, including the aggregation framework introduced in version 2.2 and hashed indexes in version 2.4. The Third Edition also now includes Python. MongoDB is the most popular of the \"Big Data\" NoSQL database technologies, and it's still growing. David Hows from 10gen, along with experienced MongoDB authors Peter Membrey and Eelco Plugge, provide their expertise and experience in teaching you everything you need to know to become a MongoDB pro.","language":"en","currency":"USD","id":"1484211820","title":"The Definitive Guide to MongoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-qIvCwAAQBAJ&source=gbs_api","authors":["Eelco Plugge","David Hows","Peter Membrey","Tim Hawkins"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XhajBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":"MongoDB, Express, AngularJS, and Node.JS","description":"With modern tools. it is possible to create a production grade, full-stack application using HTML, CSS, and JavaScript alone. The combination of MongoDB, Express, AngularJS, and Node.js has become so popular that it has earned the title MEAN stack -- the subject of this book. This book explores the MEAN stack in detail. We will begin by covering Node.js, as it will lay the groundwork for all of our server-side work. You will learn how to get Node running on your local machine as well as download modules using npm. The key aspects of the Node.js programming model will also be covered. From there, we will move on to MongoDB, where you'll learn how to interact with Mongo from a Node application. You will also learn how to create, retrieve, update, and delete data from a Mongo store. After you have a solid grasp on Node and Mongo, the book will move on to the Express web server. We'll cover the basics of Express applications via topics like routes and middleware. Building on previous chapters, we will cover the integration of Node, Mongo, and Express. Our coverage of the MEAN stack will wrap up with several chapters on AngularJS. These chapters will cover Angular fundamentals like data binding, directives, controllers, routing, and services. In an effort to explore competing technologies, a slight introduction to Ember.js will also be provided. Full stack JavaScript is not fully encompassed by the MEAN stack. There is an entire ecosystem of JavaScript tools to learn about, and this book will introduce a few of them. We will cover task runners Gulp.js and Grunt.js which are extremely useful for automating mundane, repetitive tasks. We'll also cover JSHint, a linting tool used to improve code quality. Linting tools analyze source code and report potentials issues - a feature that is especially useful in non-compiled languages like JavaScript.","language":"en","currency":"USD","id":"1457192349","title":"Full Stack JavaScript Development With MEAN","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XhajBgAAQBAJ&source=gbs_api","authors":["Colin J Ihrig","Adam Bretz"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w9-9BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":null,"description":"This book presents the first comparative review of the state of the art and the best current practices of data warehouses. It covers source and data integration, multidimensional aggregation, query optimization, metadata management, quality assessment, and design optimization. A conceptual framework is presented by which the architecture and quality of a data warehouse can be assessed and improved using enriched metadata management combined with advanced techniques from databases, business modeling, and artificial intelligence.","language":"en","currency":"USD","id":"3662051532","title":"Fundamentals of Data Warehouses","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w9-9BwAAQBAJ&source=gbs_api","authors":["Matthias Jarke","Maurizio Lenzerini","Yannis Vassiliou","Panos Vassiliadis"]},{"pageCount":151,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P8-GDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Learn the fundamental foundations and concepts of the Apache HBase (NoSQL) open source database. It covers the HBase data model, architecture, schema design, API, and administration. Apache HBase is the database for the Apache Hadoop framework. HBase is a column family based NoSQL database that provides a flexible schema model. What You'll Learn Work with the core concepts of HBase Discover the HBase data model, schema design, and architecture Use the HBase API and administration Who This Book Is For Apache HBase (NoSQL) database users, designers, developers, and admins.","language":"en","currency":"USD","id":"1484224248","title":"Apache HBase Primer","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P8-GDQAAQBAJ&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C3jwVZl39k4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":145.6,"subtitle":null,"description":"Since its first volume in 1960, Advances in Computers has presented detailed coverage of innovations in computer hardware, software, theory, design, and applications. It has also provided contributors with a medium in which they can explore their subjects in greater depth and breadth than journal articles usually allow. As a result, many articles have become standard references that continue to be of sugnificant, lasting value in this rapidly expanding field. In-depth surveys and tutorials on new computer technology Well-known authors and researchers in the field Extensive bibliographies with most chapters Many of the volumes are devoted to single themes or subfields of computer science","language":"en","currency":"USD","id":"0124081118","title":"Connected Computing Environment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C3jwVZl39k4C&source=gbs_api","authors":[]},{"pageCount":417,"thumbnail":"http:\/\/books.google.com\/books\/content?id=creeBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":156,"subtitle":null,"description":"With the improvements of artificial intelligence, processor speeds and database sizes, the rapidly expanding field of data mining continues to provide advancing methods for managing databases and gaining knowledge. Developments in Data Extraction, Management, and Analysis is an essential collection of research on the area of data mining and analytics. Presenting the most recent perspectives on data mining subjects and current issues, this book is useful for practitioners and academics alike.","language":"en","currency":"USD","id":"1466621494","title":"Developments in Data Extraction, Management, and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=creeBQAAQBAJ&source=gbs_api","authors":["Do, Nhung"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8ngws8f_lNsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.76,"subtitle":null,"description":"Data Warehousing in the Age of the Big Data will help you and your organization make the most of unstructured data with your existing data warehouse. As Big Data continues to revolutionize how we use data, it doesn't have to create more confusion. Expert author Krish Krishnan helps you make sense of how Big Data fits into the world of data warehousing in clear and concise detail. The book is presented in three distinct parts. Part 1 discusses Big Data, its technologies and use cases from early adopters. Part 2 addresses data warehousing, its shortcomings, and new architecture options, workloads, and integration techniques for Big Data and the data warehouse. Part 3 deals with data governance, data visualization, information life-cycle management, data scientists, and implementing a Big Data–ready data warehouse. Extensive appendixes include case studies from vendor implementations and a special segment on how we can build a healthcare information factory. Ultimately, this book will help you navigate through the complex layers of Big Data and data warehousing while providing you information on how to effectively think about using all these technologies and the architectures to design the next-generation data warehouse. Learn how to leverage Big Data by effectively integrating it into your data warehouse. Includes real-world examples and use cases that clearly demonstrate Hadoop, NoSQL, HBASE, Hive, and other Big Data technologies Understand how to optimize and tune your current data warehouse infrastructure and integrate newer infrastructure matching data processing workloads and requirements","language":"en","currency":"USD","id":"0124059201","title":"Data Warehousing in the Age of Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8ngws8f_lNsC&source=gbs_api","authors":["Krish Krishnan"]},{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1_JGAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":140,"subtitle":null,"description":"\"This book discusses the exponential growth of information size and the innovative methods for data capture, storage, sharing, and analysis for big data\"--Provided by publisher.","language":"en","currency":"USD","id":"1466647000","title":"Big Data Management, Technologies, and Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1_JGAwAAQBAJ&source=gbs_api","authors":["Hu, Wen-Chen"]},{"pageCount":442,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qB7XBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Insight and Innovation beyond Analytics and Big Data","description":"Business intelligence (BI) used to be so simple—in theory anyway. Integrate and copy data from your transactional systems into a specialized relational database, apply BI reporting and query tools and add business users. Job done. No longer. Analytics, big data and an array of diverse technologies have changed everything. More importantly, business is insisting on ever more value, ever faster from information and from IT in general. An emerging biz-tech ecosystem demands that business and IT work together. Business unIntelligence reflects the new reality that in today’s socially complex and rapidly changing world, business decisions must be based on a combination of rational and intuitive thinking. Integrating cues from diverse information sources and tacit knowledge, decision makers create unique meaning to innovate heuristically at the speed of thought. This book provides a wealth of new models that business and IT can use together to design support systems for tomorrow’s successful organizations. Dr. Barry Devlin, one of the earliest proponents of data warehousing, goes back to basics to explore how the modern trinity of information, process and people must be reinvented and restructured to deliver the value, insight and innovation required by modern businesses. From here, he develops a series of novel architectural models that provide a new foundation for holistic information use across the entire business. From discovery to analysis and from decision making to action taking, he defines a fully integrated, closed-loop business environment. Covering every aspect of business analytics, big data, collaborative working and more, this book takes over where BI ends to deliver the definitive framework for information use in the coming years. As the person who defined the conceptual framework and physical architecture for data warehousing in the 1980s, Barry Devlin has been an astute observer of the movement he initiated ever since. Now, in Business unIntelligence, Devlin provides a sweeping view of the past, present, and future of business intelligence, while delivering new conceptual and physical models for how to turn information into insights and action. Reading Devlin’s prose and vision of BI are comparable to reading Carl Sagan’s view of the cosmos. The book is truly illuminating and inspiring. --Wayne Eckerson, President, BI Leader Consulting Author, “Secrets of Analytical Leaders: Insights from Information Insiders”","language":"en","currency":"USD","id":"1634620321","title":"Business unIntelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qB7XBgAAQBAJ&source=gbs_api","authors":["Dr. Barry Devlin"]},{"pageCount":845,"thumbnail":"http:\/\/books.google.com\/books\/content?id=h4jJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"A Step-by-Step Guide","description":"Leverage the power of visualization in business intelligence and data science to make quicker and better decisions. Use statistics and data mining to make compelling and interactive dashboards. This book will help those familiar with Tableau software chart their journey to being a visualization expert. Pro Tableau demonstrates the power of visual analytics and teaches you how to: Connect to various data sources such as spreadsheets, text files, relational databases (Microsoft SQL Server, MySQL, etc.), non-relational databases (NoSQL such as MongoDB, Cassandra), R data files, etc. Write your own custom SQL, etc. Perform statistical analysis in Tableau using R Use a multitude of charts (pie, bar, stacked bar, line, scatter plots, dual axis, histograms, heat maps, tree maps, highlight tables, box and whisker, etc.) What you’ll learn Connect to various data sources such as relational databases (Microsoft SQL Server, MySQL), non-relational databases (NoSQL such as MongoDB, Cassandra), write your own custom SQL, join and blend data sources, etc. Leverage table calculations (moving average, year over year growth, LOD (Level of Detail), etc. Integrate Tableau with R Tell a compelling story with data by creating highly interactive dashboards Who this book is for All levels of IT professionals, from executives responsible for determining IT strategies to systems administrators, to data analysts, to decision makers responsible for driving strategic initiatives, etc. The book will help those familiar with Tableau software chart their journey to a visualization expert.","language":"en","currency":"USD","id":"1484223527","title":"Pro Tableau","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=h4jJDQAAQBAJ&source=gbs_api","authors":["Seema Acharya","Subhashini Chellappan"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-0M5AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® Redbooks® publication describes how the IBM Big Data Platform provides the integrated capabilities that are required for the adoption of Information Governance in the big data landscape. As organizations embark on new use cases, such as Big Data Exploration, an enhanced 360 view of customers, or Data Warehouse modernization, and absorb ever growing volumes and variety of data with accelerating velocity, the principles and practices of Information Governance become ever more critical to ensure trust in data and help organizations overcome the inherent risks and achieve the wanted value. The introduction of big data changes the information landscape. Data arrives faster than humans can react to it, and issues can quickly escalate into significant events. The variety of data now poses new privacy and security risks. The high volume of information in all places makes it harder to find where these issues, risks, and even useful information to drive new value and revenue are. Information Governance provides an organization with a framework that can align their wanted outcomes with their strategic management principles, the people who can implement those principles, and the architecture and platform that are needed to support the big data use cases. The IBM Big Data Platform, coupled with a framework for Information Governance, provides an approach to build, manage, and gain significant value from the big data landscape.","language":"en","currency":"USD","id":"0738439592","title":"Information Governance Principles and Practices for a Big Data Landscape","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-0M5AwAAQBAJ&source=gbs_api","authors":["Chuck Ballard","Cindy Compert","Tom Jesionowski","Ivan Milman","Bill Plants","Barry Rosen","Harald Smith","IBM Redbooks"]},{"pageCount":209,"thumbnail":"http:\/\/books.google.com\/books\/content?id=W7C7BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"4th TPC Technology Conference, TPCTC 2012, Istanbul, Turkey, August 27, 2012, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 4th TPC Technology Conference, TPCTC 2012, held in Istanbul, Turkey, in August 2012. It contains 10 selected peer-reviewed papers, 2 invited talks, a report from the TPC Public Relations Committee, and a report from the workshop on Big Data Benchmarking, WBDB 2012. The papers present novel ideas and methodologies in performance evaluation, measurement, and characterization.","language":"en","currency":"USD","id":"3642367275","title":"Selected Topics in Performance Evaluation and Benchmarking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=W7C7BQAAQBAJ&source=gbs_api","authors":["Raghunath Nambiar","Meikel Poess"]},{"pageCount":24,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wZHe0t4ZgWoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"As data science evolves to become a business necessity, the importance of assembling a strong and innovative data teams grows. In this in-depth report, data scientist DJ Patil explains the skills, perspectives, tools and processes that position data science teams for success. Topics include: What it means to be \"data driven.\" The unique roles of data scientists. The four essential qualities of data scientists. Patil's first-hand experience building the LinkedIn data science team.","language":"en","currency":"USD","id":"1449316778","title":"Building Data Science Teams","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wZHe0t4ZgWoC&source=gbs_api","authors":["DJ Patil"]},{"pageCount":129,"thumbnail":"http:\/\/books.google.com\/books\/content?id=myfLBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"Special Issue on Big Data and Open Data","description":"The LNCS journal Transactions on Large-Scale Data- and Knowledge-Centered Systems focuses on data management, knowledge discovery, and knowledge processing, which are core and hot topics in computer science. Since the 1990s, the Internet has become the main driving force behind application development in all domains. An increase in the demand for resource sharing across different sites connected through networks has led to an evolution of data- and knowledge-management systems from centralized systems to decentralized systems enabling large-scale distributed applications providing high scalability. Current decentralized systems still focus on data and knowledge as their main resource. Feasibility of these systems relies basically on P2P (peer-to-peer) techniques and the support of agent systems with scaling and decentralized control. Synergy between grids, P2P systems, and agent technologies is the key to data- and knowledge-centered systems in large-scale environments. This, the 19th issue of Transactions on Large-Scale Data- and Knowledge-Centered Systems, contains four high-quality papers investigating the areas of linked data and big data from a data management perspective. Two of the four papers focus on the application of clustering techniques in performing inference and search over (linked) data sources. One paper leverages graph analysis techniques to enable application-level integration of institutional data and a final paper describes an approach for protecting users' profile data from disclosure, tampering, and improper use.","language":"en","currency":"USD","id":"3662465620","title":"Transactions on Large-Scale Data- and Knowledge-Centered Systems XIX","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=myfLBgAAQBAJ&source=gbs_api","authors":["Abdelkader Hameurlain","Josef Küng","Roland Wagner","Devis Bianchini","Valeria De Antonellis","Roberto De Virgilio"]},{"pageCount":73,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uaSSAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25,"subtitle":null,"description":"Many applications process high volumes of streaming data, among them Internet traffic analysis, financial tickers, and transaction log mining. In general, a data stream is an unbounded data set that is produced incrementally over time, rather than being available in full before its processing begins. In this lecture, we give an overview of recent research in stream processing, ranging from answering simple queries on high-speed streams to loading real-time data feeds into a streaming warehouse for off-line analysis. We will discuss two types of systems for end-to-end stream processing: Data Stream Management Systems (DSMSs) and Streaming Data Warehouses (SDWs). A traditional database management system typically processes a stream of ad-hoc queries over relatively static data. In contrast, a DSMS evaluates static (long-running) queries on streaming data, making a single pass over the data and using limited working memory. In the first part of this lecture, we will discuss research problems in DSMSs, such as continuous query languages, non-blocking query operators that continually react to new data, and continuous query optimization. The second part covers SDWs, which combine the real-time response of a DSMS by loading new data as soon as they arrive with a data warehouse's ability to manage Terabytes of historical data on secondary storage. Table of Contents: Introduction \/ Data Stream Management Systems \/ Streaming Data Warehouses \/ Conclusions","language":"en","currency":"USD","id":"1608452735","title":"Data Stream Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uaSSAwAAQBAJ&source=gbs_api","authors":["Lukasz Golab","M. Tamer Ozsu"]},{"pageCount":506,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qt18DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Perform end-to-end data analysis to gain efficient data insight","description":"Find, explore, and extract big data to transform into actionable insights Key Features Perform end-to-end data analysis—from exploration to visualization Real-world examples, tasks, and interview queries to be a proficient data scientist Understand how SQL is used for big data processing using HiveQL and SparkSQL Book Description SQL Server is a relational database management system that enables you to cover end-to-end data science processes using various inbuilt services and features. Hands-On Data Science with SQL Server 2017 starts with an overview of data science with SQL to understand the core tasks in data science. You will learn intermediate-to-advanced level concepts to perform analytical tasks on data using SQL Server. The book has a unique approach, covering best practices, tasks, and challenges to test your abilities at the end of each chapter. You will explore the ins and outs of performing various key tasks such as data collection, cleaning, manipulation, aggregations, and filtering techniques. As you make your way through the chapters, you will turn raw data into actionable insights by wrangling and extracting data from databases using T-SQL. You will get to grips with preparing and presenting data in a meaningful way, using Power BI to reveal hidden patterns. In the concluding chapters, you will work with SQL Server integration services to transform data into a useful format and delve into advanced examples covering machine learning concepts such as predictive analytics using real-world examples. By the end of this book, you will be in a position to handle the growing amounts of data and perform everyday activities that a data science professional performs. What you will learn Understand what data science is and how SQL Server is used for big data processing Analyze incoming data with SQL queries and visualizations Create, train, and evaluate predictive models Make predictions using trained models and establish regular retraining courses Incorporate data source querying into SQL Server Enhance built-in T-SQL capabilities using SQLCLR Visualize data with Reporting Services, Power View, and Power BI Transform data with R, Python, and Azure Who this book is for Hands-On Data Science with SQL Server 2017 is intended for data scientists, data analysts, and big data professionals who want to master their skills learning SQL and its applications. This book will be helpful even for beginners who want to build their career as data science professionals using the power of SQL Server 2017. Basic familiarity with SQL language will aid with understanding the concepts covered in this book.","language":"en","currency":"USD","id":"1788996437","title":"Hands-On Data Science with SQL Server 2017","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qt18DwAAQBAJ&source=gbs_api","authors":["Marek Chmel","Vladimír Mužný"]},{"pageCount":102,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VJblDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Survey","description":"This book provides readers the “big picture” and a comprehensive survey of the domain of big data processing systems. For the past decade, the Hadoop framework has dominated the world of big data processing, yet recently academia and industry have started to recognize its limitations in several application domains and big data processing scenarios such as the large-scale processing of structured data, graph data and streaming data. Thus, it is now gradually being replaced by a collection of engines that are dedicated to specific verticals (e.g. structured data, graph data, and streaming data). The book explores this new wave of systems, which it refers to as Big Data 2.0 processing systems. After Chapter 1 presents the general background of the big data phenomena, Chapter 2 provides an overview of various general-purpose big data processing systems that allow their users to develop various big data processing jobs for different application domains. In turn, Chapter 3 examines various systems that have been introduced to support the SQL flavor on top of the Hadoop infrastructure and provide competing and scalable performance in the processing of large-scale structured data. Chapter 4 discusses several systems that have been designed to tackle the problem of large-scale graph processing, while the main focus of Chapter 5 is on several systems that have been designed to provide scalable solutions for processing big data streams, and on other sets of systems that have been introduced to support the development of data pipelines between various types of big data processing jobs and systems. Lastly, Chapter 6 shares conclusions and an outlook on future research challenges. Overall, the book offers a valuable reference guide for students, researchers and professionals in the domain of big data processing systems. Further, its comprehensive content will hopefully encourage readers to pursue further research on the subject.","language":"en","currency":"USD","id":"3319387766","title":"Big Data 2.0 Processing Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VJblDAAAQBAJ&source=gbs_api","authors":["Sherif Sakr"]},{"pageCount":406,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kbZCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"Dive into the business intelligence features in SharePoint 2013—and use the right combination of tools to deliver compelling solutions. Take control of business intelligence (BI) with the tools offered by SharePoint 2013 and Microsoft SQL Server 2012. Led by a group of BI and SharePoint experts, you’ll get step-by-step instructions for understanding how to use these technologies best in specific BI scenarios—whether you’re a SharePoint administrator, SQL Server developer, or business analyst. Discover how to: Manage the entire BI lifecycle, from determining key performance indicators to building dashboards Use web-based Microsoft Excel services and publish workbooks on a SharePoint Server Mash up data from multiple sources and create Data Analysis Expressions (DAX) using PowerPivot Create data-driven diagrams that provide interactive processes and context with Microsoft Visio Services Use dashboards, scorecards, reports, and key performance indicators to monitor and analyze your business Use SharePoint to view BI reports side by side, no matter which tools were used to produced them","language":"en","currency":"USD","id":"0735675872","title":"Business Intelligence in Microsoft SharePoint 2013","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kbZCAwAAQBAJ&source=gbs_api","authors":["Norm Warren","Mariano Neto","Stacia Misner","Ivan Sanders","Scott A. Helmers"]},{"pageCount":594,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6tjfmnKhT24C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solutions and Examples for C++ Programmers","description":"Despite its highly adaptable and flexible nature, C++ is also one of the more complex programming languages to learn. Once mastered, however, it can help you organize and process information with amazing efficiency and quickness. The C++ Cookbook will make your path to mastery much shorter. This practical, problem-solving guide is ideal if you're an engineer, programmer, or researcher writing an application for one of the legions of platforms on which C++ runs. The algorithms provided in C++ Cookbook will jump-start your development by giving you some basic building blocks that you don't have to develop on your own. Less a tutorial than a problem-solver, the book addresses many of the most common problems you're likely encounter--whether you've been programming in C++ for years or you're relatively new to the language. Here are just some of the time-consuming tasks this book contains practical solutions for: Reading the contents of a directory Creating a singleton class Date and time parsing\/arithmetic String and text manipulation Working with files Parsing XML Using the standard containers Typical of O'Reilly's \"Cookbook\" series, C++ Cookbook is written in a straightforward format, featuring recipes that contain problem statements and code solutions, and apply not to hypothetical situations, but those that you're likely to encounter. A detailed explanation then follows each recipe in order to show you how and why the solution works. This question-solution-discussion format is a proven teaching method, as any fan of the \"Cookbook\" series can attest to. This book will move quickly to the top of your list of essential C++ references.","language":"en","currency":"USD","id":"1449366562","title":"C++ Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6tjfmnKhT24C&source=gbs_api","authors":["D. Ryan Stephens","Christopher Diggins","Jonathan Turkanis","Jeff Cogswell"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oSKwAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Oracle Database 12c","description":"Written by Oracle insiders, this indispensable guide distills an enormous amount of information about the Oracle Database into one compact volume. Ideal for novice and experienced DBAs, developers, managers, and users, Oracle Essentials walks you through technologies and features in Oracle’s product line, including its architecture, data structures, networking, concurrency, and tuning. Complete with illustrations and helpful hints, this fifth edition provides a valuable one-stop overview of Oracle Database 12c, including an introduction to Oracle and cloud computing. Oracle Essentials provides the conceptual background you need to understand how Oracle truly works. Topics include: A complete overview of Oracle databases and data stores, and Fusion Middleware products and features Core concepts and structures in Oracle’s architecture, including pluggable databases Oracle objects and the various datatypes Oracle supports System and database management, including Oracle Enterprise Manager 12c Security options, basic auditing capabilities, and options for meeting compliance needs Performance characteristics of disk, memory, and CPU tuning Basic principles of multiuser concurrency Oracle’s online transaction processing (OLTP) Data warehouses, Big Data, and Oracle’s business intelligence tools Backup and recovery, and high availability and failover solutions","language":"en","currency":"USD","id":"1449343171","title":"Oracle Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oSKwAAAAQBAJ&source=gbs_api","authors":["Rick Greenwald","Robert Stackowiak","Jonathan Stern"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FMGEBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.99,"subtitle":null,"description":"Master's Thesis from the year 2014 in the subject Computer Science - Applied, grade: 82.00, , course: M.Tech CS&E, language: English, abstract: Hadoop and Map reduce today are facing huge amounts of data and are moving towards ubiquitous for big data storage and processing. This has made it an essential feature to evaluate and characterize the Hadoop file system and its deployment through extensive benchmarking. We have other benchmarking tools widely available with us today that are capable of analyzing the performance of the Hadoop system but they are made to either run in a single node system or are created for assessing the storage device that is attached and its basic characteristics as top speed and other hardware related details or manufacturer’s details. For this, the tool used is HiBench that is an essential part of Hadoop and is comprehensive benchmark suit that consist of a complete deposit of Hadoop applications having micro bench marks & real time applications for the purpose of benchmarking the performance of Hadoop on the available type of storage device (i.e. HDD and SSD) and machine configuration. This is helpful to optimize the performance and improve the support towards the limitations of Hadoop system. In this research work we will analyze and characterize the performance of external sorting algorithm in Hadoop (MapReduce) with SSD and HDD that are connected with various Interconnect technologies like 10GigE, IPoIB and RDBAIB. In addition, we will also demonstrate that the traditional servers and old Cloud systems can be upgraded by software and hardware up gradations to perform at par with the modern technologies to handle these loads, without spending ruthlessly on up gradations or complete changes in the system with the use of Modern storage devices and interconnect networking systems. This in turn reduces the power consumption drastically and allows smoother running of large scale servers with low latency and high throughput allowing use of the utmost power of the processors for the big data flowing in the network.","language":"en","currency":"USD","id":"3656721610","title":"High-Performance Persistent Storage System for BigData Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FMGEBAAAQBAJ&source=gbs_api","authors":["Piyush Saxena"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM® RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x99mnGARqlYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"You've heard the hype about Hadoop: it runs petabyte–scale data mining tasks insanely fast, it runs gigantic tasks on clouds for absurdly cheap, it's been heavily committed to by tech giants like IBM, Yahoo!, and the Apache Project, and it's completely open-source (thus free). But what exactly is it, and more importantly, how do you even get a Hadoop cluster up and running? From Apress, the name you've come to trust for hands–on technical knowledge, Pro Hadoop brings you up to speed on Hadoop. You learn the ins and outs of MapReduce; how to structure a cluster, design, and implement the Hadoop file system; and how to build your first cloud–computing tasks using Hadoop. Learn how to let Hadoop take care of distributing and parallelizing your software—you just focus on the code, Hadoop takes care of the rest. Best of all, you'll learn from a tech professional who's been in the Hadoop scene since day one. Written from the perspective of a principal engineer with down–in–the–trenches knowledge of what to do wrong with Hadoop, you learn how to avoid the common, expensive first errors that everyone makes with creating their own Hadoop system or inheriting someone else's. Skip the novice stage and the expensive, hard–to–fix mistakes...go straight to seasoned pro on the hottest cloud–computing framework with Pro Hadoop. Your productivity will blow your managers away.","language":"en","currency":"USD","id":"1430219432","title":"Pro Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x99mnGARqlYC&source=gbs_api","authors":["Jason Venner"]},{"pageCount":500,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rhijBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":null,"description":"Learn JavaScript from scratch! Packed with numerous examples, JavaScript: Novice to Ninja is a fun, step-by-step and comprehensive introduction to development in JavaScript. Discover how to use JavaScript to solve real-world problems, build smarter forms, track user events, and design eye-catching animations. Learn JavaScript's built-in functions, methods, and properties. Use JavaScript to validate form entries and interact with your users. Understand how to respond to user events and add interactivity to your applications. Create animations that bring your web site to life. Start programming using the DOM And much more!","language":"en","currency":"USD","id":"1457192632","title":"JavaScript: Novice to Ninja","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rhijBgAAQBAJ&source=gbs_api","authors":["Darren Jones"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":917,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vQ9MDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":452,"subtitle":null,"description":"The digital age has presented an exponential growth in the amount of data available to individuals looking to draw conclusions based on given or collected information across industries. Challenges associated with the analysis, security, sharing, storage, and visualization of large and complex data sets continue to plague data scientists and analysts alike as traditional data processing applications struggle to adequately manage big data. The Handbook of Research on Big Data Storage and Visualization Techniques is a critical scholarly resource that explores big data analytics and technologies and their role in developing a broad understanding of issues pertaining to the use of big data in multidisciplinary fields. Featuring coverage on a broad range of topics, such as architecture patterns, programing systems, and computational energy, this publication is geared towards professionals, researchers, and students seeking current research and application topics on the subject.","language":"en","currency":"USD","id":"1522531432","title":"Handbook of Research on Big Data Storage and Visualization Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vQ9MDwAAQBAJ&source=gbs_api","authors":["Segall, Richard S.","Cook, Jeffrey S."]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=70OPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":54.4,"subtitle":"Principles and Practical Techniques","description":"Written in lucid language, this valuable textbook brings together fundamental concepts of data mining and data warehousing in a single volume. Important topics including information theory, decision tree, Naïve Bayes classifier, distance metrics, partitioning clustering, associate mining, data marts and operational data store are discussed comprehensively. The textbook is written to cater to the needs of undergraduate students of computer science, engineering and information technology for a course on data mining and data warehousing. The text simplifies the understanding of the concepts through exercises and practical examples. Chapters such as classification, associate mining and cluster analysis are discussed in detail with their practical implementation using Weka and R language data mining tools. Advanced topics including big data analytics, relational data models and NoSQL are discussed in detail. Pedagogical features including unsolved problems and multiple-choice questions are interspersed throughout the book for better understanding.","language":"en","currency":"USD","id":"110858585X","title":"Data Mining and Data Warehousing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=70OPDwAAQBAJ&source=gbs_api","authors":["Parteek Bhatia"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IyDlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Visualize and analyze your Hadoop data using Hunk About This Book Explore your data in Hadoop and NoSQL data stores Create and optimize your reporting experience with advanced data visualizations and data analytics A comprehensive developer's guide that helps you create outstanding analytical solutions efficiently Who This Book Is For If you are Hadoop developers who want to build efficient real-time Operation Intelligence Solutions based on Hadoop deployments or various NoSQL data stores using Hunk, this book is for you. Some familiarity with Splunk is assumed. What You Will Learn Deploy and configure Hunk on top of Cloudera Hadoop Create and configure Virtual Indexes for datasets Make your data presentable using the wide variety of data visualization components and knowledge objects Design a data model using Hunk best practices Add more flexibility to your analytics solution via extended SDK and custom visualizations Discover data using MongoDB as a data source Integrate Hunk with AWS Elastic MapReduce to improve scalability In Detail Hunk is the big data analytics platform that lets you rapidly explore, analyse, and visualize data in Hadoop and NoSQL data stores. It provides a single, fluid user experience, designed to show you insights from your big data without the need for specialized skills, fixed schemas, or months of development. Hunk goes beyond typical data analysis methods and gives you the power to rapidly detect patterns and find anomalies across petabytes of raw data. This book focuses on exploring, analysing, and visualizing big data in Hadoop and NoSQL data stores with this powerful full-featured big data analytics platform. You will begin by learning the Hunk architecture and Hunk Virtual Index before moving on to how to easily analyze and visualize data using Splunk Search Language (SPL). Next you will meet Hunk Apps which can easy integrate with NoSQL data stores such as MongoDB or Sqqrl. You will also discover Hunk knowledge objects, build a semantic layer on top of Hadoop, and explore data using the friendly user-interface of Hunk Pivot. You will connect MongoDB and explore data in the data store. Finally, you will go through report acceleration techniques and analyze data in the AWS Cloud. Style and approach A step-by-step guide starting right from the basics and deep diving into the more advanced and technical aspects of Hunk.","language":"en","currency":"USD","id":"1785283022","title":"Learning Hunk","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IyDlCwAAQBAJ&source=gbs_api","authors":["Dmitry Anoshin","Sergey Sheypak"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_PApCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"How to Install, Deploy, and Optimize Hadoop in a Virtualized Architecture","description":"Plan and Implement Hadoop Virtualization for Maximum Performance, Scalability, and Business Agility Enterprises running Hadoop must absorb rapid changes in big data ecosystems, frameworks, products, and workloads. Virtualized approaches can offer important advantages in speed, flexibility, and elasticity. Now, a world-class team of enterprise virtualization and big data experts guide you through the choices, considerations, and tradeoffs surrounding Hadoop virtualization. The authors help you decide whether to virtualize Hadoop, deploy Hadoop in the cloud, or integrate conventional and virtualized approaches in a blended solution. First, Virtualizing Hadoop reviews big data and Hadoop from the standpoint of the virtualization specialist. The authors demystify MapReduce, YARN, and HDFS and guide you through each stage of Hadoop data management. Next, they turn the tables, introducing big data experts to modern virtualization concepts and best practices. Finally, they bring Hadoop and virtualization together, guiding you through the decisions you’ll face in planning, deploying, provisioning, and managing virtualized Hadoop. From security to multitenancy to day-to-day management, you’ll find reliable answers for choosing your best Hadoop strategy and executing it. Coverage includes the following: • Reviewing the frameworks, products, distributions, use cases, and roles associated with Hadoop • Understanding YARN resource management, HDFS storage, and I\/O • Designing data ingestion, movement, and organization for modern enterprise data platforms • Defining SQL engine strategies to meet strict SLAs • Considering security, data isolation, and scheduling for multitenant environments • Deploying Hadoop as a service in the cloud • Reviewing the essential concepts, capabilities, and terminology of virtualization • Applying current best practices, guidelines, and key metrics for Hadoop virtualization • Managing multiple Hadoop frameworks and products as one unified system • Virtualizing master and worker nodes to maximize availability and performance • Installing and configuring Linux for a Hadoop environment","language":"en","currency":"USD","id":"0133811131","title":"Virtualizing Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_PApCgAAQBAJ&source=gbs_api","authors":["George Trujillo","Charles Kim","Steve Jones","Rommel Garcia","Justin Murray"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S-ZrBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"If you want to discover one of the latest tools designed to produce stunning Big Data insights, this book features everything you need to get to grips with your data. Whether you are a data architect, developer, or a business strategist, HDInsight adds value in everything from development, administration, and reporting.","language":"en","currency":"USD","id":"1784396664","title":"HDInsight Essentials - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S-ZrBgAAQBAJ&source=gbs_api","authors":["Rajesh Nadipalli"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YnDOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":176,"subtitle":"Trends and Technologies","description":"Web services, cloud computing, location based services, NoSQLdatabases, and Semantic Web offer new ways of accessing, analyzing, and elaborating geo-spatial information in both real-world and virtual spaces. This book explores the how-to of the most promising recurrent technologies and trends in GIS, such as Semantic GIS, Web GIS, Mobile GIS, NoSQL Geographic Databases, Cloud GIS, Spatial Data Warehousing-OLAP, and Open GIS. The text discusses and emphasizes the methodological aspects of such technologies and their applications in GIS.","language":"en","currency":"USD","id":"1466596953","title":"Geographical Information Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YnDOBQAAQBAJ&source=gbs_api","authors":["Elaheh Pourabbas"]},{"pageCount":94,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bxBnjitgIAYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Unlocking Hadoop for Your Relational Database","description":"Integrating data from multiple sources is essential in the age of big data, but it can be a challenging and time-consuming task. This handy cookbook provides dozens of ready-to-use recipes for using Apache Sqoop, the command-line interface application that optimizes data transfers between relational databases and Hadoop. Sqoop is both powerful and bewildering, but with this cookbook’s problem-solution-discussion format, you’ll quickly learn how to deploy and then apply Sqoop in your environment. The authors provide MySQL, Oracle, and PostgreSQL database examples on GitHub that you can easily adapt for SQL Server, Netezza, Teradata, or other relational systems. Transfer data from a single database table into your Hadoop ecosystem Keep table data and Hadoop in sync by importing data incrementally Import data from more than one database table Customize transferred data by calling various database functions Export generated, processed, or backed-up data from Hadoop to your database Run Sqoop within Oozie, Hadoop’s specialized workflow scheduler Load data into Hadoop’s data warehouse (Hive) or database (HBase) Handle installation, connection, and syntax issues common to specific database vendors","language":"en","currency":"USD","id":"1449364586","title":"Apache Sqoop Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bxBnjitgIAYC&source=gbs_api","authors":["Kathleen Ting","Jarek Jarcec Cecho"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0X7Dohne1tQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Value-Driven Approach to Business Intelligence and Data Warehousing","description":"Using Agile methods, you can bring far greater innovation, value, and quality to any data warehousing (DW), business intelligence (BI), or analytics project. However, conventional Agile methods must be carefully adapted to address the unique characteristics of DW\/BI projects. In Agile Analytics, Agile pioneer Ken Collier shows how to do just that. Collier introduces platform-agnostic Agile solutions for integrating infrastructures consisting of diverse operational, legacy, and specialty systems that mix commercial and custom code. Using working examples, he shows how to manage analytics development teams with widely diverse skill sets and how to support enormous and fast-growing data volumes. Collier’s techniques offer optimal value whether your projects involve “back-end” data management, “front-end” business analysis, or both. Part I focuses on Agile project management techniques and delivery team coordination, introducing core practices that shape the way your Agile DW\/BI project community can collaborate toward success Part II presents technical methods for enabling continuous delivery of business value at production-quality levels, including evolving superior designs; test-driven DW development; version control; and project automation Collier brings together proven solutions you can apply right now—whether you’re an IT decision-maker, data warehouse professional, database administrator, business intelligence specialist, or database developer. With his help, you can mitigate project risk, improve business alignment, achieve better results—and have fun along the way.","language":"en","currency":"USD","id":"0321669541","title":"Agile Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0X7Dohne1tQC&source=gbs_api","authors":["Ken W. Collier"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-yKCPHemQ0sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.96,"subtitle":null,"description":"The Internet and World Wide Web have revolutionized access to information. Users now store information across multiple platforms from personal computers to smartphones and websites. As a consequence, data management concepts, methods and techniques are increasingly focused on distribution concerns. Now that information largely resides in the network, so do the tools that process this information. This book explains the foundations of XML with a focus on data distribution. It covers the many facets of distributed data management on the Web, such as description logics, that are already emerging in today's data integration applications and herald tomorrow's semantic Web. It also introduces the machinery used to manipulate the unprecedented amount of data collected on the Web. Several 'Putting into Practice' chapters describe detailed practical applications of the technologies and techniques. The book will serve as an introduction to the new, global, information systems for Web professionals and master's level courses.","language":"en","currency":"USD","id":"113950505X","title":"Web Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-yKCPHemQ0sC&source=gbs_api","authors":["Serge Abiteboul","Ioana Manolescu","Philippe Rigaux","Marie-Christine Rousset","Pierre Senellart"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XBGfDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Die Autoren führen in das Gebiet der relationalen (SQL) und nicht-relationalen (NoSQL) Datenbanken ein. Themenschwerpunkte in der 8. Auflage bilden Datenmanagement, Datenmodellierung, Abfrage- und Manipulationssprachen, Konsistenzgewährung, Datenschutz und -Sicherheit, Systemarchitektur, Mehrbenutzerbetrieb. Das Buch bietet außerdem einen Überblick über postrelationale und nicht-relationale Datenbanksysteme. Neben klassischen Konzepten werden wichtige Aspekte für NoSQL-Datenbanken erläutert, wie das Verfahren Map\/Reduce, Verteilungsoptionen (Fragmente, Replikation) oder das CAP-Theorem (Consistency, Availability, Partition Tolerance). Eine Webseite ergänzt den Inhalt des Buches durch Tutorien für Abfrage- und Manipulationssprachen (SQL, Cypher), Übungsumgebungen für Datenbanken (MySQL, Neo4j) sowie zwei Fallstudien zu travelblitz (OpenOffice Base, Neo4j). Das Buch richtet sich sowohl an Studierende, die eine Einführung in das Gebiet der SQL- und NoSQL-Datenbanken suchen, wie auch an Praktiker, denen es hilft, Stärken und Schwächen relationaler Ansätze sowie Entwicklungen für Big-Data-Anwendungen besser einschätzen zu können.","language":"de","currency":"USD","id":"3662476649","title":"SQL- & NoSQL-Datenbanken","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XBGfDAAAQBAJ&source=gbs_api","authors":["Andreas Meier","Michael Kaufmann"]},{"pageCount":245,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxG68HEiv9QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.04,"subtitle":null,"description":"Web services are leading to the use of more packaged software either as an internal service or an external service available over the Internet. These services, which will be connected together to create the information technology systems of the future, will require less custom software in our organizations and more creativity in the connections between the services. This book begins with a high-level example of how an average person in an organization might interact with a service-oriented architecture. As the book progresses, more technical detail is added in a \"peeling of the onion\" approach. The leadership opportunities within these developing service-oriented architectures are also explained. At the end of the book there is a compendium or \"pocket library\" for software technology related to service-oriented architectures. · Only web services book to cover both data management and software engineering perspectives, excellent resource for ALL members of IT teams · Jargon free, highly illustrated, with introduction that anyone can read that then leads into increasing technical detail · Provides a set of leadership principles and suggested application for using this technology.","language":"en","currency":"USD","id":"9780080520940","title":"Web Services, Service-Oriented Architectures, and Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxG68HEiv9QC&source=gbs_api","authors":["Douglas K. Barry"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RT0eAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This is a step-by-step tutorial that deals with Microsoft Server 2012 reporting tools:SSRS and Power View. If you are a BI developer, consultant, or architect who wishes to learn how to use SSRS and Power View, and want to understand the best use for each tool, then this book will get you up and running quickly. No prior experience is required with either tool!","language":"en","currency":"USD","id":"1782171738","title":"Reporting with Microsoft SQL Server 2012","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RT0eAwAAQBAJ&source=gbs_api","authors":["James Serra","Bill Anton"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Vv1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Work with the massively scalable Azure database service with JSON, C#, LINQ, and .NET Core 2","description":"Create scalable applications by taking advantage of NoSQL document databases on the cloud with .NET Core Key Features Work with the latest available tools related to Cosmos DB Learn to work with the latest version of the .NET Core SDK, C# and the SQL API Work with a database service that doesn’t require you to use an ORM and provides flexibility Book Description Cosmos DB is a NoSQL database service included in Azure that is continuously adding new features and has quickly become one of the most innovative services found in Azure, targeting mission-critical applications at a global scale. This book starts off by showing you the main features of Cosmos DB, their supported NoSQL data models and the foundations of its scalable and distributed architecture. You will learn to work with the latest available tools that simplify your tasks with Cosmos DB and reduce development costs, such as the Data Explorer in the Azure portal, Microsoft Azure Storage Explorer, and the Cosmos DB Emulator. Next, move on to working with databases and document collections. We will use the tools to run schema agnostic queries against collections with the Cosmos DB SQL dialect and understand their results. Then, we will create a first version of an application that uses the latest .NET Core SDK to interact with Cosmos DB. Next, we will create a second version of the application that will take advantage of important features that the combination of C# and the .NET Core SDK provides, such as POCOs and LINQ queries. By the end of the book, you will be able to build an application that works with a Cosmos DB NoSQL document database with C#, the .NET Core SDK, LINQ, and JSON. What you will learn Understand the supported NoSQL data models and the resource hierarchy Learn the latest tools to work with Cosmos DB accounts and collections Reduce your development costs by working with the Cosmos DB Emulator Understand request units, automatic indexing, partitioning, and billing Build an application with C#, Cosmos DB, .NET Core SDK, and the SQL API Perform asynchronous operations with databases, and documents in C# Work with models, and customize serialization of LINQ queries Who this book is for This book is for C# developers. You do not require any knowledge of Azure Cosmos DB, but familiarity with the Azure platform is expected.","language":"en","currency":"USD","id":"1789618967","title":"Guide to NoSQL with Azure Cosmos DB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Vv1wDwAAQBAJ&source=gbs_api","authors":["Gaston C. Hillar","Daron Yöndem"]},{"pageCount":82,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SG5F3vxBRu4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Balancing Risk and Innovation","description":"What are your organization’s policies for generating and using huge datasets full of personal information? This book examines ethical questions raised by the big data phenomenon, and explains why enterprises need to reconsider business decisions concerning privacy and identity. Authors Kord Davis and Doug Patterson provide methods and techniques to help your business engage in a transparent and productive ethical inquiry into your current data practices. Both individuals and organizations have legitimate interests in understanding how data is handled. Your use of data can directly affect brand quality and revenue—as Target, Apple, Netflix, and dozens of other companies have discovered. With this book, you’ll learn how to align your actions with explicit company values and preserve the trust of customers, partners, and stakeholders. Review your data-handling practices and examine whether they reflect core organizational values Express coherent and consistent positions on your organization’s use of big data Define tactical plans to close gaps between values and practices—and discover how to maintain alignment as conditions change over time Maintain a balance between the benefits of innovation and the risks of unintended consequences","language":"en","currency":"USD","id":"1449357490","title":"Ethics of Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SG5F3vxBRu4C&source=gbs_api","authors":["Kord Davis"]},{"pageCount":248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2o-qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Effective Machine Learning Inspired by the Agile Manifesto","description":"Build resilient applied machine learning teams that deliver better data products through adapting the guiding principles of the Agile Manifesto. Bringing together talented people to create a great applied machine learning team is no small feat. With developers and data scientists both contributing expertise in their respective fields, communication alone can be a challenge. Agile Machine Learning teaches you how to deliver superior data products through agile processes and to learn, by example, how to organize and manage a fast-paced team challenged with solving novel data problems at scale, in a production environment. The authors’ approach models the ground-breaking engineering principles described in the Agile Manifesto. The book provides further context, and contrasts the original principles with the requirements of systems that deliver a data product. What You'll Learn Effectively run a data engineering team that is metrics-focused, experiment-focused, and data-focused Make sound implementation and model exploration decisions based on the data and the metrics Know the importance of data wallowing: analyzing data in real time in a group setting Recognize the value of always being able to measure your current state objectively Understand data literacy, a key attribute of a reliable data engineer, from definitions to expectations Who This Book Is For Anyone who manages a machine learning team, or is responsible for creating production-ready inference components. Anyone responsible for data project workflow of sampling data; labeling, training, testing, improving, and maintaining models; and system and data metrics will also find this book useful. Readers should be familiar with software engineering and understand the basics of machine learning and working with data.","language":"en","currency":"USD","id":"1484251075","title":"Agile Machine Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2o-qDwAAQBAJ&source=gbs_api","authors":["Eric Carter","Matthew Hurst"]},{"pageCount":170,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVvTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is for those application developers who want to achieve greater flexibility and scalability from their software. Whether you are familiar with other NoSQL databases or have only used relational systems, this book will provide you with enough background to move you along at your own pace. If you are new to NoSQL document databases, the design discussions and introductory material will give you the information you need to get started with Couchbase.","language":"en","currency":"USD","id":"1784397857","title":"Couchbase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVvTBgAAQBAJ&source=gbs_api","authors":["John Zablocki"]},{"pageCount":183,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-i2lDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Second International Workshop, ALGOCLOUD 2016, Aarhus, Denmark, August 22, 2016, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2016, held in Aarhus, Denmark, in August 2016. The 11 revised full papers presented together with one tutorial paper were carefully reviewed and selected from 30 initial submissions. They deal with the following topics: algorithmic aspects of elasticity and scalability for distributed, large-scale data stores (e.g. NoSQL and columnar databases); search and retrieval algorithms for cloud infrastructures; monitoring and analysis of elasticity for virtualized environments; NoSQL, schemaless data modeling, integration; caching and load-balancing; storage structures and indexing for cloud databases; new algorithmic aspects of parallel and distributed computing for cloud applications; scalable machine learning, analytics and data science; high availability, reliability, failover; transactional models and algorithms for cloud databases; query languages and processing programming models; consistency, replication and partitioning CAP, data structures and algorithms for eventually consistent stores.","language":"en","currency":"USD","id":"3319570455","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-i2lDgAAQBAJ&source=gbs_api","authors":["Timos Sellis","Konstantinos Oikonomou"]},{"pageCount":494,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MfOeCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.96,"subtitle":"Principles and Paradigms","description":"Big Data: Principles and Paradigms captures the state-of-the-art research on the architectural aspects, technologies, and applications of Big Data. The book identifies potential future directions and technologies that facilitate insight into numerous scientific, business, and consumer applications. To help realize Big Data’s full potential, the book addresses numerous challenges, offering the conceptual and technological solutions for tackling them. These challenges include life-cycle data management, large-scale storage, flexible processing infrastructure, data modeling, scalable machine learning, data analysis algorithms, sampling techniques, and privacy and ethical issues. Covers computational platforms supporting Big Data applications Addresses key principles underlying Big Data computing Examines key developments supporting next generation Big Data platforms Explores the challenges in Big Data computing and ways to overcome them Contains expert contributors from both academia and industry","language":"en","currency":"USD","id":"0128093463","title":"Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MfOeCwAAQBAJ&source=gbs_api","authors":["Rajkumar Buyya","Rodrigo N. Calheiros","Amir Vahid Dastjerdi"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zxNglqU1FKgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"The Stories Behind Elegant Data Solutions","description":"In this insightful book, you'll learn from the best data practitioners in the field just how wide-ranging -- and beautiful -- working with data can be. Join 39 contributors as they explain how they developed simple and elegant solutions on projects ranging from the Mars lander to a Radiohead video. With Beautiful Data, you will: Explore the opportunities and challenges involved in working with the vast number of datasets made available by the Web Learn how to visualize trends in urban crime, using maps and data mashups Discover the challenges of designing a data processing system that works within the constraints of space travel Learn how crowdsourcing and transparency have combined to advance the state of drug research Understand how new data can automatically trigger alerts when it matches or overlaps pre-existing data Learn about the massive infrastructure required to create, capture, and process DNA data That's only small sample of what you'll find in Beautiful Data. For anyone who handles data, this is a truly fascinating book. Contributors include: Nathan Yau Jonathan Follett and Matt Holm J.M. Hughes Raghu Ramakrishnan, Brian Cooper, and Utkarsh Srivastava Jeff Hammerbacher Jason Dykes and Jo Wood Jeff Jonas and Lisa Sokol Jud Valeski Alon Halevy and Jayant Madhavan Aaron Koblin with Valdean Klump Michal Migurski Jeff Heer Coco Krumme Peter Norvig Matt Wood and Ben Blackburne Jean-Claude Bradley, Rajarshi Guha, Andrew Lang, Pierre Lindenbaum, Cameron Neylon, Antony Williams, and Egon Willighagen Lukas Biewald and Brendan O'Connor Hadley Wickham, Deborah Swayne, and David Poole Andrew Gelman, Jonathan P. Kastellec, and Yair Ghitza Toby Segaran","language":"en","currency":"USD","id":"144937929X","title":"Beautiful Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zxNglqU1FKgC&source=gbs_api","authors":["Toby Segaran","Jeff Hammerbacher"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k5wQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Problem - Solution Approach","description":"Big Data Application Architecture Pattern Recipes provides an insight into heterogeneous infrastructures, databases, and visualization and analytics tools used for realizing the architectures of big data solutions. Its problem-solution approach helps in selecting the right architecture to solve the problem at hand. In the process of reading through these problems, you will learn harness the power of new big data opportunities which various enterprises use to attain real-time profits. Big Data Application Architecture Pattern Recipes answers one of the most critical questions of this time 'how do you select the best end-to-end architecture to solve your big data problem?'. The book deals with various mission critical problems encountered by solution architects, consultants, and software architects while dealing with the myriad options available for implementing a typical solution, trying to extract insight from huge volumes of data in real–time and across multiple relational and non-relational data types for clients from industries like retail, telecommunication, banking, and insurance. The patterns in this book provide the strong architectural foundation required to launch your next big data application. The architectures for realizing these opportunities are based on relatively less expensive and heterogeneous infrastructures compared to the traditional monolithic and hugely expensive options that exist currently. This book describes and evaluates the benefits of heterogeneity which brings with it multiple options of solving the same problem, evaluation of trade-offs and validation of 'fitness-for-purpose' of the solution.","language":"en","currency":"USD","id":"1430262931","title":"Big Data Application Architecture Q&A","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k5wQAwAAQBAJ&source=gbs_api","authors":["Nitin Sawant","Himanshu Shah"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ve-NDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.73,"subtitle":"Sistem Canggih di Balik Google, Yahoo!, Facebook, IBM","description":"Kini, adopsi teknologi Big Data bukan lagi hanya menjadi ranah perusahaan-perusahaan raksasa internet layaknya Google, Facebook, maupun Amazon. Sejumlah instansi pemerintah maupun perusahaan dalam negeri sudah mulai memberdayakannya. Bahkan, diantaranya sudah merealisasikan sukses besar. Buku ini didedikasikan untuk memberikan pengetahuan dasar namun komprehensif tentang konsep Big Data beserta teknologi terapannya. Disajikan sedemikian rupa mulai dari teori yang sifatnya konseptual, tutorial, hingga contoh implementasi sederhana yang berbasis real world data. Pembahasan dimulai dengan definisi Big Data, latar belakang munculnya istilah tersebut, serta berbagai contoh kasus aplikasinya. Kemudian, dilanjutkan dengan konsep teknologi Big Data yang telah dikembangkan oleh Google, diantaranya: Google File System, MapReduce, dan Big Table. Pada bab berikutnya, diuraikan konsep dan spesifikasi Hadoop, HBase, dan Spark yang dikembangkan oleh Apache Software Foundation. Selain itu, dibahas juga tentang teknologi web crawling dan database NoSQL MongoDB. Pada bab terakhir, guna merealisasikan pemahaman yang lebih komprehensif, disajikan sejumlah contoh sederhana implementasi teknologi Big Data yang mencakup tahap pengumpulan data, penyimpanan, analisa, hingga presentasi atau visualisasi. Contoh-contoh implementasi tersebut dikerjakan dengan memberdayakan real world data ( bukan data simulasi ). Sebagai pelengkap, pada bagian lampiran disertakan tutorial tentang cara setup serta penggunaan Hadoop, MapReduce, HBase dan Spark, baik pada platform Windows maupun Linux yang disertai dengan contoh program aplikasi. Dengan konten yang mencakup teori dan implementasi praktis, buku ini dapat menjadi referensi bagi berbagai kalangan: pelajar, akademisi, pelaku bisnis, maupun pemerintah, atau dapat menjadi semacam sumber inspirasi guna memicu lahirnya inovasi-inovasi kreatif terkait pemberdayaan data dan informasi, khususnya dalam konteks Big Data.","language":"id","currency":"USD","id":"6025375879","title":"Teknologi Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ve-NDwAAQBAJ&source=gbs_api","authors":["Wayan M. Wijaya"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=A_Y0DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book presents different use cases in big data applications and related practical experiences. Many businesses today are increasingly interested in utilizing big data technologies for supporting their business intelligence so that it is becoming more and more important to understand the various practical issues from different practical use cases. This book provides clear proof that big data technologies are playing an ever increasing important and critical role in a new cross-discipline research between computer science and business.","language":"en","currency":"USD","id":"3319301462","title":"Big Data Applications and Use Cases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=A_Y0DAAAQBAJ&source=gbs_api","authors":["Patrick C. K. Hung"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HhSON0xOCQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Boost your Big Data IQ! Gain insight into how to govern and consume IBM’s unique in-motion and at-rest Big Data analytic capabilities Big Data represents a new era of computing—an inflection point of opportunity where data in any format may be explored and utilized for breakthrough insights—whether that data is in-place, in-motion, or at-rest. IBM is uniquely positioned to help clients navigate this transformation. This book reveals how IBM is infusing open source Big Data technologies with IBM innovation that manifest in a platform capable of \"changing the game.\" The four defining characteristics of Big Data—volume, variety, velocity, and veracity—are discussed. You’ll understand how IBM is fully committed to Hadoop and integrating it into the enterprise. Hear about how organizations are taking inventories of their existing Big Data assets, with search capabilities that help organizations discover what they could already know, and extend their reach into new data territories for unprecedented model accuracy and discovery. In this book you will also learn not just about the technologies that make up the IBM Big Data platform, but when to leverage its purpose-built engines for analytics on data in-motion and data at-rest. And you’ll gain an understanding of how and when to govern Big Data, and how IBM’s industry-leading InfoSphere integration and governance portfolio helps you understand, govern, and effectively utilize Big Data. Industry use cases are also included in this practical guide.","language":"en","currency":"USD","id":"0071808183","title":"Harness the Power of Big Data The IBM Big Data Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HhSON0xOCQ0C&source=gbs_api","authors":["Paul Zikopoulos","Dirk deRoos","Krishnan Parasuraman","Thomas Deutsch","James Giles","David Corrigan"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C1nTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"If you are an application developer with some experience in software testing and want to learn more about testing frameworks, then this technology and book is for you. Mockito for Spring will be perfect as your next step towards becoming a competent software tester with Spring and Mockito.","language":"en","currency":"USD","id":"1783983795","title":"Mockito for Spring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C1nTBgAAQBAJ&source=gbs_api","authors":["Sujoy Acharya"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X2BECgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.96,"subtitle":null,"description":"Networking for Big Data supplies an unprecedented look at cutting-edge research on the networking and communication aspects of Big Data. Starting with a comprehensive introduction to Big Data and its networking issues, it offers deep technical coverage of both theory and applications. The book is divided into four sections: introduction to Big Data, networking theory and design for Big Data, networking security for Big Data, and platforms and systems for Big Data applications. Focusing on key networking issues in Big Data, the book explains network design and implementation for Big Data. It examines how network topology impacts data collection and explores Big Data storage and resource management. Addresses the virtual machine placement problem Describes widespread network and information security technologies for Big Data Explores network configuration and flow scheduling for Big Data applications Presents a systematic set of techniques that optimize throughput and improve bandwidth for efficient Big Data transfer on the Internet Tackles the trade-off problem between energy efficiency and service resiliency The book covers distributed Big Data storage and retrieval as well as security, trust, and privacy protection for Big Data collection, storage, and search. It discusses the use of cloud infrastructures and highlights its benefits to overcome the identified issues and to provide new approaches for managing huge volumes of heterogeneous data. The text concludes by proposing an innovative user data profile-aware policy-based network management framework that can help you exploit and differentiate user data profiles to achieve better power efficiency and optimized resource management.","language":"en","currency":"USD","id":"1482263505","title":"Networking for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X2BECgAAQBAJ&source=gbs_api","authors":["Shui Yu","Xiaodong Lin","Jelena Misic","Xuemin (Sherman) Shen"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X2BECgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.96,"subtitle":null,"description":"Networking for Big Data supplies an unprecedented look at cutting-edge research on the networking and communication aspects of Big Data. Starting with a comprehensive introduction to Big Data and its networking issues, it offers deep technical coverage of both theory and applications. The book is divided into four sections: introduction to Big Data, networking theory and design for Big Data, networking security for Big Data, and platforms and systems for Big Data applications. Focusing on key networking issues in Big Data, the book explains network design and implementation for Big Data. It examines how network topology impacts data collection and explores Big Data storage and resource management. Addresses the virtual machine placement problem Describes widespread network and information security technologies for Big Data Explores network configuration and flow scheduling for Big Data applications Presents a systematic set of techniques that optimize throughput and improve bandwidth for efficient Big Data transfer on the Internet Tackles the trade-off problem between energy efficiency and service resiliency The book covers distributed Big Data storage and retrieval as well as security, trust, and privacy protection for Big Data collection, storage, and search. It discusses the use of cloud infrastructures and highlights its benefits to overcome the identified issues and to provide new approaches for managing huge volumes of heterogeneous data. The text concludes by proposing an innovative user data profile-aware policy-based network management framework that can help you exploit and differentiate user data profiles to achieve better power efficiency and optimized resource management.","language":"en","currency":"USD","id":"1482263505","title":"Networking for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X2BECgAAQBAJ&source=gbs_api","authors":["Shui Yu","Xiaodong Lin","Jelena Misic","Xuemin (Sherman) Shen"]},{"pageCount":222,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vetaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is for developers who want an alternative way to store and process data within their applications. No previous graph database experience is required; however, some basic database knowledge will help you understand the concepts more easily.","language":"en","currency":"USD","id":"1849517177","title":"Learning Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vetaBAAAQBAJ&source=gbs_api","authors":["Rik Van Bruggen"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=22fOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":null,"description":"Linked Data Management presents techniques for querying and managing Linked Data that is available on today’s Web. The book shows how the abundance of Linked Data can serve as fertile ground for research and commercial applications. The text focuses on aspects of managing large-scale collections of Linked Data. It offers a detailed introduction to Linked Data and related standards, including the main principles distinguishing Linked Data from standard database technology. Chapters also describe how to generate links between datasets and explain the overall architecture of data integration systems based on Linked Data. A large part of the text is devoted to query processing in different setups. After presenting methods to publish relational data as Linked Data and efficient centralized processing, the book explores lookup-based, distributed, and parallel solutions. It then addresses advanced topics, such as reasoning, and discusses work related to read-write Linked Data for system interoperation. Despite the publication of many papers since Tim Berners-Lee developed the Linked Data principles in 2006, the field lacks a comprehensive, unified overview of the state of the art. Suitable for both researchers and practitioners, this book provides a thorough, consolidated account of the new data publishing and data integration paradigm. While the book covers query processing extensively, the Linked Data abstraction furnishes more than a mechanism for collecting, integrating, and querying data from the open Web—the Linked Data technology stack also allows for controlled, sophisticated applications deployed in an enterprise environment.","language":"en","currency":"USD","id":"1466582413","title":"Linked Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=22fOBQAAQBAJ&source=gbs_api","authors":["Andreas Harth","Katja Hose","Ralf Schenkel"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t2bnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19,"subtitle":null,"description":"Get a Jump Start on version control with Git today! If you've worked on a web development project of any size, you've probably used Git, the most broadly adopted distributed version control system available. It enables you to store different versions of project files and directories, so you can roll back to an earlier one if something goes wrong. And since it's distributed, it smoothes the path for dev team collaboration. This short, practical book will help you to: Understand Git's core philosophy. Get started with Git: install it, learn the basic commands, and set up your first project. Work with Git as part of a collaborative team. Use Git's debugging tools for maximum debug efficiency. Master Git workflow Take control with Git's advanced features: reflog, rebase, stash, and more. Use Git with cloud-based Git repository host services like Github and Bitbucket. See how Git's used effectively on large open-source projects. Whether you're a Git newbie or you've been using it for some time but only really scratching the surface of its capabilities, this book will help you to gain a deep understanding of how Git works, and how to use it to streamline your workflow.","language":"en","currency":"USD","id":"1098122879","title":"Jump Start Git","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t2bnDwAAQBAJ&source=gbs_api","authors":["Shaumik Daityari"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JJtsBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book is intended for developers and Big Data engineers who want to know all about HBase at a hands-on level. For in-depth understanding, it would be helpful to have a bit of familiarity with HDFS and MapReduce programming concepts with no prior experience with HBase or similar technologies. This book is also for Big Data enthusiasts and database developers who have worked with other NoSQL databases and now want to explore HBase as another futuristic, scalable database solution in the Big Data space.","language":"en","currency":"USD","id":"1783987251","title":"HBase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JJtsBQAAQBAJ&source=gbs_api","authors":["Nishant Garg"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VjDcBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Using Social MDM to Drive Deep Customer Insight","description":"Drive Powerful Business Value by Extending MDM to Social, Mobile, Local, and Transactional Data Enterprises have long relied on Master Data Management (MDM) to improve customer-related processes. But MDM was designed primarily for structured data. Today, crucial information is increasingly captured in unstructured, transactional, and social formats: from tweets and Facebook posts to call center transcripts. Even with tools like Hadoop, extracting usable insight is difficult—often, because it’s so difficult to integrate new and legacy data sources. In Beyond Big Data, five of IBM’s leading data management experts introduce powerful new ways to integrate social, mobile, location, and traditional data. Drawing on pioneering experience with IBM’s enterprise customers, they show how Social MDM can help you deepen relationships, improve prospect targeting, and fully engage customers through mobile channels. Business leaders and practitioners will discover powerful new ways to combine social and master data to improve performance and uncover new opportunities. Architects and other technical leaders will find a complete reference architecture, in-depth coverage of relevant technologies and use cases, and domain-specific best practices for their own projects. Coverage Includes How Social MDM extends fundamental MDM concepts and techniques Architecting Social MDM: components, functions, layers, and interactions Identifying high value relationships: person to product and person to organization Mapping Social MDM architecture to specific products and technologies Using Social MDM to create more compelling customer experiences Accelerating your transition to highly-targeted, contextual marketing Incorporating mobile data to improve employee productivity Avoiding privacy and ethical pitfalls throughout your ecosystem Previewing Semantic MDM and other emerging trends","language":"en","currency":"USD","id":"0133509818","title":"Beyond Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VjDcBAAAQBAJ&source=gbs_api","authors":["Martin Oberhofer","Eberhard Hechler","Ivan Milman","Scott Schumacher","Dan Wolfson"]},{"pageCount":364,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VY92BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"The book is aimed at Java developers who wish to develop Java EE applications while taking advantage of NetBeans functionality to automate repetitive tasks. Familiarity with NetBeans or Java EE is not assumed.","language":"en","currency":"USD","id":"1783983531","title":"Java EE 7 Development with NetBeans 8","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VY92BgAAQBAJ&source=gbs_api","authors":["David R. Heffelfinger"]},{"pageCount":760,"thumbnail":"http:\/\/books.google.com\/books\/content?id=goiHCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":143.96,"subtitle":null,"description":"Databases Illuminated, Third Edition Includes Navigate 2 Advantage Access combines database theory with a practical approach to database design and implementation. Strong pedagogical features, including accessible language, real-world examples, downloadable code, and engaging hands-on projects and lab exercises create a text with a unique combination of theory and student-oriented activities. Providing an integrated, modern approach to databases, Databases Illuminated, Third Edition is the essential text for students in this expanding field.","language":"en","currency":"USD","id":"128410642X","title":"Databases Illuminated","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=goiHCgAAQBAJ&source=gbs_api","authors":["Catherine M. Ricardo","Susan D. Urban"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GpoKZncgCxsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 150 recipes to design and optimize large scale Apache Cassandra deployments.","language":"en","currency":"USD","id":"1849515131","title":"Cassandra High Performance Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GpoKZncgCxsC&source=gbs_api","authors":["Edward Capriolo"]},{"pageCount":1128,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ENt06WRFvvgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"A Reference for Database Developers","description":"* This is the \"official\" book on FirebirdSQL—it’s being written with the support of the development and management team. * Includes an extensive set of working, real-world examples, a troubleshooting guide, and a guide to migrating existing databases to FirebirdSQL. * This is the only book on the topic; appeals to users worldwide, especially in Europe; Most people deploy Firebird on Windows.","language":"en","currency":"USD","id":"1430207434","title":"The Firebird Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ENt06WRFvvgC&source=gbs_api","authors":["Helen Borrie"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OwPG6pFAGX8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"A Systematic Approach to Database Optimization","description":"Oracle Performance Survival Guide A Systematic Approach to Database Optimization The fast, complete, start-to-finish guide to optimizing Oracle performance Oracle Performance Survival Guide offers a structured, systematic, start-to-finish methodology for optimizing Oracle performance as efficiently as possible. Leading Oracle expert Guy Harrison shows how to maximize your tuning investment by focusing on causes rather than symptoms, and by quickly identifying the areas that deliver the greatest “bang for the buck.” Writing for DBAs and developers with all levels of experience, Harrison covers every area of Oracle performance management, from application design through SQL tuning, contention management through memory and physical IO management. He also presents up-to-the-minute guidance for optimizing the performance of the Oracle 11g Release 2. You’ll start by mastering Oracle structured performance tuning principles and tools, including techniques for tracing and monitoring Oracle execution. Harrison illuminates the interaction between applications and databases, guides you through choosing tuning tools, and introduces upfront design techniques that lead to higher-performance applications. He also presents a collection of downloadable scripts for reporting on all aspects of database performance. Coverage includes • “Tuning by layers,” the most effective, highest-value approach to Oracle performance optimization • Making the most of Oracle’s core tools for tracing, monitoring, and diagnosing performance • Highly efficient database logical and physical design, indexing, transaction design, and API use • SQL and PL\/SQL tuning, including the use of parallel SQL techniques • Minimizing contention for locks, latches, shared memory, and other database resources • Optimizing memory and physical disk IO • Tuning Real Application Cluster (RAC) databases guyharrison.net informit.com\/ph","language":"en","currency":"USD","id":"0137000502","title":"Oracle Performance Survival Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OwPG6pFAGX8C&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yv1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Learn the skills you need to work with the world's most popular NoSQL database","description":"A fast paced guide that will help you to create, read, update and delete data using MongoDB Key Features Create secure databases with MongoDB Manipulate and maintain your database Model and use data in a No SQL environment with MongoDB Book Description MongoDB has grown to become the de facto NoSQL database with millions of users, from small start-ups to Fortune 500 companies. It can solve problems that are considered difficult, if not impossible, for aging RDBMS technologies. Written for version 4 of MongoDB, this book is the easiest way to get started with MongoDB. You will start by getting a MongoDB installation up and running in a safe and secure manner. You will learn how to perform mission-critical create, read, update, and delete operations, and set up database security. You will also learn about advanced features of MongoDB such as the aggregation pipeline, replication, and sharding. You will learn how to build a simple web application that uses MongoDB to respond to AJAX queries, and see how to make use of the MongoDB programming language driver for PHP. The examples incorporate new features available in MongoDB version 4 where appropriate. What you will learn Get a standard MongoDB database up and running quickly Perform simple CRUD operations on the database using the MongoDB command shell Set up a simple aggregation pipeline to return subsets of data grouped, sorted, and filtered Safeguard your data via replication and handle massive amounts of data via sharding Publish data from a web form to the database using a program language driver Explore the basic CRUD operations performed using the PHP MongoDB driver Who this book is for Web developers, IT professionals and Database Administrators (DBAs) who want to learn how to create and manage MongoDB databases.","language":"en","currency":"USD","id":"1789349729","title":"MongoDB 4 Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yv1wDwAAQBAJ&source=gbs_api","authors":["Doug Bierer"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l6O-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Ten-Week Bootcamp Approach to Python Programming","description":"Immerse yourself in learning Python and introductory data analytics with this book’s project-based approach. Through the structure of a ten-week coding bootcamp course, you’ll learn key concepts and gain hands-on experience through weekly projects. Each chapter in this book is presented as a full week of topics, with Monday through Thursday covering specific concepts, leading up to Friday, when you are challenged to create a project using the skills learned throughout the week. Topics include Python basics and essential intermediate concepts such as list comprehension, generators and iterators, understanding algorithmic complexity, and data analysis with pandas. From beginning to end, this book builds up your abilities through exercises and challenges, culminating in your solid understanding of Python. Challenge yourself with the intensity of a coding bootcamp experience or learn at your own pace. With this hands-on learning approach, you will gain the skills you need to jumpstart a new career in programming or further your current one as a software developer. What You Will Learn Understand beginning and more advanced concepts of the Python language Be introduced to data analysis using pandas, the Python Data Analysis library Walk through the process of interviewing and answering technical questions Create real-world applications with the Python language Learn how to use Anaconda, Jupyter Notebooks, and the Python Shell Who This Book Is For Those trying to jumpstart a new career into programming, and those already in the software development industry and would like to learn Python programming.","language":"en","currency":"USD","id":"1484253558","title":"Python Projects for Beginners","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l6O-DwAAQBAJ&source=gbs_api","authors":["Connor P. Milliken"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qZwvCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"A Guide to Data Science for Fraud Detection","description":"Detect fraud earlier to mitigate loss and prevent cascading damage Fraud Analytics Using Descriptive, Predictive, and Social Network Techniques is an authoritative guidebook for setting up a comprehensive fraud detection analytics solution. Early detection is a key factor in mitigating fraud damage, but it involves more specialized techniques than detecting fraud at the more advanced stages. This invaluable guide details both the theory and technical aspects of these techniques, and provides expert insight into streamlining implementation. Coverage includes data gathering, preprocessing, model building, and post-implementation, with comprehensive guidance on various learning techniques and the data types utilized by each. These techniques are effective for fraud detection across industry boundaries, including applications in insurance fraud, credit card fraud, anti-money laundering, healthcare fraud, telecommunications fraud, click fraud, tax evasion, and more, giving you a highly practical framework for fraud prevention. It is estimated that a typical organization loses about 5% of its revenue to fraud every year. More effective fraud detection is possible, and this book describes the various analytical techniques your organization must implement to put a stop to the revenue leak. Examine fraud patterns in historical data Utilize labeled, unlabeled, and networked data Detect fraud before the damage cascades Reduce losses, increase recovery, and tighten security The longer fraud is allowed to go on, the more harm it causes. It expands exponentially, sending ripples of damage throughout the organization, and becomes more and more complex to track, stop, and reverse. Fraud prevention relies on early and effective fraud detection, enabled by the techniques discussed here. Fraud Analytics Using Descriptive, Predictive, and Social Network Techniques helps you stop fraud in its tracks, and eliminate the opportunities for future occurrence.","language":"en","currency":"USD","id":"1119146836","title":"Fraud Analytics Using Descriptive, Predictive, and Social Network Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qZwvCgAAQBAJ&source=gbs_api","authors":["Bart Baesens","Veronique Van Vlasselaer","Wouter Verbeke"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Q68AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Mastering Apache Cassandra is a practical, hands-on guide with step-by-step instructions. The smooth and easy tutorial approach focuses on showing people how to utilize Cassandra to its full potential.This book is aimed at intermediate Cassandra users. It is best suited for startups where developers have to wear multiple hats: programmer, DevOps, release manager, convincing clients, and handling failures. No prior knowledge of Cassandra is required.","language":"en","currency":"USD","id":"1782162690","title":"Mastering Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Q68AQAAQBAJ&source=gbs_api","authors":["Nishant Neeraj"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FWvoCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Sams Teach Yourself Big Data Analytics with Microsoft HDInsight in 24 Hours In just 24 lessons of one hour or less, Sams Teach Yourself Big Data Analytics with Microsoft HDInsight in 24 Hours helps you leverage Hadoop’s power on a flexible, scalable cloud platform using Microsoft’s newest business intelligence, visualization, and productivity tools. This book’s straightforward, step-by-step approach shows you how to provision, configure, monitor, and troubleshoot HDInsight and use Hadoop cloud services to solve real analytics problems. You’ll gain more of Hadoop’s benefits, with less complexity–even if you’re completely new to Big Data analytics. Every lesson builds on what you’ve already learned, giving you a rock-solid foundation for real-world success. Practical, hands-on examples show you how to apply what you learn Quizzes and exercises help you test your knowledge and stretch your skills Notes and tips point out shortcuts and solutions Learn how to… · Master core Big Data and NoSQL concepts, value propositions, and use cases · Work with key Hadoop features, such as HDFS2 and YARN · Quickly install, configure, and monitor Hadoop (HDInsight) clusters in the cloud · Automate provisioning, customize clusters, install additional Hadoop projects, and administer clusters · Integrate, analyze, and report with Microsoft BI and Power BI · Automate workflows for data transformation, integration, and other tasks · Use Apache HBase on HDInsight · Use Sqoop or SSIS to move data to or from HDInsight · Perform R-based statistical computing on HDInsight datasets · Accelerate analytics with Apache Spark · Run real-time analytics on high-velocity data streams · Write MapReduce, Hive, and Pig programs Register your book at informit.com\/register for convenient access to downloads, updates, and corrections as they become available.","language":"en","currency":"USD","id":"013403533X","title":"Big Data Analytics with Microsoft HDInsight in 24 Hours, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FWvoCgAAQBAJ&source=gbs_api","authors":["Manpreet Singh","Arshad Ali"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1_KoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Build real-world, industry-strength data storage solutions with time-tested design methodologies using Cassandra About This Book Explore design patterns which co-exist with legacy data stores, migration from RDBMS, and caching technologies with Cassandra Learn about design patterns and use Cassandra to provide consistency, availability, and partition tolerance guarantees for applications Handle temporal data for analytical purposes Who This Book Is For This book is intended for big data developers who are familiar with the basics of Cassandra and wish to understand and utilize Cassandra design patterns to develop real-world big data solutions. Prior knowledge of RDBMS solutions is assumed. What You Will Learn Enable Cassandra to co-exist with RDBMS and other legacy data stores Explore various design patterns to build effective and robust storage solutions Migrate from RDBMS-based data stores and caching solutions to Cassandra Understand the behaviour of Cassandra when trying to balance the needs of consistency, availability, and partition tolerance Deal with time stamps related to data effectively See how Cassandra can be used in analytical use cases Apply the design patterns covered in this book in real-world use cases In Detail There are many NoSQL data stores used by big data applications. Cassandra is one of the most widely used NoSQL data stores that is frequently used by a huge number of heavy duty Internet-scale applications. Unlike the RDBMS world, the NoSQL landscape is very diverse and there is no one way to model data stores. This mandates the need to have good solutions to commonly seen data store design problems. Cassandra addresses such common problems simply. If you are new to Cassandra but well-versed in RDBMS modeling and design, then it is natural to model data in the same way in Cassandra, resulting in poorly performing applications and losing the real purpose of Cassandra. If you want to learn to make the most of Cassandra, this book is for you. This book starts with strategies to integrate Cassandra with other legacy data stores and progresses to the ways in which a migration from RDBMS to Cassandra can be accomplished. The journey continues with ideas to migrate data from cache solutions to Cassandra. With this, the stage is set and the book moves on to some of the most commonly seen problems in applications when dealing with consistency, availability, and partition tolerance guarantees. Cassandra is exceptionally good at dealing with temporal data and patterns such as the time-series pattern and log pattern, which are covered next. Many NoSQL data stores fail miserably when a huge amount of data is read for analytical purposes, but Cassandra is different in this regard. Keeping analytical needs in mind, you'll walk through different and interesting design patterns. No theoretical discussions are complete without a good set of use cases to which the knowledge gained can be applied, so the book concludes with a set of use cases you can apply the patterns you've learned. Style and approach This book is written in very simple language and an engaging style complete with examples in every chapter and real-world use cases at the end of the book.","language":"en","currency":"USD","id":"1783988487","title":"Cassandra Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1_KoCwAAQBAJ&source=gbs_api","authors":["Rajanarayanan Thottuvaikkatumana"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9SKJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Delivering the Promise of Big Data and Data Science","description":"The data lake is a daring new approach for harnessing the power of big data technology and providing convenient self-service capabilities. But is it right for your company? This book is based on discussions with practitioners and executives from more than a hundred organizations, ranging from data-driven companies such as Google, LinkedIn, and Facebook, to governments and traditional corporate enterprises. You’ll learn what a data lake is, why enterprises need one, and how to build one successfully with the best practices in this book. Alex Gorelik, CTO and founder of Waterline Data, explains why old systems and processes can no longer support data needs in the enterprise. Then, in a collection of essays about data lake implementation, you’ll examine data lake initiatives, analytic projects, experiences, and best practices from data experts working in various industries. Get a succinct introduction to data warehousing, big data, and data science Learn various paths enterprises take to build a data lake Explore how to build a self-service model and best practices for providing analysts access to the data Use different methods for architecting your data lake Discover ways to implement a data lake from experts in different industries","language":"en","currency":"USD","id":"1491931507","title":"The Enterprise Big Data Lake","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9SKJDwAAQBAJ&source=gbs_api","authors":["Alex Gorelik"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build highly effective analytics solutions to gain valuable insight into your big data","description":"Explore big data concepts, platforms, analytics, and their applications using the power of Hadoop 3 Key Features Learn Hadoop 3 to build effective big data analytics solutions on-premise and on cloud Integrate Hadoop with other big data tools such as R, Python, Apache Spark, and Apache Flink Exploit big data using Hadoop 3 with real-world examples Book Description Apache Hadoop is the most popular platform for big data processing, and can be combined with a host of other big data tools to build powerful analytics solutions. Big Data Analytics with Hadoop 3 shows you how to do just that, by providing insights into the software as well as its benefits with the help of practical examples. Once you have taken a tour of Hadoop 3’s latest features, you will get an overview of HDFS, MapReduce, and YARN, and how they enable faster, more efficient big data processing. You will then move on to learning how to integrate Hadoop with the open source tools, such as Python and R, to analyze and visualize data and perform statistical computing on big data. As you get acquainted with all this, you will explore how to use Hadoop 3 with Apache Spark and Apache Flink for real-time data analytics and stream processing. In addition to this, you will understand how to use Hadoop to build analytics solutions on the cloud and an end-to-end pipeline to perform big data analysis using practical use cases. By the end of this book, you will be well-versed with the analytical capabilities of the Hadoop ecosystem. You will be able to build powerful solutions to perform big data analytics and get insight effortlessly. What you will learn Explore the new features of Hadoop 3 along with HDFS, YARN, and MapReduce Get well-versed with the analytical capabilities of Hadoop ecosystem using practical examples Integrate Hadoop with R and Python for more efficient big data processing Learn to use Hadoop with Apache Spark and Apache Flink for real-time data analytics Set up a Hadoop cluster on AWS cloud Perform big data analytics on AWS using Elastic Map Reduce Who this book is for Big Data Analytics with Hadoop 3 is for you if you are looking to build high-performance analytics solutions for your enterprise or business using Hadoop 3’s powerful features, or you’re new to big data analytics. A basic understanding of the Java programming language is required.","language":"en","currency":"USD","id":"1788624955","title":"Big Data Analytics with Hadoop 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MHxeDwAAQBAJ&source=gbs_api","authors":["Sridhar Alla"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":366,"thumbnail":"http:\/\/books.google.com\/books\/content?id=39_HCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":null,"description":"This book contributes to illustrating the methodological and technological issues of data management in Pervasive Systems by using the DataBenc project as the running case study for a variety of research contributions: sensor data management, user-originated data operation and reasoning, multimedia data management, data analytics and reasoning for event detection and decision making, context modelling and control, automatic data and service tailoring for personalization and recommendation. The book is organized into the following main parts: i) multimedia information management; ii) sensor data streams and storage; iii) social networks as information sources; iv) context awareness and personalization. The case study is used throughout the book as a reference example.","language":"en","currency":"USD","id":"3319200623","title":"Data Management in Pervasive Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=39_HCgAAQBAJ&source=gbs_api","authors":["Francesco Colace","Massimo De Santo","Vincenzo Moscato","Antonio Picariello","Fabio A. Schreiber","Letizia Tanca"]},{"pageCount":314,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CXaBCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":156,"subtitle":null,"description":"Cloud computing has proven to be a successful paradigm of service-oriented computing, and has revolutionized the way computing infrastructures are abstracted and used. By means of cloud computing technology, massive data can be managed effectively and efficiently to support various aspects of problem solving and decision making. Managing Big Data in Cloud Computing Environments explores the latest advancements in the area of data management and analysis in the cloud. Providing timely, research-based information relating to data storage, sharing, extraction, and indexing in cloud systems, this publication is an ideal reference source for graduate students, IT specialists, researchers, and professionals working in the areas of data and knowledge engineering.","language":"en","currency":"USD","id":"1466698357","title":"Managing Big Data in Cloud Computing Environments","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CXaBCwAAQBAJ&source=gbs_api","authors":["Ma, Zongmin"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8kLfBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"This book is for Elasticsearch users who want to extend their knowledge and develop new skills. Prior knowledge of the Query DSL and data indexing is expected.","language":"en","currency":"USD","id":"1783553804","title":"Mastering Elasticsearch - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8kLfBgAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FN8dDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.95,"subtitle":null,"description":"◎內容精簡、淺顯易懂，可7天快速學會MongoDB ◎搭配MongoVUE的圖形介面操作，一步步帶領你上手 ◎透過實際範例，準確掌握精髓技巧 在大數據時代，NoSQL已經成為資料儲存的主流，而在NoSQL中最具影響力的資料庫，則以文件類型的MongoDB為第一，其在IT業界最為活躍。本書內容共分為7章，可以讓你在短時間內快速上手，了解如何將MongoDB實際應用在真實系統產品上。本書適合資料庫管理開發人員、資料探勘與分析人員以及各類應用大數據儲存的開發人員閱讀。","language":"zh-CN","currency":"USD","id":"9864340808","title":"7天學會大數據資料處理—NoSQL：MongoDB入門與活用","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FN8dDQAAQBAJ&source=gbs_api","authors":["黃士嘉","劉祐賓","周聖凱"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xmqPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Realtime and Object-Oriented Audio","description":"This book is divided into two parts. The chapters in Part I offer a comprehensive introduction to the C language and to fundamental programming concepts, followed by an explanation of realtime audio programming, including audio synthesis and processing. The chapters in Part II demonstrate how the object-oriented programming paradigm is useful in the modelling of computer music instruments, each chapter shows a set of instrument components that are paired with key C++ programming concepts. Ultimately the author discusses the development of a fully-fledged object-oriented library. Together with its companion volume, Computer Music Instruments: Foundations, Design and Development, this book provides a comprehensive treatment of computational instruments for sound and music. It is suitable for advanced undergraduate and postgraduate students in music and signal processing, and for practitioners and researchers. Some understanding of acoustics and electronic music would be helpful to understand some applications, but it's not strictly necessary to have prior knowledge of audio DSP or programming, while C \/ C++ programmers with no experience of audio may be able to start reading the chapters that deal with sound and music computing.","language":"en","currency":"USD","id":"3030137120","title":"Computer Music Instruments II","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xmqPDwAAQBAJ&source=gbs_api","authors":["Victor Lazzarini"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YNhOCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Over 90 hands-on recipes to design Internet scalable web and mobile applications with Amazon DynamoDB About This Book Construct top-notch mobile and web applications with the Internet scalable NoSQL database and host it on cloud Integrate your applications with other AWS services like AWS EMR, AWS S3, AWS Redshift, and AWS CloudSearch etc. in order to achieve a one-stop application stack Step-by-step implementation guide that provides real-world use with hands-on recipes Who This Book Is For This book is intended for those who have a basic understanding of AWS services and want to take their knowledge to the next level by getting their hands dirty with coding recipes in DynamoDB. What You Will Learn Design DynamoDB tables to achieve high read and write throughput Discover best practices like caching, exponential back-offs and auto-retries, storing large items in AWS S3, storing compressed data etc. Effectively use DynamoDB Local in order to make your development smooth and cost effective Implement cost effective best practices to reduce the burden of DynamoDB charges Create and maintain secondary indexes to support improved data access Integrate various other AWS services like AWS EMR, AWS CloudSearch, AWS Pipeline etc. with DynamoDB In Detail AWS DynamoDB is an excellent example of a production-ready NoSQL database. In recent years, DynamoDB has been able to attract many customers because of its features like high-availability, reliability and infinite scalability. DynamoDB can be easily integrated with massive data crunching tools like Hadoop \/EMR, which is an essential part of this data-driven world and hence it is widely accepted. The cost and time-efficient design makes DynamoDB stand out amongst its peers. The design of DynamoDB is so neat and clean that it has inspired many NoSQL databases to simply follow it. This book will get your hands on some engineering best practices DynamoDB engineers use, which can be used in your day-to-day life to build robust and scalable applications. You will start by operating with DynamoDB tables and learn to manipulate items and manage indexes. You will also discover how to easily integrate applications with other AWS services like EMR, S3, CloudSearch, RedShift etc. A couple of chapters talk in detail about how to use DynamoDB as a backend database and hosting it on AWS ElasticBean. This book will also focus on security measures of DynamoDB as well by providing techniques on data encryption, masking etc. By the end of the book you'll be adroit in designing web and mobile applications using DynamoDB and host it on cloud. Style and approach An easy-to-follow guide, full of real-world examples, which takes you through the world of DynamoDB following a step-by-step, problem-solution based approach.","language":"en","currency":"USD","id":"1784391093","title":"DynamoDB Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YNhOCwAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":214,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_X1XAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.69,"subtitle":"Strategies for Gaining a Competitive Advantage with Data","description":"Information Management: Gaining a Competitive Advantage with Data is about making smart decisions to make the most of company information. Expert author William McKnight develops the value proposition for information in the enterprise and succinctly outlines the numerous forms of data storage. Information Management will enlighten you, challenge your preconceived notions, and help activate information in the enterprise. Get the big picture on managing data so that your team can make smart decisions by understanding how everything from workload allocation to data stores fits together. The practical, hands-on guidance in this book includes: Part 1: The importance of information management and analytics to business, and how data warehouses are used Part 2: The technologies and data that advance an organization, and extend data warehouses and related functionality Part 3: Big Data and NoSQL, and how technologies like Hadoop enable management of new forms of data Part 4: Pulls it all together, while addressing topics of agile development, modern business intelligence, and organizational change management Read the book cover-to-cover, or keep it within reach for a quick and useful resource. Either way, this book will enable you to master all of the possibilities for data or the broadest view across the enterprise. Balances business and technology, with non-product-specific technical detail Shows how to leverage data to deliver ROI for a business Engaging and approachable, with practical advice on the pros and cons of each domain, so that you learn how information fits together into a complete architecture Provides a path for the data warehouse professional into the new normal of heterogeneity, including NoSQL solutions","language":"en","currency":"USD","id":"0124095267","title":"Information Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_X1XAQAAQBAJ&source=gbs_api","authors":["William McKnight"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OlMnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Working Guide to the Complete Hadoop Toolset","description":"Many corporations are finding that the size of their data sets are outgrowing the capability of their systems to store and process them. The data is becoming too big to manage and use with traditional tools. The solution: implementing a big data system. As Big Data Made Easy: A Working Guide to the Complete Hadoop Toolset shows, Apache Hadoop offers a scalable, fault-tolerant system for storing and processing data in parallel. It has a very rich toolset that allows for storage (Hadoop), configuration (YARN and ZooKeeper), collection (Nutch and Solr), processing (Storm, Pig, and Map Reduce), scheduling (Oozie), moving (Sqoop and Avro), monitoring (Chukwa, Ambari, and Hue), testing (Big Top), and analysis (Hive). The problem is that the Internet offers IT pros wading into big data many versions of the truth and some outright falsehoods born of ignorance. What is needed is a book just like this one: a wide-ranging but easily understood set of instructions to explain where to get Hadoop tools, what they can do, how to install them, how to configure them, how to integrate them, and how to use them successfully. And you need an expert who has worked in this area for a decade—someone just like author and big data expert Mike Frampton. Big Data Made Easy approaches the problem of managing massive data sets from a systems perspective, and it explains the roles for each project (like architect and tester, for example) and shows how the Hadoop toolset can be used at each system stage. It explains, in an easily understood manner and through numerous examples, how to use each tool. The book also explains the sliding scale of tools available depending upon data size and when and how to use them. Big Data Made Easy shows developers and architects, as well as testers and project managers, how to: Store big data Configure big data Process big data Schedule processes Move data among SQL and NoSQL systems Monitor data Perform big data analytics Report on big data processes and projects Test big data systems Big Data Made Easy also explains the best part, which is that this toolset is free. Anyone can download it and—with the help of this book—start to use it within a day. With the skills this book will teach you under your belt, you will add value to your company or client immediately, not to mention your career.","language":"en","currency":"USD","id":"1484200942","title":"Big Data Made Easy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OlMnCgAAQBAJ&source=gbs_api","authors":["Michael Frampton"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E71mV_OQgX0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"A J2EE developer's guide to using Oracle JDeveloper's integrated database features to build data-driven applications with this book and eBook","language":"en","currency":"USD","id":"1847194311","title":"JDBC 4.0 and Oracle JDeveloper for J2EE Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E71mV_OQgX0C&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":1322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KxA-BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":null,"description":"Fully revised to cover the 2014 CompTIA Security+ objectives, this is a money-saving self-study bundle with bonus study materials Prepare for CompTIA Security+ Exam SY0-401 with McGraw-Hill Professional--a Platinum-Level CompTIA Authorized Partner offering Authorized CompTIA Approved Quality Content to give you the competitive edge on exam day. CompTIA Security+ Certification Bundle, Second Edition offers complete coverage of exam SY0-401 and provides a comprehensive self-study program with 1200+ practice exam questions. Pre-assessment tests help you gauge your readiness for the full-length practice exams included in the bundle. For a final overview of key exam topics, you can study the Quick Review Guide. Total electronic content includes: 500 practice exam questions Pre-assessment exam Test engine that provides full-length practice exams and customized quizzes by chapter Video clips Security Audit Checklist Review Guide URL Reference List PDF copies of both books","language":"en","currency":"USD","id":"0071834273","title":"CompTIA Security+ Certification Bundle, Second Edition (Exam SY0-401)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KxA-BAAAQBAJ&source=gbs_api","authors":["Glen E. Clarke","Daniel Lachance"]},{"pageCount":1322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KxA-BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":null,"description":"Fully revised to cover the 2014 CompTIA Security+ objectives, this is a money-saving self-study bundle with bonus study materials Prepare for CompTIA Security+ Exam SY0-401 with McGraw-Hill Professional--a Platinum-Level CompTIA Authorized Partner offering Authorized CompTIA Approved Quality Content to give you the competitive edge on exam day. CompTIA Security+ Certification Bundle, Second Edition offers complete coverage of exam SY0-401 and provides a comprehensive self-study program with 1200+ practice exam questions. Pre-assessment tests help you gauge your readiness for the full-length practice exams included in the bundle. For a final overview of key exam topics, you can study the Quick Review Guide. Total electronic content includes: 500 practice exam questions Pre-assessment exam Test engine that provides full-length practice exams and customized quizzes by chapter Video clips Security Audit Checklist Review Guide URL Reference List PDF copies of both books","language":"en","currency":"USD","id":"0071834273","title":"CompTIA Security+ Certification Bundle, Second Edition (Exam SY0-401)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KxA-BAAAQBAJ&source=gbs_api","authors":["Glen E. Clarke","Daniel Lachance"]},{"pageCount":880,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fnfhAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The best fully integrated study system available for the CompTIA Security+ exam! Prepare for CompTIA Security+ Exam SY0-401 with McGraw-Hill Professional--a Platinum-Level CompTIA Authorized Partner offering Authorized CompTIA Approved Quality Content to give you the competitive edge on exam day. With hundreds of practice exam questions, including new performance-based questions, CompTIA Security+ Certification Study Guide, Second Edition covers what you need to know--and shows you how to prepare--for this challenging exam. 100% complete coverage of all official objectives for exam SY0-401 Exam Watch notes call attention to information about, and potential pitfalls in, the exam Inside the Exam sections in every chapter highlight key exam topics covered Two-Minute Drills for quick review at the end of every chapter Simulated exam questions--including performance-based questions--match the format, topics, and difficulty of the real exam Covers all the exam topics, including: Networking Basics and Terminology * Security Terminology * Security Policies and Standards * Types of Attacks * System Security Threats * Mitigating Security Threats * Implementing System Security * Securing the Network Infrastructure * Wireless Networking and Security * Authentication * Access Control * Cryptography • Managing a Public Key Infrastructure * Physical Security * Risk Analysis * Disaster Recovery and Business Continuity * Computer Forensics * Security Assessments and Audits * Monitoring and Auditing Electronic content includes: Test engine that provides customized practice exams by chapter or by exam domain 1+ hour of video training from the author Lab exercise PDF with solutions NEW pre-assessment exam Glossary of key terms PDF copy of the book for studying on the go","language":"en","currency":"USD","id":"007184127X","title":"CompTIA Security+ Certification Study Guide, Second Edition (Exam SY0-401)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fnfhAgAAQBAJ&source=gbs_api","authors":["Glen E. Clarke"]},{"pageCount":712,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yQgfCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":null,"description":"Relational Database Design and Implementation: Clearly Explained, Fourth Edition, provides the conceptual and practical information necessary to develop a database design and management scheme that ensures data accuracy and user satisfaction while optimizing performance. Database systems underlie the large majority of business information systems. Most of those in use today are based on the relational data model, a way of representing data and data relationships using only two-dimensional tables. This book covers relational database theory as well as providing a solid introduction to SQL, the international standard for the relational database data manipulation language. The book begins by reviewing basic concepts of databases and database design, then turns to creating, populating, and retrieving data using SQL. Topics such as the relational data model, normalization, data entities, and Codd's Rules (and why they are important) are covered clearly and concisely. In addition, the book looks at the impact of big data on relational databases and the option of using NoSQL databases for that purpose. Features updated and expanded coverage of SQL and new material on big data, cloud computing, and object-relational databases Presents design approaches that ensure data accuracy and consistency and help boost performance Includes three case studies, each illustrating a different database design challenge Reviews the basic concepts of databases and database design, then turns to creating, populating, and retrieving data using SQL","language":"en","currency":"USD","id":"0128499028","title":"Relational Database Design and Implementation","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yQgfCgAAQBAJ&source=gbs_api","authors":["Jan L. Harrington"]},{"pageCount":399,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PkkPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":"Tools and Technology for Effective Planning","description":"The proposed book will discuss various aspects of big data Analytics. It will deliberate upon the tools, technology, applications, use cases and research directions in the field. Chapters would be contributed by researchers, scientist and practitioners from various reputed universities and organizations for the benefit of readers.","language":"en","currency":"USD","id":"1351180320","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PkkPEAAAQBAJ&source=gbs_api","authors":["Arun K. Somani","Ganesh Chandra Deka"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z4WZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Practical Examples in Apache Spark and Neo4j","description":"Discover how graph algorithms can help you leverage the relationships within your data to develop more intelligent solutions and enhance your machine learning models. You’ll learn how graph analytics are uniquely suited to unfold complex structures and reveal difficult-to-find patterns lurking in your data. Whether you are trying to build dynamic network models or forecast real-world behavior, this book illustrates how graph algorithms deliver value—from finding vulnerabilities and bottlenecks to detecting communities and improving machine learning predictions. This practical book walks you through hands-on examples of how to use graph algorithms in Apache Spark and Neo4j—two of the most common choices for graph analytics. Also included: sample code and tips for over 20 practical graph algorithms that cover optimal pathfinding, importance through centrality, and community detection. Learn how graph analytics vary from conventional statistical analysis Understand how classic graph algorithms work, and how they are applied Get guidance on which algorithms to use for different types of questions Explore algorithm examples with working code and sample datasets from Spark and Neo4j See how connected feature extraction can increase machine learning accuracy and precision Walk through creating an ML workflow for link prediction combining Neo4j and Spark","language":"en","currency":"USD","id":"1492047635","title":"Graph Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z4WZDwAAQBAJ&source=gbs_api","authors":["Mark Needham","Amy E. Hodler"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C6VBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":null,"description":"This fully updated, money-saving collection covers every objective on the CompTIA Security+ exam SY0-501 and contains bonus content This up-to-date test preparation bundle covers every objective on the latest version of the CompTIA Security+ exam. Designed to be the ultimate self-study resource, the bundle includes the current editions of CompTIA Security+ Certification Study Guide and CompTIA Security+ Certification Practice Exams and exclusive electronic content—all at a discount of 12% off of the suggested retail price. CompTIA Security+ Certification Bundle, Third Edition, provides examinees with a wide variety of exam-focused preparation resources. Bonus content includes a quick review guide, a security audit checklist, and a URL reference list. Electronic content from the two books features author-led video training, lab simulations, and customizable test engine software that contains four complete practice exams. • 12% cheaper than purchasing the books individually, and features content unavailable elsewhere • Includes a 10% off exam voucher coupon, a $37 value • CompTIA Approved Quality Content (CAQC)—provides complete coverage of every objective on exam SY0-501","language":"en","currency":"USD","id":"1260116395","title":"CompTIA Security+ Certification Bundle, Third Edition (Exam SY0-501)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C6VBDwAAQBAJ&source=gbs_api","authors":["Glen E. Clarke","Daniel Lachance"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H2Y6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This fully updated, exam-focused study aid covers everything you need to know and shows you how to prepare for the CompTIA Security+ exam Thoroughly revised to cover every objective on the latest version of the CompTIA Security+ exam (SY0-501), this powerful self-study resource offers more than 400 questions that accurately mirror those on the actual test. Authored by training and certification expert, Glen Clarke, the book provides in-depth explanations for both correct and incorrect answer choices. CompTIA Security+ Certification Study Guide, Third Edition, offers three complete practice exams—one pre-assessment test and two final exams—intended to measure progress and prepare for the live test. Within the customizable test engine, questions may be organized by chapter and exam domain, allowing readers to focus on specific topics and tailor a highly effective course of study. • Provides 100% coverage of all objectives on the CompTIA Security+ exam (SY0-501) • Includes coverage of performance-based questions • Electronic content includes training videos from the author, all 50 exercises from the book in a Lab Book PDF, a pre-assessment exam, 2 complete practice exams, Glossary, and a secured book PDF","language":"en","currency":"USD","id":"1260026086","title":"CompTIA Security+ Certification Study Guide, Third Edition (Exam SY0-501)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H2Y6DwAAQBAJ&source=gbs_api","authors":["Glen E. Clarke"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LPbkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"How the World's Best Companies Ship Software and Work Differently","description":"Today's tech unicorns develop software differently. They've developed a way of working that lets them scale like an enterprise while working like a startup. These techniques can be learned. This book takes you behind the scenes and shows you how companies like Google, Facebook, and Spotify do it. Leverage their insights, so your teams can work better together, ship higher-quality product faster, innovate more quickly, and compete with the unicorns. Massively successful tech companies, or Unicorns, have discovered how to take the techniques that made them successful as a startup and scale them to the enterprise level. Amazon, Facebook, Google, and Spotify all work like startups, despite having workforces numbering in the tens of thousands. Ex-Spotify engineer and coach, Jonathan Rasmusson, takes you behind the scenes and shows you how to develop software the way the best companies do it. Learn how to give teams purpose through Missions, empower and trust with Squads, and align large scale efforts through Bets. Create the culture necessary to make it happen. If you're a tech or product lead and you want to ship product better, this is your playbook on how the world's best do it. If you're an engineer, tester, analyst, or project manager, and you suspect there are better ways you could be working, you are correct. This book will show you how. And if you're a manager, Agile coach, or someone just charged with improving how your company ships software, this book will give you the tools, techniques, and practices of the world's most innovative, delivery-focused companies. Don't just admire the top companies - learn from them.","language":"en","currency":"USD","id":"1680507672","title":"Competing with Unicorns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LPbkDwAAQBAJ&source=gbs_api","authors":["Jonathan Rasmusson"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f-ANEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"Get ready for C++20 with all you need to know for complete mastery! Your comprehensive and updated guide to one of the world’s most popular programming languages is here! Whether you’re a novice or expert, you’ll find what you need to get going with the latest features of C++20. The workhorse of programming languages, C++ gives you the utmost control of data usage and interface and resource allocation. If your job involves data, proficiency in C++ means you’re indispensable! This edition gives you 8 books in 1 for total C++ mastery. Inside, internationally renowned expert John Paul Mueller takes you from the fundamentals of working with objects and classes to writing applications that use paradigms not normally associated with C++, such as those used for functional programming strategies. The book also includes online resources such as source code. You discover how to use a C++ GNU compiler to build applications and even how to use your mobile device for coding. Conquer advanced programming and troubleshooting Streamline your code with lambda expressions Use C++ where you need it: for gaming, enterprise applications, and Web services Uncover object secrets including the use of design patterns Discover how to use functional programming techniques to make code concise and easy to read If you want to be your organization’s C++ guru, C++ All-In-One for Dummies is where it’s at!","language":"en","currency":"USD","id":"1119601754","title":"C++ All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f-ANEAAAQBAJ&source=gbs_api","authors":["John Paul Mueller"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EaTPDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"An SQL Driver for HBase","description":"Leverage Phoenix as an ANSI SQL engine built on top of the highly distributed and scalable NoSQL framework HBase. Learn the basics and best practices that are being adopted in Phoenix to enable a high write and read throughput in a big data space. This book includes real-world cases such as Internet of Things devices that send continuous streams to Phoenix, and the book explains how key features such as joins, indexes, transactions, and functions help you understand the simple, flexible, and powerful API that Phoenix provides. Examples are provided using real-time data and data-driven businesses that show you how to collect, analyze, and act in seconds. Pro Apache Phoenix covers the nuances of setting up a distributed HBase cluster with Phoenix libraries, running performance benchmarks, configuring parameters for production scenarios, and viewing the results. The book also shows how Phoenix plays well with other key frameworks in the Hadoop ecosystem such as Apache Spark, Pig, Flume, and Sqoop. You will learn how to: Handle a petabyte data store by applying familiar SQL techniques Store, analyze, and manipulate data in a NoSQL Hadoop echo system with HBase Apply best practices while working with a scalable data store on Hadoop and HBase Integrate popular frameworks (Apache Spark, Pig, Flume) to simplify big data analysis Demonstrate real-time use cases and big data modeling techniques Who This Book Is For Data engineers, Big Data administrators, and architects.","language":"en","currency":"USD","id":"1484223705","title":"Pro Apache Phoenix","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EaTPDQAAQBAJ&source=gbs_api","authors":["Shakil Akhtar","Ravi Magham"]},{"pageCount":238,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jzvcCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"New Opportunities for Connected Data","description":"Discover how graph databases can help you manage and query highly connected data. With this practical book, you’ll learn how to design and implement a graph database that brings the power of graphs to bear on a broad range of problem domains. Whether you want to speed up your response to user queries or build a database that can adapt as your business evolves, this book shows you how to apply the schema-free graph model to real-world problems. This second edition includes new code samples and diagrams, using the latest Neo4j syntax, as well as information on new functionality. Learn how different organizations are using graph databases to outperform their competitors. With this book’s data modeling, query, and code examples, you’ll quickly be able to implement your own solution. Model data with the Cypher query language and property graph model Learn best practices and common pitfalls when modeling with graphs Plan and implement a graph database solution in test-driven fashion Explore real-world examples to learn how and why organizations use a graph database Understand common patterns and components of graph database architecture Use analytical techniques and algorithms to mine graph database information","language":"en","currency":"USD","id":"1491930845","title":"Graph Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jzvcCQAAQBAJ&source=gbs_api","authors":["Ian Robinson","Jim Webber","Emil Eifrem"]},{"pageCount":528,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8DDSBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.96,"subtitle":null,"description":"Cloud Enterprise Architecture examines enterprise architecture (EA) in the context of the surging popularity of Cloud computing. It explains the different kinds of desired transformations the architectural blocks of EA undergo in light of this strategically significant convergence. Chapters cover each of the contributing architectures of EA-business, information, application, integration, security, and technology-illustrating the current and impending implications of the Cloud on each. Discussing the implications of the Cloud paradigm on EA, the book details the perceptible and positive changes that will affect EA design, governance, strategy, management, and sustenance. The author ties these topics together with chapters on Cloud integration and composition architecture. He also examines the Enterprise Cloud, Federated Clouds, and the vision to establish the InterCloud. Laying out a comprehensive strategy for planning and executing Cloud-inspired transformations, the book: Explains how the Cloud changes and affects enterprise architecture design, governance, strategy, management, and sustenance Presents helpful information on next-generation Cloud computing Describes additional architectural types such as enterprise-scale integration, security, management, and governance architectures This book is an ideal resource for enterprise architects, Cloud evangelists and enthusiasts, and Cloud application and service architects. Cloud center administrators, Cloud business executives, managers, and analysts will also find the book helpful and inspirational while formulating appropriate mechanisms and schemes for sound modernization and migration of traditional applications to Cloud infrastructures and platforms.","language":"en","currency":"USD","id":"1466502339","title":"Cloud Enterprise Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8DDSBQAAQBAJ&source=gbs_api","authors":["Pethuru Raj"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HHmBfmJRSL4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":49.56,"subtitle":null,"description":"Fully revised and updated, Relational Database Design, Second Edition is the most lucid and effective introduction to relational database design available. Here, you'll find the conceptual and practical information you need to develop a design that ensures data accuracy and user satisfaction while optimizing performance, regardless of your experience level or choice of DBMS. Supporting the book's step-by-step instruction are three case studies illustrating the planning, analysis, and design steps involved in arriving at a sound design. These real-world examples include object-relational design techniques, which are addressed in greater detail in a new chapter devoted entirely to this timely subject. * Concepts you need to master to put the book's practical instruction to work. * Methods for tailoring your design to the environment in which the database will run and the uses to which it will be put. * Design approaches that ensure data accuracy and consistency. * Examples of how design can inhibit or boost database application performance. * Object-relational design techniques, benefits, and examples. * Instructions on how to choose and use a normalization technique. * Guidelines for understanding and applying Codd's rules. * Tools to implement a relational design using SQL. * Techniques for using CASE tools for database design.","language":"en","currency":"USD","id":"0080516068","title":"Relational Database Design Clearly Explained","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HHmBfmJRSL4C&source=gbs_api","authors":["Jan L. Harrington"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2brVAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The go-to guidebook for deploying Big Data solutions withHadoop Today's enterprise architects need to understand how the Hadoopframeworks and APIs fit together, and how they can be integrated todeliver real-world solutions. This book is a practical, detailedguide to building and implementing those solutions, with code-levelinstruction in the popular Wrox tradition. It covers storing datawith HDFS and Hbase, processing data with MapReduce, and automatingdata processing with Oozie. Hadoop security, running Hadoop withAmazon Web Services, best practices, and automating Hadoopprocesses in real time are also covered in depth. With in-depth code examples in Java and XML and the latest onrecent additions to the Hadoop ecosystem, this complete resourcealso covers the use of APIs, exposing their inner workings andallowing architects and developers to better leverage and customizethem. The ultimate guide for developers, designers, and architectswho need to build and deploy Hadoop applications Covers storing and processing data with various technologies,automating data processing, Hadoop security, and deliveringreal-time solutions Includes detailed, real-world examples and code-levelguidelines Explains when, why, and how to use these tools effectively Written by a team of Hadoop experts in theprogrammer-to-programmer Wrox style Professional Hadoop Solutions is the reference enterprisearchitects and developers need to maximize the power of Hadoop.","language":"en","currency":"USD","id":"1118824180","title":"Professional Hadoop Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2brVAAAAQBAJ&source=gbs_api","authors":["Boris Lublinsky","Kevin T. Smith","Alexey Yakubovich"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mn9cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Use Hadoop to solve business problems by learning from a rich set of real-life case studies About This Book Solve real-world business problems using Hadoop and other Big Data technologies Build efficient data lakes in Hadoop, and develop systems for various business cases like improving marketing campaigns, fraud detection, and more Power packed with six case studies to get you going with Hadoop for Business Intelligence Who This Book Is For If you are interested in building efficient business solutions using Hadoop, this is the book for you This book assumes that you have basic knowledge of Hadoop, Java, and any scripting language. What You Will Learn Learn about the evolution of Hadoop as the big data platform Understand the basics of Hadoop architecture Build a 360 degree view of your customer using Sqoop and Hive Build and run classification models on Hadoop using BigML Use Spark and Hadoop to build a fraud detection system Develop a churn detection system using Java and MapReduce Build an IoT-based data collection and visualization system Get to grips with building a Hadoop-based Data Lake for large enterprises Learn about the coexistence of NoSQL and In-Memory databases in the Hadoop ecosystem In Detail If you have a basic understanding of Hadoop and want to put your knowledge to use to build fantastic Big Data solutions for business, then this book is for you. Build six real-life, end-to-end solutions using the tools in the Hadoop ecosystem, and take your knowledge of Hadoop to the next level. Start off by understanding various business problems which can be solved using Hadoop. You will also get acquainted with the common architectural patterns which are used to build Hadoop-based solutions. Build a 360-degree view of the customer by working with different types of data, and build an efficient fraud detection system for a financial institution. You will also develop a system in Hadoop to improve the effectiveness of marketing campaigns. Build a churn detection system for a telecom company, develop an Internet of Things (IoT) system to monitor the environment in a factory, and build a data lake – all making use of the concepts and techniques mentioned in this book. The book covers other technologies and frameworks like Apache Spark, Hive, Sqoop, and more, and how they can be used in conjunction with Hadoop. You will be able to try out the solutions explained in the book and use the knowledge gained to extend them further in your own problem space. Style and approach This is an example-driven book where each chapter covers a single business problem and describes its solution by explaining the structure of a dataset and tools required to process it. Every project is demonstrated with a step-by-step approach, and explained in a very easy-to-understand manner.","language":"en","currency":"USD","id":"1783980311","title":"Hadoop Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mn9cDgAAQBAJ&source=gbs_api","authors":["Anurag Shrivastava","Tanmay Deshpande"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VIkNCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Designing Real-World Big Data Applications","description":"Get expert guidance on architecting end-to-end data management solutions with Apache Hadoop. While many sources explain how to use various components in the Hadoop ecosystem, this practical book takes you through architectural considerations necessary to tie those components together into a complete tailored application, based on your particular use case. To reinforce those lessons, the book’s second section provides detailed examples of architectures used in some of the most commonly found Hadoop applications. Whether you’re designing a new Hadoop application, or planning to integrate Hadoop into your existing data infrastructure, Hadoop Application Architectures will skillfully guide you through the process. This book covers: Factors to consider when using Hadoop to store and model data Best practices for moving data in and out of the system Data processing frameworks, including MapReduce, Spark, and Hive Common Hadoop processing patterns, such as removing duplicate records and using windowing analytics Giraph, GraphX, and other tools for large graph processing on Hadoop Using workflow orchestration and scheduling tools such as Apache Oozie Near-real-time stream processing with Apache Storm, Apache Spark Streaming, and Apache Flume Architecture examples for clickstream analysis, fraud detection, and data warehousing","language":"en","currency":"USD","id":"1491900059","title":"Hadoop Application Architectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VIkNCgAAQBAJ&source=gbs_api","authors":["Mark Grover","Ted Malaska","Jonathan Seidman","Gwen Shapira"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0VMoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Exciting projects that will teach you how complex data can be exploited to gain maximum insights About This Book Architect a good HBase cluster for a very large distributed system Get to grips with the concepts of performance tuning with HBase A practical guide full of engaging recipes and attractive screenshots to enhance your system's performance Who This Book Is For This book is intended for developers and architects who want to know all about HBase at a hands-on level. This book is also for big data enthusiasts and database developers who have worked with other NoSQL databases and now want to explore HBase as another futuristic scalable database solution in the big data space. What You Will Learn Configure HBase from a high performance perspective Grab data from various RDBMS\/Flat files into the HBASE systems Understand table design and perform CRUD operations Find out how the communication between the client and server happens in HBase Grasp when to use and avoid MapReduce and how to perform various tasks with it Get to know the concepts of scaling with HBase through practical examples Set up Hbase in the Cloud for a small scale environment Integrate HBase with other tools including ElasticSearch In Detail Apache HBase is a non-relational NoSQL database management system that runs on top of HDFS. It is an open source, disturbed, versioned, column-oriented store and is written in Java to provide random real-time access to big Data. We'll start off by ensuring you have a solid understanding the basics of HBase, followed by giving you a thorough explanation of architecting a HBase cluster as per our project specifications. Next, we will explore the scalable structure of tables and we will be able to communicate with the HBase client. After this, we'll show you the intricacies of MapReduce and the art of performance tuning with HBase. Following this, we'll explain the concepts pertaining to scaling with HBase. Finally, you will get an understanding of how to integrate HBase with other tools such as ElasticSearch. By the end of this book, you will have learned enough to exploit HBase for boost system performance. Style and approach This book is intended for software quality assurance\/testing professionals, software project managers, or software developers with prior experience in using Selenium and Java to test web-based applications. This books also provides examples for C#, Python, and Ruby users.","language":"en","currency":"USD","id":"1783983078","title":"HBase High Performance Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0VMoDwAAQBAJ&source=gbs_api","authors":["Ruchir Choudhry"]},{"pageCount":209,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k4toDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Migrating to Azure Cosmos DB and Using the MongoDB API","description":"Learn Azure Cosmos DB and its MongoDB API with hands-on samples and advanced features such as the multi-homing API, geo-replication, custom indexing, TTL, request units (RU), consistency levels, partitioning, and much more. Each chapter explains Azure Cosmos DB’s features and functionalities by comparing it to MongoDB with coding samples. Cosmos DB for MongoDB Developers starts with an overview of NoSQL and Azure Cosmos DB and moves on to demonstrate the difference between geo-replication of Azure Cosmos DB compared to MongoDB. Along the way you’ll cover subjects including indexing, partitioning, consistency, and sizing, all of which will help you understand the concepts of read units and how this calculation is derived from an existing MongoDB’s usage. The next part of the book shows you the process and strategies for migrating to Azure Cosmos DB. You will learn the day-to-day scenarios of using Azure Cosmos DB, its sizing strategies, and optimizing techniques for the MongoDB API. This information will help you when planning to migrate from MongoDB or if you would like to compare MongoDB to the Azure Cosmos DB MongoDB API before considering the switch. What You Will Learn Migrate to MongoDB and understand its strategies Develop a sample application using MongoDB’s client driver Make use of sizing best practices and performance optimization scenarios Optimize MongoDB’s partition mechanism and indexing Who This Book Is For MongoDB developers who wish to learn Azure Cosmos DB. It specifically caters to a technical audience, working on MongoDB.","language":"en","currency":"USD","id":"1484236823","title":"Cosmos DB for MongoDB Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k4toDwAAQBAJ&source=gbs_api","authors":["Manish Sharma"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=58RiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 60 recipes for implementing big data processing and analytics using Apache Spark and Python","description":"Combine the power of Apache Spark and Python to build effective big data applications Key Features Perform effective data processing, machine learning, and analytics using PySpark Overcome challenges in developing and deploying Spark solutions using Python Explore recipes for efficiently combining Python and Apache Spark to process data Book Description Apache Spark is an open source framework for efficient cluster computing with a strong interface for data parallelism and fault tolerance. The PySpark Cookbook presents effective and time-saving recipes for leveraging the power of Python and putting it to use in the Spark ecosystem. You’ll start by learning the Apache Spark architecture and how to set up a Python environment for Spark. You’ll then get familiar with the modules available in PySpark and start using them effortlessly. In addition to this, you’ll discover how to abstract data with RDDs and DataFrames, and understand the streaming capabilities of PySpark. You’ll then move on to using ML and MLlib in order to solve any problems related to the machine learning capabilities of PySpark and use GraphFrames to solve graph-processing problems. Finally, you will explore how to deploy your applications to the cloud using the spark-submit command. By the end of this book, you will be able to use the Python API for Apache Spark to solve any problems associated with building data-intensive applications. What you will learn Configure a local instance of PySpark in a virtual environment Install and configure Jupyter in local and multi-node environments Create DataFrames from JSON and a dictionary using pyspark.sql Explore regression and clustering models available in the ML module Use DataFrames to transform data used for modeling Connect to PubNub and perform aggregations on streams Who this book is for The PySpark Cookbook is for you if you are a Python developer looking for hands-on recipes for using the Apache Spark 2.x ecosystem in the best possible way. A thorough understanding of Python (and some familiarity with Spark) will help you get the best out of the book.","language":"en","currency":"USD","id":"1788834259","title":"PySpark Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=58RiDwAAQBAJ&source=gbs_api","authors":["Denny Lee","Tomasz Drabas"]},{"pageCount":449,"thumbnail":"http:\/\/books.google.com\/books\/content?id=m9LMDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"27th International Conference, DEXA 2016, Porto, Portugal, September 5-8, 2016, Proceedings","description":"This two volume set LNCS 9827 and LNCS 9828 constitutes the refereed proceedings of the 27th International Conference on Database and Expert Systems Applications, DEXA 2016, held in Porto, Portugal, September 2016. The 39 revised full papers presented together with 29 short papers were carefully reviewed and selected from 137 submissions. The papers discuss a range of topics including: Temporal, Spatial, and High Dimensional Databases; Data Mining; Authenticity, Privacy, Security, and Trust; Data Clustering; Distributed and Big Data Processing; Decision Support Systems, and Learning; Data Streams; Data Integration, and Interoperability; Semantic Web, and Data Semantics; Social Networks, and Network Analysis; Linked Data; Data Analysis; NoSQL, NewSQL; Multimedia Data; Personal Information Management; Semantic Web and Ontologies; Database and Information System Architectures; Query Answering and Optimization; Information Retrieval, and Keyword Search; Data Modelling, and Uncertainty.","language":"en","currency":"USD","id":"3319444034","title":"Database and Expert Systems Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=m9LMDAAAQBAJ&source=gbs_api","authors":["Sven Hartmann","Hui Ma"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oc6PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Expert techniques to run high-volume and fault-tolerant database solutions using MongoDB 4.x, 2nd Edition","description":"Leverage the power of MongoDB 4.x to build and administer fault-tolerant database applications Key Features Master the new features and capabilities of MongoDB 4.x Implement advanced data modeling, querying, and administration techniques in MongoDB Includes rich case-studies and best practices followed by expert MongoDB developers Book Description MongoDB is the best platform for working with non-relational data and is considered to be the smartest tool for organizing data in line with business needs. The recently released MongoDB 4.x supports ACID transactions and makes the technology an asset for enterprises across the IT and fintech sectors. This book provides expertise in advanced and niche areas of managing databases (such as modeling and querying databases) along with various administration techniques in MongoDB, thereby helping you become a successful MongoDB expert. The book helps you understand how the newly added capabilities function with the help of some interesting examples and large datasets. You will dive deeper into niche areas such as high-performance configurations, optimizing SQL statements, configuring large-scale sharded clusters, and many more. You will also master best practices in overcoming database failover, and master recovery and backup procedures for database security. By the end of the book, you will have gained a practical understanding of administering database applications both on premises and on the cloud; you will also be able to scale database applications across all servers. What you will learn Perform advanced querying techniques such as indexing and expressions Configure, monitor, and maintain a highly scalable MongoDB environment Master replication and data sharding to optimize read\/write performance Administer MongoDB-based applications on premises or on the cloud Integrate MongoDB with big data sources to process huge amounts of data Deploy MongoDB on Kubernetes containers Use MongoDB in IoT, mobile, and serverless environments Who this book is for This book is ideal for MongoDB developers and database administrators who wish to become successful MongoDB experts and build scalable and fault-tolerant applications using MongoDB. It will also be useful for database professionals who wish to become certified MongoDB professionals. Some understanding of MongoDB and basic database concepts is required to get the most out of this book.","language":"en","currency":"USD","id":"1789611385","title":"Mastering MongoDB 4.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oc6PDwAAQBAJ&source=gbs_api","authors":["Alex Giamas"]},{"pageCount":104,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DRqkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.75,"subtitle":null,"description":"If you’re a business team leader, CIO, business analyst, or developer interested in how Apache Hadoop and Apache HBase-related technologies can address problems involving large-scale data in cost-effective ways, this book is for you. Using real-world stories and situations, authors Ted Dunning and Ellen Friedman show Hadoop newcomers and seasoned users alike how NoSQL databases and Hadoop can solve a variety of business and research issues. You’ll learn about early decisions and pre-planning that can make the process easier and more productive. If you’re already using these technologies, you’ll discover ways to gain the full range of benefits possible with Hadoop. While you don’t need a deep technical background to get started, this book does provide expert guidance to help managers, architects, and practitioners succeed with their Hadoop projects. Examine a day in the life of big data: India’s ambitious Aadhaar project Review tools in the Hadoop ecosystem such as Apache’s Spark, Storm, and Drill to learn how they can help you Pick up a collection of technical and strategic tips that have helped others succeed with Hadoop Learn from several prototypical Hadoop use cases, based on how organizations have actually applied the technology Explore real-world stories that reveal how MapR customers combine use cases when putting Hadoop and NoSQL to work, including in production","language":"en","currency":"USD","id":"1491928913","title":"Real-World Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DRqkBwAAQBAJ&source=gbs_api","authors":["Ted Dunning","Ellen Friedman"]},{"pageCount":121,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vpmiBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Issues and Current Trends","description":"This book offers readers a quick, comprehensive and up-to-date overview of the most important methodologies, technologies, APIs and standards related to the portability and interoperability of cloud applications and services, illustrated by a number of use cases representing a variety of interoperability and portability scenarios. The lack of portability and interoperability between cloud platforms at different service levels is the main issue affecting cloud-based services today. The brokering, negotiation, management, monitoring and reconfiguration of cloud resources are challenging tasks for developers and users of cloud applications due to the different business models associated with resource consumption, and to the variety of services and features offered by different cloud providers. In chapter 1 the concepts of cloud portability and interoperability are introduced, together with the issues and limitations arising when such features are lacking or ignored. Subsequently, chapter 2 provides an overview of the state-of-the-art methodologies and technologies that are currently used or being explored to enable cloud portability and interoperability. Chapter 3 illustrates the main cross-platform cloud APIs and how they can solve interoperability and portability issues. In turn, chapter 4 presents a set of ready-to-use solutions which, either because of their broad-scale use in cloud computing scenarios or because they utilize established or emerging standards, play a fundamental part in providing interoperable and portable solutions. Lastly, chapter 5 presents an overview of emerging standards for cloud Interoperability and portability. Researchers and developers of cloud-based services will find here a brief survey of the relevant methodologies, APIs and standards, illustrated by case studies and complemented by an extensive reference list for more detailed descriptions of every topic covered.","language":"en","currency":"USD","id":"3319137018","title":"Cloud Portability and Interoperability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vpmiBwAAQBAJ&source=gbs_api","authors":["Beniamino Di Martino","Giuseppina Cretella","Antonio Esposito"]},{"pageCount":484,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zCaxAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"An easy-to-use guide, full of hands-on recipes for manipulating spatial data in a PostGIS database. Each topic is explained and placed in context, and for the more inquisitive, there are more details of the concepts used. If you are a web developer or a software architect, especially in location-based companies, and want to expand the range of techniques you are using with PostGIS, then this book is for you. You should have some prior experience with PostgreSQL database and spatial concepts.","language":"en","currency":"USD","id":"184951867X","title":"PostGIS Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zCaxAgAAQBAJ&source=gbs_api","authors":["Paolo Corti","Thomas J. Kraft","Stephen Vincent Mather","Bborie Park"]},{"pageCount":515,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R_pmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"SQL and NoSQL Data Storage Using MySQL for Python Programmers","description":"Move data back and forth between database and application. The must-have knowledge in this book helps programmers learn how to use the official driver, MySQL Connector\/Python, by which Python programs communicate with the MySQL database. This book takes you from the initial installation of the connector through basic query execution, then through more advanced topics, error handing, and troubleshooting. The book covers both the traditional API as well as the new X DevAPI. The X DevAPI is part of MySQL 8.0 and is an API that can be used with connectors for several programming languages and is used from the command-line interface known as MySQL Shell. You will learn to use the connector by working through code examples and following a discussion of how the API calls work. By the end of the book, you will be able to use MySQL as the back-end storage for your Python programs, and you’ll even have the option of choosing between SQL and NoSQL interfaces. What You'll Learn Install MySQL Connector\/Python Connect to MySQL and configure database access Execute SQL and NoSQL queries from your Python program Trap errors and troubleshoot problems Store data from different languages using MySQL’s character set support Work in the X DevAPI that underlies all of MySQL’s language connectors Who This Book Is For Developers familiar with Python who are looking at using MySQL as the back-end database. No prior knowledge of Connector\/Python is assumed, but readers should be familiar with databases and the Python programming language.","language":"en","currency":"USD","id":"1484236947","title":"MySQL Connector\/Python Revealed","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R_pmDwAAQBAJ&source=gbs_api","authors":["Jesper Wisborg Krogh"]},{"pageCount":276,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_xhADQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Methods and Applications","description":"This book has a collection of articles written by Big Data experts to describe some of the cutting-edge methods and applications from their respective areas of interest, and provides the reader with a detailed overview of the field of Big Data Analytics as it is practiced today. The chapters cover technical aspects of key areas that generate and use Big Data such as management and finance; medicine and healthcare; genome, cytome and microbiome; graphs and networks; Internet of Things; Big Data standards; bench-marking of systems; and others. In addition to different applications, key algorithmic approaches such as graph partitioning, clustering and finite mixture modelling of high-dimensional data are also covered. The varied collection of themes in this volume introduces the reader to the richness of the emerging field of Big Data Analytics.","language":"en","currency":"USD","id":"8132236289","title":"Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_xhADQAAQBAJ&source=gbs_api","authors":["Saumyadipta Pyne","B.L.S. Prakasa Rao","S.B. Rao"]},{"pageCount":380,"thumbnail":"http:\/\/books.google.com\/books\/content?id=etR6DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"Grundlagen, Systeme und Nutzungspotenziale","description":"Dieser Herausgeber-Band bietet eine umfassende Einführung in das Gebiet Big Data. Neben einer Markteinschätzung und grundlegenden Konzepten (semantische Modellbildung, Anfragesprachen, Konsistenzgewährung etc.) werden wichtige NoSQL-Systeme (Key\/Value Store, Column Store, Document Store, Graph Database) vorgestellt und erfolgreiche Anwendungen aus unterschiedlichen Perspektiven erläutert. Eine Diskussion rechtlicher Aspekte und ein Vorschlag zum Berufsbild des Data Scientist runden das Buch ab. Damit erhält die Leserschaft Handlungsempfehlungen für die Nutzung von Big-Data-Technologien im Unternehmen.","language":"de","currency":"USD","id":"3658115890","title":"Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=etR6DAAAQBAJ&source=gbs_api","authors":["Daniel Fasel","Andreas Meier"]},{"pageCount":440,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UxxWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":196,"subtitle":null,"description":"Fog computing is quickly increasing its applications and uses to the next level. As it continues to grow, different types of virtualization technologies can thrust this branch of computing further into mainstream use. The Handbook of Research on Cloud and Fog Computing Infrastructures for Data Science is a key reference volume on the latest research on the role of next-generation systems and devices that are capable of self-learning and how those devices will impact society. Featuring wide-ranging coverage across a variety of relevant views and themes such as cognitive analytics, data mining algorithms, and the internet of things, this publication is ideally designed for programmers, IT professionals, students, researchers, and engineers looking for innovative research on software-defined cloud infrastructures and domain-specific analytics.","language":"en","currency":"USD","id":"1522559736","title":"Handbook of Research on Cloud and Fog Computing Infrastructures for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UxxWDwAAQBAJ&source=gbs_api","authors":["Raj, Pethuru","Raman, Anupama"]},{"pageCount":576,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q22uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Secure Your Systems Using the Latest IT Auditing Techniques Fully updated to cover leading-edge tools and technologies, IT Auditing: Using Controls to Protect Information Assets, Third Edition explains, step by step, how to implement a successful, enterprise-wide IT audit program. New chapters on auditing cybersecurity programs, big data and data repositories, and new technologies are included. This comprehensive guide describes how to assemble an effective IT audit team and maximize the value of the IT audit function. In-depth details on performing specific audits are accompanied by real-world examples, ready-to-use checklists, and valuable templates. Standards, frameworks, regulations, and risk management techniques are also covered in this definitive resource. • Build and maintain an internal IT audit function with maximum effectiveness and value • Audit entity-level controls and cybersecurity programs • Assess data centers and disaster recovery • Examine switches, routers, and firewalls • Evaluate Windows, UNIX, and Linux operating systems • Audit Web servers and applications • Analyze databases and storage solutions • Review big data and data repositories • Assess end user computer devices, including PCs and mobile devices • Audit virtualized environments • Evaluate risks associated with cloud computing and outsourced operations • Drill down into applications and projects to find potential control weaknesses • Learn best practices for auditing new technologies • Use standards and frameworks, such as COBIT, ITIL, and ISO • Understand regulations, including Sarbanes-Oxley, HIPAA, and PCI • Implement proven risk management practices","language":"en","currency":"USD","id":"1260453235","title":"IT Auditing Using Controls to Protect Information Assets, Third Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q22uDwAAQBAJ&source=gbs_api","authors":["Mike Kegerreis","Mike Schiller","Chris Davis"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qj-5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":null,"description":"In practice, the design and architecture of a cloud varies among cloud providers. We present a generic evaluation framework for the performance, availability and reliability characteristics of various cloud platforms. We describe a generic benchmark architecture for cloud databases, specifically NoSQL database as a service. It measures the performance of replication delay and monetary cost. Service Level Agreements (SLA) represent the contract which captures the agreed upon guarantees between a service provider and its customers. The specifications of existing service level agreements (SLA) for cloud services are not designed to flexibly handle even relatively straightforward performance and technical requirements of consumer applications. We present a novel approach for SLA-based management of cloud-hosted databases from the consumer perspective and an end-to-end framework for consumer-centric SLA management of cloud-hosted databases. The framework facilitates adaptive and dynamic provisioning of the database tier of the software applications based on application-defined policies for satisfying their own SLA performance requirements, avoiding the cost of any SLA violation and controlling the monetary cost of the allocated computing resources. In this framework, the SLA of the consumer applications are declaratively defined in terms of goals which are subjected to a number of constraints that are specific to the application requirements. The framework continuously monitors the application-defined SLA and automatically triggers the execution of necessary corrective actions (scaling out\/in the database tier) when required. The framework is database platform-agnostic, uses virtualization-based database replication mechanisms and requires zero source code changes of the cloud-hosted software applications.","language":"en","currency":"USD","id":"3319047655","title":"Cloud Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qj-5BQAAQBAJ&source=gbs_api","authors":["Liang Zhao","Sherif Sakr","Anna Liu","Athman Bouguettaya"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WfadDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":196,"subtitle":null,"description":"The concept of a big data warehouse appeared in order to store moving data objects and temporal data information. Moving objects are geometries that change their position and shape continuously over time. In order to support spatio-temporal data, a data model and associated query language is needed for supporting moving objects. Emerging Perspectives in Big Data Warehousing is an essential research publication that explores current innovative activities focusing on the integration between data warehousing and data mining with an emphasis on the applicability to real-world problems. Featuring a wide range of topics such as index structures, ontology, and user behavior, this book is ideally designed for IT consultants, researchers, professionals, computer scientists, academicians, and managers.","language":"en","currency":"USD","id":"152255517X","title":"Emerging Perspectives in Big Data Warehousing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WfadDwAAQBAJ&source=gbs_api","authors":["Taniar, David","Rahayu, Wenny"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kC_lDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":2.74,"subtitle":"(Pig, Zookeeper and HBase)","description":"Big data analytics emerged as a revolution in the field of information technology. It is the ability of the organization to stay agile which gives it a competitive edge over its competitors. Data harvesting and data analytics enable the organization identify new opportunities which in turn results in efficient operations, leads to smarter business moves and higher business turnovers. All these issues are addressed by big data analytics and its initiatives. Chapter 4 focuses on architecture of Pig, Apache Pig execution modes, Pig data types and operators. Apache Pig Latin data model is based on nested relations. The chapter provides description of different components of Pig Latin data model. The lab session includes installing Pig over Hadoop and exploring different Pig Latin operators.Chapter 5 deals with common services provides by zookeeper, architecture and components of zookeeper and zookeeper operation modes. The salient feature of the chapter is exploration of leader election algorithm and security of ZNodes through access control list. The chapter concludes with the hands-on lab sessions on installation of zookeeper and exposure to zookeeper command-line interface. Chapter 6 discusses different types of NoSQL databases, transformation rules from one data model to another and performs in-depth analysis of HBase data model. The features which are difficult to comprehend such as data compaction, data locality, HBase read and write operations are simplified with easy to understand figures and explanation. As a part of hands-on lab sessions, installation of HBase over Hadoop and exercises based on HBase general commands, DDL commands and DML commands are dealt with.","language":"en","currency":"USD","id":"8194529182","title":"Big Data Tools – Which, When and How? (Volume– II)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kC_lDwAAQBAJ&source=gbs_api","authors":["Dr. Poornima G. Naik","Dr. Girish R. Naik"]},{"pageCount":385,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J_YRmK9byy4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"Create, validate, and transform XML documents with Oracle's JDeveloper IDE using this book and eBook.","language":"en","currency":"USD","id":"1847196675","title":"Processing XML Documents with Oracle JDeveloper 11g","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J_YRmK9byy4C&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":674,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3V7BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":null,"description":"The fourth edition of this classic textbook provides major updates. This edition has completely new chapters on Big Data Platforms (distributed storage systems, MapReduce, Spark, data stream processing, graph analytics) and on NoSQL, NewSQL and polystore systems. It also includes an updated web data management chapter that includes RDF and semantic web discussion, an integrated database integration chapter focusing both on schema integration and querying over these systems. The peer-to-peer computing chapter has been updated with a discussion of blockchains. The chapters that describe classical distributed and parallel database technology have all been updated. The new edition covers the breadth and depth of the field from a modern viewpoint. Graduate students, as well as senior undergraduate students studying computer science and other related fields will use this book as a primary textbook. Researchers working in computer science will also find this textbook useful. This textbook has a companion web site that includes background information on relational database fundamentals, query processing, transaction management, and computer networks for those who might need this background. The web site also includes all the figures and presentation slides as well as solutions to exercises (restricted to instructors).","language":"en","currency":"USD","id":"3030262537","title":"Principles of Distributed Database Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3V7BDwAAQBAJ&source=gbs_api","authors":["M. Tamer Özsu","Patrick Valduriez"]},{"pageCount":430,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JZLLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":null,"description":"This textbook on practical data analytics unites fundamental principles, algorithms, and data. Algorithms are the keystone of data analytics and the focal point of this textbook. Clear and intuitive explanations of the mathematical and statistical foundations make the algorithms transparent. But practical data analytics requires more than just the foundations. Problems and data are enormously variable and only the most elementary of algorithms can be used without modification. Programming fluency and experience with real and challenging data is indispensable and so the reader is immersed in Python and R and real data analysis. By the end of the book, the reader will have gained the ability to adapt algorithms to new problems and carry out innovative analyses. This book has three parts:(a) Data Reduction: Begins with the concepts of data reduction, data maps, and information extraction. The second chapter introduces associative statistics, the mathematical foundation of scalable algorithms and distributed computing. Practical aspects of distributed computing is the subject of the Hadoop and MapReduce chapter.(b) Extracting Information from Data: Linear regression and data visualization are the principal topics of Part II. The authors dedicate a chapter to the critical domain of Healthcare Analytics for an extended example of practical data analytics. The algorithms and analytics will be of much interest to practitioners interested in utilizing the large and unwieldly data sets of the Centers for Disease Control and Prevention's Behavioral Risk Factor Surveillance System.(c) Predictive Analytics Two foundational and widely used algorithms, k-nearest neighbors and naive Bayes, are developed in detail. A chapter is dedicated to forecasting. The last chapter focuses on streaming data and uses publicly accessible data streams originating from the Twitter API and the NASDAQ stock market in the tutorials. This book is intended for a one- or two-semester course in data analytics for upper-division undergraduate and graduate students in mathematics, statistics, and computer science. The prerequisites are kept low, and students with one or two courses in probability or statistics, an exposure to vectors and matrices, and a programming course will have no difficulty. The core material of every chapter is accessible to all with these prerequisites. The chapters often expand at the close with innovations of interest to practitioners of data science. Each chapter includes exercises of varying levels of difficulty. The text is eminently suitable for self-study and an exceptional resource for practitioners.","language":"en","currency":"USD","id":"3319457977","title":"Algorithms for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JZLLDQAAQBAJ&source=gbs_api","authors":["Brian Steele","John Chandler","Swarna Reddy"]}]