[{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VOctAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This book is an easy-to-follow guide full of hands-on examples of real-world administration tasks, which will help you design and build highly scalable and very fast web applications.This book is ideal for web application developers looking for hands-on, practical, and to-the-point recipes to integrate the Memcached service into their day-to-day programming tasks. No prior knowledge of Memcached is assumed for using this book.","language":"en","currency":"USD","id":"1782163239","title":"Getting Started with Memcached","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VOctAgAAQBAJ&source=gbs_api","authors":["Ahmed Soliman"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1918CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":100,"subtitle":null,"description":"Introduces the topic of cloud computing with an emphasis on the trustworthiness of cloud computing systems and services This book describes the scientific basis of cloud computing, explaining the ideas, principles, and architectures of cloud computing as well the different types of clouds and the services they provide. The text reviews several cloud computing platforms, including Microsoft Azure, Amazon, Oracle, Google, HP, IBM, Salesforce, and Kaavo. The author addresses the problem of trustworthiness in cloud computing and provides methods to improve the security and privacy of cloud applications. The end-of-chapter exercises and supplementary material on the book's companion website will allow readers to grasp the introductory and advanced level concepts of cloud computing. Examines cloud computing platforms such as Microsoft Azure, Amazon, Oracle, Google, HP, IBM, Salesforce, and Kaavo Analyzes the use of aspect-oriented programming (AOP) for refactoring cloud services and improving the security and privacy of cloud applications Contains practical examples of cloud computing, test questions, and end-of-chapter exercises Includes presentations, examples of cloud projects and other teaching resources at the author’s website (http:\/\/www.vladimirsafonov.org\/cloud) Trustworthy Cloud Computing is written for advanced undergraduate and graduate students in computer science, data science, and computer engineering as well as software engineers, system architects, system managers, and software developers new to cloud computing.","language":"en","currency":"USD","id":"1119113512","title":"Trustworthy Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1918CwAAQBAJ&source=gbs_api","authors":["Vladimir O. Safonov"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4eEyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":null,"description":"The Complete Healthcare Information Technology Reference and Exam Guide Gain the skills and knowledge required to implement and support healthcare IT (HIT) systems in various clinical and healthcare business settings. Health Information Technology Exam Guide for CHTS and CAHIMS Certifications prepares IT professionals to transition into HIT with coverage of topics ranging from health data standards to project management. This new edition includes broadened security content in addition to coverage of disruptive innovations such as complex platforms that support big data, genomics, telemedicine, mobile devices, and consumers. Learn about achieving true interoperability, updates to HIPAA rules, and FHIR and SMART standards. “This book is an invaluable reference for understanding what has come before and what trends are likely to shape the future. The world of big data, precision medicine, genomics, and telehealth require us to break old paradigms of architecture and functionality while not interrupting existing care processes and revenue cycles... We’re dealing with state sponsored cyberterrorism, hacktivism, and organized crime. I describe healthcare IT security as a cold war... You’ll hear from the experts who created many of the regulations and best practices we’re using today to keep information private. I hope you enjoy this book as much as I have and that it finds a place of importance on your book shelf.” From the Foreword by John D. Halamka, MD, Chief Information Officer, CAREGROUP, Boston, MA Coverage includes: • Healthcare and Information Technology in the United States • Fundamentals of Healthcare Information Science • Healthcare Information Standards and Regulation • Implementing, Managing, and Maintaining Healthcare Information Technology • Optimizing Healthcare Information Technology • Making Healthcare Information Technology Private, Secure, and Confidential Electronic content includes: • Practice exams for CHTS and CAHIMS • Secure PDF copy of the book","language":"en","currency":"USD","id":"1259836959","title":"Healthcare Information Technology Exam Guide for CHTS and CAHIMS Certifications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4eEyDwAAQBAJ&source=gbs_api","authors":["Kathleen A. McCormick","Brian Gugerty","John E. Mattison"]},{"pageCount":515,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4_06DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Confederated International Conferences: CoopIS, C&TC, and ODBASE 2017, Rhodes, Greece, October 23-27, 2017, Proceedings","description":"This double volumes LNCS 10573-10574 constitutes the refereed proceedings of the Confederated International Conferences: Cooperative Information Systems, CoopIS 2017, Ontologies, Databases, and Applications of Semantics, ODBASE 2017, and Cloud and Trusted Computing, C&TC, held as part of OTM 2017 in October 2017 in Rhodes, Greece. The 61 full papers presented together with 19 short papers were carefully reviewed and selected from 180 submissions. The OTM program every year covers data and Web semantics, distributed objects, Web services, databases, information systems, enterprise workflow and collaboration, ubiquity, interoperability, mobility, grid and high-performance computing.","language":"en","currency":"USD","id":"3319694596","title":"On the Move to Meaningful Internet Systems. OTM 2017 Conferences","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4_06DwAAQBAJ&source=gbs_api","authors":["Hervé Panetto","Christophe Debruyne","Walid Gaaloul","Mike Papazoglou","Adrian Paschke","Claudio Agostino Ardagna","Robert Meersman"]},{"pageCount":458,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iNuSDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques for predictive modeling, 3rd Edition","description":"Solve real-world data problems with R and machine learning Key Features Third edition of the bestselling, widely acclaimed R machine learning book, updated and improved for R 3.6 and beyond Harness the power of R to build flexible, effective, and transparent machine learning models Learn quickly with a clear, hands-on guide by experienced machine learning teacher and practitioner, Brett Lantz Book Description Machine learning, at its core, is concerned with transforming data into actionable knowledge. R offers a powerful set of machine learning methods to quickly and easily gain insight from your data. Machine Learning with R, Third Edition provides a hands-on, readable guide to applying machine learning to real-world problems. Whether you are an experienced R user or new to the language, Brett Lantz teaches you everything you need to uncover key insights, make new predictions, and visualize your findings. This new 3rd edition updates the classic R data science book to R 3.6 with newer and better libraries, advice on ethical and bias issues in machine learning, and an introduction to deep learning. Find powerful new insights in your data; discover machine learning with R. What you will learn Discover the origins of machine learning and how exactly a computer learns by example Prepare your data for machine learning work with the R programming language Classify important outcomes using nearest neighbor and Bayesian methods Predict future events using decision trees, rules, and support vector machines Forecast numeric data and estimate financial values using regression methods Model complex processes with artificial neural networks — the basis of deep learning Avoid bias in machine learning models Evaluate your models and improve their performance Connect R to SQL databases and emerging big data technologies such as Spark, H2O, and TensorFlow Who this book is for Data scientists, students, and other practitioners who want a clear, accessible guide to machine learning with R.","language":"en","currency":"USD","id":"1788291557","title":"Machine Learning with R","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iNuSDwAAQBAJ&source=gbs_api","authors":["Brett Lantz"]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qTKcAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"New Dynamic In-Memory Analytics for the Era of Big Data","description":"UPGRADE TO THE NEW GENERATION OF DATABASE SOFTWARE FOR THE ERA OF BIG DATA! If big data is an untapped natural resource, how do you find the gold hidden within? Leaders realize that big data means all data, and are moving quickly to extract more value from both structured and unstructured application data. However, analyzing this data can prove costly and complex, especially while protecting the availability, performance and reliability of essential business applications. In the new era of big data, businesses require data systems that can blend always-available transactions with speed-of-thought analytics. DB2 10.5 with BLU Acceleration provides this speed, simplicity, and affordability while making it easier to build next-generation applications with NoSQL features, such as a mongo-styled JSON document store, a graph store, and more. Dynamic in-memory columnar processing and other innovations deliver faster insights from more data, and enhanced pureScale clustering technology delivers high-availability transactions with application-transparent scalability for business continuity. With this book, you'll learn about the power and flexibility of multiworkload, multi-platform database software. Use the comprehensive knowledge from a team of DB2 developers and experts to get started with the latest DB2 trial version you can download at ibm.com\/developerworks\/downloads\/im\/db2\/. Stay up to date on DB2 by visiting ibm.com\/db2\/.","language":"en","currency":"USD","id":"0071823549","title":"DB2 10.5 with BLU Acceleration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qTKcAQAAQBAJ&source=gbs_api","authors":["Paul Zikopoulos","Sam Lightstone","Matthew Huras","Aamer Sachedina","George Baklarz"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AggWEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":"Hardware Accelerator Systems for Artificial Intelligence and Machine Learning, Volume 122 delves into artificial Intelligence and the growth it has seen with the advent of Deep Neural Networks (DNNs) and Machine Learning. Updates in this release include chapters on Hardware accelerator systems for artificial intelligence and machine learning, Introduction to Hardware Accelerator Systems for Artificial Intelligence and Machine Learning, Deep Learning with GPUs, Edge Computing Optimization of Deep Learning Models for Specialized Tensor Processing Architectures, Architecture of NPU for DNN, Hardware Architecture for Convolutional Neural Network for Image Processing, FPGA based Neural Network Accelerators, and much more. Updates on new information on the architecture of GPU, NPU and DNN Discusses In-memory computing, Machine intelligence and Quantum computing Includes sections on Hardware Accelerator Systems to improve processing efficiency and performance","language":"en","currency":null,"id":"0128231246","title":"Hardware Accelerator Systems for Artificial Intelligence and Machine Learning","infoLink":"http:\/\/books.google.com\/books?id=AggWEAAAQBAJ&dq=nosql+big+data&hl=&as_brr=5&source=gbs_api","authors":[]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Z6k7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"This quick review, cram-style study guide offers 100% coverage of every topic on the latest version of the CompTIA Security+ exam This powerful exam preparation resource presents an accelerated review of the pertinent technology and covers all objectives for the CompTIA Security+ exam (exam SY0-501). Written in the proven Passport format developed by training expert Mike Meyers, the book enables you to focus on specific topics, determine areas of need, and tailor an effective course for study. Mike Meyers’ CompTIA Security+ Certification Passport, Fifth Edition (Exam SY0-501) features accurate practice exam questions and in-depth answer explanations as well as end-of-chapter bulleted summaries that reinforce salient points. Throughout, “Exam Tips” highlight important topics, “Local Lingo” notes define need-to-know terms, “Travel Advisories” alert you to potential pitfalls, and “Travel Assistance” icons specify resources for further information. • Provides complete coverage of every objective on exam SY0-501 • Electronic content includes 200 practice questions and a secured book PDF • Written by a pair of security experts and edited by certification guru Mike Meyers","language":"en","currency":"USD","id":"1260026558","title":"Mike Meyers' CompTIA Security+ Certification Passport, Fifth Edition (Exam SY0-501)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Z6k7DwAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zVafJuQZMOAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.35,"subtitle":null,"description":"Achieve Extreme Application Performance for a Private Cloud with Oracle Exalogic Elastic Cloud Transition to a private cloud computing infrastructure and achieve unmatched levels of performance with help from this Oracle Press guide. Oracle Exalogic Elastic Cloud Handbook shows you how to plan, implement, and maintain a private cloud. Find out how to set up components, deploy Java applications, maximize redundancy and throughput, and migrate legacy workloads. Examples, screenshots, and diagrams are included throughout this comprehensive resource. Configure Oracle Exalogic Elastic Cloud nodes and racks Optimize Java EE application performance on Oracle WebLogic Server Provision and administer a highly scalable private cloud Build, debug, and manage custom Java applications Secure, monitor, and tune using Oracle Enterprise Manager Leverage capabilities from Oracle Fusion Middleware Consolidate Oracle and third-party application workloads","language":"en","currency":"USD","id":"0071778292","title":"Oracle Exalogic Elastic Cloud Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zVafJuQZMOAC&source=gbs_api","authors":["Tom Plunkett","TJ Palazzolo","Tejas Joshi"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ucESbd6cmKAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":144,"subtitle":"New Concepts and Developments","description":"\"This book presents and disseminates new concepts and developments in the areas of data warehousing and data mining, in particular on the research trends shaped during the last few years\"--Provided by publisher.","language":"en","currency":"USD","id":"1605667188","title":"Strategic Advancements in Utilizing Data Mining and Warehousing Technologies: New Concepts and Developments","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ucESbd6cmKAC&source=gbs_api","authors":["Taniar, David","Rusu, Laura Irina"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=83UpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Quick Reference Guide to Cloud Solutions","description":"Follow this guide that explains Oracle’s Infrastructure as a Service (IaaS) cloud solution and the tools and capabilities that can help you increase business value, productivity, and performance. You will learn about economic advantages as well as elasticity, unlimited storage, and on-demand capacity computing. Oracle IaaS: Quick Reference Guide to Cloud Solutions covers Oracle’s service structure as well as its cloud service offerings and cloud models. It provides detailed guidance regarding the advantages of the specific models, as well as how to create and manage each service. This book contains many real-world case studies, including how to build and configure compute resources to fit the needs of your specific organization. IaaS product offerings covered in this book include: Oracle Compute Cloud Oracle Storage Cloud Oracle Ravello Cloud Oracle Container Cloud What You’ll Learn Understand Oracle IaaS products and Oracle Cloud Compare existing Oracle cloud products Discover IaaS new features Master Oracle Cloud Architecture Who This Book Is For Oracle database administrators, Oracle developers, and other developers looking to build cloud-based applications.","language":"en","currency":"USD","id":"1484228324","title":"Oracle IaaS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=83UpDwAAQBAJ&source=gbs_api","authors":["Okcan Yasin Saygili"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QKBlAcdkMwsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"People-powered Metadata for the Social Web","description":"Tagging is fast becoming one of the primary ways people organize and manage digital information. Tagging complements traditional organizational tools like folders and search on users desktops as well as on the web. These developments mean that tagging has broad implications for information management, information architecture and interface design. And its reach extends beyond these technical domains to our culture at large. We can imagine, for example, the scrapbookers of the future curating their digital photos, emails, ticket stubs and other mementos with tags. This book explains the value of tagging, explores why people tag, how tagging works and when it can be used to improve the user experience. It exposes tagging's superficial simplicity to reveal interesting issues related to usability, information architecture, online community and collective intelligence.","language":"en","currency":"USD","id":"9780132798273","title":"Tagging","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QKBlAcdkMwsC&source=gbs_api","authors":["Gene Smith"]},{"pageCount":97,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dc3WCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"This book comprehensively illustrates quality-ware scheduling in key-value stores. In addition, it provides scheduling strategies and a prototype framework of quality-aware scheduler as well as a demonstration of online applications. The book offers a rich blend of theory and practice which is suitable for students, researchers and practitioners interested in distributed systems, NoSQL key-value stores and scheduling.","language":"en","currency":"USD","id":"3662473062","title":"Quality-aware Scheduling for Key-value Data Stores","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dc3WCQAAQBAJ&source=gbs_api","authors":["Chen Xu","Aoying Zhou"]},{"pageCount":526,"thumbnail":"http:\/\/books.google.com\/books\/content?id=64UP9u2KlA4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":95.2,"subtitle":"Second International Conference, OCSC 2007, Held as Part of HCI International 2007, Beijing, China, July 22-27, 2007, Proceedings","description":"This book constitutes the refereed proceedings of the Second International Conference on Online Communities and Social Computing, OCSC 2007, held in Beijing, China, July 2007 in the framework of the 12th International Conference on Human-Computer Interaction, HCII 2007. It covers designing and developing on-line communities, as well as knowledge, collaboration, learning and local on-line communities.","language":"en","currency":"USD","id":"3540732578","title":"Online Communities and Social Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=64UP9u2KlA4C&source=gbs_api","authors":["Douglas Schuler"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AcG_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Exam 1Z0-815","description":"The comprehensive study aide for those preparing for the new Oracle Certified Professional Java SE Programmer I Exam 1Z0-815 Used primarily in mobile and desktop application development, Java is a platform-independent, object-oriented programming language. It is the principal language used in Android application development as well as a popular language for client-side cloud applications. Oracle has updated its Java Programmer certification tracks for Oracle Certified Professional. OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide covers 100% of the exam objectives, ensuring that you are thoroughly prepared for this challenging certification exam. This comprehensive, in-depth study guide helps you develop the functional-programming knowledge required to pass the exam and earn certification. All vital topics are covered, including Java building blocks, operators and loops, String and StringBuilder, Array and ArrayList, and more. Included is access to Sybex's superior online interactive learning environment and test bank—containing self-assessment tests, chapter tests, bonus practice exam questions, electronic flashcards, and a searchable glossary of important terms. This indispensable guide: Clarifies complex material and strengthens your comprehension and retention of key topics Covers all exam objectives such as methods and encapsulation, exceptions, inheriting abstract classes and interfaces, and Java 8 Dates and Lambda Expressions Explains object-oriented design principles and patterns Helps you master the fundamentals of functional programming Enables you to create Java solutions applicable to real-world scenarios There are over 9 millions developers using Java around the world, yet hiring managers face challenges filling open positions with qualified candidates. The OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide will help you take the next step in your career.","language":"en","currency":"USD","id":"1119584566","title":"OCP Oracle Certified Professional Java SE 11 Programmer I Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AcG_DwAAQBAJ&source=gbs_api","authors":["Jeanne Boyarsky","Scott Selikoff"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zEI1CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":null,"description":"Written by leading information security educators, this fully revised, full-color computer security textbook covers CompTIA’s fastest-growing credential, CompTIA Security+. Principles of Computer Security, Fourth Edition is a student-tested, introductory computer security textbook that provides comprehensive coverage of computer and network security fundamentals in an engaging and dynamic full-color design. In addition to teaching key computer security concepts, the textbook also fully prepares you for CompTIA Security+ exam SY0-401 with 100% coverage of all exam objectives. Each chapter begins with a list of topics to be covered and features sidebar exam and tech tips, a chapter summary, and an end-of-chapter assessment section that includes key term, multiple choice, and essay quizzes as well as lab projects. Electronic content includes CompTIA Security+ practice exam questions and a PDF copy of the book. Key features: CompTIA Approved Quality Content (CAQC) Electronic content features two simulated practice exams in the Total Tester exam engine and a PDF eBook Supplemented by Principles of Computer Security Lab Manual, Fourth Edition, available separately White and Conklin are two of the most well-respected computer security educators in higher education Instructor resource materials for adopting instructors include: Instructor Manual, PowerPoint slides featuring artwork from the book, and a test bank of questions for use as quizzes or exams Answers to the end of chapter sections are not included in the book and are only available to adopting instructors Learn how to: Ensure operational, organizational, and physical security Use cryptography and public key infrastructures (PKIs) Secure remote access, wireless networks, and virtual private networks (VPNs) Authenticate users and lock down mobile devices Harden network devices, operating systems, and applications Prevent network attacks, such as denial of service, spoofing, hijacking, and password guessing Combat viruses, worms, Trojan horses, and rootkits Manage e-mail, instant messaging, and web security Explore secure software development requirements Implement disaster recovery and business continuity measures Handle computer forensics and incident response Understand legal, ethical, and privacy issues","language":"en","currency":"USD","id":"0071836012","title":"Principles of Computer Security, Fourth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zEI1CwAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Chuck Cothren","Roger Davis","Dwayne Williams"]},{"pageCount":480,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bnNAAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.5,"subtitle":null,"description":"From the #1 Name in Professional Certification Prepare for CompTIA Security+ Exam SY0-401 with McGraw-Hill Professional—a Platinum-Level CompTIA Authorized Partner offering Authorized CompTIA Approved Quality Content to give you the competitive edge on exam day. Get on the fast track to becoming CompTIA Security+ certified with this affordable, portable study tool--fully revised for the latest exam release. Inside, certification training experts guide you on your career path, providing expert tips and sound advice along the way. With an intensive focus only on what you need to know to pass CompTIA Security+ Exam SY0-401, this certification passport is your ticket to success on exam day. INSIDE: Itineraries -- List of official exam objectives covered ETAs -- Amount of time needed to complete each lesson Travel Advisories -- Expert advice on critical topics Local Lingo -- Concise definitions of key terms and concepts Travel Assistance -- Recommended resources for more information Exam Tips -- Common exam pitfalls and solutions Checkpoints -- End-of-chapter questions, answers, and explanations Career Flight Path -- Information on the exam and possible next steps Electronic content includes: 200 practice exam questions","language":"en","currency":"USD","id":"0071832173","title":"Mike Meyers’ CompTIA Security+ Certification Passport, Fourth Edition (Exam SY0-401)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bnNAAwAAQBAJ&source=gbs_api","authors":["Dawn Dunkerley","T. J. Samuelle"]},{"pageCount":267,"thumbnail":"http:\/\/books.google.com\/books\/content?id=X9qCDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":null,"description":"This book focuses on the analytic principles of business practice and big data. Specifically, it provides an interface between the main disciplines of engineering\/technology and the organizational and administrative aspects of management, serving as a complement to books in other disciplines such as economics, finance, marketing and risk analysis. The contributors present their areas of expertise, together with essential case studies that illustrate the successful application of engineering management theories in real-life examples.","language":"en","currency":"USD","id":"3319454986","title":"Big Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=X9qCDQAAQBAJ&source=gbs_api","authors":["Fausto Pedro García Márquez","Benjamin Lev"]},{"pageCount":470,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UwXRrBCvY78C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":"Tools, Perspectives and Applications","description":"This book is the first of three volumes that illustrate the concept of social networks from a computational point of view. The book contains contributions from a international selection of world-class experts, with a specific focus on practical tools, applications, and open avenues for further research (the other two volumes review issues of Security and Privacy, and Mining and Visualization in CSNs). Topics and features: presents the latest advances in CSNs, and illustrates how organizations can gain a competitive advantage by applying these ideas in real-world scenarios; discusses the design and use of a wide range of computational tools and software for social network analysis; describes simulations of social networks, the representation and analysis of social networks, and the use of semantic networks in knowledge discovery and visualization; provides experience reports, survey articles, and intelligence techniques and theories relating to specific problems in network technology.","language":"en","currency":"USD","id":"1447140486","title":"Computational Social Networks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UwXRrBCvY78C&source=gbs_api","authors":["Ajith Abraham","Aboul-Ella Hassanien"]},{"pageCount":502,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SE2iRgeYYwcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":103.2,"subtitle":null,"description":"Social network analysis applications have experienced tremendous advances within the last few years due in part to increasing trends towards users interacting with each other on the internet. Social networks are organized as graphs, and the data on social networks takes on the form of massive streams, which are mined for a variety of purposes. Social Network Data Analytics covers an important niche in the social network analytics field. This edited volume, contributed by prominent researchers in this field, presents a wide selection of topics on social network data mining such as Structural Properties of Social Networks, Algorithms for Structural Discovery of Social Networks and Content Analysis in Social Networks. This book is also unique in focussing on the data analytical aspects of social networks in the internet scenario, rather than the traditional sociology-driven emphasis prevalent in the existing books, which do not focus on the unique data-intensive characteristics of online social networks. Emphasis is placed on simplifying the content so that students and practitioners benefit from this book. This book targets advanced level students and researchers concentrating on computer science as a secondary text or reference book. Data mining, database, information security, electronic commerce and machine learning professionals will find this book a valuable asset, as well as primary associations such as ACM, IEEE and Management Science.","language":"en","currency":"USD","id":"1441984623","title":"Social Network Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SE2iRgeYYwcC&source=gbs_api","authors":["Charu C. Aggarwal"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cnI6vGNmJvgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.96,"subtitle":"A Practical Guide for Architecture, Design, and Implementation","description":"Whether you are a software developer, systems architect, data analyst, or business analyst, if you want to take advantage of data mining in the development of advanced analytic applications, Java Data Mining, JDM, the new standard now implemented in core DBMS and data mining\/analysis software, is a key solution component. This book is the essential guide to the usage of the JDM standard interface, written by contributors to the JDM standard. Data mining introduction - an overview of data mining and the problems it can address across industries; JDM's place in strategic solutions to data mining-related problems JDM essentials - concepts, design approach and design issues, with detailed code examples in Java; a Web Services interface to enable JDM functionality in an SOA environment; and illustration of JDM XML Schema for JDM objects JDM in practice - the use of JDM from vendor implementations and approaches to customer applications, integration, and usage; impact of data mining on IT infrastructure; a how-to guide for building applications that use the JDM API Free, downloadable KJDM source code referenced in the book available here","language":"en","currency":"USD","id":"9780080495910","title":"Java Data Mining: Strategy, Standard, and Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cnI6vGNmJvgC&source=gbs_api","authors":["Mark F. Hornick","Erik Marcadé","Sunil Venkayala"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9V0MEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Specialty (DAS-C01) Exam","description":"Move your career forward with AWS certification! Prepare for the AWS Certified Data Analytics Specialty Exam with this thorough study guide This comprehensive study guide will help assess your technical skills and prepare for the updated AWS Certified Data Analytics exam. Earning this AWS certification will confirm your expertise in designing and implementing AWS services to derive value from data. The AWS Certified Data Analytics Study Guide: Specialty (DAS-C01) Exam is designed for business analysts and IT professionals who perform complex Big Data analyses. This AWS Specialty Exam guide gets you ready for certification testing with expert content, real-world knowledge, key exam concepts, and topic reviews. Gain confidence by studying the subject areas and working through the practice questions. Big data concepts covered in the guide include: Collection Storage Processing Analysis Visualization Data security AWS certifications allow professionals to demonstrate skills related to leading Amazon Web Services technology. The AWS Certified Data Analytics Specialty (DAS-C01) Exam specifically evaluates your ability to design and maintain Big Data, leverage tools to automate data analysis, and implement AWS Big Data services according to architectural best practices. An exam study guide can help you feel more prepared about taking an AWS certification test and advancing your professional career. In addition to the guide’s content, you’ll have access to an online learning environment and test bank that offers practice exams, a glossary, and electronic flashcards.","language":"en","currency":"USD","id":"1119649455","title":"AWS Certified Data Analytics Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9V0MEAAAQBAJ&source=gbs_api","authors":["Asif Abbasi"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xNHyAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Get complete coverage of all six CCFP exam domains developed by the International Information Systems Security Certification Consortium (ISC)2. Written by a leading computer security expert, this authoritative guide fully addresses cyber forensics techniques, standards, technologies, and legal and ethical principles. You'll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. COVERS ALL SIX EXAM DOMAINS: Legal and ethical principles Investigations Forensic science Digital forensics Application forensics Hybrid and emerging technologies ELECTRONIC CONTENT INCLUDES: 250 practice exam questions Test engine that provides full-length practice exams and customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"0071839755","title":"CCFP Certified Cyber Forensics Professional All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xNHyAwAAQBAJ&source=gbs_api","authors":["Chuck Easttom"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y7BDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":8.06,"subtitle":null,"description":"本書可協助讀者徹底了解Google Cloud平台使用的基本資訊 並且協助有需要的企業能了解到使用Google Cloud平台的優勢 Google Cloud延伸Google的開發者精神，將服務的建置、部署、測試與維運等做一個垂直的串連，讓開發者及服務提供者可以在Google所提供的高安全性平台上部署、建置其所屬的應用服務。透過各層面上不同的服務，包含運算資源、儲存資源、大資料處理工具、機器學習工具以及應用服務等等，都可以在Google Cloud的平台上完美的發揮。","language":"zh-CN","currency":"USD","id":"9864342177","title":"Google Cloud平台實作手冊─Google雲端功能一點就通","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y7BDDwAAQBAJ&source=gbs_api","authors":["蘇培欣、胡際善、洪宜禎"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-_rxBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":87.2,"subtitle":"Toward the Speaking Computer","description":"Auditory User Interfaces: Toward the Speaking Computer describes a speech-enabling approach that separates computation from the user interface and integrates speech into the human-computer interaction. The Auditory User Interface (AUI) works directly with the computational core of the application, the same as the Graphical User Interface. The author's approach is implemented in two large systems, ASTER - a computing system that produces high-quality interactive aural renderings of electronic documents - and Emacspeak - a fully-fledged speech interface to workstations, including fluent spoken access to the World Wide Web and many desktop applications. Using this approach, developers can design new high-quality AUIs. Auditory interfaces are presented using concrete examples that have been implemented on an electronic desktop. This aural desktop system enables applications to produce auditory output using the same information used for conventional visual output. Auditory User Interfaces: Toward the Speaking Computer is for the electrical and computer engineering professional in the field of computer\/human interface design. It will also be of interest to academic and industrial researchers, and engineers designing and implementing computer systems that speak. Communication devices such as hand-held computers, smart telephones, talking web browsers, and others will need to incorporate speech-enabling interfaces to be effective.","language":"en","currency":"USD","id":"1461562252","title":"Auditory User Interfaces","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-_rxBwAAQBAJ&source=gbs_api","authors":["T.V. Raman"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B3zd4GCAWeYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":49.56,"subtitle":null,"description":"The Practitioner's Guide to Data Quality Improvement offers a comprehensive look at data quality for business and IT, encompassing people, process, and technology. It shares the fundamentals for understanding the impacts of poor data quality, and guides practitioners and managers alike in socializing, gaining sponsorship for, planning, and establishing a data quality program. It demonstrates how to institute and run a data quality program, from first thoughts and justifications to maintenance and ongoing metrics. It includes an in-depth look at the use of data quality tools, including business case templates, and tools for analysis, reporting, and strategic planning. This book is recommended for data management practitioners, including database analysts, information analysts, data administrators, data architects, enterprise architects, data warehouse engineers, and systems analysts, and their managers. Offers a comprehensive look at data quality for business and IT, encompassing people, process, and technology. Shows how to institute and run a data quality program, from first thoughts and justifications to maintenance and ongoing metrics. Includes an in-depth look at the use of data quality tools, including business case templates, and tools for analysis, reporting, and strategic planning.","language":"en","currency":"USD","id":"9780080920344","title":"The Practitioner's Guide to Data Quality Improvement","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B3zd4GCAWeYC&source=gbs_api","authors":["David Loshin"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rMKiCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Probabilistic Programming and Bayesian Inference","description":"Master Bayesian Inference through Practical Examples and Computation–Without Advanced Mathematical Analysis Bayesian methods of inference are deeply natural and extremely powerful. However, most discussions of Bayesian inference rely on intensely complex mathematical analyses and artificial examples, making it inaccessible to anyone without a strong mathematical background. Now, though, Cameron Davidson-Pilon introduces Bayesian inference from a computational perspective, bridging theory to practice–freeing you to get results using computing power. Bayesian Methods for Hackers illuminates Bayesian inference through probabilistic programming with the powerful PyMC language and the closely related Python tools NumPy, SciPy, and Matplotlib. Using this approach, you can reach effective solutions in small increments, without extensive mathematical intervention. Davidson-Pilon begins by introducing the concepts underlying Bayesian inference, comparing it with other techniques and guiding you through building and training your first Bayesian model. Next, he introduces PyMC through a series of detailed examples and intuitive explanations that have been refined after extensive user feedback. You’ll learn how to use the Markov Chain Monte Carlo algorithm, choose appropriate sample sizes and priors, work with loss functions, and apply Bayesian inference in domains ranging from finance to marketing. Once you’ve mastered these techniques, you’ll constantly turn to this guide for the working PyMC code you need to jumpstart future projects. Coverage includes • Learning the Bayesian “state of mind” and its practical implications • Understanding how computers perform Bayesian inference • Using the PyMC Python library to program Bayesian analyses • Building and debugging models with PyMC • Testing your model’s “goodness of fit” • Opening the “black box” of the Markov Chain Monte Carlo algorithm to see how and why it works • Leveraging the power of the “Law of Large Numbers” • Mastering key concepts, such as clustering, convergence, autocorrelation, and thinning • Using loss functions to measure an estimate’s weaknesses based on your goals and desired outcomes • Selecting appropriate priors and understanding how their influence changes with dataset size • Overcoming the “exploration versus exploitation” dilemma: deciding when “pretty good” is good enough • Using Bayesian inference to improve A\/B testing • Solving data science problems when only small amounts of data are available Cameron Davidson-Pilon has worked in many areas of applied mathematics, from the evolutionary dynamics of genes and diseases to stochastic modeling of financial prices. His contributions to the open source community include lifelines, an implementation of survival analysis in Python. Educated at the University of Waterloo and at the Independent University of Moscow, he currently works with the online commerce leader Shopify.","language":"en","currency":"USD","id":"0133902927","title":"Bayesian Methods for Hackers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rMKiCgAAQBAJ&source=gbs_api","authors":["Cameron Davidson-Pilon"]},{"pageCount":950,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hhtfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":231.2,"subtitle":"Proceedings of the 12th International Conference on Innovative Mobile and Internet Services in Ubiquitous Computing (IMIS-2018)","description":"This book presents the latest research findings, methods and development techniques related to Ubiquitous and Pervasive Computing (UPC) as well as challenges and solutions from both theoretical and practical perspectives with an emphasis on innovative, mobile and internet services. With the proliferation of wireless technologies and electronic devices, there is a rapidly growing interest in Ubiquitous and Pervasive Computing (UPC). UPC makes it possible to create a human-oriented computing environment where computer chips are embedded in everyday objects and interact with physical world. It also allows users to be online even while moving around, providing them with almost permanent access to their preferred services. Along with a great potential to revolutionize our lives, UPC also poses new research challenges.","language":"en","currency":"USD","id":"3319935542","title":"Innovative Mobile and Internet Services in Ubiquitous Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hhtfDwAAQBAJ&source=gbs_api","authors":["Leonard Barolli","Fatos Xhafa","Nadeem Javaid","Tomoya Enokido"]},{"pageCount":264,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J9b_CH-NrycC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Tools and algorithms for analyzing images","description":"If you want a basic understanding of computer vision’s underlying theory and algorithms, this hands-on introduction is the ideal place to start. You’ll learn techniques for object recognition, 3D reconstruction, stereo imaging, augmented reality, and other computer vision applications as you follow clear examples written in Python. Programming Computer Vision with Python explains computer vision in broad terms that won’t bog you down in theory. You get complete code samples with explanations on how to reproduce and build upon each example, along with exercises to help you apply what you’ve learned. This book is ideal for students, researchers, and enthusiasts with basic programming and standard mathematical skills. Learn techniques used in robot navigation, medical image analysis, and other computer vision applications Work with image mappings and transforms, such as texture warping and panorama creation Compute 3D reconstructions from several images of the same scene Organize images based on similarity or content, using clustering methods Build efficient image retrieval techniques to search for images based on visual content Use algorithms to classify image content and recognize objects Access the popular OpenCV library through a Python interface","language":"en","currency":"USD","id":"1449341934","title":"Programming Computer Vision with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J9b_CH-NrycC&source=gbs_api","authors":["Jan Erik Solem"]},{"pageCount":557,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vqTfNFDzzdIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":"Pattern Enterpr Applica Arch","description":"The practice of enterprise application development has benefited from the emergence of many new enabling technologies. Multi-tiered object-oriented platforms, such as Java and .NET, have become commonplace. These new tools and technologies are capable of building powerful applications, but they are not easily implemented. Common failures in enterprise applications often occur because their developers do not understand the architectural lessons that experienced object developers have learned. Patterns of Enterprise Application Architecture is written in direct response to the stiff challenges that face enterprise application developers. The author, noted object-oriented designer Martin Fowler, noticed that despite changes in technology--from Smalltalk to CORBA to Java to .NET--the same basic design ideas can be adapted and applied to solve common problems. With the help of an expert group of contributors, Martin distills over forty recurring solutions into patterns. The result is an indispensable handbook of solutions that are applicable to any enterprise application platform. This book is actually two books in one. The first section is a short tutorial on developing enterprise applications, which you can read from start to finish to understand the scope of the book's lessons. The next section, the bulk of the book, is a detailed reference to the patterns themselves. Each pattern provides usage and implementation information, as well as detailed code examples in Java or C#. The entire book is also richly illustrated with UML diagrams to further explain the concepts. Armed with this book, you will have the knowledge necessary to make important architectural decisions about building an enterprise application and the proven patterns for use when building them. The topics covered include · Dividing an enterprise application into layers · The major approaches to organizing business logic · An in-depth treatment of mapping between objects and relational databases · Using Model-View-Controller to organize a Web presentation · Handling concurrency for data that spans multiple transactions · Designing distributed object interfaces","language":"en","currency":"USD","id":"0133065219","title":"Fowler","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vqTfNFDzzdIC&source=gbs_api","authors":["Martin Fowler"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8AcvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Practical Programming for Total Beginners","description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: –Search for text in a file or across multiple files –Create, update, move, and rename files and folders –Search the Web and download online content –Update and format data in Excel spreadsheets of any size –Split, merge, watermark, and encrypt PDFs –Send reminder emails and text notifications –Fill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","language":"en","currency":"USD","id":"1593276850","title":"Automate the Boring Stuff with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8AcvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AQgvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":null,"description":"Invent Your Own Computer Games with Python will teach you how to make computer games using the popular Python programming language—even if you’ve never programmed before! Begin by building classic games like Hangman, Guess the Number, and Tic-Tac-Toe, and then work your way up to more advanced games, like a text-based treasure hunting game and an animated collision-dodging game with sound effects. Along the way, you’ll learn key programming and math concepts that will help you take your game programming to the next level. Learn how to: –Combine loops, variables, and flow control statements into real working programs –Choose the right data structures for the job, such as lists, dictionaries, and tuples –Add graphics and animation to your games with the pygame module –Handle keyboard and mouse input –Program simple artificial intelligence so you can play against the computer –Use cryptography to convert text messages into secret code –Debug your programs and find common errors As you work through each game, you’ll build a solid foundation in Python and an understanding of computer science fundamentals. What new game will you create with the power of Python? The projects in this book are compatible with Python 3.","language":"en","currency":"USD","id":"159327811X","title":"Invent Your Own Computer Games with Python, 4E","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AQgvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jBpKBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Written by leading authorities in database and Web technologies, this book is essential reading for students and practitioners alike. The popularity of the Web and Internet commerce provides many extremely large datasets from which information can be gleaned by data mining. This book focuses on practical algorithms that have been used to solve key problems in data mining and can be applied successfully to even the largest datasets. It begins with a discussion of the map-reduce framework, an important tool for parallelizing algorithms automatically. The authors explain the tricks of locality-sensitive hashing and stream processing algorithms for mining data that arrives too fast for exhaustive processing. Other chapters cover the PageRank idea and related tricks for organizing the Web, the problems of finding frequent itemsets and clustering. This second edition includes new and extended coverage on social networks, machine learning and dimensionality reduction.","language":"en","currency":"USD","id":"1316148130","title":"Mining of Massive Datasets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jBpKBQAAQBAJ&source=gbs_api","authors":["Jure Leskovec","Anand Rajaraman","Jeffrey David Ullman"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BFVv4qmu1XIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":null,"description":"Big data has more disruptive potential than any information technology developed in the past 40 years. As author Jeffrey Needham points out in this revealing book, big data can provide unprecedented visibility into the operational efficiency of enterprises and agencies. Disruptive Possibilities provides an historically-informed overview through a wide range of topics, from the evolution of commodity supercomputing and the simplicity of big data technology, to the ways conventional clouds differ from Hadoop analytics clouds. This relentlessly innovative form of computing will soon become standard practice for organizations of any size attempting to derive insight from the tsunami of data engulfing them. Replacing legacy silos—whether they’re infrastructure, organizational, or vendor silos—with a platform-centric perspective is just one of the big stories of big data. To reap maximum value from the myriad forms of data, organizations and vendors will have to adopt highly collaborative habits and methodologies.","language":"en","currency":"USD","id":"1449369006","title":"Disruptive Possibilities: How Big Data Changes Everything","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BFVv4qmu1XIC&source=gbs_api","authors":["Jeffrey Needham"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=omivDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":50.99,"subtitle":null,"description":"An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives. “Written by three experts in the field, Deep Learning is the only comprehensive book on the subject.” —Elon Musk, cochair of OpenAI; cofounder and CEO of Tesla and SpaceX Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning. The text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models. Deep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.","language":"en","currency":"USD","id":"0262337371","title":"Deep Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=omivDQAAQBAJ&source=gbs_api","authors":["Ian Goodfellow","Yoshua Bengio","Aaron Courville"]},{"pageCount":173,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eNBJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"A Decision Based Approach","description":"As the first to focus on the issue of Data Warehouse Requirements Engineering, this book introduces a model-driven requirements process used to identify requirements granules and incrementally develop data warehouse fragments. In addition, it presents an approach to the pair-wise integration of requirements granules for consolidating multiple data warehouse fragments. The process is systematic and does away with the fuzziness associated with existing techniques. Thus, consolidation is treated as a requirements engineering issue. The notion of a decision occupies a central position in the decision-based approach. On one hand, information relevant to a decision must be elicited from stakeholders; modeled; and transformed into multi-dimensional form. On the other, decisions themselves are to be obtained from decision applications. For the former, the authors introduce a suite of information elicitation techniques specific to data warehousing. This information is subsequently converted into multi-dimensional form. For the latter, not only are decisions obtained from decision applications for managing operational businesses, but also from applications for formulating business policies and for defining rules for enforcing policies, respectively. In this context, the book presents a broad range of models, tools and techniques. For readers from academia, the book identifies the scientific\/technological problems it addresses and provides cogent arguments for the proposed solutions; for readers from industry, it presents an approach for ensuring that the product meets its requirements while ensuring low lead times in delivery.","language":"en","currency":"USD","id":"9811070199","title":"Data Warehouse Requirements Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eNBJDwAAQBAJ&source=gbs_api","authors":["Naveen Prakash","Deepika Prakash"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eR6mAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42,"subtitle":"Fundamental Concepts and Algorithms","description":"The fundamental algorithms in data mining and analysis form the basis for the emerging field of data science, which includes automated methods to analyze patterns and models for all kinds of data, with applications ranging from scientific discovery to business intelligence and analytics. This textbook for senior undergraduate and graduate data mining courses provides a broad yet in-depth overview of data mining, integrating related concepts from machine learning and statistics. The main parts of the book include exploratory data analysis, pattern mining, clustering, and classification. The book lays the basic foundations of these tasks, and also covers cutting-edge topics such as kernel methods, high-dimensional data analysis, and complex graphs and networks. With its comprehensive coverage, algorithmic perspective, and wealth of examples, this book offers solid guidance in data mining for students, researchers, and practitioners alike.","language":"en","currency":"USD","id":"1107782562","title":"Data Mining and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eR6mAwAAQBAJ&source=gbs_api","authors":["Mohammed J. Zaki","Wagner Meira, Jr"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M68hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.02,"subtitle":"How to Think Like a Computer Scientist","description":"A no-nonsense introduction to software design using the Python programming language. Written for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters. The focus is on the programming process, with special emphasis on debugging. The book includes a wide range of exercises, from short examples to substantial projects, so that students have ample opportunity to practise each new concept. Exercise solutions and code examples are available from thinkpython.com, along with Swampy, a suite of Python programs that is used in some of the exercises.","language":"en","currency":"USD","id":"1139479229","title":"Python for Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M68hAwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fVhzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.66,"subtitle":"An Introduction","description":"The growth of social media over the last decade has revolutionized the way individuals interact and industries conduct business. Individuals produce data at an unprecedented rate by interacting, sharing, and consuming content through social media. Understanding and processing this new type of data to glean actionable patterns presents challenges and opportunities for interdisciplinary research, novel algorithms and tool development. Social Media Mining integrates social media, social network analysis, and data mining to provide a coherent platform to understand the basics and potentials of social media mining. It introduces the unique problems arising from social media data and presents fundamental concepts, emerging issues, and effective algorithms for network analysis and data mining. Suitable for use in advanced undergraduate and beginning graduate courses as well as professional short courses, the text contains exercises of different degrees of difficulty that improve understanding and help apply concepts, principles and methods for social media mining.","language":"en","currency":"USD","id":"1139916122","title":"Social Media Mining","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fVhzAwAAQBAJ&source=gbs_api","authors":["Reza Zafarani","Mohammad Ali Abbasi","Huan Liu"]},{"pageCount":848,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZA5dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":88,"subtitle":null,"description":"Fully updated computer security essentials—quality approved by CompTIA Learn IT security fundamentals while getting complete coverage of the objectives for the latest release of CompTIA Security+ certification exam SY0-501. This thoroughly revised, full-color textbook discusses communication, infrastructure, operational security, attack prevention, disaster recovery, computer forensics, and much more. Written by a pair of highly respected security educators, Principles of Computer Security: CompTIA Security+® and Beyond, Fifth Edition (Exam SY0-501) will help you pass the exam and become a CompTIA certified computer security expert. Find out how to: •Ensure operational, organizational, and physical security •Use cryptography and public key infrastructures (PKIs) •Secure remote access, wireless networks, and virtual private networks (VPNs) •Authenticate users and lock down mobile devices •Harden network devices, operating systems, and applications •Prevent network attacks, such as denial of service, spoofing, hijacking, and password guessing •Combat viruses, worms, Trojan horses, and rootkits •Manage e-mail, instant messaging, and web security •Explore secure software development requirements •Implement disaster recovery and business continuity measures •Handle computer forensics and incident response •Understand legal, ethical, and privacy issues Online content includes: •Test engine that provides full-length practice exams and customized quizzes by chapter or exam objective •200 practice exam questions Each chapter includes: •Learning objectives •Real-world examples •Try This! and Cross Check exercises •Tech Tips, Notes, and Warnings •Exam Tips •End-of-chapter quizzes and lab projects","language":"en","currency":"USD","id":"1260026000","title":"Principles of Computer Security: CompTIA Security+ and Beyond, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZA5dDwAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Chuck Cothren","Roger L. Davis","Dwayne Williams"]},{"pageCount":812,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bXzAlkODwa8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Algorithms and Applications","description":"Computer Vision: Algorithms and Applications explores the variety of techniques commonly used to analyze and interpret images. It also describes challenging real-world applications where vision is being successfully used, both for specialized applications such as medical imaging, and for fun, consumer-level tasks such as image editing and stitching, which students can apply to their own personal photos and videos. More than just a source of “recipes,” this exceptionally authoritative and comprehensive textbook\/reference also takes a scientific approach to basic vision problems, formulating physical models of the imaging process before inverting them to produce descriptions of a scene. These problems are also analyzed using statistical models and solved using rigorous engineering techniques. Topics and features: structured to support active curricula and project-oriented courses, with tips in the Introduction for using the book in a variety of customized courses; presents exercises at the end of each chapter with a heavy emphasis on testing algorithms and containing numerous suggestions for small mid-term projects; provides additional material and more detailed mathematical topics in the Appendices, which cover linear algebra, numerical techniques, and Bayesian estimation theory; suggests additional reading at the end of each chapter, including the latest research in each sub-field, in addition to a full Bibliography at the end of the book; supplies supplementary course material for students at the associated website, http:\/\/szeliski.org\/Book\/. Suitable for an upper-level undergraduate or graduate-level course in computer science or engineering, this textbook focuses on basic techniques that work under real-world conditions and encourages students to push their creative boundaries. Its design and exposition also make it eminently suitable as a unique reference to the fundamental techniques and current research literature in computer vision.","language":"en","currency":"USD","id":"9781848829350","title":"Computer Vision","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bXzAlkODwa8C&source=gbs_api","authors":["Richard Szeliski"]},{"pageCount":30,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o-FwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Succeeding with data isn’t just a matter of putting Hadoop in your machine room, or hiring some physicists with crazy math skills. It requires you to develop a data culture that involves people throughout the organization. In this O’Reilly report, DJ Patil and Hilary Mason outline the steps you need to take if your company is to be truly data-driven—including the questions you should ask and the methods you should adopt. You’ll not only learn examples of how Google, LinkedIn, and Facebook use their data, but also how Walmart, UPS, and other organizations took advantage of this resource long before the advent of Big Data. No matter how you approach it, building a data culture is the key to success in the 21st century. You’ll explore: Data scientist skills—and why every company needs a Spock How the benefits of giving company-wide access to data outweigh the costs Why data-driven organizations use the scientific method to explore and solve data problems Key questions to help you develop a research-specific process for tackling important issues What to consider when assembling your data team Developing processes to keep your data team (and company) engaged Choosing technologies that are powerful, support teamwork, and easy to use and learn","language":"en","currency":"USD","id":"1491925477","title":"Data Driven","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o-FwBgAAQBAJ&source=gbs_api","authors":["DJ Patil","Hilary Mason"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=93YpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code","description":"You Will Learn Python 3! Zed Shaw has perfected the world’s best system for learning Python 3. Follow it and you will succeed—just like the millions of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. In Learn Python 3 the Hard Way, you’ll learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you’ll learn how a computer works; what good programs look like; and how to read, write, and think about code. Zed then teaches you even more in 5+ hours of video where he shows you how to break, fix, and debug your code—live, as he’s doing the exercises. Install a complete Python environment Organize and write code Fix and break code Basic mathematics Variables Strings and text Interact with users Work with files Looping and logic Data structures using lists and dictionaries Program design Object-oriented programming Inheritance and composition Modules, classes, and objects Python packaging Automated testing Basic game development Basic web development It’ll be hard at first. But soon, you’ll just get it—and that will feel great! This course will reward you for every minute you put into it. Soon, you’ll know one of the world’s most powerful, popular programming languages. You’ll be a Python programmer. This Book Is Perfect For Total beginners with zero programming experience Junior developers who know one or two languages Returning professionals who haven’t written code in years Seasoned professionals looking for a fast, simple, crash course in Python 3","language":"en","currency":"USD","id":"0134693906","title":"Learn Python 3 the Hard Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=93YpDwAAQBAJ&source=gbs_api","authors":["Zed A. Shaw"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxFYuVZHG60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Our world is being revolutionized by data-driven methods: access to large amounts of data has generated new insights and opened exciting new opportunities in commerce, science, and computing applications. Processing the enormous quantities of data necessary for these advances requires large clusters, making distributed computing paradigms more crucial than ever. MapReduce is a programming model for expressing distributed computations on massive datasets and an execution framework for large-scale data processing on clusters of commodity servers. The programming model provides an easy-to-understand abstraction for designing scalable algorithms, while the execution framework transparently handles many system-level details, ranging from scheduling to synchronization to fault tolerance. This book focuses on MapReduce algorithm design, with an emphasis on text processing algorithms common in natural language processing, information retrieval, and machine learning. We introduce the notion of MapReduce design patterns, which represent general reusable solutions to commonly occurring problems across a variety of problem domains. This book not only intends to help the reader \"think in MapReduce\", but also discusses limitations of the programming model as well. This volume is a printed version of a work that appears in the Synthesis Digital Library of Engineering and Computer Science. Synthesis Lectures provide concise, original presentations of important research and development topics, published quickly, in digital and print formats. For more information visit www.morganclaypool.com","language":"en","currency":"USD","id":"1608453421","title":"Data-intensive Text Processing with MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxFYuVZHG60C&source=gbs_api","authors":["Jimmy Lin","Chris Dyer"]},{"pageCount":1152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Na8rAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"A Modern Approach","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Artificial Intelligence: A Modern Approach, 3e offers the most comprehensive, up-to-date introduction to the theory and practice of artificial intelligence. Number one in its field, this textbook is ideal for one or two-semester, undergraduate or graduate-level courses in Artificial Intelligence. Dr. Peter Norvig, contributing Artificial Intelligence author and Professor Sebastian Thrun, a Pearson author are offering a free online course at Stanford University on artificial intelligence. According to an article in The New York Times , the course on artificial intelligence is “one of three being offered experimentally by the Stanford computer science department to extend technology knowledge and skills beyond this elite campus to the entire world.” One of the other two courses, an introduction to database software, is being taught by Pearson author Dr. Jennifer Widom. Artificial Intelligence: A Modern Approach, 3e is available to purchase as an eText for your Kindle™, NOOK™, and the iPhone®\/iPad®. To learn more about the course on artificial intelligence, visit http:\/\/www.ai-class.com. To read the full New York Times article, click here.","language":"en","currency":null,"id":"0133001989","title":"Artificial Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Na8rAAAAQBAJ&source=gbs_api","authors":["Peter Norvig","Stuart Russell"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3wNbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":"Proceedings of 7th Computer Science On-line Conference 2018","description":"This book presents new software engineering approaches and methods, discussing real-world problems and exploratory research that describes novel approaches, modern design techniques, hybrid algorithms and empirical methods. This book constitutes part of the refereed proceedings of the Software Engineering and Algorithms in Intelligent Systems Section of the 7th Computer Science On-line Conference 2018 (CSOC 2018), held in April 2018.","language":"en","currency":"USD","id":"3319911864","title":"Software Engineering and Algorithms in Intelligent Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3wNbDwAAQBAJ&source=gbs_api","authors":["Radek Silhavy"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TfCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"12th International Conference, LION 12, Kalamata, Greece, June 10–15, 2018, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Conference on Learning and Intelligent Optimization, LION 12, held in Kalamata, Greece, in June 2018. The 28 full papers and 12 short papers presented have been carefully reviewed and selected from 62 submissions. The papers explore the advanced research developments in such interconnected fields as mathematical programming, global optimization, machine learning, and artificial intelligence. Special focus is given to advanced ideas, technologies, methods, and applications in optimization and machine learning.","language":"en","currency":"USD","id":"3030053482","title":"Learning and Intelligent Optimization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TfCBDwAAQBAJ&source=gbs_api","authors":["Roberto Battiti","Mauro Brunato","Ilias Kotsireas","Panos M. Pardalos"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8AcvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Practical Programming for Total Beginners","description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: –Search for text in a file or across multiple files –Create, update, move, and rename files and folders –Search the Web and download online content –Update and format data in Excel spreadsheets of any size –Split, merge, watermark, and encrypt PDFs –Send reminder emails and text notifications –Fill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","language":"en","currency":"USD","id":"1593276850","title":"Automate the Boring Stuff with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8AcvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AQgvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":null,"description":"Invent Your Own Computer Games with Python will teach you how to make computer games using the popular Python programming language—even if you’ve never programmed before! Begin by building classic games like Hangman, Guess the Number, and Tic-Tac-Toe, and then work your way up to more advanced games, like a text-based treasure hunting game and an animated collision-dodging game with sound effects. Along the way, you’ll learn key programming and math concepts that will help you take your game programming to the next level. Learn how to: –Combine loops, variables, and flow control statements into real working programs –Choose the right data structures for the job, such as lists, dictionaries, and tuples –Add graphics and animation to your games with the pygame module –Handle keyboard and mouse input –Program simple artificial intelligence so you can play against the computer –Use cryptography to convert text messages into secret code –Debug your programs and find common errors As you work through each game, you’ll build a solid foundation in Python and an understanding of computer science fundamentals. What new game will you create with the power of Python? The projects in this book are compatible with Python 3.","language":"en","currency":"USD","id":"159327811X","title":"Invent Your Own Computer Games with Python, 4E","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AQgvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jBpKBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Written by leading authorities in database and Web technologies, this book is essential reading for students and practitioners alike. The popularity of the Web and Internet commerce provides many extremely large datasets from which information can be gleaned by data mining. This book focuses on practical algorithms that have been used to solve key problems in data mining and can be applied successfully to even the largest datasets. It begins with a discussion of the map-reduce framework, an important tool for parallelizing algorithms automatically. The authors explain the tricks of locality-sensitive hashing and stream processing algorithms for mining data that arrives too fast for exhaustive processing. Other chapters cover the PageRank idea and related tricks for organizing the Web, the problems of finding frequent itemsets and clustering. This second edition includes new and extended coverage on social networks, machine learning and dimensionality reduction.","language":"en","currency":"USD","id":"1316148130","title":"Mining of Massive Datasets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jBpKBQAAQBAJ&source=gbs_api","authors":["Jure Leskovec","Anand Rajaraman","Jeffrey David Ullman"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BFVv4qmu1XIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":null,"description":"Big data has more disruptive potential than any information technology developed in the past 40 years. As author Jeffrey Needham points out in this revealing book, big data can provide unprecedented visibility into the operational efficiency of enterprises and agencies. Disruptive Possibilities provides an historically-informed overview through a wide range of topics, from the evolution of commodity supercomputing and the simplicity of big data technology, to the ways conventional clouds differ from Hadoop analytics clouds. This relentlessly innovative form of computing will soon become standard practice for organizations of any size attempting to derive insight from the tsunami of data engulfing them. Replacing legacy silos—whether they’re infrastructure, organizational, or vendor silos—with a platform-centric perspective is just one of the big stories of big data. To reap maximum value from the myriad forms of data, organizations and vendors will have to adopt highly collaborative habits and methodologies.","language":"en","currency":"USD","id":"1449369006","title":"Disruptive Possibilities: How Big Data Changes Everything","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BFVv4qmu1XIC&source=gbs_api","authors":["Jeffrey Needham"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=omivDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":50.99,"subtitle":null,"description":"An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives. “Written by three experts in the field, Deep Learning is the only comprehensive book on the subject.” —Elon Musk, cochair of OpenAI; cofounder and CEO of Tesla and SpaceX Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning. The text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models. Deep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.","language":"en","currency":"USD","id":"0262337371","title":"Deep Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=omivDQAAQBAJ&source=gbs_api","authors":["Ian Goodfellow","Yoshua Bengio","Aaron Courville"]},{"pageCount":173,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eNBJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"A Decision Based Approach","description":"As the first to focus on the issue of Data Warehouse Requirements Engineering, this book introduces a model-driven requirements process used to identify requirements granules and incrementally develop data warehouse fragments. In addition, it presents an approach to the pair-wise integration of requirements granules for consolidating multiple data warehouse fragments. The process is systematic and does away with the fuzziness associated with existing techniques. Thus, consolidation is treated as a requirements engineering issue. The notion of a decision occupies a central position in the decision-based approach. On one hand, information relevant to a decision must be elicited from stakeholders; modeled; and transformed into multi-dimensional form. On the other, decisions themselves are to be obtained from decision applications. For the former, the authors introduce a suite of information elicitation techniques specific to data warehousing. This information is subsequently converted into multi-dimensional form. For the latter, not only are decisions obtained from decision applications for managing operational businesses, but also from applications for formulating business policies and for defining rules for enforcing policies, respectively. In this context, the book presents a broad range of models, tools and techniques. For readers from academia, the book identifies the scientific\/technological problems it addresses and provides cogent arguments for the proposed solutions; for readers from industry, it presents an approach for ensuring that the product meets its requirements while ensuring low lead times in delivery.","language":"en","currency":"USD","id":"9811070199","title":"Data Warehouse Requirements Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eNBJDwAAQBAJ&source=gbs_api","authors":["Naveen Prakash","Deepika Prakash"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eR6mAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42,"subtitle":"Fundamental Concepts and Algorithms","description":"The fundamental algorithms in data mining and analysis form the basis for the emerging field of data science, which includes automated methods to analyze patterns and models for all kinds of data, with applications ranging from scientific discovery to business intelligence and analytics. This textbook for senior undergraduate and graduate data mining courses provides a broad yet in-depth overview of data mining, integrating related concepts from machine learning and statistics. The main parts of the book include exploratory data analysis, pattern mining, clustering, and classification. The book lays the basic foundations of these tasks, and also covers cutting-edge topics such as kernel methods, high-dimensional data analysis, and complex graphs and networks. With its comprehensive coverage, algorithmic perspective, and wealth of examples, this book offers solid guidance in data mining for students, researchers, and practitioners alike.","language":"en","currency":"USD","id":"1107782562","title":"Data Mining and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eR6mAwAAQBAJ&source=gbs_api","authors":["Mohammed J. Zaki","Wagner Meira, Jr"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M68hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.02,"subtitle":"How to Think Like a Computer Scientist","description":"A no-nonsense introduction to software design using the Python programming language. Written for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters. The focus is on the programming process, with special emphasis on debugging. The book includes a wide range of exercises, from short examples to substantial projects, so that students have ample opportunity to practise each new concept. Exercise solutions and code examples are available from thinkpython.com, along with Swampy, a suite of Python programs that is used in some of the exercises.","language":"en","currency":"USD","id":"1139479229","title":"Python for Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M68hAwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fVhzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.66,"subtitle":"An Introduction","description":"The growth of social media over the last decade has revolutionized the way individuals interact and industries conduct business. Individuals produce data at an unprecedented rate by interacting, sharing, and consuming content through social media. Understanding and processing this new type of data to glean actionable patterns presents challenges and opportunities for interdisciplinary research, novel algorithms and tool development. Social Media Mining integrates social media, social network analysis, and data mining to provide a coherent platform to understand the basics and potentials of social media mining. It introduces the unique problems arising from social media data and presents fundamental concepts, emerging issues, and effective algorithms for network analysis and data mining. Suitable for use in advanced undergraduate and beginning graduate courses as well as professional short courses, the text contains exercises of different degrees of difficulty that improve understanding and help apply concepts, principles and methods for social media mining.","language":"en","currency":"USD","id":"1139916122","title":"Social Media Mining","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fVhzAwAAQBAJ&source=gbs_api","authors":["Reza Zafarani","Mohammad Ali Abbasi","Huan Liu"]},{"pageCount":848,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZA5dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":88,"subtitle":null,"description":"Fully updated computer security essentials—quality approved by CompTIA Learn IT security fundamentals while getting complete coverage of the objectives for the latest release of CompTIA Security+ certification exam SY0-501. This thoroughly revised, full-color textbook discusses communication, infrastructure, operational security, attack prevention, disaster recovery, computer forensics, and much more. Written by a pair of highly respected security educators, Principles of Computer Security: CompTIA Security+® and Beyond, Fifth Edition (Exam SY0-501) will help you pass the exam and become a CompTIA certified computer security expert. Find out how to: •Ensure operational, organizational, and physical security •Use cryptography and public key infrastructures (PKIs) •Secure remote access, wireless networks, and virtual private networks (VPNs) •Authenticate users and lock down mobile devices •Harden network devices, operating systems, and applications •Prevent network attacks, such as denial of service, spoofing, hijacking, and password guessing •Combat viruses, worms, Trojan horses, and rootkits •Manage e-mail, instant messaging, and web security •Explore secure software development requirements •Implement disaster recovery and business continuity measures •Handle computer forensics and incident response •Understand legal, ethical, and privacy issues Online content includes: •Test engine that provides full-length practice exams and customized quizzes by chapter or exam objective •200 practice exam questions Each chapter includes: •Learning objectives •Real-world examples •Try This! and Cross Check exercises •Tech Tips, Notes, and Warnings •Exam Tips •End-of-chapter quizzes and lab projects","language":"en","currency":"USD","id":"1260026000","title":"Principles of Computer Security: CompTIA Security+ and Beyond, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZA5dDwAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Chuck Cothren","Roger L. Davis","Dwayne Williams"]},{"pageCount":812,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bXzAlkODwa8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Algorithms and Applications","description":"Computer Vision: Algorithms and Applications explores the variety of techniques commonly used to analyze and interpret images. It also describes challenging real-world applications where vision is being successfully used, both for specialized applications such as medical imaging, and for fun, consumer-level tasks such as image editing and stitching, which students can apply to their own personal photos and videos. More than just a source of “recipes,” this exceptionally authoritative and comprehensive textbook\/reference also takes a scientific approach to basic vision problems, formulating physical models of the imaging process before inverting them to produce descriptions of a scene. These problems are also analyzed using statistical models and solved using rigorous engineering techniques. Topics and features: structured to support active curricula and project-oriented courses, with tips in the Introduction for using the book in a variety of customized courses; presents exercises at the end of each chapter with a heavy emphasis on testing algorithms and containing numerous suggestions for small mid-term projects; provides additional material and more detailed mathematical topics in the Appendices, which cover linear algebra, numerical techniques, and Bayesian estimation theory; suggests additional reading at the end of each chapter, including the latest research in each sub-field, in addition to a full Bibliography at the end of the book; supplies supplementary course material for students at the associated website, http:\/\/szeliski.org\/Book\/. Suitable for an upper-level undergraduate or graduate-level course in computer science or engineering, this textbook focuses on basic techniques that work under real-world conditions and encourages students to push their creative boundaries. Its design and exposition also make it eminently suitable as a unique reference to the fundamental techniques and current research literature in computer vision.","language":"en","currency":"USD","id":"9781848829350","title":"Computer Vision","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bXzAlkODwa8C&source=gbs_api","authors":["Richard Szeliski"]},{"pageCount":30,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o-FwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Succeeding with data isn’t just a matter of putting Hadoop in your machine room, or hiring some physicists with crazy math skills. It requires you to develop a data culture that involves people throughout the organization. In this O’Reilly report, DJ Patil and Hilary Mason outline the steps you need to take if your company is to be truly data-driven—including the questions you should ask and the methods you should adopt. You’ll not only learn examples of how Google, LinkedIn, and Facebook use their data, but also how Walmart, UPS, and other organizations took advantage of this resource long before the advent of Big Data. No matter how you approach it, building a data culture is the key to success in the 21st century. You’ll explore: Data scientist skills—and why every company needs a Spock How the benefits of giving company-wide access to data outweigh the costs Why data-driven organizations use the scientific method to explore and solve data problems Key questions to help you develop a research-specific process for tackling important issues What to consider when assembling your data team Developing processes to keep your data team (and company) engaged Choosing technologies that are powerful, support teamwork, and easy to use and learn","language":"en","currency":"USD","id":"1491925477","title":"Data Driven","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o-FwBgAAQBAJ&source=gbs_api","authors":["DJ Patil","Hilary Mason"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=93YpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code","description":"You Will Learn Python 3! Zed Shaw has perfected the world’s best system for learning Python 3. Follow it and you will succeed—just like the millions of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. In Learn Python 3 the Hard Way, you’ll learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you’ll learn how a computer works; what good programs look like; and how to read, write, and think about code. Zed then teaches you even more in 5+ hours of video where he shows you how to break, fix, and debug your code—live, as he’s doing the exercises. Install a complete Python environment Organize and write code Fix and break code Basic mathematics Variables Strings and text Interact with users Work with files Looping and logic Data structures using lists and dictionaries Program design Object-oriented programming Inheritance and composition Modules, classes, and objects Python packaging Automated testing Basic game development Basic web development It’ll be hard at first. But soon, you’ll just get it—and that will feel great! This course will reward you for every minute you put into it. Soon, you’ll know one of the world’s most powerful, popular programming languages. You’ll be a Python programmer. This Book Is Perfect For Total beginners with zero programming experience Junior developers who know one or two languages Returning professionals who haven’t written code in years Seasoned professionals looking for a fast, simple, crash course in Python 3","language":"en","currency":"USD","id":"0134693906","title":"Learn Python 3 the Hard Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=93YpDwAAQBAJ&source=gbs_api","authors":["Zed A. Shaw"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxFYuVZHG60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Our world is being revolutionized by data-driven methods: access to large amounts of data has generated new insights and opened exciting new opportunities in commerce, science, and computing applications. Processing the enormous quantities of data necessary for these advances requires large clusters, making distributed computing paradigms more crucial than ever. MapReduce is a programming model for expressing distributed computations on massive datasets and an execution framework for large-scale data processing on clusters of commodity servers. The programming model provides an easy-to-understand abstraction for designing scalable algorithms, while the execution framework transparently handles many system-level details, ranging from scheduling to synchronization to fault tolerance. This book focuses on MapReduce algorithm design, with an emphasis on text processing algorithms common in natural language processing, information retrieval, and machine learning. We introduce the notion of MapReduce design patterns, which represent general reusable solutions to commonly occurring problems across a variety of problem domains. This book not only intends to help the reader \"think in MapReduce\", but also discusses limitations of the programming model as well. This volume is a printed version of a work that appears in the Synthesis Digital Library of Engineering and Computer Science. Synthesis Lectures provide concise, original presentations of important research and development topics, published quickly, in digital and print formats. For more information visit www.morganclaypool.com","language":"en","currency":"USD","id":"1608453421","title":"Data-intensive Text Processing with MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxFYuVZHG60C&source=gbs_api","authors":["Jimmy Lin","Chris Dyer"]},{"pageCount":1152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Na8rAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"A Modern Approach","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Artificial Intelligence: A Modern Approach, 3e offers the most comprehensive, up-to-date introduction to the theory and practice of artificial intelligence. Number one in its field, this textbook is ideal for one or two-semester, undergraduate or graduate-level courses in Artificial Intelligence. Dr. Peter Norvig, contributing Artificial Intelligence author and Professor Sebastian Thrun, a Pearson author are offering a free online course at Stanford University on artificial intelligence. According to an article in The New York Times , the course on artificial intelligence is “one of three being offered experimentally by the Stanford computer science department to extend technology knowledge and skills beyond this elite campus to the entire world.” One of the other two courses, an introduction to database software, is being taught by Pearson author Dr. Jennifer Widom. Artificial Intelligence: A Modern Approach, 3e is available to purchase as an eText for your Kindle™, NOOK™, and the iPhone®\/iPad®. To learn more about the course on artificial intelligence, visit http:\/\/www.ai-class.com. To read the full New York Times article, click here.","language":"en","currency":null,"id":"0133001989","title":"Artificial Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Na8rAAAAQBAJ&source=gbs_api","authors":["Peter Norvig","Stuart Russell"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3wNbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":"Proceedings of 7th Computer Science On-line Conference 2018","description":"This book presents new software engineering approaches and methods, discussing real-world problems and exploratory research that describes novel approaches, modern design techniques, hybrid algorithms and empirical methods. This book constitutes part of the refereed proceedings of the Software Engineering and Algorithms in Intelligent Systems Section of the 7th Computer Science On-line Conference 2018 (CSOC 2018), held in April 2018.","language":"en","currency":"USD","id":"3319911864","title":"Software Engineering and Algorithms in Intelligent Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3wNbDwAAQBAJ&source=gbs_api","authors":["Radek Silhavy"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TfCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"12th International Conference, LION 12, Kalamata, Greece, June 10–15, 2018, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Conference on Learning and Intelligent Optimization, LION 12, held in Kalamata, Greece, in June 2018. The 28 full papers and 12 short papers presented have been carefully reviewed and selected from 62 submissions. The papers explore the advanced research developments in such interconnected fields as mathematical programming, global optimization, machine learning, and artificial intelligence. Special focus is given to advanced ideas, technologies, methods, and applications in optimization and machine learning.","language":"en","currency":"USD","id":"3030053482","title":"Learning and Intelligent Optimization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TfCBDwAAQBAJ&source=gbs_api","authors":["Roberto Battiti","Mauro Brunato","Ilias Kotsireas","Panos M. Pardalos"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8AcvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Practical Programming for Total Beginners","description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: –Search for text in a file or across multiple files –Create, update, move, and rename files and folders –Search the Web and download online content –Update and format data in Excel spreadsheets of any size –Split, merge, watermark, and encrypt PDFs –Send reminder emails and text notifications –Fill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","language":"en","currency":"USD","id":"1593276850","title":"Automate the Boring Stuff with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8AcvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AQgvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":null,"description":"Invent Your Own Computer Games with Python will teach you how to make computer games using the popular Python programming language—even if you’ve never programmed before! Begin by building classic games like Hangman, Guess the Number, and Tic-Tac-Toe, and then work your way up to more advanced games, like a text-based treasure hunting game and an animated collision-dodging game with sound effects. Along the way, you’ll learn key programming and math concepts that will help you take your game programming to the next level. Learn how to: –Combine loops, variables, and flow control statements into real working programs –Choose the right data structures for the job, such as lists, dictionaries, and tuples –Add graphics and animation to your games with the pygame module –Handle keyboard and mouse input –Program simple artificial intelligence so you can play against the computer –Use cryptography to convert text messages into secret code –Debug your programs and find common errors As you work through each game, you’ll build a solid foundation in Python and an understanding of computer science fundamentals. What new game will you create with the power of Python? The projects in this book are compatible with Python 3.","language":"en","currency":"USD","id":"159327811X","title":"Invent Your Own Computer Games with Python, 4E","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AQgvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jBpKBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Written by leading authorities in database and Web technologies, this book is essential reading for students and practitioners alike. The popularity of the Web and Internet commerce provides many extremely large datasets from which information can be gleaned by data mining. This book focuses on practical algorithms that have been used to solve key problems in data mining and can be applied successfully to even the largest datasets. It begins with a discussion of the map-reduce framework, an important tool for parallelizing algorithms automatically. The authors explain the tricks of locality-sensitive hashing and stream processing algorithms for mining data that arrives too fast for exhaustive processing. Other chapters cover the PageRank idea and related tricks for organizing the Web, the problems of finding frequent itemsets and clustering. This second edition includes new and extended coverage on social networks, machine learning and dimensionality reduction.","language":"en","currency":"USD","id":"1316148130","title":"Mining of Massive Datasets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jBpKBQAAQBAJ&source=gbs_api","authors":["Jure Leskovec","Anand Rajaraman","Jeffrey David Ullman"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BFVv4qmu1XIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":null,"description":"Big data has more disruptive potential than any information technology developed in the past 40 years. As author Jeffrey Needham points out in this revealing book, big data can provide unprecedented visibility into the operational efficiency of enterprises and agencies. Disruptive Possibilities provides an historically-informed overview through a wide range of topics, from the evolution of commodity supercomputing and the simplicity of big data technology, to the ways conventional clouds differ from Hadoop analytics clouds. This relentlessly innovative form of computing will soon become standard practice for organizations of any size attempting to derive insight from the tsunami of data engulfing them. Replacing legacy silos—whether they’re infrastructure, organizational, or vendor silos—with a platform-centric perspective is just one of the big stories of big data. To reap maximum value from the myriad forms of data, organizations and vendors will have to adopt highly collaborative habits and methodologies.","language":"en","currency":"USD","id":"1449369006","title":"Disruptive Possibilities: How Big Data Changes Everything","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BFVv4qmu1XIC&source=gbs_api","authors":["Jeffrey Needham"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=omivDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":50.99,"subtitle":null,"description":"An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives. “Written by three experts in the field, Deep Learning is the only comprehensive book on the subject.” —Elon Musk, cochair of OpenAI; cofounder and CEO of Tesla and SpaceX Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning. The text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models. Deep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.","language":"en","currency":"USD","id":"0262337371","title":"Deep Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=omivDQAAQBAJ&source=gbs_api","authors":["Ian Goodfellow","Yoshua Bengio","Aaron Courville"]},{"pageCount":173,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eNBJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"A Decision Based Approach","description":"As the first to focus on the issue of Data Warehouse Requirements Engineering, this book introduces a model-driven requirements process used to identify requirements granules and incrementally develop data warehouse fragments. In addition, it presents an approach to the pair-wise integration of requirements granules for consolidating multiple data warehouse fragments. The process is systematic and does away with the fuzziness associated with existing techniques. Thus, consolidation is treated as a requirements engineering issue. The notion of a decision occupies a central position in the decision-based approach. On one hand, information relevant to a decision must be elicited from stakeholders; modeled; and transformed into multi-dimensional form. On the other, decisions themselves are to be obtained from decision applications. For the former, the authors introduce a suite of information elicitation techniques specific to data warehousing. This information is subsequently converted into multi-dimensional form. For the latter, not only are decisions obtained from decision applications for managing operational businesses, but also from applications for formulating business policies and for defining rules for enforcing policies, respectively. In this context, the book presents a broad range of models, tools and techniques. For readers from academia, the book identifies the scientific\/technological problems it addresses and provides cogent arguments for the proposed solutions; for readers from industry, it presents an approach for ensuring that the product meets its requirements while ensuring low lead times in delivery.","language":"en","currency":"USD","id":"9811070199","title":"Data Warehouse Requirements Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eNBJDwAAQBAJ&source=gbs_api","authors":["Naveen Prakash","Deepika Prakash"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eR6mAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42,"subtitle":"Fundamental Concepts and Algorithms","description":"The fundamental algorithms in data mining and analysis form the basis for the emerging field of data science, which includes automated methods to analyze patterns and models for all kinds of data, with applications ranging from scientific discovery to business intelligence and analytics. This textbook for senior undergraduate and graduate data mining courses provides a broad yet in-depth overview of data mining, integrating related concepts from machine learning and statistics. The main parts of the book include exploratory data analysis, pattern mining, clustering, and classification. The book lays the basic foundations of these tasks, and also covers cutting-edge topics such as kernel methods, high-dimensional data analysis, and complex graphs and networks. With its comprehensive coverage, algorithmic perspective, and wealth of examples, this book offers solid guidance in data mining for students, researchers, and practitioners alike.","language":"en","currency":"USD","id":"1107782562","title":"Data Mining and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eR6mAwAAQBAJ&source=gbs_api","authors":["Mohammed J. Zaki","Wagner Meira, Jr"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M68hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.02,"subtitle":"How to Think Like a Computer Scientist","description":"A no-nonsense introduction to software design using the Python programming language. Written for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters. The focus is on the programming process, with special emphasis on debugging. The book includes a wide range of exercises, from short examples to substantial projects, so that students have ample opportunity to practise each new concept. Exercise solutions and code examples are available from thinkpython.com, along with Swampy, a suite of Python programs that is used in some of the exercises.","language":"en","currency":"USD","id":"1139479229","title":"Python for Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M68hAwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fVhzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.66,"subtitle":"An Introduction","description":"The growth of social media over the last decade has revolutionized the way individuals interact and industries conduct business. Individuals produce data at an unprecedented rate by interacting, sharing, and consuming content through social media. Understanding and processing this new type of data to glean actionable patterns presents challenges and opportunities for interdisciplinary research, novel algorithms and tool development. Social Media Mining integrates social media, social network analysis, and data mining to provide a coherent platform to understand the basics and potentials of social media mining. It introduces the unique problems arising from social media data and presents fundamental concepts, emerging issues, and effective algorithms for network analysis and data mining. Suitable for use in advanced undergraduate and beginning graduate courses as well as professional short courses, the text contains exercises of different degrees of difficulty that improve understanding and help apply concepts, principles and methods for social media mining.","language":"en","currency":"USD","id":"1139916122","title":"Social Media Mining","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fVhzAwAAQBAJ&source=gbs_api","authors":["Reza Zafarani","Mohammad Ali Abbasi","Huan Liu"]},{"pageCount":848,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZA5dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":88,"subtitle":null,"description":"Fully updated computer security essentials—quality approved by CompTIA Learn IT security fundamentals while getting complete coverage of the objectives for the latest release of CompTIA Security+ certification exam SY0-501. This thoroughly revised, full-color textbook discusses communication, infrastructure, operational security, attack prevention, disaster recovery, computer forensics, and much more. Written by a pair of highly respected security educators, Principles of Computer Security: CompTIA Security+® and Beyond, Fifth Edition (Exam SY0-501) will help you pass the exam and become a CompTIA certified computer security expert. Find out how to: •Ensure operational, organizational, and physical security •Use cryptography and public key infrastructures (PKIs) •Secure remote access, wireless networks, and virtual private networks (VPNs) •Authenticate users and lock down mobile devices •Harden network devices, operating systems, and applications •Prevent network attacks, such as denial of service, spoofing, hijacking, and password guessing •Combat viruses, worms, Trojan horses, and rootkits •Manage e-mail, instant messaging, and web security •Explore secure software development requirements •Implement disaster recovery and business continuity measures •Handle computer forensics and incident response •Understand legal, ethical, and privacy issues Online content includes: •Test engine that provides full-length practice exams and customized quizzes by chapter or exam objective •200 practice exam questions Each chapter includes: •Learning objectives •Real-world examples •Try This! and Cross Check exercises •Tech Tips, Notes, and Warnings •Exam Tips •End-of-chapter quizzes and lab projects","language":"en","currency":"USD","id":"1260026000","title":"Principles of Computer Security: CompTIA Security+ and Beyond, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZA5dDwAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Chuck Cothren","Roger L. Davis","Dwayne Williams"]},{"pageCount":812,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bXzAlkODwa8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Algorithms and Applications","description":"Computer Vision: Algorithms and Applications explores the variety of techniques commonly used to analyze and interpret images. It also describes challenging real-world applications where vision is being successfully used, both for specialized applications such as medical imaging, and for fun, consumer-level tasks such as image editing and stitching, which students can apply to their own personal photos and videos. More than just a source of “recipes,” this exceptionally authoritative and comprehensive textbook\/reference also takes a scientific approach to basic vision problems, formulating physical models of the imaging process before inverting them to produce descriptions of a scene. These problems are also analyzed using statistical models and solved using rigorous engineering techniques. Topics and features: structured to support active curricula and project-oriented courses, with tips in the Introduction for using the book in a variety of customized courses; presents exercises at the end of each chapter with a heavy emphasis on testing algorithms and containing numerous suggestions for small mid-term projects; provides additional material and more detailed mathematical topics in the Appendices, which cover linear algebra, numerical techniques, and Bayesian estimation theory; suggests additional reading at the end of each chapter, including the latest research in each sub-field, in addition to a full Bibliography at the end of the book; supplies supplementary course material for students at the associated website, http:\/\/szeliski.org\/Book\/. Suitable for an upper-level undergraduate or graduate-level course in computer science or engineering, this textbook focuses on basic techniques that work under real-world conditions and encourages students to push their creative boundaries. Its design and exposition also make it eminently suitable as a unique reference to the fundamental techniques and current research literature in computer vision.","language":"en","currency":"USD","id":"9781848829350","title":"Computer Vision","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bXzAlkODwa8C&source=gbs_api","authors":["Richard Szeliski"]},{"pageCount":30,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o-FwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Succeeding with data isn’t just a matter of putting Hadoop in your machine room, or hiring some physicists with crazy math skills. It requires you to develop a data culture that involves people throughout the organization. In this O’Reilly report, DJ Patil and Hilary Mason outline the steps you need to take if your company is to be truly data-driven—including the questions you should ask and the methods you should adopt. You’ll not only learn examples of how Google, LinkedIn, and Facebook use their data, but also how Walmart, UPS, and other organizations took advantage of this resource long before the advent of Big Data. No matter how you approach it, building a data culture is the key to success in the 21st century. You’ll explore: Data scientist skills—and why every company needs a Spock How the benefits of giving company-wide access to data outweigh the costs Why data-driven organizations use the scientific method to explore and solve data problems Key questions to help you develop a research-specific process for tackling important issues What to consider when assembling your data team Developing processes to keep your data team (and company) engaged Choosing technologies that are powerful, support teamwork, and easy to use and learn","language":"en","currency":"USD","id":"1491925477","title":"Data Driven","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o-FwBgAAQBAJ&source=gbs_api","authors":["DJ Patil","Hilary Mason"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=93YpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code","description":"You Will Learn Python 3! Zed Shaw has perfected the world’s best system for learning Python 3. Follow it and you will succeed—just like the millions of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. In Learn Python 3 the Hard Way, you’ll learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you’ll learn how a computer works; what good programs look like; and how to read, write, and think about code. Zed then teaches you even more in 5+ hours of video where he shows you how to break, fix, and debug your code—live, as he’s doing the exercises. Install a complete Python environment Organize and write code Fix and break code Basic mathematics Variables Strings and text Interact with users Work with files Looping and logic Data structures using lists and dictionaries Program design Object-oriented programming Inheritance and composition Modules, classes, and objects Python packaging Automated testing Basic game development Basic web development It’ll be hard at first. But soon, you’ll just get it—and that will feel great! This course will reward you for every minute you put into it. Soon, you’ll know one of the world’s most powerful, popular programming languages. You’ll be a Python programmer. This Book Is Perfect For Total beginners with zero programming experience Junior developers who know one or two languages Returning professionals who haven’t written code in years Seasoned professionals looking for a fast, simple, crash course in Python 3","language":"en","currency":"USD","id":"0134693906","title":"Learn Python 3 the Hard Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=93YpDwAAQBAJ&source=gbs_api","authors":["Zed A. Shaw"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxFYuVZHG60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Our world is being revolutionized by data-driven methods: access to large amounts of data has generated new insights and opened exciting new opportunities in commerce, science, and computing applications. Processing the enormous quantities of data necessary for these advances requires large clusters, making distributed computing paradigms more crucial than ever. MapReduce is a programming model for expressing distributed computations on massive datasets and an execution framework for large-scale data processing on clusters of commodity servers. The programming model provides an easy-to-understand abstraction for designing scalable algorithms, while the execution framework transparently handles many system-level details, ranging from scheduling to synchronization to fault tolerance. This book focuses on MapReduce algorithm design, with an emphasis on text processing algorithms common in natural language processing, information retrieval, and machine learning. We introduce the notion of MapReduce design patterns, which represent general reusable solutions to commonly occurring problems across a variety of problem domains. This book not only intends to help the reader \"think in MapReduce\", but also discusses limitations of the programming model as well. This volume is a printed version of a work that appears in the Synthesis Digital Library of Engineering and Computer Science. Synthesis Lectures provide concise, original presentations of important research and development topics, published quickly, in digital and print formats. For more information visit www.morganclaypool.com","language":"en","currency":"USD","id":"1608453421","title":"Data-intensive Text Processing with MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxFYuVZHG60C&source=gbs_api","authors":["Jimmy Lin","Chris Dyer"]},{"pageCount":1152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Na8rAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"A Modern Approach","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Artificial Intelligence: A Modern Approach, 3e offers the most comprehensive, up-to-date introduction to the theory and practice of artificial intelligence. Number one in its field, this textbook is ideal for one or two-semester, undergraduate or graduate-level courses in Artificial Intelligence. Dr. Peter Norvig, contributing Artificial Intelligence author and Professor Sebastian Thrun, a Pearson author are offering a free online course at Stanford University on artificial intelligence. According to an article in The New York Times , the course on artificial intelligence is “one of three being offered experimentally by the Stanford computer science department to extend technology knowledge and skills beyond this elite campus to the entire world.” One of the other two courses, an introduction to database software, is being taught by Pearson author Dr. Jennifer Widom. Artificial Intelligence: A Modern Approach, 3e is available to purchase as an eText for your Kindle™, NOOK™, and the iPhone®\/iPad®. To learn more about the course on artificial intelligence, visit http:\/\/www.ai-class.com. To read the full New York Times article, click here.","language":"en","currency":null,"id":"0133001989","title":"Artificial Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Na8rAAAAQBAJ&source=gbs_api","authors":["Peter Norvig","Stuart Russell"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3wNbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":"Proceedings of 7th Computer Science On-line Conference 2018","description":"This book presents new software engineering approaches and methods, discussing real-world problems and exploratory research that describes novel approaches, modern design techniques, hybrid algorithms and empirical methods. This book constitutes part of the refereed proceedings of the Software Engineering and Algorithms in Intelligent Systems Section of the 7th Computer Science On-line Conference 2018 (CSOC 2018), held in April 2018.","language":"en","currency":"USD","id":"3319911864","title":"Software Engineering and Algorithms in Intelligent Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3wNbDwAAQBAJ&source=gbs_api","authors":["Radek Silhavy"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TfCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"12th International Conference, LION 12, Kalamata, Greece, June 10–15, 2018, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Conference on Learning and Intelligent Optimization, LION 12, held in Kalamata, Greece, in June 2018. The 28 full papers and 12 short papers presented have been carefully reviewed and selected from 62 submissions. The papers explore the advanced research developments in such interconnected fields as mathematical programming, global optimization, machine learning, and artificial intelligence. Special focus is given to advanced ideas, technologies, methods, and applications in optimization and machine learning.","language":"en","currency":"USD","id":"3030053482","title":"Learning and Intelligent Optimization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TfCBDwAAQBAJ&source=gbs_api","authors":["Roberto Battiti","Mauro Brunato","Ilias Kotsireas","Panos M. Pardalos"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8AcvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":"Practical Programming for Total Beginners","description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: –Search for text in a file or across multiple files –Create, update, move, and rename files and folders –Search the Web and download online content –Update and format data in Excel spreadsheets of any size –Split, merge, watermark, and encrypt PDFs –Send reminder emails and text notifications –Fill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","language":"en","currency":"USD","id":"1593276850","title":"Automate the Boring Stuff with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8AcvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AQgvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.99,"subtitle":null,"description":"Invent Your Own Computer Games with Python will teach you how to make computer games using the popular Python programming language—even if you’ve never programmed before! Begin by building classic games like Hangman, Guess the Number, and Tic-Tac-Toe, and then work your way up to more advanced games, like a text-based treasure hunting game and an animated collision-dodging game with sound effects. Along the way, you’ll learn key programming and math concepts that will help you take your game programming to the next level. Learn how to: –Combine loops, variables, and flow control statements into real working programs –Choose the right data structures for the job, such as lists, dictionaries, and tuples –Add graphics and animation to your games with the pygame module –Handle keyboard and mouse input –Program simple artificial intelligence so you can play against the computer –Use cryptography to convert text messages into secret code –Debug your programs and find common errors As you work through each game, you’ll build a solid foundation in Python and an understanding of computer science fundamentals. What new game will you create with the power of Python? The projects in this book are compatible with Python 3.","language":"en","currency":"USD","id":"159327811X","title":"Invent Your Own Computer Games with Python, 4E","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AQgvDwAAQBAJ&source=gbs_api","authors":["Al Sweigart"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jBpKBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.8,"subtitle":null,"description":"Written by leading authorities in database and Web technologies, this book is essential reading for students and practitioners alike. The popularity of the Web and Internet commerce provides many extremely large datasets from which information can be gleaned by data mining. This book focuses on practical algorithms that have been used to solve key problems in data mining and can be applied successfully to even the largest datasets. It begins with a discussion of the map-reduce framework, an important tool for parallelizing algorithms automatically. The authors explain the tricks of locality-sensitive hashing and stream processing algorithms for mining data that arrives too fast for exhaustive processing. Other chapters cover the PageRank idea and related tricks for organizing the Web, the problems of finding frequent itemsets and clustering. This second edition includes new and extended coverage on social networks, machine learning and dimensionality reduction.","language":"en","currency":"USD","id":"1316148130","title":"Mining of Massive Datasets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jBpKBQAAQBAJ&source=gbs_api","authors":["Jure Leskovec","Anand Rajaraman","Jeffrey David Ullman"]},{"pageCount":90,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BFVv4qmu1XIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.19,"subtitle":null,"description":"Big data has more disruptive potential than any information technology developed in the past 40 years. As author Jeffrey Needham points out in this revealing book, big data can provide unprecedented visibility into the operational efficiency of enterprises and agencies. Disruptive Possibilities provides an historically-informed overview through a wide range of topics, from the evolution of commodity supercomputing and the simplicity of big data technology, to the ways conventional clouds differ from Hadoop analytics clouds. This relentlessly innovative form of computing will soon become standard practice for organizations of any size attempting to derive insight from the tsunami of data engulfing them. Replacing legacy silos—whether they’re infrastructure, organizational, or vendor silos—with a platform-centric perspective is just one of the big stories of big data. To reap maximum value from the myriad forms of data, organizations and vendors will have to adopt highly collaborative habits and methodologies.","language":"en","currency":"USD","id":"1449369006","title":"Disruptive Possibilities: How Big Data Changes Everything","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BFVv4qmu1XIC&source=gbs_api","authors":["Jeffrey Needham"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=omivDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":50.99,"subtitle":null,"description":"An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives. “Written by three experts in the field, Deep Learning is the only comprehensive book on the subject.” —Elon Musk, cochair of OpenAI; cofounder and CEO of Tesla and SpaceX Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning. The text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models. Deep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.","language":"en","currency":"USD","id":"0262337371","title":"Deep Learning","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=omivDQAAQBAJ&source=gbs_api","authors":["Ian Goodfellow","Yoshua Bengio","Aaron Courville"]},{"pageCount":173,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eNBJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"A Decision Based Approach","description":"As the first to focus on the issue of Data Warehouse Requirements Engineering, this book introduces a model-driven requirements process used to identify requirements granules and incrementally develop data warehouse fragments. In addition, it presents an approach to the pair-wise integration of requirements granules for consolidating multiple data warehouse fragments. The process is systematic and does away with the fuzziness associated with existing techniques. Thus, consolidation is treated as a requirements engineering issue. The notion of a decision occupies a central position in the decision-based approach. On one hand, information relevant to a decision must be elicited from stakeholders; modeled; and transformed into multi-dimensional form. On the other, decisions themselves are to be obtained from decision applications. For the former, the authors introduce a suite of information elicitation techniques specific to data warehousing. This information is subsequently converted into multi-dimensional form. For the latter, not only are decisions obtained from decision applications for managing operational businesses, but also from applications for formulating business policies and for defining rules for enforcing policies, respectively. In this context, the book presents a broad range of models, tools and techniques. For readers from academia, the book identifies the scientific\/technological problems it addresses and provides cogent arguments for the proposed solutions; for readers from industry, it presents an approach for ensuring that the product meets its requirements while ensuring low lead times in delivery.","language":"en","currency":"USD","id":"9811070199","title":"Data Warehouse Requirements Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eNBJDwAAQBAJ&source=gbs_api","authors":["Naveen Prakash","Deepika Prakash"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eR6mAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42,"subtitle":"Fundamental Concepts and Algorithms","description":"The fundamental algorithms in data mining and analysis form the basis for the emerging field of data science, which includes automated methods to analyze patterns and models for all kinds of data, with applications ranging from scientific discovery to business intelligence and analytics. This textbook for senior undergraduate and graduate data mining courses provides a broad yet in-depth overview of data mining, integrating related concepts from machine learning and statistics. The main parts of the book include exploratory data analysis, pattern mining, clustering, and classification. The book lays the basic foundations of these tasks, and also covers cutting-edge topics such as kernel methods, high-dimensional data analysis, and complex graphs and networks. With its comprehensive coverage, algorithmic perspective, and wealth of examples, this book offers solid guidance in data mining for students, researchers, and practitioners alike.","language":"en","currency":"USD","id":"1107782562","title":"Data Mining and Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eR6mAwAAQBAJ&source=gbs_api","authors":["Mohammed J. Zaki","Wagner Meira, Jr"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M68hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.02,"subtitle":"How to Think Like a Computer Scientist","description":"A no-nonsense introduction to software design using the Python programming language. Written for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters. The focus is on the programming process, with special emphasis on debugging. The book includes a wide range of exercises, from short examples to substantial projects, so that students have ample opportunity to practise each new concept. Exercise solutions and code examples are available from thinkpython.com, along with Swampy, a suite of Python programs that is used in some of the exercises.","language":"en","currency":"USD","id":"1139479229","title":"Python for Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M68hAwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fVhzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":42.66,"subtitle":"An Introduction","description":"The growth of social media over the last decade has revolutionized the way individuals interact and industries conduct business. Individuals produce data at an unprecedented rate by interacting, sharing, and consuming content through social media. Understanding and processing this new type of data to glean actionable patterns presents challenges and opportunities for interdisciplinary research, novel algorithms and tool development. Social Media Mining integrates social media, social network analysis, and data mining to provide a coherent platform to understand the basics and potentials of social media mining. It introduces the unique problems arising from social media data and presents fundamental concepts, emerging issues, and effective algorithms for network analysis and data mining. Suitable for use in advanced undergraduate and beginning graduate courses as well as professional short courses, the text contains exercises of different degrees of difficulty that improve understanding and help apply concepts, principles and methods for social media mining.","language":"en","currency":"USD","id":"1139916122","title":"Social Media Mining","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fVhzAwAAQBAJ&source=gbs_api","authors":["Reza Zafarani","Mohammad Ali Abbasi","Huan Liu"]},{"pageCount":848,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZA5dDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":88,"subtitle":null,"description":"Fully updated computer security essentials—quality approved by CompTIA Learn IT security fundamentals while getting complete coverage of the objectives for the latest release of CompTIA Security+ certification exam SY0-501. This thoroughly revised, full-color textbook discusses communication, infrastructure, operational security, attack prevention, disaster recovery, computer forensics, and much more. Written by a pair of highly respected security educators, Principles of Computer Security: CompTIA Security+® and Beyond, Fifth Edition (Exam SY0-501) will help you pass the exam and become a CompTIA certified computer security expert. Find out how to: •Ensure operational, organizational, and physical security •Use cryptography and public key infrastructures (PKIs) •Secure remote access, wireless networks, and virtual private networks (VPNs) •Authenticate users and lock down mobile devices •Harden network devices, operating systems, and applications •Prevent network attacks, such as denial of service, spoofing, hijacking, and password guessing •Combat viruses, worms, Trojan horses, and rootkits •Manage e-mail, instant messaging, and web security •Explore secure software development requirements •Implement disaster recovery and business continuity measures •Handle computer forensics and incident response •Understand legal, ethical, and privacy issues Online content includes: •Test engine that provides full-length practice exams and customized quizzes by chapter or exam objective •200 practice exam questions Each chapter includes: •Learning objectives •Real-world examples •Try This! and Cross Check exercises •Tech Tips, Notes, and Warnings •Exam Tips •End-of-chapter quizzes and lab projects","language":"en","currency":"USD","id":"1260026000","title":"Principles of Computer Security: CompTIA Security+ and Beyond, Fifth Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZA5dDwAAQBAJ&source=gbs_api","authors":["Wm. Arthur Conklin","Greg White","Chuck Cothren","Roger L. Davis","Dwayne Williams"]},{"pageCount":812,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bXzAlkODwa8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Algorithms and Applications","description":"Computer Vision: Algorithms and Applications explores the variety of techniques commonly used to analyze and interpret images. It also describes challenging real-world applications where vision is being successfully used, both for specialized applications such as medical imaging, and for fun, consumer-level tasks such as image editing and stitching, which students can apply to their own personal photos and videos. More than just a source of “recipes,” this exceptionally authoritative and comprehensive textbook\/reference also takes a scientific approach to basic vision problems, formulating physical models of the imaging process before inverting them to produce descriptions of a scene. These problems are also analyzed using statistical models and solved using rigorous engineering techniques. Topics and features: structured to support active curricula and project-oriented courses, with tips in the Introduction for using the book in a variety of customized courses; presents exercises at the end of each chapter with a heavy emphasis on testing algorithms and containing numerous suggestions for small mid-term projects; provides additional material and more detailed mathematical topics in the Appendices, which cover linear algebra, numerical techniques, and Bayesian estimation theory; suggests additional reading at the end of each chapter, including the latest research in each sub-field, in addition to a full Bibliography at the end of the book; supplies supplementary course material for students at the associated website, http:\/\/szeliski.org\/Book\/. Suitable for an upper-level undergraduate or graduate-level course in computer science or engineering, this textbook focuses on basic techniques that work under real-world conditions and encourages students to push their creative boundaries. Its design and exposition also make it eminently suitable as a unique reference to the fundamental techniques and current research literature in computer vision.","language":"en","currency":"USD","id":"9781848829350","title":"Computer Vision","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bXzAlkODwa8C&source=gbs_api","authors":["Richard Szeliski"]},{"pageCount":30,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o-FwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Succeeding with data isn’t just a matter of putting Hadoop in your machine room, or hiring some physicists with crazy math skills. It requires you to develop a data culture that involves people throughout the organization. In this O’Reilly report, DJ Patil and Hilary Mason outline the steps you need to take if your company is to be truly data-driven—including the questions you should ask and the methods you should adopt. You’ll not only learn examples of how Google, LinkedIn, and Facebook use their data, but also how Walmart, UPS, and other organizations took advantage of this resource long before the advent of Big Data. No matter how you approach it, building a data culture is the key to success in the 21st century. You’ll explore: Data scientist skills—and why every company needs a Spock How the benefits of giving company-wide access to data outweigh the costs Why data-driven organizations use the scientific method to explore and solve data problems Key questions to help you develop a research-specific process for tackling important issues What to consider when assembling your data team Developing processes to keep your data team (and company) engaged Choosing technologies that are powerful, support teamwork, and easy to use and learn","language":"en","currency":"USD","id":"1491925477","title":"Data Driven","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o-FwBgAAQBAJ&source=gbs_api","authors":["DJ Patil","Hilary Mason"]},{"pageCount":320,"thumbnail":"http:\/\/books.google.com\/books\/content?id=93YpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code","description":"You Will Learn Python 3! Zed Shaw has perfected the world’s best system for learning Python 3. Follow it and you will succeed—just like the millions of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. In Learn Python 3 the Hard Way, you’ll learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you’ll learn how a computer works; what good programs look like; and how to read, write, and think about code. Zed then teaches you even more in 5+ hours of video where he shows you how to break, fix, and debug your code—live, as he’s doing the exercises. Install a complete Python environment Organize and write code Fix and break code Basic mathematics Variables Strings and text Interact with users Work with files Looping and logic Data structures using lists and dictionaries Program design Object-oriented programming Inheritance and composition Modules, classes, and objects Python packaging Automated testing Basic game development Basic web development It’ll be hard at first. But soon, you’ll just get it—and that will feel great! This course will reward you for every minute you put into it. Soon, you’ll know one of the world’s most powerful, popular programming languages. You’ll be a Python programmer. This Book Is Perfect For Total beginners with zero programming experience Junior developers who know one or two languages Returning professionals who haven’t written code in years Seasoned professionals looking for a fast, simple, crash course in Python 3","language":"en","currency":"USD","id":"0134693906","title":"Learn Python 3 the Hard Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=93YpDwAAQBAJ&source=gbs_api","authors":["Zed A. Shaw"]},{"pageCount":165,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GxFYuVZHG60C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Our world is being revolutionized by data-driven methods: access to large amounts of data has generated new insights and opened exciting new opportunities in commerce, science, and computing applications. Processing the enormous quantities of data necessary for these advances requires large clusters, making distributed computing paradigms more crucial than ever. MapReduce is a programming model for expressing distributed computations on massive datasets and an execution framework for large-scale data processing on clusters of commodity servers. The programming model provides an easy-to-understand abstraction for designing scalable algorithms, while the execution framework transparently handles many system-level details, ranging from scheduling to synchronization to fault tolerance. This book focuses on MapReduce algorithm design, with an emphasis on text processing algorithms common in natural language processing, information retrieval, and machine learning. We introduce the notion of MapReduce design patterns, which represent general reusable solutions to commonly occurring problems across a variety of problem domains. This book not only intends to help the reader \"think in MapReduce\", but also discusses limitations of the programming model as well. This volume is a printed version of a work that appears in the Synthesis Digital Library of Engineering and Computer Science. Synthesis Lectures provide concise, original presentations of important research and development topics, published quickly, in digital and print formats. For more information visit www.morganclaypool.com","language":"en","currency":"USD","id":"1608453421","title":"Data-intensive Text Processing with MapReduce","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GxFYuVZHG60C&source=gbs_api","authors":["Jimmy Lin","Chris Dyer"]},{"pageCount":1152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Na8rAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"A Modern Approach","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Artificial Intelligence: A Modern Approach, 3e offers the most comprehensive, up-to-date introduction to the theory and practice of artificial intelligence. Number one in its field, this textbook is ideal for one or two-semester, undergraduate or graduate-level courses in Artificial Intelligence. Dr. Peter Norvig, contributing Artificial Intelligence author and Professor Sebastian Thrun, a Pearson author are offering a free online course at Stanford University on artificial intelligence. According to an article in The New York Times , the course on artificial intelligence is “one of three being offered experimentally by the Stanford computer science department to extend technology knowledge and skills beyond this elite campus to the entire world.” One of the other two courses, an introduction to database software, is being taught by Pearson author Dr. Jennifer Widom. Artificial Intelligence: A Modern Approach, 3e is available to purchase as an eText for your Kindle™, NOOK™, and the iPhone®\/iPad®. To learn more about the course on artificial intelligence, visit http:\/\/www.ai-class.com. To read the full New York Times article, click here.","language":"en","currency":null,"id":"0133001989","title":"Artificial Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Na8rAAAAQBAJ&source=gbs_api","authors":["Peter Norvig","Stuart Russell"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5hIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.25,"subtitle":null,"description":"Develop, validate, and deploy powerful decentralized applications using blockchain Get the most out of cutting-edge blockchain technology using the hands-on information contained in this comprehensive resource. Written by a team of technology and legal experts, Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions demonstrates each topic through a start-to-finish, illustrated case study. The book includes financial, technology, governance, and legal use cases along with advantages and challenges. Validation, implementation, troubleshooting, and best practices are fully covered. You will learn, step-by-step, how to build and maintain effective, reliable, and transparent blockchain solutions. •Understand the fundamentals of decentralized computing and blockchain•Explore business, technology, governance, and legal use cases•Review the evolving practice of law and technology as it concerns legal and governance issues arising from blockchain implementation•Write and administer performant blockchain-enabled applications•Handle cryptographic validation in private, public, and consortium blockchains•Employ blockchain in cloud deployments and Internet of Things (IoT) devices•Incorporate Web 3.0 features with Swarm, IPFS, Storj, Golem, and WHISPER•Use Solidity to build and validate fully functional distributed applications and smart contracts using Ethereum•See how blockchain is used in crypto-currency, including Bitcoin and Ethereum•Overcome technical hurdles and secure your decentralized IT platform","language":"en","currency":"USD","id":"1260115860","title":"Blockchain: A Practical Guide to Developing Business, Law, and Technology Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5hIDwAAQBAJ&source=gbs_api","authors":["Joseph J. Bambara","Paul R. Allen","Kedar Iyer","Rene Madsen","Solomon Lederer","Michael Wuehler"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3wNbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":"Proceedings of 7th Computer Science On-line Conference 2018","description":"This book presents new software engineering approaches and methods, discussing real-world problems and exploratory research that describes novel approaches, modern design techniques, hybrid algorithms and empirical methods. This book constitutes part of the refereed proceedings of the Software Engineering and Algorithms in Intelligent Systems Section of the 7th Computer Science On-line Conference 2018 (CSOC 2018), held in April 2018.","language":"en","currency":"USD","id":"3319911864","title":"Software Engineering and Algorithms in Intelligent Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3wNbDwAAQBAJ&source=gbs_api","authors":["Radek Silhavy"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TfCBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"12th International Conference, LION 12, Kalamata, Greece, June 10–15, 2018, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the 12th International Conference on Learning and Intelligent Optimization, LION 12, held in Kalamata, Greece, in June 2018. The 28 full papers and 12 short papers presented have been carefully reviewed and selected from 62 submissions. The papers explore the advanced research developments in such interconnected fields as mathematical programming, global optimization, machine learning, and artificial intelligence. Special focus is given to advanced ideas, technologies, methods, and applications in optimization and machine learning.","language":"en","currency":"USD","id":"3030053482","title":"Learning and Intelligent Optimization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TfCBDwAAQBAJ&source=gbs_api","authors":["Roberto Battiti","Mauro Brunato","Ilias Kotsireas","Panos M. Pardalos"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]}]