[{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Yu_7CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64.95,"subtitle":"Adapting to Agile Data Modeling in a Big Data World","description":"Build a working knowledge of data modeling concepts and best practices, along with how to apply these principles with ER\/Studio. This second edition includes numerous updates and new sections including an overview of ER\/Studio’s support for agile development, as well as a description of some of ER\/Studio’s newer features for NoSQL, such as MongoDB’s containment structure.","language":"en","currency":"USD","id":"1634620941","title":"Data Modeling Made Simple with ER\/Studio Data Architect","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Yu_7CgAAQBAJ&source=gbs_api","authors":["Steve Hoberman"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dt7TDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":135.2,"subtitle":null,"description":"This comprehensive book focuses on better big-data security for healthcare organizations. Following an extensive introduction to the Internet of Things (IoT) in healthcare including challenging topics and scenarios, it offers an in-depth analysis of medical body area networks with the 5th generation of IoT communication technology along with its nanotechnology. It also describes a novel strategic framework and computationally intelligent model to measure possible security vulnerabilities in the context of e-health. Moreover, the book addresses healthcare systems that handle large volumes of data driven by patients’ records and health\/personal information, including big-data-based knowledge management systems to support clinical decisions. Several of the issues faced in storing\/processing big data are presented along with the available tools, technologies and algorithms to deal with those problems as well as a case study in healthcare analytics. Addressing trust, privacy, and security issues as well as the IoT and big-data challenges, the book highlights the advances in the field to guide engineers developing different IoT devices and evaluating the performance of different IoT techniques. Additionally, it explores the impact of such technologies on public, private, community, and hybrid scenarios in healthcare. This book offers professionals, scientists and engineers the latest technologies, techniques, and strategies for IoT and big data.","language":"en","currency":"USD","id":"3319497367","title":"Internet of Things and Big Data Technologies for Next Generation Healthcare","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dt7TDQAAQBAJ&source=gbs_api","authors":["Chintan Bhatt","Nilanjan Dey","Amira S. Ashour"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Over 170 advanced recipes to search, analyze, deploy, manage, and monitor data effectively with Elasticsearch 5.x About This Book Deploy and manage simple Elasticsearch nodes as well as complex cluster topologies Write native plugins to extend the functionalities of Elasticsearch 5.x to boost your business Packed with clear, step-by-step recipes to walk you through the capabilities of Elasticsearch 5.x Who This Book Is For If you are a developer who wants to get the most out of Elasticsearch for advanced search and analytics, this is the book for you. Some understanding of JSON is expected. If you want to extend Elasticsearch, understanding of Java and related technologies is also required. What You Will Learn Choose the best Elasticsearch cloud topology to deploy and power it up with external plugins Develop tailored mapping to take full control of index steps Build complex queries through managing indices and documents Optimize search results through executing analytics aggregations Monitor the performance of the cluster and nodes Install Kibana to monitor cluster and extend Kibana for plugins Integrate Elasticsearch in Java, Scala, Python and Big Data applications In Detail Elasticsearch is a Lucene-based distributed search server that allows users to index and search unstructured content with petabytes of data. This book is your one-stop guide to master the complete Elasticsearch ecosystem. We'll guide you through comprehensive recipes on what's new in Elasticsearch 5.x, showing you how to create complex queries and analytics, and perform index mapping, aggregation, and scripting. Further on, you will explore the modules of Cluster and Node monitoring and see ways to back up and restore a snapshot of an index. You will understand how to install Kibana to monitor a cluster and also to extend Kibana for plugins. Finally, you will also see how you can integrate your Java, Scala, Python, and Big Data applications such as Apache Spark and Pig with Elasticsearch, and add enhanced functionalities with custom plugins. By the end of this book, you will have an in-depth knowledge of the implementation of the Elasticsearch architecture and will be able to manage data efficiently and effectively with Elasticsearch. Style and approach This book follows a problem-solution approach to effectively use and manage Elasticsearch. Each recipe focuses on a particular task at hand, and is explained in a very simple, easy to understand manner.","language":"en","currency":"USD","id":"1786466880","title":"Elasticsearch 5.x Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JVQoDwAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZTj5AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.65,"subtitle":null,"description":"Ein Hype ist nichts weiter als eine Welle, die auf den Strand trifft. Wenn sie sich wieder zurückzieht, ist sie vergessen, aber manchmal lässt sie ein Stück Bernstein zurück. Cornel Brücher Aus dem Inhalt: Der Gartner Hype Cycle Bedeutung des Hype Cycle für das Business Anwendungsbeispiel Smart Port Logistics Big Data in der Historie Volume, Velocity, Variety Viele Nadeln in vielen Heuhaufen Die Freitextfalle Lohnt sich Big Data? Predictive Maintenance Predictive Analytics Der Neurobayes-Algorithmus Kundenfeedback im Social Web Vorgehensmodell Social Network Analytics Vorgehensmodell Predictive Analytics Mythos Data Scientist Big Data und Datenschutz Wrap-up und Ausblick Ist Big Data die Rettung vor dem Untergang oder die Versenkung des IT-Budgets? Gibt es Big Data-Anwendungen mit einem praktischen Nutzen oder wird hier nur technischer Spieltrieb befriedigt? Sollte man noch abwarten oder ist es schon fast zu spät? Diese und weitere Fragen werden in diesem Buch beantwortet. Sie erfahren, wo Big Data ursprünglich herkommt, welche Anwendungen erfolgreich sind, wie Sie Ihre Big-Data-Projekte zum Erfolg führen und welche Riffe dabei umschifft werden müssen. Wenn Sie zu einem brandaktuellen Thema nicht nur gut informiert, sondern auch gut unterhalten werden wollen, ist dieses Buch genau das Richtige für Sie! Der Autor: Cornel Brücher arbeitet als Principal bei der SHS VIVEON GmbH und blickt auf über 25 Jahre IT- und Hypeerfahrung zurück. Mit dem schon aus seinen früheren Büchern bekannten augenzwinkernden Stil hat er sich dieses Mal den aktuellen Big Data-Hype vorgenommen.","language":"de","currency":"USD","id":"3826695917","title":"Rethink Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZTj5AAAAQBAJ&source=gbs_api","authors":["Cornel Brücher"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TAxlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"The What, Where, When, and How of Large-Scale Data Processing","description":"Streaming data is a big deal in big data these days. As more and more businesses seek to tame the massive unbounded data sets that pervade our world, streaming systems have finally reached a level of maturity sufficient for mainstream adoption. With this practical guide, data engineers, data scientists, and developers will learn how to work with streaming data in a conceptual and platform-agnostic way. Expanded from Tyler Akidau’s popular blog posts \"Streaming 101\" and \"Streaming 102\", this book takes you from an introductory level to a nuanced understanding of the what, where, when, and how of processing real-time data streams. You’ll also dive deep into watermarks and exactly-once processing with co-authors Slava Chernyak and Reuven Lax. You’ll explore: How streaming and batch data processing patterns compare The core principles and concepts behind robust out-of-order data processing How watermarks track progress and completeness in infinite datasets How exactly-once data processing techniques ensure correctness How the concepts of streams and tables form the foundations of both batch and streaming data processing The practical motivations behind a powerful persistent state mechanism, driven by a real-world example How time-varying relations provide a link between stream processing and the world of SQL and relational algebra","language":"en","currency":"USD","id":"1491983825","title":"Streaming Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TAxlDwAAQBAJ&source=gbs_api","authors":["Tyler Akidau","Slava Chernyak","Reuven Lax"]},{"pageCount":223,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kOt6DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"For Hibernate 5","description":"Get started with the Hibernate 5 persistence layer and gain a clear introduction to the current standard for object-relational persistence in Java. This updated edition includes the new Hibernate 5.0 framework as well as coverage of NoSQL, MongoDB, and other related technologies, ranging from applications to big data. Beginning Hibernate is ideal if you’re experienced in Java with databases (the traditional, or connected, approach), but new to open-source, lightweight Hibernate. The book keeps its focus on Hibernate without wasting time on nonessential third-party tools, so you’ll be able to immediately start building transaction-based engines and applications. Experienced authors Joseph Ottinger with Dave Minter and Jeff Linwood provide more in-depth examples than any other book for Hibernate beginners. They present their material in a lively, example-based manner—not a dry, theoretical, hard-to-read fashion. What You'll Learn Build enterprise Java-based transaction-type applications that access complex data with Hibernate Work with Hibernate 5 using a present-day build process Use Java 8 features with Hibernate Integrate into the persistence life cycle Map using Java’s annotations Search and query with the new version of Hibernate Integrate with MongoDB using NoSQL Keep track of versioned data with Hibernate Envers Who This Book Is For Experienced Java developers interested in learning how to use and apply object-relational persistence in Java and who are new to the Hibernate persistence framework.","language":"en","currency":"USD","id":"1484223195","title":"Beginning Hibernate","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kOt6DQAAQBAJ&source=gbs_api","authors":["Joseph B. Ottinger","Jeff Linwood","Dave Minter"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pitLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Big Data Processing Made Simple","description":"Learn how to use, deploy, and maintain Apache Spark with this comprehensive guide, written by the creators of the open-source cluster-computing framework. With an emphasis on improvements and new features in Spark 2.0, authors Bill Chambers and Matei Zaharia break down Spark topics into distinct sections, each with unique goals. You’ll explore the basic operations and common functions of Spark’s structured APIs, as well as Structured Streaming, a new high-level API for building end-to-end streaming applications. Developers and system administrators will learn the fundamentals of monitoring, tuning, and debugging Spark, and explore machine learning techniques and scenarios for employing MLlib, Spark’s scalable machine-learning library. Get a gentle overview of big data and Spark Learn about DataFrames, SQL, and Datasets—Spark’s core APIs—through worked examples Dive into Spark’s low-level APIs, RDDs, and execution of SQL and DataFrames Understand how Spark runs on a cluster Debug, monitor, and tune Spark clusters and applications Learn the power of Structured Streaming, Spark’s stream-processing engine Learn how you can apply MLlib to a variety of problems, including classification or recommendation","language":"en","currency":"USD","id":"1491912294","title":"Spark: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pitLDwAAQBAJ&source=gbs_api","authors":["Bill Chambers","Matei Zaharia"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lWUnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Enterprise Information Architecture for A New Age","description":"Enterprise Information Architecture for a New Age: Big Data and The Internet of Things, provides guidance in designing an information architecture to accommodate increasingly large amounts of data, massively large amounts of data, not only from traditional sources, but also from novel sources such everyday objects that are fast becoming wired into global Internet. No business can afford to be caught out by missing the value to be mined from the increasingly large amounts of available data generated by everyday devices. The text provides background as to how analytical solutions and enterprise architecture methodologies and concepts have evolved (including the roles of data warehouses, business intelligence tools, predictive analytics, data discovery, Big Data, and the impact of the Internet of Things). Then you’re taken through a series of steps by which to define a future state architecture and create a plan for how to reach that future state. Enterprise Information Architecture for a New Age: Big Data and The Internet of Things helps you gain an understanding of the following: Implications of Big Data from a variety of new data sources (including data from sensors that are part of the Internet of Things) upon an information architecture How establishing a vision for data usage by defining a roadmap that aligns IT with line-of-business needs is a key early step The importance and details of taking a step-by-step approach when dealing with shifting business challenges and changing technology capabilities How to mitigate risk when evaluating existing infrastructure and designing and deploying new infrastructure Enterprise Information Architecture for a New Age: Big Data and The Internet of Things combines practical advice with technical considerations. Author Robert Stackowiak and his team are recognized worldwide for their expertise in large data solutions, including analytics. Don’t miss your chance to read this book and gain the benefit of their advice as you look forward in thinking through your own choices and designing your own architecture to accommodate the burgeoning explosion in data that can be analyzed and converted into valuable information to drive your business forward toward success.","language":"en","currency":"USD","id":"1484209869","title":"Big Data and The Internet of Things","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lWUnCgAAQBAJ&source=gbs_api","authors":["Robert Stackowiak","Art Licht","Venu Mantha","Louis Nagode"]},{"pageCount":458,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JJGbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":212,"subtitle":null,"description":"Advances in web technology and the proliferation of sensors and mobile devices connected to the internet have resulted in the generation of immense data sets available on the web that need to be represented, saved, and exchanged. Massive data can be managed effectively and efficiently to support various problem-solving and decision-making techniques. Emerging Technologies and Applications in Data Processing and Management is a critical scholarly publication that examines the importance of data management strategies that coincide with advancements in web technologies. Highlighting topics such as geospatial coverages, data analysis, and keyword query, this book is ideal for professionals, researchers, academicians, data analysts, web developers, and web engineers.","language":"en","currency":"USD","id":"1522584471","title":"Emerging Technologies and Applications in Data Processing and Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JJGbDwAAQBAJ&source=gbs_api","authors":["Ma, Zongmin","Yan, Li"]},{"pageCount":1200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yllzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"An all-new CompTIA Security+ exam guide from top CompTIA training and exam prep expert Mike Meyers In Mike Meyers’ CompTIA Security+ Certification Guide (Exam SY0-401), the bestselling author and leading authority on CompTIA A+ certification brings his highly effective methodology to IT security for the first time. Like the exam, this book goes beyond knowledge application and is designed to ensure that security personnel anticipate security risks and guard against them. Meyers’ “in the trenches” voice and the clarity of his explanations make his books the bestselling self-study resources available for professional certification. Electronic content includes: 20+ lab simulations, 1+ hour of video training from Meyers, and hundreds of practice exam questions McGraw-Hill Professional is a Platinum-Level CompTIA Authorized Partner CAQC Authorized (CompTIA Approved Quality Curriculum) Includes Mike's toolbox of favorite network security related freeware\/shareware","language":"en","currency":"USD","id":"0071836187","title":"Mike Meyers' CompTIA Security+ Certification Guide (Exam SY0-401)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yllzAwAAQBAJ&source=gbs_api","authors":["Mike Meyers"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1RhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 100 practical recipes to efficiently maintain and administer your MongoDB solution","description":"Manage, fine-tune, secure and deploy your MongoDB solution with ease with the help of practical recipes About This Book Configure and deploy your MongoDB instance securely, without any hassle Optimize your database's query performance, perform scale-out operations, and make your database highly available Practical guide with a recipe-based approach to help you tackle any problem in the application and database administration aspects of MongoDB Who This Book Is For Database administrators with a basic understanding of the features of MongoDB and who want to professionally configure, deploy, and administer a MongoDB database, will find this book essential. If you are a MongoDB developer and want to get into MongoDB administration, this book will also help you. What You Will Learn Install and deploy MongoDB in production Manage and implement optimal indexes Optimize monitoring in MongoDB Fine-tune the performance of your queries Debug and diagnose your database's performance Optimize database backups and recovery and ensure high availability Make your MongoDB instance scalable Implement security and user authentication features in MongoDB Master optimal cloud deployment strategies In Detail MongoDB is a high-performance and feature-rich NoSQL database that forms the backbone of the systems that power many different organizations. Packed with many features that have become essential for many different types of software professional and incredibly easy to use, this cookbook contains more than 100 recipes to address the everyday challenges of working with MongoDB. Starting with database configuration, you will understand the indexing aspects of MongoDB. The book also includes practical recipes on how you can optimize your database query performance, perform diagnostics, and query debugging. You will also learn how to implement the core administration tasks required for high-availability and scalability, achieved through replica sets and sharding, respectively. You will also implement server security concepts such as authentication, user management, role-based access models, and TLS configuration. You will also learn how to back up and recover your database efficiently and monitor server performance. By the end of this book, you will have all the information you need—along with tips, tricks, and best practices—to implement a high-performance MongoDB solution. Style and approach This practical book follows a problem-solution approach to help you tackle any issues encountered while performing MongoDB administrative tasks. Each recipe is detailed, and explained in a very easy to understand manner","language":"en","currency":"USD","id":"1787127184","title":"MongoDB Administrator's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1RhKDwAAQBAJ&source=gbs_api","authors":["Cyrus Dasadia"]},{"pageCount":230,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bfpmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Theory, Methods, and Real-Life Applications","description":"This hands-on textbook provides an accessible introduction to the fundamentals of digital forensics. The text contains thorough coverage of the theoretical foundations, explaining what computer forensics is, what it can do, and also what it can’t. A particular focus is presented on establishing sound forensic thinking and methodology, supported by practical guidance on performing typical tasks and using common forensic tools. Emphasis is also placed on universal principles, as opposed to content unique to specific legislation in individual countries. Topics and features: introduces the fundamental concepts in digital forensics, and the steps involved in a forensic examination in a digital environment; discusses the nature of what cybercrime is, and how digital evidence can be of use during criminal investigations into such crimes; offers a practical overview of common practices for cracking encrypted data; reviews key artifacts that have proven to be important in several cases, highlighting where to find these and how to correctly interpret them; presents a survey of various different search techniques, and several forensic tools that are available for free; examines the functions of AccessData Forensic Toolkit and Registry Viewer; proposes methods for analyzing applications, timelining, determining the identity of the computer user, and deducing if the computer was remote controlled; describes the central concepts relating to computer memory management, and how to perform different types of memory analysis using the open source tool Volatility; provides review questions and practice tasks at the end of most chapters, and supporting video lectures on YouTube. This easy-to-follow primer is an essential resource for students of computer forensics, and will also serve as a valuable reference for practitioners seeking instruction on performing forensic examinations in law enforcement or in the private sector.","language":"en","currency":"USD","id":"3319963198","title":"Fundamentals of Digital Forensics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bfpmDwAAQBAJ&source=gbs_api","authors":["Joakim Kävrestad"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Td-cBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.96,"subtitle":"Master Data Management and Information Integration","description":"Entity Information Life Cycle for Big Data walks you through the ins and outs of managing entity information so you can successfully achieve master data management (MDM) in the era of big data. This book explains big data’s impact on MDM and the critical role of entity information management system (EIMS) in successful MDM. Expert authors Dr. John R. Talburt and Dr. Yinle Zhou provide a thorough background in the principles of managing the entity information life cycle and provide practical tips and techniques for implementing an EIMS, strategies for exploiting distributed processing to handle big data for EIMS, and examples from real applications. Additional material on the theory of EIIM and methods for assessing and evaluating EIMS performance also make this book appropriate for use as a textbook in courses on entity and identity management, data management, customer relationship management (CRM), and related topics. Explains the business value and impact of entity information management system (EIMS) and directly addresses the problem of EIMS design and operation, a critical issue organizations face when implementing MDM systems Offers practical guidance to help you design and build an EIM system that will successfully handle big data Details how to measure and evaluate entity integrity in MDM systems and explains the principles and processes that comprise EIM Provides an understanding of features and functions an EIM system should have that will assist in evaluating commercial EIM systems Includes chapter review questions, exercises, tips, and free downloads of demonstrations that use the OYSTER open source EIM system Executable code (Java .jar files), control scripts, and synthetic input data illustrate various aspects of CSRUD life cycle such as identity capture, identity update, and assertions","language":"en","currency":"USD","id":"012800665X","title":"Entity Information Life Cycle for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Td-cBAAAQBAJ&source=gbs_api","authors":["John R. Talburt","Yinle Zhou"]},{"pageCount":114,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ygLH4qrGm-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Representing Informational Relationships","description":"Data visualization is an efficient and effective medium for communicating large amounts of information, but the design process can often seem like an unexplainable creative endeavor. This concise book aims to demystify the design process by showing you how to use a linear decision-making process to encode your information visually. Delve into different kinds of visualization, including infographics and visual art, and explore the influences at work in each one. Then learn how to apply these concepts to your design process. Learn data visualization classifications, including explanatory, exploratory, and hybrid Discover how three fundamental influences—the designer, the reader, and the data—shape what you create Learn how to describe the specific goal of your visualization and identify the supporting data Decide the spatial position of your visual entities with axes Encode the various dimensions of your data with appropriate visual properties, such as shape and color See visualization best practices and suggestions for encoding various specific data types","language":"en","currency":"USD","id":"1449317065","title":"Designing Data Visualizations","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ygLH4qrGm-wC&source=gbs_api","authors":["Noah Iliinsky","Julie Steele"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HaHz3-fqGM0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Developing Apps in the New World of Cloud Computing","description":"Moving to the Cloud provides an in-depth introduction to cloud computing models, cloud platforms, application development paradigms, concepts and technologies. The authors particularly examine cloud platforms that are in use today. They also describe programming APIs and compare the technologies that underlie them. The basic foundations needed for developing both client-side and cloud-side applications covering compute\/storage scaling, data parallelism, virtualization, MapReduce, RIA, SaaS and Mashups are covered. Approaches to address key challenges of a cloud infrastructure, such as scalability, availability, multi-tenancy, security and management are addressed. The book also lays out the key open issues and emerging cloud standards that will drive the continuing evolution of cloud computing. Includes complex case studies of cloud solutions by cloud experts from Yahoo! , Amazon, Microsoft, IBM, Adobe and HP Labs Presents insights and techniques for creating compelling rich client applications that interact with cloud services Demonstrates and distinguishes features of different cloud platforms using simple to complex API programming examples","language":"en","currency":"USD","id":"1597497266","title":"Moving To The Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HaHz3-fqGM0C&source=gbs_api","authors":["Dinkar Sitaram","Geetha Manjunath"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4UEwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build a scalable, fault-tolerant and highly available data layer for your applications using Apache Cassandra About This Book Install Cassandra and set up multi-node clusters Design rich schemas that capture the relationships between different data types Master the advanced features available in Cassandra 3.x through a step-by-step tutorial and build a scalable, high performance database layer Who This Book Is For If you are a NoSQL developer and new to Apache Cassandra who wants to learn its common as well as not-so-common features, this book is for you. Alternatively, a developer wanting to enter the world of NoSQL will find this book useful. It does not assume any prior experience in coding or any framework. What You Will Learn Install Cassandra Create keyspaces and tables with multiple clustering columns to organize related data Use secondary indexes and materialized views to avoid denormalization of data Effortlessly handle concurrent updates with collection columns Ensure data integrity with lightweight transactions and logged batches Understand eventual consistency and use the right consistency level for your situation Understand data distribution with Cassandra Develop simple application using Java driver and implement application-level optimizations In Detail Cassandra is a distributed database that stands out thanks to its robust feature set and intuitive interface, while providing high availability and scalability of a distributed data store. This book will introduce you to the rich feature set offered by Cassandra, and empower you to create and manage a highly scalable, performant and fault-tolerant database layer. The book starts by explaining the new features implemented in Cassandra 3.x and get you set up with Cassandra. Then you'll walk through data modeling in Cassandra and the rich feature set available to design a flexible schema. Next you'll learn to create tables with composite partition keys, collections and user-defined types and get to know different methods to avoid denormalization of data. You will then proceed to create user-defined functions and aggregates in Cassandra. Then, you will set up a multi node cluster and see how the dynamics of Cassandra change with it. Finally, you will implement some application-level optimizations using a Java client. By the end of this book, you'll be fully equipped to build powerful, scalable Cassandra database layers for your applications. Style and approach This book takes a step-by- step approach to give you basic to intermediate knowledge of Apache Cassandra. Every concept is explained in depth, and is supplemented with practical examples when required.","language":"en","currency":"USD","id":"1787128407","title":"Learning Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4UEwDwAAQBAJ&source=gbs_api","authors":["Sandeep Yarabarla"]},{"pageCount":111,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GaBtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"A Practical Introduction with Legacy Data and Neo4j","description":"Get an introduction to the visual design of GraphQL data and concepts, including GraphQL structures, semantics, and schemas in this compact, pragmatic book. In it you will see simple guidelines based on lessons learned from real-life data discovery and unification, as well as useful visualization techniques. These in turn help you improve the quality of your API designs and give you the skills to produce convincing visual communications about the structure of your API designs. Finally, Visual Design of GraphQL Data shows you how to handle GraphQL with legacy data as well as with Neo4j graph databases. Spending time on schema quality means that you will work from sharper definitions, which in turn leads to greater productivity and well-structured applications. What You Will Learn Create quality GraphQL data designs Avoid structural mistakes Draw highly communicative property graph diagrams of your APIs Who This Book Is For Web developers and data architects who work with GraphQL and other APIs to build modern applications.","language":"en","currency":"USD","id":"1484239040","title":"Visual Design of GraphQL Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GaBtDwAAQBAJ&source=gbs_api","authors":["Thomas Frisendal"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LVsnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":null,"description":"Why have developers at places like Facebook and Twitter increasingly turned to graph databases to manage their highly connected big data? The short answer is that graphs offer superior speed and flexibility to get the job done. It’s time you added skills in graph databases to your toolkit. In Practical Neo4j, database expert Greg Jordan guides you through the background and basics of graph databases and gets you quickly up and running with Neo4j, the most prominent graph database on the market today. Jordan walks you through the data modeling stages for projects such as social networks, recommendation engines, and geo-based applications. The book also dives into the configuration steps as well as the language options used to create your Neo4j-backed applications. Neo4j runs some of the largest connected datasets in the world, and developing with it offers you a fast, proven NoSQL database option. Besides those working for social media, database, and networking companies of all sizes, academics and researchers will find Neo4j a powerful research tool that can help connect large sets of diverse data and provide insights that would otherwise remain hidden. Using Practical Neo4j, you will learn how to harness that power and create elegant solutions that address complex data problems. This book: Explains the basics of graph databases Demonstrates how to configure and maintain Neo4j Shows how to import data into Neo4j from a variety of sources Provides a working example of a Neo4j-based application using an array of language of options including Java, .Net, PHP, Python, Spring, and Ruby As you’ll discover, Neo4j offers a blend of simplicity and speed while allowing data relationships to maintain first-class status. That’s one reason among many that such a wide range of industries and fields have turned to graph databases to analyze deep, dense relationships. After reading this book, you’ll have a potent, elegant tool you can use to develop projects profitably and improve your career options.","language":"en","currency":"USD","id":"1484200225","title":"Practical Neo4j","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LVsnCgAAQBAJ&source=gbs_api","authors":["Gregory Jordan"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3igKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This effective self-study system delivers complete coverage of every topic on the AWS Certified Developer Associate Exam Take the challenging AWS Certified Developer Associate Exam with confidence using the comprehensive information contained in this effective test preparation guide. Written by an Amazon Web Services certified expert and experienced trainer, AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01) covers every subject on the exam and clearly explains how to create, deploy, migrate, monitor, and debug cloud-native applications. Designed to help you pass the exam with ease, this guide also serves as an ideal on-the-job reference. Covers all topics on the exam, including: Getting started with AWS Journey AWS high availability and fault tolerance Working with cloud storage Authentication and authorization Creating SQL and NoSQL databases in AWS Cloud AWS application integration and management Developing cloud-native applications in AWS Building, deploying, and debugging cloud applications Electronic content includes: 130 practice questions Test engine containing full-length practice exams and customizable quizzes","language":"en","currency":"USD","id":"1260460185","title":"AWS Certified Developer Associate All-in-One Exam Guide (Exam DVA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3igKEAAAQBAJ&source=gbs_api","authors":["Kamesh Ganesan"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ufjJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Easy, hands-on recipes to help you understand Hive and its integration with frameworks that are used widely in today's big data world About This Book Grasp a complete reference of different Hive topics. Get to know the latest recipes in development in Hive including CRUD operations Understand Hive internals and integration of Hive with different frameworks used in today's world. Who This Book Is For The book is intended for those who want to start in Hive or who have basic understanding of Hive framework. Prior knowledge of basic SQL command is also required What You Will Learn Learn different features and offering on the latest Hive Understand the working and structure of the Hive internals Get an insight on the latest development in Hive framework Grasp the concepts of Hive Data Model Master the key concepts like Partition, Buckets and Statistics Know how to integrate Hive with other frameworks such as Spark, Accumulo, etc In Detail Hive was developed by Facebook and later open sourced in Apache community. Hive provides SQL like interface to run queries on Big Data frameworks. Hive provides SQL like syntax also called as HiveQL that includes all SQL capabilities like analytical functions which are the need of the hour in today's Big Data world. This book provides you easy installation steps with different types of metastores supported by Hive. This book has simple and easy to learn recipes for configuring Hive clients and services. You would also learn different Hive optimizations including Partitions and Bucketing. The book also covers the source code explanation of latest Hive version. Hive Query Language is being used by other frameworks including spark. Towards the end you will cover integration of Hive with these frameworks. Style and approach Starting with the basics and covering the core concepts with the practical usage, this book is a complete guide to learn and explore Hive offerings.","language":"en","currency":"USD","id":"1782161090","title":"Apache Hive Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ufjJDAAAQBAJ&source=gbs_api","authors":["Hanish Bansal","Saurabh Chauhan","Shrey Mehrotra"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B3dcSWopawwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"A Hands-On Guide to Relational Database Design","description":"&a>Database Design for Mere Mortals™, Second Edition, is a straightforward, platform-independent tutorial on the basic principles of relational database design. It provides a commonsense design methodology for developing databases that work. Database design expert Michael J. Hernandez has expanded his best-selling first edition, maintaining its hands-on approach and accessibility while updating its coverage and including even more examples and illustrations. This book will give you the knowledge and tools you need to create efficient and effective relational databases.","language":"en","currency":"USD","id":"9780321605474","title":"Database Design for Mere Mortals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B3dcSWopawwC&source=gbs_api","authors":["Michael J. Hernandez"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_GtqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":145.6,"subtitle":null,"description":"Blockchain Technology: Platforms, Tools and Use Cases, Volume 111, the latest release in the Advances in Computers series published since 1960, presents detailed coverage of innovations in computer hardware, software, theory, design and applications. In addition, it provides contributors with a medium in which they can explore their subjects in greater depth and breadth than journal articles usually allow. This volume has 8 Chapters that discuss the various aspects of Blockchain technology. Provides in-depth surveys and tutorials on new computer technology, with this release focusing on blockchain Presents well-known authors and researchers in the field Contains extensive bibliographies with most chapters Includes volumes that are devoted to single themes or subfields of computer science","language":"en","currency":"USD","id":"012813884X","title":"Blockchain Technology: Platforms, Tools and Use Cases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_GtqDwAAQBAJ&source=gbs_api","authors":[]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Effective data modeling, performance tuning and data visualization techniques in Neo4j","description":"Run blazingly fast queries on complex graph datasets with the power of the Neo4j graph database About This Book Get acquainted with graph database systems and apply them in real-world use cases Use Cypher query language, APOC and other Neo4j extensions to derive meaningful analysis from complex data sets. A practical guide filled with ready to use examples on querying, graph processing and visualizing information to build smarter spatial applications. Who This Book Is For This book is for developers who want an alternative way to store and process data within their applications. No previous graph database experience is required; however, some basic database knowledge will help you understand the concepts more easily. What You Will Learn Understand the science of graph theory, databases and its advantages over traditional databases. Install Neo4j, model data and learn the most common practices of traversing data Learn the Cypher query language and tailor-made procedures to analyze and derive meaningful representations of data Improve graph techniques with the help of precise procedures in the APOC library Use Neo4j advanced extensions and plugins for performance optimization. Understand how Neo4j's new security features and clustering architecture are used for large scale deployments. In Detail Neo4j is a graph database that allows traversing huge amounts of data with ease. This book aims at quickly getting you started with the popular graph database Neo4j. Starting with a brief introduction to graph theory, this book will show you the advantages of using graph databases along with data modeling techniques for graph databases. You'll gain practical hands-on experience with commonly used and lesser known features for updating graph store with Neo4j's Cypher query language. Furthermore, you'll also learn to create awesome procedures using APOC and extend Neo4j's functionality, enabling integration, algorithmic analysis, and other advanced spatial operation capabilities on data. Through the course of the book you will come across implementation examples on the latest updates in Neo4j, such as in-graph indexes, scaling, performance improvements, visualization, data refactoring techniques, security enhancements, and much more. By the end of the book, you'll have gained the skills to design and implement modern spatial applications, from graphing data to unraveling business capabilities with the help of real-world use cases. Style and approach A step-by-step approach of adopting Neo4j, the world's leading graph database. This book includes a lot of background information, helps you grasp the fundamental concepts behind this radical new way of dealing with connected data, and will give you lots of examples of use cases and environments where a graph database would be a great fit","language":"en","currency":"USD","id":"1786460084","title":"Learning Neo4j 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_xhKDwAAQBAJ&source=gbs_api","authors":["Jerome Baton","Rik Van Bruggen"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hdiYSzRsVZMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":52,"subtitle":null,"description":"The latest techniques for building a customer-focused enterprise environment \"The authors have appreciated that MDM is a complex multidimensional area, and have set out to cover each of these dimensions in sufficient detail to provide adequate practical guidance to anyone implementing MDM. While this necessarily makes the book rather long, it means that the authors achieve a comprehensive treatment of MDM that is lacking in previous works.\" -- Malcolm Chisholm, Ph.D., President, AskGet.com Consulting, Inc. Regain control of your master data and maintain a master-entity-centric enterprise data framework using the detailed information in this authoritative guide. Master Data Management and Data Governance, Second Edition provides up-to-date coverage of the most current architecture and technology views and system development and management methods. Discover how to construct an MDM business case and roadmap, build accurate models, deploy data hubs, and implement layered security policies. Legacy system integration, cross-industry challenges, and regulatory compliance are also covered in this comprehensive volume. Plan and implement enterprise-scale MDM and Data Governance solutions Develop master data model Identify, match, and link master records for various domains through entity resolution Improve efficiency and maximize integration using SOA and Web services Ensure compliance with local, state, federal, and international regulations Handle security using authentication, authorization, roles, entitlements, and encryption Defend against identity theft, data compromise, spyware attack, and worm infection Synchronize components and test data quality and system performance","language":"en","currency":"USD","id":"0071744592","title":"MASTER DATA MANAGEMENT AND DATA GOVERNANCE, 2\/E","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hdiYSzRsVZMC&source=gbs_api","authors":["Alex Berson","Larry Dubov"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kdEAEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This study guide offers 100% coverage of every objective for the Google Cloud Certified Associate Cloud Engineer exam Take the challenging Google Cloud Certified Associate Cloud Engineer exam with confidence using the comprehensive information contained in this effective self-study guide. The book serves as an introduction to Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Associate Cloud Engineer All-In-One Exam Guide is based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and detailed explanations. You will discover how to plan set up, and configure GCP; ensure effective operation; and administer access and security. Covers every topic on the exam—demonstrated through exercises, sample exams, and practice use cases Provides online access to TotalTester customizable exam engine with additional practice questions Written by a cloud computing expert, educator, and experienced author","language":"en","currency":"USD","id":"1260473465","title":"Google Cloud Certified Associate Cloud Engineer All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kdEAEAAAQBAJ&source=gbs_api","authors":["Jack Hyman"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XxNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"COVERS THE NEW 2018 EXAM SAA-C01! This effective study guide provides 100% coverage of every topic on the AWS Certified Solutions Architect Associate exam. Get complete coverage of all objectives included on the February 2018 SAA-C01 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: •Design Resilient Architectures •Define Performant Architectures •Specify Secure Applications and Architectures •Design Cost-Optimized Architectures •Define Operationally Excellent Architectures Digital content includes: •130 practice exam questions•Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260108260","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide (Exam SAA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XxNqDwAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BCEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This up-to-date study guide offers 100% coverage of every objective for the current version of the AWS Certified Solutions Architect Professional exam Get complete coverage of all objectives included on the SAA-C02 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect – Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. You’ll also build your practical knowledge with the many hands-on labs found throughout this guide. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: Design Resilient Architectures Design High-Performing Architectures Design Secure Applications and Architectures Design Cost-Optimized Architectures Online content includes: 130 practice exam questions Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260470199","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide, Second Edition (Exam SAA-C02)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BCEOEAAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":467,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-WZCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Follow this handbook to build, configure, tune, and secure Apache Cassandra databases. Start with the installation of Cassandra and move on to the creation of a single instance, and then a cluster of Cassandra databases. Cassandra is increasingly a key player in many big data environments, and this book shows you how to use Cassandra with Apache Spark, a popular big data processing framework. Also covered are day-to-day topics of importance such as the backup and recovery of Cassandra databases, using the right compression and compaction strategies, and loading and unloading data. Expert Apache Cassandra Administration provides numerous step-by-step examples starting with the basics of a Cassandra database, and going all the way through backup and recovery, performance optimization, and monitoring and securing the data. The book serves as an authoritative and comprehensive guide to the building and management of simple to complex Cassandra databases. The book: Takes you through building a Cassandra database from installation of the software and creation of a single database, through to complex clusters and data centers Provides numerous examples of actual commands in a real-life Cassandra environment that show how to confidently configure, manage, troubleshoot, and tune Cassandra databases Shows how to use the Cassandra configuration properties to build a highly stable, available, and secure Cassandra database that always operates at peak efficiency What You'll Learn Install the Cassandra software and create your first database Understand the Cassandra data model, and the internal architecture of a Cassandra database Create your own Cassandra cluster, step-by-step Run a Cassandra cluster on Docker Work with Apache Spark by connecting to a Cassandra database Deploy Cassandra clusters in your data center, or on Amazon EC2 instances Back up and restore mission-critical Cassandra databases Monitor, troubleshoot, and tune production Cassandra databases, and cut your spending on resources such as memory, servers, and storage Who This Book Is For Database administrators, developers, and architects who are looking for an authoritative and comprehensive single volume for all their Cassandra administration needs. Also for administrators who are tasked with setting up and maintaining highly reliable and high-performing Cassandra databases. An excellent choice for big data administrators, database administrators, architects, and developers who use Cassandra as their key data store, to support high volume online transactions, or as a decentralized, elastic data store.","language":"en","currency":"USD","id":"1484231260","title":"Expert Apache Cassandra Administration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-WZCDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=V83cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Develop a deep understanding of Tableau 10.0 and get to know tricks to understand your data About This Book Quickly learn tips, tricks, and best practices about Tableau from Tableau masters Whether it is data blending or complex calculations, you can solve your problem with ease and confidence; no more searching for a help doc or waiting for support If you want to quickly master Tableau, then this book is for you Who This Book Is For This book is for Tableau users who have a basic to average understanding of the various features available in Tableau. You'll find this book useful if you spend a lot of time conducting data analysis and visualizations with Tableau. What You Will Learn Connect to variety of data (cloud and local) and blend it in an efficient way for fast analytics Advanced calculations such as LOD calculations and Table calculations See advanced use cases of Parameter, Sorting, and Filters Get practical tips on how to format dashboards following the Zen of dashboard design See examples of a variety of visualizations such as cohort analysis, Jitters chart, and multiple small charts See the new features in Tableau 10—cross data source filter, worksheet as tooltip, cluster, and custom territory In Detail Tableau has emerged as an industry leader in the field of data discovery and business analytic software solutions. While there is a lot of information on how to use the tool, most Tableau users are faced with the challenge on how it can be effectively used to derive meaningful business insights from the uncharted territory of data. This book will give you useful tips from Tableau masters learned from years of experience working with Tableau. You'll start by getting your data into Tableau, move on to generating progressively complex visualizations, and end with finishing touches and packaging your work for distribution. Inside you will learn the exact steps required to solve complex real-life problems. Whether it is data blending or complex calculations, you can solve your problem with ease and confidence; no more searching for Help doc or waiting for support. This book will help you make the most of Tableau and become a Tableau expert. Style and approach The book will show you hacks to solve complex real-life problems. This book will help you make the most of Tableau and become a Tableau expert. This book is packed with lots of real-life problems with step-by-step instructions from Tableau experts.","language":"en","currency":"USD","id":"1786467100","title":"Tableau 10.0 Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=V83cDgAAQBAJ&source=gbs_api","authors":["Jenny Zhang"]},{"pageCount":418,"thumbnail":"http:\/\/books.google.com\/books\/content?id=APhUCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"17th International Conference, DaWaK 2015, Valencia, Spain, September 1-4, 2015, Proceedings","description":"This book constitutes the refereed proceedings of the 17th International Conference on Data Warehousing and Knowledge Discovery, DaWaK 2015, held in Valencia, Spain, September 2015. The 31 revised full papers presented were carefully reviewed and selected from 90 submissions. The papers are organized in topical sections similarity measure and clustering; data mining; social computing; heterogeneos networks and data; data warehouses; stream processing; applications of big data analysis; and big data.","language":"en","currency":"USD","id":"3319227297","title":"Big Data Analytics and Knowledge Discovery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=APhUCgAAQBAJ&source=gbs_api","authors":["Sanjay Madria","Takahiro Hara"]},{"pageCount":143,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jD-5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"5th TPC Technology Conference, TPCTC 2013, Trento, Italy, August 26, 2013, Revised Selected Papers","description":"This book constitutes the refereed post-proceedings of the 5th TPC Technology Conference, TPCTC 2013, held in Trento, Italy, in August 2013. It contains 7 selected peer-reviewed papers, a report from the TPC Public Relations Committee and one invited paper. The papers present novel ideas and methodologies in performance evaluation, measurement and characterization.","language":"en","currency":"USD","id":"3319049364","title":"Performance Characterization and Benchmarking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jD-5BQAAQBAJ&source=gbs_api","authors":["Raghunath Nambiar","Meikel Poess"]},{"pageCount":323,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJSNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"With HiveQL, Dataframe and Graphframes","description":"Carry out data analysis with PySpark SQL, graphframes, and graph data processing using a problem-solution approach. This book provides solutions to problems related to dataframes, data manipulation summarization, and exploratory analysis. You will improve your skills in graph data analysis using graphframes and see how to optimize your PySpark SQL code. PySpark SQL Recipes starts with recipes on creating dataframes from different types of data source, data aggregation and summarization, and exploratory data analysis using PySpark SQL. You’ll also discover how to solve problems in graph analysis using graphframes. On completing this book, you’ll have ready-made code for all your PySpark SQL tasks, including creating dataframes using data from different file formats as well as from SQL or NoSQL databases. What You Will Learn Understand PySpark SQL and its advanced features Use SQL and HiveQL with PySpark SQL Work with structured streaming Optimize PySpark SQL Master graphframes and graph processing Who This Book Is ForData scientists, Python programmers, and SQL programmers.","language":"en","currency":"USD","id":"1484243358","title":"PySpark SQL Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJSNDwAAQBAJ&source=gbs_api","authors":["Raju Kumar Mishra","Sundar Rajan Raman"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lbBEmhnbvvcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":167.2,"subtitle":null,"description":"Database and information systems technologies have been rapidly evolving in several directions over the past years. New types and kinds of data, new types of applications and information systems to support them raise diverse challenges to be addressed. The so-called big data challenge, streaming data management and processing, social networks and other complex data analysis, including semantic reasoning into information systems supporting for instance trading, negotiations, and bidding mechanisms are just some of the emerging research topics. This volume contains papers contributed by six workshops: ADBIS Workshop on GPUs in Databases (GID 2012), Mining Complex and Stream Data (MCSD'12), International Workshop on Ontologies meet Advanced Information Systems (OAIS'2012), Second Workshop on Modeling Multi-commodity Trade: Data models and processing (MMT'12), 1st ADBIS Workshop on Social Data Processing (SDP'12), 1st ADBIS Workshop on Social and Algorithmic Issues in Business Support (SAIBS), and the Ph.D. Consortium associated with the ADBIS 2012 conference that report on the recent developments and an ongoing research in the aforementioned areas.","language":"en","currency":"USD","id":"3642325181","title":"New Trends in Databases and Information Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lbBEmhnbvvcC&source=gbs_api","authors":["Mykola Pechenizkiy","Marek Wojciechowski"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8QG6BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":127.2,"subtitle":"7th IFIP WG 5.14 International Conference, CCTA 2013, Beijing, China, September 18-20, 2013, Revised Selected Papers","description":"The two-volume set IFIP AICT 419 and 420 constitutes the refereed post-conference proceedings of the 7th IFIP TC 5, WG 5.14 International Conference on Computer and Computing Technologies in Agriculture, CCTA 2013, held in Beijing, China, in September 2013. The 115 revised papers presented were carefully selected from numerous submissions. They cover a wide range of interesting theories and applications of information technology in agriculture, including Internet of things and cloud computing; simulation models and decision-support systems for agricultural production; smart sensor, monitoring, and control technology; traceability and e-commerce technology; computer vision, computer graphics, and virtual reality; the application of information and communication technology in agriculture; and universal information service technology and service systems development in rural areas.","language":"en","currency":"USD","id":"3642543413","title":"Computer and Computing Technologies in Agriculture VII","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8QG6BQAAQBAJ&source=gbs_api","authors":["Daoliang Li","Yingyi Chen"]},{"pageCount":1250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AJ-1BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":367.2,"subtitle":null,"description":"This book contains a selection of articles from The 2015 World Conference on Information Systems and Technologies (WorldCIST'15), held between the 1st and 3rd of April in Funchal, Madeira, Portugal, a global forum for researchers and practitioners to present and discuss recent results and innovations, current trends, professional experiences and challenges of modern Information Systems and Technologies research, technological development and applications. The main topics covered are: Information and Knowledge Management; Organizational Models and Information Systems; Intelligent and Decision Support Systems; Big Data Analytics and Applications; Software Systems, Architectures, Applications and Tools; Multimedia Systems and Applications; Computer Networks, Mobility and Pervasive Systems; Human-Computer Interaction; Health Informatics; Information Technologies in Education; Information Technologies in Radio communications.","language":"en","currency":"USD","id":"3319164864","title":"New Contributions in Information Systems and Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AJ-1BwAAQBAJ&source=gbs_api","authors":["Alvaro Rocha","Ana Maria Correia","Sandra Costanzo","Luis Paulo Reis"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oU3iDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.24,"subtitle":"Reliability, scalability, and security both on premises and in the cloud","description":"Explore the impressive storage and analytic tools available with the in-cloud and on-premises versions of Microsoft SQL Server 2019. Key Features Gain insights into what’s new in SQL Server 2019 Understand use cases and customer scenarios that can be implemented with SQL Server 2019 Discover new cross-platform tools that simplify management and analysis Book Description Microsoft SQL Server comes equipped with industry-leading features and the best online transaction processing capabilities. If you are looking to work with data processing and management, getting up to speed with Microsoft Server 2019 is key. Introducing SQL Server 2019 takes you through the latest features in SQL Server 2019 and their importance. You will learn to unlock faster querying speeds and understand how to leverage the new and improved security features to build robust data management solutions. Further chapters will assist you with integrating, managing, and analyzing all data, including relational, NoSQL, and unstructured big data using SQL Server 2019. Dedicated sections in the book will also demonstrate how you can use SQL Server 2019 to leverage data processing platforms, such as Apache Hadoop and Spark, and containerization technologies like Docker and Kubernetes to control your data and efficiently monitor it. By the end of this book, you'll be well versed with all the features of Microsoft SQL Server 2019 and understand how to use them confidently to build robust data management solutions. What you will learn Build a custom container image with a Dockerfile Deploy and run the SQL Server 2019 container image Understand how to use SQL server on Linux Migrate existing paginated reports to Power BI Report Server Learn to query Hadoop Distributed File System (HDFS) data using Azure Data Studio Understand the benefits of In-Memory OLTP Who this book is for This book is for database administrators, architects, big data engineers, or anyone who has experience with SQL Server and wants to explore and implement the new features in SQL Server 2019. Basic working knowledge of SQL Server and relational database management system (RDBMS) is required.","language":"en","currency":"USD","id":"1838829822","title":"Introducing Microsoft SQL Server 2019","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oU3iDwAAQBAJ&source=gbs_api","authors":["Kellyn Gorman","Allan Hirt","Dave Noderer","Mitchell Pearson","James Rowland-Jones","Dustin Ryan","Arun Sirpal","Buck Woody"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5iR4hZNSCcgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Your Brain on SQL -- A Learner's Guide","description":"Is your data dragging you down? Are your tables all tangled up? Well we've got the tools to teach you just how to wrangle your databases into submission. Using the latest research in neurobiology, cognitive science, and learning theory to craft a multi-sensory SQL learning experience, Head First SQL has a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. Maybe you've written some simple SQL queries to interact with databases. But now you want more, you want to really dig into those databases and work with your data. Head First SQL will show you the fundamentals of SQL and how to really take advantage of it. We'll take you on a journey through the language, from basic INSERT statements and SELECT queries to hardcore database manipulation with indices, joins, and transactions. We all know \"Data is Power\" - but we'll show you how to have \"Power over your Data\". Expect to have fun, expect to learn, and expect to be querying, normalizing, and joining your data like a pro by the time you're finished reading!","language":"en","currency":"USD","id":"1449360440","title":"Head First SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5iR4hZNSCcgC&source=gbs_api","authors":["Lynn Beighley"]},{"pageCount":684,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lgDJBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.96,"subtitle":null,"description":"The Data Vault was invented by Dan Linstedt at the U.S. Department of Defense, and the standard has been successfully applied to data warehousing projects at organizations of different sizes, from small to large-size corporations. Due to its simplified design, which is adapted from nature, the Data Vault 2.0 standard helps prevent typical data warehousing failures. \"Building a Scalable Data Warehouse\" covers everything one needs to know to create a scalable data warehouse end to end, including a presentation of the Data Vault modeling technique, which provides the foundations to create a technical data warehouse layer. The book discusses how to build the data warehouse incrementally using the agile Data Vault 2.0 methodology. In addition, readers will learn how to create the input layer (the stage layer) and the presentation layer (data mart) of the Data Vault 2.0 architecture including implementation best practices. Drawing upon years of practical experience and using numerous examples and an easy to understand framework, Dan Linstedt and Michael Olschimke discuss: How to load each layer using SQL Server Integration Services (SSIS), including automation of the Data Vault loading processes. Important data warehouse technologies and practices. Data Quality Services (DQS) and Master Data Services (MDS) in the context of the Data Vault architecture. Provides a complete introduction to data warehousing, applications, and the business context so readers can get-up and running fast Explains theoretical concepts and provides hands-on instruction on how to build and implement a data warehouse Demystifies data vault modeling with beginning, intermediate, and advanced techniques Discusses the advantages of the data vault approach over other techniques, also including the latest updates to Data Vault 2.0 and multiple improvements to Data Vault 1.0","language":"en","currency":"USD","id":"0128026480","title":"Building a Scalable Data Warehouse with Data Vault 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lgDJBAAAQBAJ&source=gbs_api","authors":["Dan Linstedt","Michael Olschimke"]},{"pageCount":496,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CteFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"The fast and easy way to learn Python programming and statistics Python is a general-purpose programming language created in the late 1980s—and named after Monty Python—that's used by thousands of people to do things from testing microchips at Intel, to powering Instagram, to building video games with the PyGame library. Python For Data Science For Dummies is written for people who are new to data analysis, and discusses the basics of Python data analysis programming and statistics. The book also discusses Google Colab, which makes it possible to write Python code in the cloud. Get started with data science and Python Visualize information Wrangle data Learn from data The book provides the statistical background needed to get started in data science programming, including probability, random distributions, hypothesis testing, confidence intervals, and building regression models for prediction.","language":"en","currency":"USD","id":"1119547660","title":"Python for Data Science For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CteFDwAAQBAJ&source=gbs_api","authors":["John Paul Mueller","Luca Massaron"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yPywDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"A Guidebook for Successful Development and Design","description":"HBase is a remarkable tool for indexing mass volumes of data, but getting started with this distributed database and its ecosystem can be daunting. With this hands-on guide, you’ll learn how to architect, design, and deploy your own HBase applications by examining real-world solutions. Along with HBase principles and cluster deployment guidelines, this book includes in-depth case studies that demonstrate how large companies solved specific use cases with HBase. Authors Jean-Marc Spaggiari and Kevin O’Dell also provide draft solutions and code examples to help you implement your own versions of those use cases, from master data management (MDM) and document storage to near real-time event processing. You’ll also learn troubleshooting techniques to help you avoid common deployment mistakes. Learn exactly what HBase does, what its ecosystem includes, and how to set up your environment Explore how real-world HBase instances were deployed and put into production Examine documented use cases for tracking healthcare claims, digital advertising, data management, and product quality Understand how HBase works with tools and techniques such as Spark, Kafka, MapReduce, and the Java API Learn how to identify the causes and understand the consequences of the most common HBase issues","language":"en","currency":"USD","id":"1491916109","title":"Architecting HBase Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yPywDAAAQBAJ&source=gbs_api","authors":["Jean-Marc Spaggiari","Kevin O'Dell"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HaHz3-fqGM0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Developing Apps in the New World of Cloud Computing","description":"Moving to the Cloud provides an in-depth introduction to cloud computing models, cloud platforms, application development paradigms, concepts and technologies. The authors particularly examine cloud platforms that are in use today. They also describe programming APIs and compare the technologies that underlie them. The basic foundations needed for developing both client-side and cloud-side applications covering compute\/storage scaling, data parallelism, virtualization, MapReduce, RIA, SaaS and Mashups are covered. Approaches to address key challenges of a cloud infrastructure, such as scalability, availability, multi-tenancy, security and management are addressed. The book also lays out the key open issues and emerging cloud standards that will drive the continuing evolution of cloud computing. Includes complex case studies of cloud solutions by cloud experts from Yahoo! , Amazon, Microsoft, IBM, Adobe and HP Labs Presents insights and techniques for creating compelling rich client applications that interact with cloud services Demonstrates and distinguishes features of different cloud platforms using simple to complex API programming examples","language":"en","currency":"USD","id":"1597497266","title":"Moving To The Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HaHz3-fqGM0C&source=gbs_api","authors":["Dinkar Sitaram","Geetha Manjunath"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Zb8iDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":4.87,"subtitle":"Entwicklung und Programmierung von Systemen für große Datenmengen und Einsatz der Lambda-Architektur","description":null,"language":"de","currency":"USD","id":"3958451772","title":"Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Zb8iDQAAQBAJ&source=gbs_api","authors":["Nathan Marz","James Warren"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qrkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Learn how to apply powerful data analysis techniques with popular open source Python modules About This Book Find, manipulate, and analyze your data using the Python 3.5 libraries Perform advanced, high-performance linear algebra and mathematical calculations with clean and efficient Python code An easy-to-follow guide with realistic examples that are frequently used in real-world data analysis projects. Who This Book Is For This book is for programmers, scientists, and engineers who have the knowledge of Python and know the basics of data science. It is for those who wish to learn different data analysis methods using Python 3.5 and its libraries. This book contains all the basic ingredients you need to become an expert data analyst. What You Will Learn Install open source Python modules such NumPy, SciPy, Pandas, stasmodels, scikit-learn,theano, keras, and tensorflow on various platforms Prepare and clean your data, and use it for exploratory analysis Manipulate your data with Pandas Retrieve and store your data from RDBMS, NoSQL, and distributed filesystems such as HDFS and HDF5 Visualize your data with open source libraries such as matplotlib, bokeh, and plotly Learn about various machine learning methods such as supervised, unsupervised, probabilistic, and Bayesian Understand signal processing and time series data analysis Get to grips with graph processing and social network analysis In Detail Data analysis techniques generate useful insights from small and large volumes of data. Python, with its strong set of libraries, has become a popular platform to conduct various data analysis and predictive modeling tasks. With this book, you will learn how to process and manipulate data with Python for complex analysis and modeling. We learn data manipulations such as aggregating, concatenating, appending, cleaning, and handling missing values, with NumPy and Pandas. The book covers how to store and retrieve data from various data sources such as SQL and NoSQL, CSV fies, and HDF5. We learn how to visualize data using visualization libraries, along with advanced topics such as signal processing, time series, textual data analysis, machine learning, and social media analysis. The book covers a plethora of Python modules, such as matplotlib, statsmodels, scikit-learn, and NLTK. It also covers using Python with external environments such as R, Fortran, C\/C++, and Boost libraries. Style and approach The book takes a very comprehensive approach to enhance your understanding of data analysis. Sufficient real-world examples and use cases are included in the book to help you grasp the concepts quickly and apply them easily in your day-to-day work. Packed with clear, easy to follow examples, this book will turn you into an ace data analyst in no time.","language":"en","currency":"USD","id":"1787127923","title":"Python Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qrkrDwAAQBAJ&source=gbs_api","authors":["Armando Fandango"]},{"pageCount":831,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L-U5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Solve all your Spring 5 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work over creating a project from scratch. The recipes in Spring 5 Recipes cover Spring fundamentals such as Spring IoC container, Spring AOP\/ AspectJ, and more. Other recipes include Spring enterprise solutions for topics such as Spring Java EE integration, Spring Integration, Spring Batch, Spring Remoting, messaging, transactions, and working with big data and the cloud using Hadoop and MongoDB. Finally, Spring web recipes cover Spring MVC, other dynamic scripting, integration with the popular Grails Framework (and Groovy), REST\/web services, and more. You’ll also see recipes on new topics such as Spring Framework 5, reactive Spring, Spring 5 microservices, the functional web framework and much more. This book builds upon the best-selling success of the previous editions and focuses on the latest Spring Framework features for building enterprise Java applications. What You'll Learn Get re-usable code recipes and snippets for core Spring, annotations and other development tools Access Spring MVC for web development Work with Spring REST and microservices for web services development and integration into your enterprise Java applications Use Spring Batch, NoSQL and big data for building and integrating various cloud computing services and resources Integrate Java Enterprise Edition and other Java APIs for use in Spring Use Grails code and much more Who This Book Is For Experienced Java and Spring programmers.","language":"en","currency":"USD","id":"1484227905","title":"Spring 5 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L-U5DwAAQBAJ&source=gbs_api","authors":["Marten Deinum","Daniel Rubio","Josh Long"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OySOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Triples Storage and SPARQL Query Processing","description":"RDF Database Systems is a cutting-edge guide that distills everything you need to know to effectively use or design an RDF database. This book starts with the basics of linked open data and covers the most recent research, practice, and technologies to help you leverage semantic technology. With an approach that combines technical detail with theoretical background, this book shows how to design and develop semantic web applications, data models, indexing and query processing solutions. Understand the Semantic Web, RDF, RDFS, SPARQL, and OWL within the context of relational database management and NoSQL systems Learn about the prevailing RDF triples solutions for both relational and non-relational databases, including column family, document, graph, and NoSQL Implement systems using RDF data with helpful guidelines and various storage solutions for RDF Process SPARQL queries with detailed explanations of query optimization, query plans, caching, and more Evaluate which approaches and systems to use when developing Semantic Web applications with a helpful description of commercial and open-source systems","language":"en","currency":"USD","id":"0128004703","title":"RDF Database Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OySOAwAAQBAJ&source=gbs_api","authors":["Olivier Curé","Guillaume Blin"]},{"pageCount":388,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hloWonPJyC4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book gathers chapters from some of the top international empirical software engineering researchers focusing on the practical knowledge necessary for conducting, reporting and using empirical methods in software engineering. Topics and features include guidance on how to design, conduct and report empirical studies. The volume also provides information across a range of techniques, methods and qualitative and quantitative issues to help build a toolkit applicable to the diverse software development contexts","language":"en","currency":"USD","id":"1848000448","title":"Guide to Advanced Empirical Software Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hloWonPJyC4C&source=gbs_api","authors":["Forrest Shull","Janice Singer","Dag I. K. Sjøberg"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8Z-9CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This practical guide is intended for those who want to learn how to build extremely scalable applications. This book is easy to read and is aimed at Java enterprise developers with a solid knowledge of Java. However, no previous coding experience with Infinispan is required.","language":"en","currency":"USD","id":"1782169989","title":"Infinispan Data Grid Platform Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8Z-9CQAAQBAJ&source=gbs_api","authors":["Wagner Roberto dos Santos"]},{"pageCount":145,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vly5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"6th International Workshop, BIRTE 2012, Held at the 38th International Conference on Very Large Databases, VLDB 2012, Istanbul, Turkey, August 27, 2012, Revised Selected Papers","description":"This book constitutes the thoroughly refereed conference proceedings of the 6th International Workshop on Business Intelligence for the Real-Time Enterprise, BIRTE 2012, held in Istanbul, Turkey, in August 2012, in conjunction with VLDB 2012, the International Conference on Very Large Data Bases. The BIRTE workshop series provides a forum to discuss and advance the science and engineering enabling real-time business intelligence and the novel applications that build on these foundational techniques. This volume contains ten research papers, which were carefully reviewed and selected from 13 submissions.","language":"en","currency":"USD","id":"3642398723","title":"Enabling Real-Time Business Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vly5BQAAQBAJ&source=gbs_api","authors":["Malu Castellanos","Umeshwar Dayal","Elke A. Rundensteiner"]},{"pageCount":331,"thumbnail":"http:\/\/books.google.com\/books\/content?id=67jEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Deployment, Administration and Use Cases with Python","description":"Discover the methodologies and best practices for getting started with Google Cloud Platform relational services – CloudSQL and CloudSpanner. The book begins with the basics of working with the Google Cloud Platform along with an introduction to the database technologies available for developers from Google Cloud. You'll then take an in-depth hands on journey into Google CloudSQL and CloudSpanner, including choosing the right platform for your application needs, planning, provisioning, designing and developing your application. Sample applications are given that use Python to connect to CloudSQL and CloudSpanner, along with helpful features provided by the engines. You''ll also implement practical best practices in the last chapter. Hands On Google Cloud SQL and Cloud Spanner is a great starting point to apply GCP data offerings in your technology stack and the code used allows you to try out the examples and extend them in interesting ways. What You'll Learn Get started with Big Data technologies on the Google Cloud Platform Review CloudSQL and Cloud Spanner from basics to administration Apply best practices and use Google’s CloudSQL and CloudSpanner offering Work with code in Python notebooks and scripts Who This Book Is For Application architects, database architects, software developers, data engineers, cloud architects.","language":"en","currency":"USD","id":"1484255372","title":"Hands On Google Cloud SQL and Cloud Spanner","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=67jEDwAAQBAJ&source=gbs_api","authors":["Navin Sabharwal","Shakuntala Gupta Edward"]},{"pageCount":111,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mCS7BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":151.2,"subtitle":null,"description":"Big data is an essential key to build a smart world as a meaning of the streaming, continuous integration of large volume and high velocity data covering from all sources to final destinations. The big data range from data mining, data analysis and decision making, by drawing statistical rules and mathematical patterns through systematical or automatically reasoning. The big data helps serve our life better, clarify our future and deliver greater value. We can discover how to capture and analyze data. Readers will be guided to processing system integrity and implementing intelligent systems. With intelligent systems, we deal with the fundamental data management and visualization challenges in effective management of dynamic and large-scale data, and efficient processing of real-time and spatio-temporal data. Advanced intelligent systems have led to managing the data monitoring, data processing and decision-making in realistic and effective way. Considering a big size of data, variety of data and frequent changes of data, the intelligent systems basically challenge new data management tasks for integration, visualization, querying and analysis. Connected with powerful data analysis, the intelligent systems will provide a paradigm shift from conventional store and process systems. This book focuses on taking a full advantage of big data and intelligent systems processing. It consists of 11 contributions that feature extraction of minority opinion, method for reusing an application, assessment of scientific and innovative projects, multi-voxel pattern analysis, exploiting No-SQL DB, materialized view, TF-IDF criterion, latent Dirichlet allocation, technology forecasting, small world network, and classification & regression tree structure. This edition is published in original, peer reviewed contributions covering from initial design to final prototypes and authorization.","language":"en","currency":"USD","id":"3319055275","title":"Soft Computing in Big Data Processing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mCS7BQAAQBAJ&source=gbs_api","authors":["Keon Myung Lee","Seung-Jong Park","Jee-Hyong Lee"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HGOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are an intermediate to advanced DynamoDB developer looking to learn the best practices associated with efficient data modeling, this book is for you.","language":"en","currency":"USD","id":"1783551909","title":"DynamoDB Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HGOZBAAAQBAJ&source=gbs_api","authors":["Uchit Vyas","Prabhakaran Kuppusamy"]},{"pageCount":896,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jZnCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Get Up to Speed on Microsoft® SQL Server® 2019 Quickly and Easily Start working with Microsoft SQL Server 2019 in no time with help from this thoroughly revised, practical resource. Filled with real-world examples and hands-on exercises, Microsoft SQL Server 2019: A Beginner’s Guide, Seventh Edition starts by explaining fundamental relational database system concepts. From there, you’ll learn how to write Transact-SQL statements, execute simple and complex database queries, handle system administration and security, and use powerful analysis and reporting tools. New topics such as SQL and JSON support, graph databases, and support for machine learning with R and Python are also covered in this step-by-step tutorial. • Install, configure, and customize Microsoft SQL Server 2019 • Create and modify database objects with Transact-SQL statements • Write stored procedures and user-defined functions • Handle backup and recovery, and automate administrative tasks • Tune your database system for optimal availability and reliability • Secure your system using authentication, encryption, and authorization • Work with SQL Server Analysis Services, Reporting Services, and other BI tools • Gain knowledge of relational storage, presentation, and retrieval of data stored in the JSON format • Manage graphs using SQL Server Graph Databases • Learn about machine learning support for R and Python","language":"en","currency":"USD","id":"1260458881","title":"Microsoft SQL Server 2019: A Beginner's Guide, Seventh Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jZnCDwAAQBAJ&source=gbs_api","authors":["Dusan Petkovic"]},{"pageCount":306,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rkBWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Best Practices and Examples with Python","description":"This book provides a complete and modern guide to web scraping, using Python as the programming language, without glossing over important details or best practices. Written with a data science audience in mind, the book explores both scraping and the larger context of web technologies in which it operates, to ensure full understanding. The authors recommend web scraping as a powerful tool for any data scientist’s arsenal, as many data science projects start by obtaining an appropriate data set. Starting with a brief overview on scraping and real-life use cases, the authors explore the core concepts of HTTP, HTML, and CSS to provide a solid foundation. Along with a quick Python primer, they cover Selenium for JavaScript-heavy sites, and web crawling in detail. The book finishes with a recap of best practices and a collection of examples that bring together everything you've learned and illustrate various data science use cases. What You'll Learn Leverage well-established best practices and commonly-used Python packages Handle today's web, including JavaScript, cookies, and common web scraping mitigation techniques Understand the managerial and legal concerns regarding web scraping Who This Book is For A data science oriented audience that is probably already familiar with Python or another programming language or analytical toolkit (R, SAS, SPSS, etc). Students or instructors in university courses may also benefit. Readers unfamiliar with Python will appreciate a quick Python primer in chapter 1 to catch up with the basics and provide pointers to other guides as well.","language":"en","currency":"USD","id":"1484235827","title":"Practical Web Scraping for Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rkBWDwAAQBAJ&source=gbs_api","authors":["Seppe vanden Broucke","Bart Baesens"]},{"pageCount":161,"thumbnail":"http:\/\/books.google.com\/books\/content?id=283aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"16th European Workshop, EPEW 2019, Milan, Italy, November 28–29, 2019, Revised Selected Papers","description":"This book constitutes the refereed proceedings of the 16th European Workshop on Computer Performance Engineering, EPEW 2019, held in Milan, Italy, in November 2019. The 10 papers presented in this volume together with one invited talk were carefully reviewed and selected from 13 submissions. The papers presented at the workshop reflect the diversity of modern performance engineering, with topics ranging from modeling and analysis of network\/control protocols and high performance\/BigData information systems, analysis of scheduling, blockchain technology, analytical modeling and simulation of computer\/network systems.","language":"en","currency":"USD","id":"3030444112","title":"Computer Performance Engineering","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=283aDwAAQBAJ&source=gbs_api","authors":["Marco Gribaudo","Mauro Iacono","Tuan Phung-Duc","Rostislav Razumchik"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Unleash the data processing and analytics capability of Apache Spark with the language of choice: Java About This Book Perform big data processing with Spark—without having to learn Scala! Use the Spark Java API to implement efficient enterprise-grade applications for data processing and analytics Go beyond mainstream data processing by adding querying capability, Machine Learning, and graph processing using Spark Who This Book Is For If you are a Java developer interested in learning to use the popular Apache Spark framework, this book is the resource you need to get started. Apache Spark developers who are looking to build enterprise-grade applications in Java will also find this book very useful. What You Will Learn Process data using different file formats such as XML, JSON, CSV, and plain and delimited text, using the Spark core Library. Perform analytics on data from various data sources such as Kafka, and Flume using Spark Streaming Library Learn SQL schema creation and the analysis of structured data using various SQL functions including Windowing functions in the Spark SQL Library Explore Spark Mlib APIs while implementing Machine Learning techniques to solve real-world problems Get to know Spark GraphX so you understand various graph-based analytics that can be performed with Spark In Detail Apache Spark is the buzzword in the big data industry right now, especially with the increasing need for real-time streaming and data processing. While Spark is built on Scala, the Spark Java API exposes all the Spark features available in the Scala version for Java developers. This book will show you how you can implement various functionalities of the Apache Spark framework in Java, without stepping out of your comfort zone. The book starts with an introduction to the Apache Spark 2.x ecosystem, followed by explaining how to install and configure Spark, and refreshes the Java concepts that will be useful to you when consuming Apache Spark's APIs. You will explore RDD and its associated common Action and Transformation Java APIs, set up a production-like clustered environment, and work with Spark SQL. Moving on, you will perform near-real-time processing with Spark streaming, Machine Learning analytics with Spark MLlib, and graph processing with GraphX, all using various Java packages. By the end of the book, you will have a solid foundation in implementing components in the Spark framework in Java to build fast, real-time applications. Style and approach This practical guide teaches readers the fundamentals of the Apache Spark framework and how to implement components using the Java language. It is a unique blend of theory and practical examples, and is written in a way that will gradually build your knowledge of Apache Spark.","language":"en","currency":"USD","id":"178712942X","title":"Apache Spark 2.x for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8-ZDDwAAQBAJ&source=gbs_api","authors":["Sourav Gulati","Sumit Kumar"]},{"pageCount":979,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LWzWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unlock the power of your data with Hadoop 2.X ecosystem and its data warehousing techniques across large data sets About This Book Conquer the mountain of data using Hadoop 2.X tools The authors succeed in creating a context for Hadoop and its ecosystem Hands-on examples and recipes giving the bigger picture and helping you to master Hadoop 2.X data processing platforms Overcome the challenging data processing problems using this exhaustive course with Hadoop 2.X Who This Book Is For This course is for Java developers, who know scripting, wanting a career shift to Hadoop - Big Data segment of the IT industry. So if you are a novice in Hadoop or an expert, this book will make you reach the most advanced level in Hadoop 2.X. What You Will Learn Best practices for setup and configuration of Hadoop clusters, tailoring the system to the problem at hand Integration with relational databases, using Hive for SQL queries and Sqoop for data transfer Installing and maintaining Hadoop 2.X cluster and its ecosystem Advanced Data Analysis using the Hive, Pig, and Map Reduce programs Machine learning principles with libraries such as Mahout and Batch and Stream data processing using Apache Spark Understand the changes involved in the process in the move from Hadoop 1.0 to Hadoop 2.0 Dive into YARN and Storm and use YARN to integrate Storm with Hadoop Deploy Hadoop on Amazon Elastic MapReduce and Discover HDFS replacements and learn about HDFS Federation In Detail As Marc Andreessen has said “Data is eating the world,” which can be witnessed today being the age of Big Data, businesses are producing data in huge volumes every day and this rise in tide of data need to be organized and analyzed in a more secured way. With proper and effective use of Hadoop, you can build new-improved models, and based on that you will be able to make the right decisions. The first module, Hadoop beginners Guide will walk you through on understanding Hadoop with very detailed instructions and how to go about using it. Commands are explained using sections called “What just happened” for more clarity and understanding. The second module, Hadoop Real World Solutions Cookbook, 2nd edition, is an essential tutorial to effectively implement a big data warehouse in your business, where you get detailed practices on the latest technologies such as YARN and Spark. Big data has become a key basis of competition and the new waves of productivity growth. Hence, once you get familiar with the basics and implement the end-to-end big data use cases, you will start exploring the third module, Mastering Hadoop. So, now the question is if you need to broaden your Hadoop skill set to the next level after you nail the basics and the advance concepts, then this course is indispensable. When you finish this course, you will be able to tackle the real-world scenarios and become a big data expert using the tools and the knowledge based on the various step-by-step tutorials and recipes. Style and approach This course has covered everything right from the basic concepts of Hadoop till you master the advance mechanisms to become a big data expert. The goal here is to help you learn the basic essentials using the step-by-step tutorials and from there moving toward the recipes with various real-world solutions for you. It covers all the important aspects of Hadoop from system designing and configuring Hadoop, machine learning principles with various libraries with chapters illustrated with code fragments and schematic diagrams. This is a compendious course to explore Hadoop from the basics to the most advanced techniques available in Hadoop 2.X.","language":"en","currency":"USD","id":"1787120457","title":"Hadoop: Data Processing and Modelling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LWzWDQAAQBAJ&source=gbs_api","authors":["Garry Turkington","Tanmay Deshpande","Sandeep Karanth"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y_irBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a competent C++ programmer and want to learn the tricks of image processing with OpenCV, then this book is for you. A basic understanding of image processing is required.","language":"en","currency":"USD","id":"1783287667","title":"Learning Image Processing with OpenCV","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y_irBwAAQBAJ&source=gbs_api","authors":["Gloria Bueno García","Oscar Deniz Suarez","José Luis Espinosa Aranda","Jesus Salido Tercero","Ismael Serrano Gracia","Noelia Vállez Enano"]},{"pageCount":463,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oewbDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Storage, Sharing, and Security","description":"Although there are already some books published on Big Data, most of them only cover basic concepts and society impacts and ignore the internal implementation details-making them unsuitable to R&D people. To fill such a need, Big Data: Storage, Sharing, and Security examines Big Data management from an R&D perspective. It covers the 3S desi","language":"en","currency":"USD","id":"1498734871","title":"Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oewbDAAAQBAJ&source=gbs_api","authors":["Fei Hu"]},{"pageCount":138,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WTlECgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Neo4j is a graph database that allows you to model your data as a graph and find solutions to complex real-world problems that are difficult to solve using any other type of database. This book is designed to help you understand the intricacies of modeling a graph for any domain. The book starts with an example of a graph problem and then introduces you to modeling non-graph problems using Neo4j. Concepts such as the evolution of your database, chains, access control, and recommendations are addressed, along with examples and are modeled in a graph. Throughout the book, you will discover design choices and trade-offs, and understand how and when to use them. By the end of the book, you will be able to effectively use Neo4j to model your database for efficiency and flexibility.","language":"en","currency":"USD","id":"178439730X","title":"Neo4j Graph Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WTlECgAAQBAJ&source=gbs_api","authors":["Mahesh Lal"]},{"pageCount":604,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xIauw5xWTO8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"S3, EC2, SQS, FPS, and SimpleDB","description":"Building on the success of its storefront and fulfillment services, Amazon now allows businesses to \"rent\" computing power, data storage and bandwidth on its vast network platform. This book demonstrates how developers working with small- to mid-sized companies can take advantage of Amazon Web Services (AWS) such as the Simple Storage Service (S3), Elastic Compute Cloud (EC2), Simple Queue Service (SQS), Flexible Payments Service (FPS), and SimpleDB to build web-scale business applications. With AWS, Amazon offers a new paradigm for IT infrastructure: use what you need, as you need it, and pay as you go. Programming Amazon Web Services explains how you can access Amazon's open APIs to store and run applications, rather than spend precious time and resources building your own. With this book, you'll learn all the technical details you need to: Store and retrieve any amount of data using application servers, unlimited data storage, and bandwidth with the Amazon S3 service Buy computing time using Amazon EC2's interface to requisition machines, load them with an application environment, manage access permissions, and run your image using as many or few systems as needed Use Amazon's web-scale messaging infrastructure to store messages as they travel between computers with Amazon SQS Leverage the Amazon FPS service to structure payment instructions and allow the movement of money between any two entities, humans or computers Create and store multiple data sets, query your data easily, and return the results using Amazon SimpleDB. Scale up or down at a moment's notice, using these services to employ as much time and space as you need Whether you're starting a new online business, need to ramp up existing services, or require an offsite backup for your home, Programming Amazon Web Services gives you the background and the practical knowledge you need to start using AWS. Other books explain how to build web services. This book teaches businesses how to take make use of existing services from an established technology leader.","language":"en","currency":"USD","id":"9780596551797","title":"Programming Amazon Web Services","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xIauw5xWTO8C&source=gbs_api","authors":["James Murty"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":97,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6guCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Principles and Fundamentals using Hadoop and Spark","description":"Data-intensive systems are a technological building block supporting Big Data and Data Science applications.This book familiarizes readers with core concepts that they should be aware of before continuing with independent work and the more advanced technical reference literature that dominates the current landscape. The material in the book is structured following a problem-based approach. This means that the content in the chapters is focused on developing solutions to simplified, but still realistic problems using data-intensive technologies and approaches. The reader follows one reference scenario through the whole book, that uses an open Apache dataset. The origins of this volume are in lectures from a master’s course in Data-intensive Systems, given at the University of Stavanger. Some chapters were also a base for guest lectures at Purdue University and Lodz University of Technology.","language":"en","currency":"USD","id":"3030046036","title":"Data-intensive Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6guCDwAAQBAJ&source=gbs_api","authors":["Tomasz Wiktorski"]},{"pageCount":152,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o8SeBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Interactive SQL for Apache Hadoop","description":"Learn how to write, tune, and port SQL queries and other statements for a Big Data environment, using Impala—the massively parallel processing SQL query engine for Apache Hadoop. The best practices in this practical guide help you design database schemas that not only interoperate with other Hadoop components, and are convenient for administers to manage and monitor, but also accommodate future expansion in data size and evolution of software capabilities. Written by John Russell, documentation lead for the Cloudera Impala project, this book gets you working with the most recent Impala releases quickly. Ideal for database developers and business analysts, the latest revision covers analytics functions, complex types, incremental statistics, subqueries, and submission to the Apache incubator. Getting Started with Impala includes advice from Cloudera’s development team, as well as insights from its consulting engagements with customers. Learn how Impala integrates with a wide range of Hadoop components Attain high performance and scalability for huge data sets on production clusters Explore common developer tasks, such as porting code to Impala and optimizing performance Use tutorials for working with billion-row tables, date- and time-based values, and other techniques Learn how to transition from rigid schemas to a flexible model that evolves as needs change Take a deep dive into joins and the roles of statistics","language":"en","currency":"USD","id":"1491905727","title":"Getting Started with Impala","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o8SeBAAAQBAJ&source=gbs_api","authors":["John Russell"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=S2TNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. The best IT certification exam study system available Filled with hands-on exercises and practice exam questions, CompTIA Cloud Essentials+TM Certification Study Guide, Second Edition (Exam CLO-002) covers what you need to know—and shows you how to prepare—for this challenging exam. • 100% complete coverage of all official objectives for exam CLO-002 • Exam Readiness checklist—you’re ready for the exam when all objectives on the list are checked off • Exam Watch notes call attention to information about, and potential pitfalls in, the exam • Two-Minute Drills for quick review at the end of every chapter • Simulated exam questions match the format, tone, topics, and difficulty of the real exam Covers all the exam topics, including: The Principles of Cloud Computing • The Business Side of Cloud Computing • Cloud Planning • Compliance and the Cloud • Cloud Storage Infrastructure • Cloud Network Infrastructure • Cloud Compute Infrastructure • Applications and Big Data in the Cloud • Cloud DevOps • Security and the Cloud • Managing Cloud Risk Online content includes: • Test engine that provides full-length practice exams and customized quizzes by chapter or by exam domain • Access to entire book PDF","language":"en","currency":"USD","id":"1260461793","title":"CompTIA Cloud Essentials+ Certification Study Guide, Second Edition (Exam CLO-002)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=S2TNDwAAQBAJ&source=gbs_api","authors":["Daniel Lachance"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T1fTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Big Data enthusiast and wish to use Hadoop v2 to solve your problems, then this book is for you. This book is for Java programmers with little to moderate knowledge of Hadoop MapReduce. This is also a one-stop reference for developers and system admins who want to quickly get up to speed with using Hadoop v2. It would be helpful to have a basic knowledge of software development using Java and a basic working knowledge of Linux.","language":"en","currency":"USD","id":"1783285486","title":"Hadoop MapReduce v2 Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T1fTBgAAQBAJ&source=gbs_api","authors":["Thilina Gunarathne"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H7VCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Your essential guide to key programming features in Microsoft SQL Server 2012 Take your database programming skills to a new level—and build customized applications using the developer tools introduced with SQL Server 2012. This hands-on reference shows you how to design, test, and deploy SQL Server databases through tutorials, practical examples, and code samples. If you’re an experienced SQL Server developer, this book is a must-read for learning how to design and build effective SQL Server 2012 applications. Discover how to: Build and deploy databases using the SQL Server Data Tools IDE Query and manipulate complex data with powerful Transact-SQL enhancements Integrate non-relational features, including native file streaming and geospatial data types Consume data with Microsoft ADO.NET, LINQ, and Entity Framework Deliver data using Windows Communication Foundation (WCF) Data Services and WCF RIA Services Move your database to the cloud with Windows Azure SQL Database Develop Windows Phone cloud applications using SQL Data Sync Use SQL Server BI components, including xVelocity in-memory technologies","language":"en","currency":"USD","id":"0735675287","title":"Programming Microsoft SQL Server 2012","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H7VCAwAAQBAJ&source=gbs_api","authors":["Andrew Brust","Leonard G. Lobel"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SohgCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":63.99,"subtitle":"19th East European Conference, ADBIS 2015, Poitiers, France, September 8-11, 2015, Proceedings","description":"This book constitutes the thoroughly refereed proceedings of the 19th East European Conference on Advances in Databases and Information Systems, ADBIS 2015, held in Poitiers, France, in September 2015. The 31 full papers and 18 short papers presented were carefully selected and reviewed from 135 submissions. The papers are organized in topical sections such as database theory and access methods; user requirements and database evolution; multidimensional modeling and OLAP; ETL; transformation, extraction and archiving; modeling and ontologies; time series processing; performance and tuning; advanced query processing; approximation and skyline; confidentiality and trust.","language":"en","currency":"USD","id":"3319231359","title":"Advances in Databases and Information Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SohgCgAAQBAJ&source=gbs_api","authors":["Morzy Tadeusz","Patrick Valduriez","Ladjel Bellatreche"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_KI9DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":104,"subtitle":null,"description":"Big Data Analytics for Sensor-Network Collected Intelligence explores state-of-the-art methods for using advanced ICT technologies to perform intelligent analysis on sensor collected data. The book shows how to develop systems that automatically detect natural and human-made events, how to examine people’s behaviors, and how to unobtrusively provide better services. It begins by exploring big data architecture and platforms, covering the cloud computing infrastructure and how data is stored and visualized. The book then explores how big data is processed and managed, the key security and privacy issues involved, and the approaches used to ensure data quality. In addition, readers will find a thorough examination of big data analytics, analyzing statistical methods for data analytics and data mining, along with a detailed look at big data intelligence, ubiquitous and mobile computing, and designing intelligence system based on context and situation. Indexing: The books of this series are submitted to EI-Compendex and SCOPUS Contains contributions from noted scholars in computer science and electrical engineering from around the globe Provides a broad overview of recent developments in sensor collected intelligence Edited by a team comprised of leading thinkers in big data analytics","language":"en","currency":"USD","id":"012809625X","title":"Big Data Analytics for Sensor-Network Collected Intelligence","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_KI9DQAAQBAJ&source=gbs_api","authors":["Hui-Huang Hsu","Chuan-Yu Chang","Ching-Hsien Hsu"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nV80DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. Master Oracle Database 12c Release 2 testing and tuning Seamlessly transition to Oracle Database 12c Release 2 and achieve peak performance using the step-by-step instruction and best practices contained in this Oracle Press guide. Written by a team of Oracle ACEs, Oracle Database 12c Release 2 Testing Tools and Techniques for Performance and Scalability clearly explains how to identify, investigate, and resolve performance issues. You will discover how to use troubleshooting tools and test rigs, optimize code and queries, evaluate database performance, perform realistic application testing, capture and replay actual production workloads, and employ Oracle Database In-Memory. •Establish benchmarks and evaluate application workload performance •Configure and deploy SQL Tuning Advisor and SQL Access Advisor •Maximize efficiency using Oracle Database In-Memory and In-Memory Advisor •Identify and repair poorly running code with SQL Monitor •Uncover database problems using Real-Time ADDM and Emergency Monitoring •Work with database workload capture and replay •Analyze third-party code with Workload Intelligence •Identify database objects that will benefit most from In-Memory Column Store (IMCS) •Monitor and manage IMCS objects with In-Memory Central","language":"en","currency":"USD","id":"1260025977","title":"Oracle Database 12c Release 2 Testing Tools and Techniques for Performance and Scalability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nV80DwAAQBAJ&source=gbs_api","authors":["Jim Czuprynski","Deiby Gomez","Bert Scalzo"]},{"pageCount":162,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7XIzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"Concepts, Technologies and Applications","description":"Big data technologies are used to achieve any type of analytics in a fast and predictable way, thus enabling better human and machine level decision making. Principles of distributed computing are the keys to big data technologies and analytics. The mechanisms related to data storage, data access, data transfer, visualization and predictive modeling using distributed processing in multiple low cost machines are the key considerations that make big data analytics possible within stipulated cost and time practical for consumption by human and machines. However, the current literature available in big data analytics needs a holistic perspective to highlight the relation between big data analytics and distributed processing for ease of understanding and practitioner use. This book fills the literature gap by addressing key aspects of distributed processing in big data analytics. The chapters tackle the essential concepts and patterns of distributed computing widely used in big data analytics. This book discusses also covers the main technologies which support distributed processing. Finally, this book provides insight into applications of big data analytics, highlighting how principles of distributed computing are used in those situations. Practitioners and researchers alike will find this book a valuable tool for their work, helping them to select the appropriate technologies, while understanding the inherent strengths and drawbacks of those technologies.","language":"en","currency":"USD","id":"3319598341","title":"Distributed Computing in Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7XIzDwAAQBAJ&source=gbs_api","authors":["Sourav Mazumder","Robin Singh Bhadoria","Ganesh Chandra Deka"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JupaBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you have interest in DynamoDB and want to know what DynamoDB is all about and become proficient in using it, this is the book for you. If you are an intermediate user who wishes to enhance your knowledge of DynamoDB, this book is aimed at you. Basic familiarity with programming, NoSQL, and cloud computing concepts would be helpful.","language":"en","currency":"USD","id":"1783551968","title":"Mastering DynamoDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JupaBAAAQBAJ&source=gbs_api","authors":["Tanmay Deshpande"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jTflCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Learn to process massive real-time data streams using Storm and Python—no Java required! About This Book Learn to use Apache Storm and the Python Petrel library to build distributed applications that process large streams of data Explore sample applications in real-time and analyze them in the popular NoSQL databases MongoDB and Redis Discover how to apply software development best practices to improve performance, productivity, and quality in your Storm projects Who This Book Is For This book is intended for Python developers who want to benefit from Storm's real-time data processing capabilities. If you are new to Python, you'll benefit from the attention to key supporting tools and techniques such as automated testing, virtual environments, and logging. If you're an experienced Python developer, you'll appreciate the thorough and detailed examples What You Will Learn Install Storm and learn about the prerequisites Get to know the components of a Storm topology and how to control the flow of data between them Ingest Twitter data directly into Storm Use Storm with MongoDB and Redis Build topologies and run them in Storm Use an interactive graphical debugger to debug your topology as it's running in Storm Test your topology components outside of Storm Configure your topology using YAML In Detail Big data is a trending concept that everyone wants to learn about. With its ability to process all kinds of data in real time, Storm is an important addition to your big data “bag of tricks.” At the same time, Python is one of the fastest-growing programming languages today. It has become a top choice for both data science and everyday application development. Together, Storm and Python enable you to build and deploy real-time big data applications quickly and easily. You will begin with some basic command tutorials to set up storm and learn about its configurations in detail. You will then go through the requirement scenarios to create a Storm cluster. Next, you'll be provided with an overview of Petrel, followed by an example of Twitter topology and persistence using Redis and MongoDB. Finally, you will build a production-quality Storm topology using development best practices. Style and approach This book takes an easy-to-follow and a practical approach to help you understand all the concepts related to Storm and Python.","language":"en","currency":"USD","id":"1784392871","title":"Building Python Real-Time Applications with Storm","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jTflCwAAQBAJ&source=gbs_api","authors":["Kartik Bhatnagar","Barry Hart"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6mihCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":151.2,"subtitle":null,"description":"This proceedings volume contains selected papers that were presented in the 3rd International Symposium on Big data and Cloud Computing Challenges, 2016 held at VIT University, India on March 10 and 11. New research issues, challenges and opportunities shaping the future agenda in the field of Big Data and Cloud Computing are identified and presented throughout the book, which is intended for researchers, scholars, students, software developers and practitioners working at the forefront in their field. This book acts as a platform for exchanging ideas, setting questions for discussion, and sharing the experience in Big Data and Cloud Computing domain.​","language":"en","currency":"USD","id":"3319303481","title":"Proceedings of the 3rd International Symposium on Big Data and Cloud Computing Challenges (ISBCC – 16’)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6mihCwAAQBAJ&source=gbs_api","authors":["V. Vijayakumar","V. Neelanarayanan"]},{"pageCount":349,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wtALCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"This new edition is a hands-on guide for developers and administrators who want to use the power and flexibility of Couchbase Server 4.0 in their applications. The second edition extends coverage of N1QL, the SQL-like query language for Couchbase. It also brings coverage of multiple new features, including the new generation of client SDKs, security and LDAP integration, secondary indexes, and multi-dimensional scaling. Pro Couchbase Server covers everything you need to develop Couchbase solutions and deploy them in production. The NoSQL movement has fundamentally changed the database world in recent years. Influenced by the growing needs of web-scale applications, NoSQL databases such as Couchbase Server provide new approaches to scalability, reliability, and performance. Never have document databases been so powerful and performant. With the power and flexibility of Couchbase Server, you can model your data however you want, and easily change the data model any time you want. Pro Couchbase Server shows what is possible and helps you take full advantage of Couchbase Server and all the performance and scalability that it offers. Helps you design and develop a document database using Couchbase Server. Covers the latest features such as the N1QL query language. Gives you the tools to scale out your application as needed.","language":"en","currency":"USD","id":"1484211855","title":"Pro Couchbase Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wtALCwAAQBAJ&source=gbs_api","authors":["David Ostrovsky","Yaniv Rodenski","Mohammed Haji"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=R3i7BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"6th International Conference, IDCS 2013, Hangzhou, China, October 28-30, 2013, Proceedings","description":"This book constitutes the refereed proceedings of the 6th International Conference on Internet and Distributed Computing Systems, IDCS 2013, held in Hangzhou, China, in October 2013. The 20 revised full papers and 13 invited papers presented were carefully reviewed and selected from numerous submissions. The papers cover the following topics: ad-hoc and sensor networks, internet and Web technologies, network operations and management, information infrastructure; resilience, as well as fault tolerance and availability.","language":"en","currency":"USD","id":"3642414281","title":"Internet and Distributed Computing Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=R3i7BQAAQBAJ&source=gbs_api","authors":["Mukaddim Pathan","Guiyi Wei","Giancarlo Fortino"]},{"pageCount":805,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QWZNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Guide to Building the Technology Stack for Turning Data Lakes into Business Assets","description":"Learn how to build a data science technology stack and perform good data science with repeatable methods. You will learn how to turn data lakes into business assets. The data science technology stack demonstrated in Practical Data Science is built from components in general use in the industry. Data scientist Andreas Vermeulen demonstrates in detail how to build and provision a technology stack to yield repeatable results. He shows you how to apply practical methods to extract actionable business knowledge from data lakes consisting of data from a polyglot of data types and dimensions. What You'll Learn Become fluent in the essential concepts and terminology of data science and data engineering Build and use a technology stack that meets industry criteria Master the methods for retrieving actionable business knowledge Coordinate the handling of polyglot data types in a data lake for repeatable results Who This Book Is For Data scientists and data engineers who are required to convert data from a data lake into actionable knowledge for their business, and students who aspire to be data scientists and data engineers","language":"en","currency":"USD","id":"148423054X","title":"Practical Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QWZNDwAAQBAJ&source=gbs_api","authors":["Andreas François Vermeulen"]},{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GvsjdHMI1FQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":25.99,"subtitle":null,"description":"Learn What Usability Really Is, Why to Strive for It, and How to Achieve It \"Highly useable\" software is easy to use. It does what you expect it to. And it does it well. It's not easy to build but as this book demonstrates, it's well worth the effort. Highly useable software is highly successful software—and everyone wins. Inside, an accomplished programmer who has made usability his business systematically explores the world of programming, showing you how every aspect of the work is implicated in the usability of the final product. This is not just an \"issues\" book, however, but systematic, real-world instructions for developing applications that are better in every way. As you'll learn, there's no such thing as \"intuitive\" software. Instead, there are just the factors that make it highly useable: simplicity, consistency, the recognition of accepted conventions, and the foregrounding of the user's perspective. With these principles under your belt, you'll quickly discover dozens of ways to make your applications more useable: Making windows and dialog boxes easy to comprehend and use Designing software that is time- and resource-efficient Making your software easy to navigate Reducing the complexity of reports and other presentations of data Understanding how the wrong programming decisions can limit usability Ensuring smooth starts and stops Capitalizing on the usability advantages of object-oriented programming Understanding how usability affects your product's financial success Using the testing process to improve usability Promoting usability in training, installation, and online help Making management decisions that will benefit software usability Some chapters are written primarily for programmers, one primarily for managers. Most are for everyone, and all are filled with illuminating, usually amusing examples drawn from both inside and outside the technical world. A helpful appendix provides information on standards, usability groups, and sources for more information.","language":"en","currency":"USD","id":"9780470113189","title":"Designing Highly Useable Software","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GvsjdHMI1FQC&source=gbs_api","authors":["Jeff Cogswell"]},{"pageCount":464,"thumbnail":"http:\/\/books.google.com\/books\/content?id=k86PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Improve your marketing strategies with machine learning using Python and R","description":"Optimize your marketing strategies through analytics and machine learning Key Features Understand how data science drives successful marketing campaigns Use machine learning for better customer engagement, retention, and product recommendations Extract insights from your data to optimize marketing strategies and increase profitability Book Description Regardless of company size, the adoption of data science and machine learning for marketing has been rising in the industry. With this book, you will learn to implement data science techniques to understand the drivers behind the successes and failures of marketing campaigns. This book is a comprehensive guide to help you understand and predict customer behaviors and create more effectively targeted and personalized marketing strategies. This is a practical guide to performing simple-to-advanced tasks, to extract hidden insights from the data and use them to make smart business decisions. You will understand what drives sales and increases customer engagements for your products. You will learn to implement machine learning to forecast which customers are more likely to engage with the products and have high lifetime value. This book will also show you how to use machine learning techniques to understand different customer segments and recommend the right products for each customer. Apart from learning to gain insights into consumer behavior using exploratory analysis, you will also learn the concept of A\/B testing and implement it using Python and R. By the end of this book, you will be experienced enough with various data science and machine learning techniques to run and manage successful marketing campaigns for your business. What you will learn Learn how to compute and visualize marketing KPIs in Python and R Master what drives successful marketing campaigns with data science Use machine learning to predict customer engagement and lifetime value Make product recommendations that customers are most likely to buy Learn how to use A\/B testing for better marketing decision making Implement machine learning to understand different customer segments Who this book is for If you are a marketing professional, data scientist, engineer, or a student keen to learn how to apply data science to marketing, this book is what you need! It will be beneficial to have some basic knowledge of either Python or R to work through the examples. This book will also be beneficial for beginners as it covers basic-to-advanced data science concepts and applications in marketing with real-life examples.","language":"en","currency":"USD","id":"178934882X","title":"Hands-On Data Science for Marketing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=k86PDwAAQBAJ&source=gbs_api","authors":["Yoon Hyup Hwang"]},{"pageCount":422,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O5J39gk63BYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.36,"subtitle":null,"description":"Temporal database systems are systems that provide special support for storing, querying, and updating historical and\/or future data. Current DBMSs provide essentially no temporal features at all, but this situation is likely to change soon for a variety of reasons; in fact, temporal databases are virtually certain to become important sooner rather than later, in the commercial world as well as in academia. This book provides an in-depth description of the foundations and principles on which those temporal DBMSs will be built. These foundations and principles are firmly rooted in the relational model of data; thus, they represent an evolutionary step, not a revolutionary one, and they will stand the test of time. This book is arranged in three parts and a set of appendixes: * Preliminaries: Provides a detailed review of the relational model, and an overview of the Tutorial D language. * Laying the Foundations: Explains basic temporal data problems and introduces fundamental constructs and operators for addressing those problems. * Building on the Foundations: Applies the material of the previous part to issues of temporal database design, temporal constraints, temporal query and update, and much more. * Appendixes: Include annotated references and bibliography, implementation considerations, and other topics. Key features: * Describes a truly relational approach to the temporal data problem. * Addresses implementation as well as model issues. * Covers recent research on new database design techniques, a new normal form, new relational operators, new update operators, a new approach to the problem of \"granularity,\" support for \"cyclic point types,\" and other matters. * Includes review questions and exercises in every chapter. * Suitable for both reference and tutorial purposes.","language":"en","currency":"USD","id":"0080518710","title":"Temporal Data & the Relational Model","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O5J39gk63BYC&source=gbs_api","authors":["C.J. Date","Hugh Darwen","Nikos Lorentzos"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=94LoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Query and manipulate databases from popular relational database servers using SQL","description":"Learn everything you need to know to build efficient SQL queries using this easy-to-follow beginner’s guide Key Features Explore all SQL statements in depth using a variety of examples Get to grips with database querying, data aggregate, manipulation, and much more Understand how to explore and process data of varying complexity to tell a story Book Description SQL is a powerful querying language that's used to store, manipulate, and retrieve data, and it is one of the most popular languages used by developers to query and analyze data efficiently. If you're looking for a comprehensive introduction to SQL, Learn SQL Database Programming will help you to get up to speed with using SQL to streamline your work in no time. Starting with an overview of relational database management systems, this book will show you how to set up and use MySQL Workbench and design a database using practical examples. You'll also discover how to query and manipulate data with SQL programming using MySQL Workbench. As you advance, you’ll create a database, query single and multiple tables, and modify data using SQL querying. This SQL book covers advanced SQL techniques, including aggregate functions, flow control statements, error handling, and subqueries, and helps you process your data to present your findings. Finally, you’ll implement best practices for writing SQL and designing indexes and tables. By the end of this SQL programming book, you’ll have gained the confidence to use SQL queries to retrieve and manipulate data. What you will learn Install, configure, and use MySQL Workbench to restore a database Explore different data types such as string, numeric, and date and time Query a single table using the basic SQL SELECT statement and the FROM, WHERE, and ORDER BY clauses Query multiple tables by understanding various types of table relationships Modify data in tables using the INSERT, UPDATE, and DELETE statements Use aggregate functions to group and summarize data Detect bad data, duplicates, and irrelevant values while processing data Who this book is for This book is for business analysts, SQL developers, database administrators, and students learning SQL. If you want to learn how to query and manipulate SQL data for database administration tasks or simply extract and organize relevant data for analysis, you’ll find this book useful. No prior SQL experience is required.","language":"en","currency":"USD","id":"1838981705","title":"Learn SQL Database Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=94LoDwAAQBAJ&source=gbs_api","authors":["Josephine Bush"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Vop4CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Tools and Technologies for Storing Your Company’s Data","description":"Network Storage: Tools and Technologies for Storing Your Company’s Data explains the changes occurring in storage, what they mean, and how to negotiate the minefields of conflicting technologies that litter the storage arena, all in an effort to help IT managers create a solid foundation for coming decades. The book begins with an overview of the current state of storage and its evolution from the network perspective, looking closely at the different protocols and connection schemes and how they differentiate in use case and operational behavior. The book explores the software changes that are motivating this evolution, ranging from data management, to in-stream processing and storage in virtual systems, and changes in the decades-old OS stack. It explores Software-Defined Storage as a way to construct storage networks, the impact of Big Data, high-performance computing, and the cloud on storage networking. As networks and data integrity are intertwined, the book looks at how data is split up and moved to the various appliances holding that dataset and its impact. Because data security is often neglected, users will find a comprehensive discussion on security issues that offers remedies that can be applied. The book concludes with a look at technologies on the horizon that will impact storage and its networks, such as NVDIMMs, The Hybrid Memory Cube, VSANs, and NAND Killers. Puts all the new developments in storage networking in a clear perspective for near-term and long-term planning Offers a complete overview of storage networking, serving as a go-to resource for creating a coherent implementation plan Provides the details needed to understand the area, and clears a path through the confusion and hype that surrounds such a radical revolution of the industry","language":"en","currency":"USD","id":"0128038659","title":"Network Storage","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Vop4CgAAQBAJ&source=gbs_api","authors":["James O'Reilly"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":166,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BJNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":"Patterns and Paradigms for Scalable, Reliable Services","description":"Without established design patterns to guide them, developers have had to build distributed systems from scratch, and most of these systems are very unique indeed. Today, the increasing use of containers has paved the way for core distributed system patterns and reusable containerized components. This practical guide presents a collection of repeatable, generic patterns to help make the development of reliable distributed systems far more approachable and efficient. Author Brendan Burns—Director of Engineering at Microsoft Azure—demonstrates how you can adapt existing software design patterns for designing and building reliable distributed applications. Systems engineers and application developers will learn how these long-established patterns provide a common language and framework for dramatically increasing the quality of your system. Understand how patterns and reusable components enable the rapid development of reliable distributed systems Use the side-car, adapter, and ambassador patterns to split your application into a group of containers on a single machine Explore loosely coupled multi-node distributed patterns for replication, scaling, and communication between the components Learn distributed system patterns for large-scale batch data processing covering work-queues, event-based processing, and coordinated workflows","language":"en","currency":"USD","id":"1491983604","title":"Designing Distributed Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BJNDwAAQBAJ&source=gbs_api","authors":["Brendan Burns"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HfcMDvxb43AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"For all the buzz about trendy IT techniques, data processing is still at the core of our systems, especially now that enterprises all over the world are confronted with exploding volumes of data. Database performance has become a major headache, and most IT departments believe that developers should provide simple SQL code to solve immediate problems and let DBAs tune any \"bad SQL\" later. In The Art of SQL, author and SQL expert Stephane Faroult argues that this \"safe approach\" only leads to disaster. His insightful book, named after Art of War by Sun Tzu, contends that writing quick inefficient code is sweeping the dirt under the rug. SQL code may run for 5 to 10 years, surviving several major releases of the database management system and on several generations of hardware. The code must be fast and sound from the start, and that requires a firm understanding of SQL and relational theory. The Art of SQL offers best practices that teach experienced SQL users to focus on strategy rather than specifics. Faroult's approach takes a page from Sun Tzu's classic treatise by viewing database design as a military campaign. You need knowledge, skills, and talent. Talent can't be taught, but every strategist from Sun Tzu to modern-day generals believed that it can be nurtured through the experience of others. They passed on their experience acquired in the field through basic principles that served as guiding stars amid the sound and fury of battle. This is what Faroult does with SQL. Like a successful battle plan, good architectural choices are based on contingencies. What if the volume of this or that table increases unexpectedly? What if, following a merger, the number of users doubles? What if you want to keep several years of data online? Faroult's way of looking at SQL performance may be unconventional and unique, but he's deadly serious about writing good SQL and using SQL well. The Art of SQL is not a cookbook, listing problems and giving recipes. The aim is to get you-and your manager-to raise good questions.","language":"en","currency":"USD","id":"9780596555368","title":"The Art of SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HfcMDvxb43AC&source=gbs_api","authors":["Stephane Faroult","Peter Robson"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T9iPeex6W9sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":null,"description":"Expert Oracle GoldenGate is a hands-on guide to creating and managing complex data replication environments using the latest in database replication technology from Oracle. GoldenGate is the future in replication technology from Oracle, and aims to be best-of-breed. GoldenGate supports homogeneous replication between Oracle databases. It supports heterogeneous replication involving other brands such as Microsoft SQL Server and IBM DB2 Universal Server. GoldenGate is high-speed, bidirectional, highly-parallelized, and makes only a light impact on the performance of databases involved in replication. The authors share their experience in the form of tutorials on designing and implementing all types of Oracle GoldenGate environments. You’ll learn methods for tuning Oracle GoldenGate performance. You’ll discover GoldenGate’s utility as a migration and extract, transform, load (ETL) tool. You’ll learn to configure highly-available environments involving GoldenGate, Real Application Clusters, and Data Guard. From installation to design to implementation and troubleshooting, Expert Oracle GoldenGate helps you master all aspects of using and applying Oracle GoldenGate as the replication tool of choice in your environment. Explains all aspects of using GoldenGate for replication Covers homogeneous, heterogeneous, and bidirectional replication Shows the use of GoldenGate for data migration and extract, transform, load (ETL)","language":"en","currency":"USD","id":"1430235675","title":"Expert Oracle GoldenGate","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T9iPeex6W9sC&source=gbs_api","authors":["Ben Prusinski","Steve Phillips","Shing Chung"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_2SV_0aGtPEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.16,"subtitle":"Second Edition","description":"This comprehensive book instructs IT managers to adhere to federally mandated compliance requirements. FISMA Compliance Handbook Second Edition explains what the requirements are for FISMA compliance and why FISMA compliance is mandated by federal law. The evolution of Certification and Accreditation is discussed. This book walks the reader through the entire FISMA compliance process and includes guidance on how to manage a FISMA compliance project from start to finish. The book has chapters for all FISMA compliance deliverables and includes information on how to conduct a FISMA compliant security assessment. Various topics discussed in this book include the NIST Risk Management Framework, how to characterize the sensitivity level of your system, contingency plan, system security plan development, security awareness training, privacy impact assessments, security assessments and more. Readers will learn how to obtain an Authority to Operate for an information system and what actions to take in regards to vulnerabilities and audit findings. FISMA Compliance Handbook Second Edition, also includes all-new coverage of federal cloud computing compliance from author Laura Taylor, the federal government’s technical lead for FedRAMP, the government program used to assess and authorize cloud products and services. Includes new information on cloud computing compliance from Laura Taylor, the federal government’s technical lead for FedRAMP Includes coverage for both corporate and government IT managers Learn how to prepare for, perform, and document FISMA compliance projects This book is used by various colleges and universities in information security and MBA curriculums","language":"en","currency":"USD","id":"0124059155","title":"FISMA Compliance Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_2SV_0aGtPEC&source=gbs_api","authors":["Laura P. Taylor"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YFFBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.49,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. A fully updated CompTIA Security+ exam guide from training and exam preparation expert Mike Meyers Take the CompTIA Security+ exam (exam SY0-501) with confidence using the comprehensive information contained in this highly effective study resource. Like the exam, the guide goes beyond knowledge application and is designed to ensure that security personnel anticipate security risks and guard against them. In Mike Meyers’ CompTIA Security+ Certification Guide, Second Edition (Exam SY0-501), the bestselling author and leading authority on CompTIA A+ certification brings his proven methodology to IT security. Mike covers all exam objectives in small, digestible modules that allow you to focus on individual skills as you move through a broad and complex set of skills and concepts. The book features hundreds of accurate practice questions as well as a toolbox of the author’s favorite network security related freeware\/shareware. • Provides complete coverage of every objective on exam SY0-501 • Electronic content includes 20+ lab simulations, video training, and hundreds of practice exam questions • Written by computer security and certification guru Mike Meyers","language":"en","currency":"USD","id":"1260026388","title":"Mike Meyers' CompTIA Security+ Certification Guide, Second Edition (Exam SY0-501)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YFFBDwAAQBAJ&source=gbs_api","authors":["Mike Meyers","Scott Jernigan"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gjyd3IOrwz4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"What can you do when database performance doesn't meet expectations? Before you turn to expensive hardware upgrades to solve the problem, reach for this book. Refactoring SQL Applications provides a set of tested options for making code modifications to dramatically improve the way your database applications function. Backed by real-world examples, you'll find quick fixes for simple problems, in-depth answers for more complex situations, and complete solutions for applications with extensive problems. Learn to: Determine if and where you can expect performance gains Apply quick fixes, such as limiting calls to the database in stored functions and procedures Refactor tasks, such as replacing application code by a stored procedure, or replacing iterative, procedural statements with sweeping SQL statements Refactor flow by increasing parallelism and switching business-inducted processing from synchronous to asynchronous Refactor design using schema extensions, regular views, materialized views, partitioning, and more Compare before and after versions of a program to ensure you get the same results once you make modifications Refactoring SQL Applications teaches you to recognize and assess code that needs refactoring, and to understand the crucial link between refactoring and performance. If and when your application bogs down, this book will help you get it back up to speed.","language":"en","currency":"USD","id":"9780596551773","title":"Refactoring SQL Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gjyd3IOrwz4C&source=gbs_api","authors":["Stephane Faroult","Pascal L'Hermite"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QU88BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Oracle Endeca Information Discovery Best Practices Maximize the powerful capabilities of this self-service enterprise data discovery platform. Master Competitive Analytics with Oracle Endeca Information Discovery reveals how to unlock insights from any type of data, regardless of structure. The first part of the book is a complete technical guide to the product's architecture, components, and implementation. The second part presents a comprehensive collection of business analytics use cases in various industries, including financial services, healthcare, research, manufacturing, retail, consumer packaged goods, and public sector. Step-by-step instructions on implementing some of these use cases are included in this Oracle Press book. Install and manage Oracle Endeca Server Design Oracle Endeca Information Discovery Studio visualizations to facilitate user-driven data exploration and discovery Enable enterprise-driven data exploration with Oracle Endeca Information Discovery Integrator Develop and implement a fraud detection and analysis application Build a healthcare correlation application that integrates claims, patient, and operations analysis; partners; clinical research; and remote monitoring Use an enterprise architecture approach to incrementally establish big data and analytical capabilities","language":"en","currency":"USD","id":"0071833196","title":"Master Competitive Analytics with Oracle Endeca Information Discovery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QU88BAAAQBAJ&source=gbs_api","authors":["Helen Sun","William Smith"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cYDQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This effective study guide provides 100% coverage of every topic on the challenging CCSK exam from the Cloud Security Alliance This highly effective self-study guide covers all domains of the challenging Certificate of Cloud Security Knowledge v4 exam. Written by a cloud security trainer and consultant in collaboration with the Cloud Security Alliance, CCSK Certificate of Cloud Security Knowledge All-in-One Exam Guide offers clear explanations, real-world examples, and practice questions that match the content and format of those on the actual exam. To aid in retention, each chapter includes exam tips that highlight key information, a review that serves as a quick recap of salient points, and practice questions that allow you to test your comprehension. Sample cloud policies and a glossary of key terms are also provided. COVERS ALL EXAM TOPICS, INCLUDING: • Cloud Computing Concepts and Architectures • Governance and Enterprise Risk Management • Legal Issues, Contracts, and Electronic Discovery • Compliance and Audit Management • Information Governance • Management Plane and Business Continuity • Infrastructure Security • Virtualization and Containers • Incident Response • Application Security • Data Security and Encryption • Identity, Entitlement, and Access Management • Security as a Service • Related Technologies • ENISA Cloud Computing: Benefits, Risks, and Recommendations for Information Security Online content includes: • 120 practice exam questions • Test engine that provides full-length practice exams and customizable quizzes by exam topic","language":"en","currency":"USD","id":"1260460096","title":"CCSK Certificate of Cloud Security Knowledge All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cYDQDwAAQBAJ&source=gbs_api","authors":["Graham Thompson"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6WPjLbZU_wEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"By following a simple ticket booking example, you will learn how to use each of Infinispan's features in the real-world. Lots of practical examples and screenshots help you to get to grips with Infinispan quickly and easily..This book is for Enterprise developers and architects who want to use a distributed caching and data grid solution. You should have programming knowledge of Java and a general familiarity with concepts like data caching and clustering.","language":"en","currency":"USD","id":"1849518238","title":"Infinispan Data Grid Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6WPjLbZU_wEC&source=gbs_api","authors":["Francesco Marchioni","Manik Surtani"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GjlUXVLruCQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A complete guide to building EJB 3.0 database persistent applications with Oracle Fusion Middleware 11g tools with this book and eBook.","language":"en","currency":"USD","id":"1849681570","title":"EJB 3.0 Database Persistence with Oracle Fusion Middleware 11g","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GjlUXVLruCQC&source=gbs_api","authors":["Deepak Vohra"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=s2RgGxd572QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17,"subtitle":"Querying and Updating with SPARQL 1.1","description":"Gain hands-on experience with SPARQL, the RDF query language that’s bringing new possibilities to semantic web, linked data, and big data projects. This updated and expanded edition shows you how to use SPARQL 1.1 with a variety of tools to retrieve, manipulate, and federate data from the public web as well as from private sources. Author Bob DuCharme has you writing simple queries right away before providing background on how SPARQL fits into RDF technologies. Using short examples that you can run yourself with open source software, you’ll learn how to update, add to, and delete data in RDF datasets. Get the big picture on RDF, linked data, and the semantic web Use SPARQL to find bad data and create new data from existing data Use datatype metadata and functions in your queries Learn techniques and tools to help your queries run more efficiently Use RDF Schemas and OWL ontologies to extend the power of your queries Discover the roles that SPARQL can play in your applications","language":"en","currency":"USD","id":"1449371477","title":"Learning SPARQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=s2RgGxd572QC&source=gbs_api","authors":["Bob DuCharme"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_QBEAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":null,"description":"The Social Web (including services such as MySpace, Flickr, last.fm, and WordPress) has captured the attention of millions of users as well as billions of dollars in investment and acquisition. Social websites, evolving around the connections between people and their objects of interest, are encountering boundaries in the areas of information integration, dissemination, reuse, portability, searchability, automation and demanding tasks like querying. The Semantic Web is an ideal platform for interlinking and performing operations on diverse person- and object-related data available from the Social Web, and has produced a variety of approaches to overcome the boundaries being experienced in Social Web application areas. After a short overview of both the Social Web and the Semantic Web, Breslin et al. describe some popular social media and social networking applications, list their strengths and limitations, and describe some applications of Semantic Web technology to address their current shortcomings by enhancing them with semantics. Across these social websites, they demonstrate a twofold approach for interconnecting the islands that are social websites with semantic technologies, and for powering semantic applications with rich community-created content. They conclude with observations on how the application of Semantic Web technologies to the Social Web is leading towards the \"Social Semantic Web\" (sometimes also called \"Web 3.0\"), forming a network of interlinked and semantically-rich content and knowledge. The book is intended for computer science professionals, researchers, and graduates interested in understanding the technologies and research issues involved in applying Semantic Web technologies to social software. Practitioners and developers interested in applications such as blogs, social networks or wikis will also learn about methods for increasing the levels of automation in these forms of Web communication.","language":"en","currency":"USD","id":"3642011721","title":"The Social Semantic Web","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_QBEAAAAQBAJ&source=gbs_api","authors":["John G Breslin","Alexandre Passant","Stefan Decker"]},{"pageCount":25,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BLjKCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® RedpaperTM publication provides the details for setting up an environment on AIX 7.1 on an IBM Power Systems S824 so you can install and upgrade Oracle E-Business Suite Release 12.2. It provides a step-by-step installation of Oracle E-Business Suite Release 12.2 for AIX 7.1. This document also provides a consolidated list of database and application tier patches to upgrade Oracle E-Business Suite from release 12.2.0 to 12.2.4, and explains how to apply patches. This document is written for those who are newly installing Oracle E-Business Suite Release 12.2 version 12.2.0 and upgrading to 12.2.4 on an IBM Power SystemsTM server with AIX® 7.1. It provides a sample two-tier installation of Oracle E-Business Suite Release 12.2 version 12.2.0 on two AIX logical partitions and steps for upgrading to version 12.2.4. The sample installation of Oracle EBusiness Suite Release 12.2 version 12.2.0 and upgrade to 12.2.4 also proves their interoperability with IBM Power Systems servers with POWER8TM processor technology. This document assumes that the reader has an in-depth knowledge of IBM AIX, Oracle Database 11g, and Oracle E-Business Suite.","language":"en","currency":"USD","id":"0738454540","title":"Oracle E-Business Suite 12.2.4 Installation and Upgrade on IBM Power S824","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BLjKCgAAQBAJ&source=gbs_api","authors":["Kishore Radhakrishna","Ravisankar Shanmugam","IBM Redbooks"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ao8gCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"Relentlessly Practical Tools for Data Warehousing and Business Intelligence Remastered Collection","description":"The final edition of the incomparable data warehousing and business intelligence reference, updated and expanded The Kimball Group Reader, Remastered Collection is the essential reference for data warehouse and business intelligence design, packed with best practices, design tips, and valuable insight from industry pioneer Ralph Kimball and the Kimball Group. This Remastered Collection represents decades of expert advice and mentoring in data warehousing and business intelligence, and is the final work to be published by the Kimball Group. Organized for quick navigation and easy reference, this book contains nearly 20 years of experience on more than 300 topics, all fully up-to-date and expanded with 65 new articles. The discussion covers the complete data warehouse\/business intelligence lifecycle, including project planning, requirements gathering, system architecture, dimensional modeling, ETL, and business intelligence analytics, with each group of articles prefaced by original commentaries explaining their role in the overall Kimball Group methodology. Data warehousing\/business intelligence industry's current multi-billion dollar value is due in no small part to the contributions of Ralph Kimball and the Kimball Group. Their publications are the standards on which the industry is built, and nearly all data warehouse hardware and software vendors have adopted their methods in one form or another. This book is a compendium of Kimball Group expertise, and an essential reference for anyone in the field. Learn data warehousing and business intelligence from the field's pioneers Get up to date on best practices and essential design tips Gain valuable knowledge on every stage of the project lifecycle Dig into the Kimball Group methodology with hands-on guidance Ralph Kimball and the Kimball Group have continued to refine their methods and techniques based on thousands of hours of consulting and training. This Remastered Collection of The Kimball Group Reader represents their final body of knowledge, and is nothing less than a vital reference for anyone involved in the field.","language":"en","currency":"USD","id":"111923879X","title":"The Kimball Group Reader","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ao8gCwAAQBAJ&source=gbs_api","authors":["Ralph Kimball","Margy Ross"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IdPuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Practical Hadoop Security is an excellent resource for administrators planning a production Hadoop deployment who want to secure their Hadoop clusters. A detailed guide to the security options and configuration within Hadoop itself, author Bhushan Lakhe takes you through a comprehensive study of how to implement defined security within a Hadoop cluster in a hands-on way. You will start with a detailed overview of all the security options available for Hadoop, including popular extensions like Kerberos and OpenSSH, and then delve into a hands-on implementation of user security (with illustrated code samples) with both in-the-box features and with security extensions implemented by leading vendors. No security system is complete without a monitoring and tracing facility, so Practical Hadoop Security next steps you through audit logging and monitoring technologies for Hadoop, as well as ready to use implementation and configuration examples--again with illustrated code samples. The book concludes with the most important aspect of Hadoop security – encryption. Both types of encryptions, for data in transit and data at rest, are discussed at length with leading open source projects that integrate directly with Hadoop at no licensing cost. Practical Hadoop Security: Explains importance of security, auditing and encryption within a Hadoop installation Describes how the leading players have incorporated these features within their Hadoop distributions and provided extensions Demonstrates how to set up and use these features to your benefit and make your Hadoop installation secure without impacting performance or ease of use","language":"en","currency":"USD","id":"1430265450","title":"Practical Hadoop Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IdPuBQAAQBAJ&source=gbs_api","authors":["Bhushan Lakhe"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=djLDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24,"subtitle":null,"description":"Your logical, linear guide to the fundamentals of data science programming Data science is exploding—in a good way—with a forecast of 1.7 megabytes of new information created every second for each human being on the planet by 2020 and 11.5 million job openings by 2026. It clearly pays dividends to be in the know. This friendly guide charts a path through the fundamentals of data science and then delves into the actual work: linear regression, logical regression, machine learning, neural networks, recommender engines, and cross-validation of models. Data Science Programming All-In-One For Dummies is a compilation of the key data science, machine learning, and deep learning programming languages: Python and R. It helps you decide which programming languages are best for specific data science needs. It also gives you the guidelines to build your own projects to solve problems in real time. Get grounded: the ideal start for new data professionals What lies ahead: learn about specific areas that data is transforming Be meaningful: find out how to tell your data story See clearly: pick up the art of visualization Whether you’re a beginning student or already mid-career, get your copy now and add even more meaning to your life—and everyone else’s!","language":"en","currency":"USD","id":"1119626145","title":"Data Science Programming All-in-One For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=djLDDwAAQBAJ&source=gbs_api","authors":["John Paul Mueller","Luca Massaron"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n6nYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Applying Graph Thinking and Graph Technologies to Solve Complex Problems","description":"Graph data closes the gap between the way humans and computers view the world. While computers rely on static rows and columns of data, people navigate and reason about life through relationships. This practical guide demonstrates how graph data brings these two approaches together. By working with concepts from graph theory, database schema, distributed systems, and data analysis, you’ll arrive at a unique intersection known as graph thinking. Authors Denise Koessler Gosnell and Matthias Broecheler show data engineers, data scientists, and data analysts how to solve complex problems with graph databases. You’ll explore templates for building with graph technology, along with examples that demonstrate how teams think about graph data within an application. Build an example application architecture with relational and graph technologies Use graph technology to build a Customer 360 application, the most popular graph data pattern today Dive into hierarchical data and troubleshoot a new paradigm that comes from working with graph data Find paths in graph data and learn why your trust in different paths motivates and informs your preferences Use collaborative filtering to design a Netflix-inspired recommendation system","language":"en","currency":"USD","id":"1492044024","title":"The Practitioner's Guide to Graph Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n6nYDwAAQBAJ&source=gbs_api","authors":["Denise Gosnell","Matthias Broecheler"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6Sk0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Implement a High-Performance Enterprise Java Application Modernization Strategy Learn cutting-edge techniques and processes to systematically and strategically modernize legacy Java applications with predictability, consistency, and confidence. This Oracle Press guide offers an innovative blueprint that empowers corporate management teams to better understand necessary technical requirements and enables Java architects and developers to better align with agile business needs. Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio contains modernization approaches that offer end-to-end Java application portfolio visibility so that application modernization projects can stay on-schedule and within budget.","language":"en","currency":"USD","id":"0071842047","title":"Rapid Modernization of Java Applications: Practical Business and Technical Solutions for Upgrading Your Enterprise Portfolio","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6Sk0DwAAQBAJ&source=gbs_api","authors":["G. Venkat"]},{"pageCount":492,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6BsNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Foundations and Challenges","description":"This handbook offers a comprehensive overview of cloud computing security technology and implementation, while exploring practical solutions to a wide range of cloud computing security issues. With more organizations using cloud computing and cloud providers for data operations, proper security in these and other potentially vulnerable areas have become a priority for organizations of all sizes across the globe. Research efforts from both academia and industry in all security aspects related to cloud computing are gathered within one reference guide.","language":"en","currency":"USD","id":"1482260956","title":"Cloud Computing Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6BsNDgAAQBAJ&source=gbs_api","authors":["John R. Vacca"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ERCyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"A Sustainable Evolution Strategy","description":"This book focuses on software architecture and the value of architecture in the development of long-lived, mission-critical, trustworthy software-systems. The author introduces and demonstrates the powerful strategy of “Managed Evolution,” along with the engineering best practice known as “Principle-based Architecting.” The book examines in detail architecture principles for e.g., Business Value, Changeability, Resilience, and Dependability. The author argues that the software development community has a strong responsibility to produce and operate useful, dependable, and trustworthy software. Software should at the same time provide business value and guarantee many quality-of-service properties, including security, safety, performance, and integrity. As Dr. Furrer states, “Producing dependable software is a balancing act between investing in the implementation of business functionality and investing in the quality-of-service properties of the software-systems.” The book presents extensive coverage of such concepts as: Principle-Based Architecting Managed Evolution Strategy The Future Principles for Business Value Legacy Software Modernization\/Migration Architecture Principles for Changeability Architecture Principles for Resilience Architecture Principles for Dependability The text is supplemented with numerous figures, tables, examples and illustrative quotations. Future-Proof Software-Systems provides a set of good engineering practices, devised for integration into most software development processes dedicated to the creation of software-systems that incorporate Managed Evolution.","language":"en","currency":"USD","id":"3658199385","title":"Future-Proof Software-Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ERCyDwAAQBAJ&source=gbs_api","authors":["Frank J. Furrer"]},{"pageCount":631,"thumbnail":"http:\/\/books.google.com\/books\/content?id=466PDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":271.2,"subtitle":null,"description":"This book includes a selection of articles from The 2019 World Conference on Information Systems and Technologies (WorldCIST’19), held from April 16 to 19, at La Toja, Spain. WorldCIST is a global forum for researchers and practitioners to present and discuss recent results and innovations, current trends, professional experiences and challenges in modern information systems and technologies research, together with their technological development and applications. The book covers a number of topics, including A) Information and Knowledge Management; B) Organizational Models and Information Systems; C) Software and Systems Modeling; D) Software Systems, Architectures, Applications and Tools; E) Multimedia Systems and Applications; F) Computer Networks, Mobility and Pervasive Systems; G) Intelligent and Decision Support Systems; H) Big Data Analytics and Applications; I) Human–Computer Interaction; J) Ethics, Computers & Security; K) Health Informatics; L) Information Technologies in Education; M) Information Technologies in Radiocommunications; and N) Technologies for Biomedical Applications.","language":"en","currency":"USD","id":"3030161870","title":"New Knowledge in Information Systems and Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=466PDwAAQBAJ&source=gbs_api","authors":["Álvaro Rocha","Hojjat Adeli","Luís Paulo Reis","Sandra Costanzo"]},{"pageCount":390,"thumbnail":"http:\/\/books.google.com\/books\/content?id=enX6nXBceD0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":156,"subtitle":"Concepts and Competitive Analytics","description":"Provides developments and research, as well as current innovative activities in data warehousing and mining, focusing on the intersection of data warehousing and business intelligence.","language":"en","currency":"USD","id":"160566233X","title":"Progressive Methods in Data Warehousing and Business Intelligence: Concepts and Competitive Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=enX6nXBceD0C&source=gbs_api","authors":["Taniar, David"]},{"pageCount":603,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eGdLbRZ5AX0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Remixing Data and Web Services","description":"Mashups are hugely popular right now, a very important topic within the general area of Web 2.0, involving technologies such as CSS, JavaScript, Ajax, APIs, libraries, and server-side languages (such as PHP and ASP.NET.) This book aims to be the definitive tome on Mashup development, to stand in the middle of all the other, more API specific books coming out on Google Maps, Flickr, etc. The book shows how to create real world Mashups using all the most poplar APIs, such as Google Maps, Flickr, Amazon Web Services, and delicious, and includes examples in multiple different server-side languages, such as PHP, Java, and .NET.","language":"en","currency":"USD","id":"9781430202868","title":"Pro Web 2.0 Mashups","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eGdLbRZ5AX0C&source=gbs_api","authors":["Raymond Yee"]},{"pageCount":54,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T75KDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.57,"subtitle":null,"description":"Bachelorarbeit aus dem Jahr 2015 im Fachbereich Informatik - Software, Note: 1,7, Frankfurt University of Applied Sciences, ehem. Fachhochschule Frankfurt am Main, Sprache: Deutsch, Abstract: Für viele Unternehmen sind sie elementar wichtig, für Benutzer von Smartphones, Social Media-Anwendungen, Online-Shops sowie diverser Plattformen sind sie dagegen nicht von großer Bedeutung. Die Rede ist von \"Daten\". Da Daten aus Unternehmenssicht wichtige Informationen, wie zum Beispiel das Kaufverhalten eines Kunden reflektieren, spielen sie heutzutage eine wichtige Rolle bei der Gewinngenerierung. Beispielsweise versuchen Unternehmen anhand von verschiedenen BI-Lösungen, diese gespeicherten Daten auszuwerten, um eine Gewinnmaximierung zu erzielen. Laut der Digital-Universe-Studie von IDC verdoppelt sich der komplette Datenbestand alle zweieinhalb Jahre und soll im Jahre 2020 in Westeuropa auf fünf Zetabyte anwachsen. Die Studie besagt zudem, dass das Datenvolumen 2020 auf dem gesamten Globus 44 Zetabyte betragen wird. An einigen Beispielen lässt sich der explosiv wachsende Datenbestand aufzeigen: (1) Derzeit wären acht Jahre nötig, um alle Videos in YouTube, die täglich hochgeladen werden, anzuschauen. (2) Es werden in Facebook pro Minute 2,46 Millionen Inhalte geteilt. (3) Die Summe der Datensätze ist aktuell größer als die Zahl aller Sterne im Universum. Solch große Datenansammlungen, die aufgrund des Web 2.0 entstanden sind, brachten vor einigen Jahren das Trendwort \"BIG DATA\" hervor. Die Entwicklung von Big Data brachte vielen Unternehmen nicht nur profitable Informationen, sondern ließ auch deren Datenbanken und Datenbank-Management-Systeme an ihre Grenzen stoßen. Herausforderungen, wie z. B. die schnelle Verarbeitung vieler Datensätze, sind aufgrund der Komplexität und der Datenstruktur von relationalen Datenbank-Management-Systemen nicht mehr leicht zu bewältigen. Diese Herausforderungen stießen den Durchbruch der NoSQL-Datenbanken an. Diese Bachelorarbeit befasst sich mit folgendem Thema: Implementation und Test einer kleinen Videodatenbank mit CouchDB.","language":"de","currency":"USD","id":"3668630348","title":"Implementation und Test einer kleinen Videodatenbank mit CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T75KDwAAQBAJ&source=gbs_api","authors":["Taylan Basmara"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mB8wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.5,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This fully updated, exam-focused study aid covers everything you need to know and shows you how to prepare for the CompTIA Security+ exam With hundreds of practice exam questions, including difficult performance-based questions, CompTIA Security+® Certification Study Guide, Third Edition covers what you need to know—and shows you how to prepare—for this challenging exam. • 100% complete coverage of all official objectives for exam SY0-501 • Exam Watch notes call attention to information about, and potential pitfalls in, the exam • Inside the Exam sections in every chapter highlight key exam topics covered • Two-Minute Drills for quick review at the end of every chapter • Simulated exam questions—including performance-based questions—match the format, topics, and difficulty of the real exam Covers all exam topics, including: Networking Basics and Terminology • Security Terminology • Security Policies and Standards • Types of Attacks • System Security Threats • Mitigating Security Threats • Implementing System Security • Securing the Network Infrastructure • Wireless Networking and Security • Authentication • Access Control • Cryptography • Managing a Public Key Infrastructure • Physical Security • Risk Analysis • Disaster Recovery and Business Continuity • Computer Forensics • Security Assessments and Audits • Monitoring and Auditing Electronic Content Includes: • 50+ lab exercises and solutions • Complete practice exams • 3+ hours of video training from the author • Secured book PDF","language":"en","currency":"USD","id":"1260026892","title":"CompTIA Security+ Certification Practice Exams, Third Edition (Exam SY0-501)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mB8wDwAAQBAJ&source=gbs_api","authors":["Daniel Lachance","Glen E. Clarke"]},{"pageCount":253,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZQLjDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":null,"description":"Master the Big Data Capabilities of Oracle R Enterprise Effectively manage your enterprise’s big data and keep complex processes running smoothly using the hands-on information contained in this Oracle Press guide. Oracle R Enterprise: Harnessing the Power of R in Oracle Database shows, step-by-step, how to create and execute large-scale predictive analytics and maintain superior performance. Discover how to explore and prepare your data, accurately model business processes, generate sophisticated graphics, and write and deploy powerful scripts. You will also find out how to effectively incorporate Oracle R Enterprise features in APEX applications, OBIEE dashboards, and Apache Hadoop systems. Learn to: • Install, configure, and administer Oracle R Enterprise • Establish connections and move data to the database • Create Oracle R Enterprise packages and functions • Use the R language to work with data in Oracle Database • Build models using ODM, ORE, and other algorithms • Develop and deploy R scripts and use the R script repository • Execute embedded R scripts and employ ORE SQL API functions • Map and manipulate data using Oracle R Advanced Analytics for Hadoop • Use ORE in Oracle Data Miner, OBIEE, and other applications","language":"en","currency":"USD","id":"1259585646","title":"Oracle R Enterprise: Harnessing the Power of R in Oracle Database","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZQLjDAAAQBAJ&source=gbs_api","authors":["Brendan Tierney"]},{"pageCount":656,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ep-RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Techniques for Better Predictive Modeling and Analysis of Big Data, Third Edition","description":"Interest in predictive analytics of big data has grown exponentially in the four years since the publication of Statistical and Machine-Learning Data Mining: Techniques for Better Predictive Modeling and Analysis of Big Data, Second Edition. In the third edition of this bestseller, the author has completely revised, reorganized, and repositioned the original chapters and produced 13 new chapters of creative and useful machine-learning data mining techniques. In sum, the 43 chapters of simple yet insightful quantitative techniques make this book unique in the field of data mining literature. What is new in the Third Edition: The current chapters have been completely rewritten. The core content has been extended with strategies and methods for problems drawn from the top predictive analytics conference and statistical modeling workshops. Adds thirteen new chapters including coverage of data science and its rise, market share estimation, share of wallet modeling without survey data, latent market segmentation, statistical regression modeling that deals with incomplete data, decile analysis assessment in terms of the predictive power of the data, and a user-friendly version of text mining, not requiring an advanced background in natural language processing (NLP). Includes SAS subroutines which can be easily converted to other languages. As in the previous edition, this book offers detailed background, discussion, and illustration of specific methods for solving the most commonly experienced problems in predictive modeling and analysis of big data. The author addresses each methodology and assigns its application to a specific type of problem. To better ground readers, the book provides an in-depth discussion of the basic methodologies of predictive modeling and analysis. While this type of overview has been attempted before, this approach offers a truly nitty-gritty, step-by-step method that both tyros and experts in the field can enjoy playing with.","language":"en","currency":"USD","id":"149879761X","title":"Statistical and Machine-Learning Data Mining:","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ep-RDwAAQBAJ&source=gbs_api","authors":["Bruce Ratner"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xJCKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":null,"description":"This multi-contributed handbook focuses on the latest workings of IoT (internet of Things) and Big Data. As the resources are limited, it's the endeavor of the authors to support and bring the information into one resource. The book is divided into 4 sections that covers IoT and technologies, the future of Big Data, algorithms, and case studies showing IoT and Big Data in various fields such as health care, manufacturing and automation. Features Focuses on the latest workings of IoT and Big Data Discusses the emerging role of technologies and the fast-growing market of Big Data Covers the movement toward automation with hardware, software, and sensors, and trying to save on energy resources Offers the latest technology on IoT Presents the future horizons on Big Data","language":"en","currency":"USD","id":"042962493X","title":"Handbook of IoT and Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xJCKDwAAQBAJ&source=gbs_api","authors":["Vijender Kumar Solanki","Vicente García Díaz","J. Paulo Davim"]},{"pageCount":465,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JmydDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":"Lessons Learned for the Data-Driven Business","description":"This book has two main goals: to define data science through the work of data scientists and their results, namely data products, while simultaneously providing the reader with relevant lessons learned from applied data science projects at the intersection of academia and industry. As such, it is not a replacement for a classical textbook (i.e., it does not elaborate on fundamentals of methods and principles described elsewhere), but systematically highlights the connection between theory, on the one hand, and its application in specific use cases, on the other. With these goals in mind, the book is divided into three parts: Part I pays tribute to the interdisciplinary nature of data science and provides a common understanding of data science terminology for readers with different backgrounds. These six chapters are geared towards drawing a consistent picture of data science and were predominantly written by the editors themselves. Part II then broadens the spectrum by presenting views and insights from diverse authors – some from academia and some from industry, ranging from financial to health and from manufacturing to e-commerce. Each of these chapters describes a fundamental principle, method or tool in data science by analyzing specific use cases and drawing concrete conclusions from them. The case studies presented, and the methods and tools applied, represent the nuts and bolts of data science. Finally, Part III was again written from the perspective of the editors and summarizes the lessons learned that have been distilled from the case studies in Part II. The section can be viewed as a meta-study on data science across a broad range of domains, viewpoints and fields. Moreover, it provides answers to the question of what the mission-critical factors for success in different data science undertakings are. The book targets professionals as well as students of data science: first, practicing data scientists in industry and academia who want to broaden their scope and expand their knowledge by drawing on the authors’ combined experience. Second, decision makers in businesses who face the challenge of creating or implementing a data-driven strategy and who want to learn from success stories spanning a range of industries. Third, students of data science who want to understand both the theoretical and practical aspects of data science, vetted by real-world case studies at the intersection of academia and industry.","language":"en","currency":"USD","id":"3030118215","title":"Applied Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JmydDwAAQBAJ&source=gbs_api","authors":["Martin Braschler","Thilo Stadelmann","Kurt Stockinger"]},{"pageCount":516,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJgvBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":151.2,"subtitle":"With Applications and Case Studies","description":"This book covers the latest advances in Big Data technologies and provides the readers with a comprehensive review of the state-of-the-art in Big Data processing, analysis, analytics, and other related topics. It presents new models, algorithms, software solutions and methodologies, covering the full data cycle, from data gathering to their visualization and interaction, and includes a set of case studies and best practices. New research issues, challenges and opportunities shaping the future agenda in the field of Big Data are also identified and presented throughout the book, which is intended for researchers, scholars, advanced students, software developers and practitioners working at the forefront in their field.","language":"en","currency":"USD","id":"3319091778","title":"Modeling and Processing for Next-Generation Big-Data Technologies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJgvBQAAQBAJ&source=gbs_api","authors":["Fatos Xhafa","Leonard Barolli","Admir Barolli","Petraq Papajorgji"]},{"pageCount":341,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PgetDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":145.6,"subtitle":null,"description":"Role of Blockchain Technology in IoT Applications, Volume 115 in the Advances in Computers series, reviews the latest information on this topic that promises many applications in human life. According to forecasts made by various market research\/survey agencies, there will be around 50 Billion connected devices (IoT) by 2020. Updates in this new release include chapters on the Technical Aspects of Blockchain and IoT, Integrated Platforms for Blockchain-Enablement, Intersections Between IoT and Distributed Ledger, Blockchain and Artificial Intelligence: How and Why Combining These Two Groundbreaking Technologies, Blockchain Applications in Health Care and Opportunities and Advancements Due to New Information Technology Frameworks, and more. Explores blockchain technology research trends in secured device to device communication Includes updates on secure vehicular communication (VANET) using blockchain technology Provides the latest on secure IoT communication using blockchain technology Presents use cases of blockchain technology in healthcare, the food chain, ERP and other emerging areas","language":"en","currency":"USD","id":"0128171928","title":"Role of Blockchain Technology in IoT Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PgetDwAAQBAJ&source=gbs_api","authors":[]},{"pageCount":168,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LIhFBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This IBM® RedpaperTM publication is a comprehensive guide covering the IBM Power System S812L (8247-21L) and IBM Power System S822L (8247-22L) servers that support the Linux operating system (OS). The objective of this paper is to introduce the major innovative Power S812L and Power S822L offerings and their relevant functions: The new IBM POWER8TM processor, available at frequencies of 3.02 GHz, and 3.42 GHz Significantly strengthened cores and larger caches Two integrated memory controllers with improved latency and bandwidth Integrated I\/O subsystem and hot-pluggable Peripheral Component Interconnect Express (PCIe) Gen3 I\/O slots Improved reliability, serviceability, and availability (RAS) functions IBM EnergyScaleTM technology that provides features such as power trending, power-saving, capping of power, and thermal measurement This publication is for professionals who want to acquire a better understanding of IBM Power SystemsTM products. This paper expands the current set of IBM Power Systems documentation by providing a desktop reference that offers a detailed technical description of the Power S812L and Power S822L server. This paper does not replace the latest marketing materials and configuration tools. It is intended as an additional source of information that, together with existing sources, can be used to enhance your knowledge of IBM server solutions.","language":"en","currency":"USD","id":"0738453765","title":"IBM Power Systems S812L and S822L Technical Overview and Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LIhFBAAAQBAJ&source=gbs_api","authors":["Scott Vetter","Alexandre Bicas Caldeira","Volker Haug","Marc-Eric Kahle","Cesar Diniz Maciel","Monica Sanchez","IBM Redbooks"]},{"pageCount":1584,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cKtCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":null,"description":"Dive in—and discover how to really put Windows Server 2012 to work! This supremely organized reference packs the details you need to plan and manage a Windows Server 2012 implementation—including hundreds of timesaving solutions, troubleshooting tips, and workarounds. Learn how the experts tackle Windows Server 2012—and challenge yourself to new levels of mastery. Topics include: Managing Windows Server 2012 systems Storage and file systems TCP\/IP networking DHCP and DNS Active Directory Group Policy Security and access Troubleshooting hardware Performance monitoring and tuning Backup and recovery","language":"en","currency":"USD","id":"073566871X","title":"Windows Server 2012 Inside Out","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cKtCAwAAQBAJ&source=gbs_api","authors":["William Stanek"]},{"pageCount":8,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fjxNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":3.99,"subtitle":null,"description":"Studienarbeit aus dem Jahr 2017 im Fachbereich Informatik - Allgemeines, Note: 1,6, Universität Rostock, Sprache: Deutsch, Abstract: Die Begriffe „Data Science“ und „Big Data“ sind neben der „Cloud“ und „KI“ die wohl am häufigsten genutzten Buzzwords der letzten Jahre. Sie werden in Verbindung gebracht mit dem exzessiven Datensammelwahn großer Konzerne und werfen Datenschutzbedenken auf und bieten gleichzeitig unendliche Möglichkeiten zur Vorhersage und Analyse von Verhalten. Die Wichtigkeit von Big Data und den damit verbundenen Technologien erreicht mittlerweile immer mehr Unternehmen und macht so eine Verbindung zwischen Geschäftswelt und Wissenschaft nötig.","language":"de","currency":"USD","id":"3668642672","title":"Data Science und Big Data. Eine Übersicht","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fjxNDwAAQBAJ&source=gbs_api","authors":["Robert Bastei"]},{"pageCount":50,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GdiqDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.99,"subtitle":null,"description":"Studienarbeit aus dem Jahr 2015 im Fachbereich Informatik - Wirtschaftsinformatik, Note: 2,3, Technische Universität Darmstadt (Fachgebiet Wirtschaftsinformatik | Software Business & Information Management), Sprache: Deutsch, Abstract: Unternehmen werden im Zuge der Digitalisierung fast aller Lebensbereiche vom Datentsunami, besser unter dem Namen Big Data bekannt, nahezu vollständig überflutet. Innerhalb von 60 Sekunden werden weltweit etwa 694.445 Google Suchanfragen durchgeführt, 695.000 Status-Updates in Facebook gepostet, 168 Millionen E-Mails versandt und das Datenvolumen des Webs verdoppelt sich alle 18 Monate. Unternehmen sind gut darin beraten, dem Überfluss an Daten mit geeigneten Methoden und Technologien entgegenzutreten, da die alt bewährten Legacy Systeme (z.B. Data Warehouses) bereits an ihre technischen Grenzen stoßen. Obwohl Big Data sicherlich eine Herausforderung für die Unternehmen darstellt, ergeben sich auch neue Möglichkeiten und Umsatzquellen. Dafür gilt es nicht nur die Daten zu sammeln, sondern sie sollten auch analysiert und entsprechend ausgewertet werden. Ein wichtiger Schritt der Analyse und Auswertung von Unternehmensdaten ist die Systematisierung dieser. Die Seminararbeit versucht konkrete Ansätze zur Systematisierung von Unternehmensdaten vor dem Hintergrund von Big Data zu finden und diese zu evaluieren. Im Zuge der Arbeit werden hierfür Experten aus der Praxis hinzugezogen, die einerseits die theoretischen Ansätze aus einer praxisorientierten Sichtweise bewerten und andererseits auch horizonterweiterten Input zum Themenfeld Big Data und Analytics liefern.","language":"de","currency":"USD","id":"3668357927","title":"Ansätze zur Systematisierung von Unternehmensdaten vor dem Hintergrund von Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GdiqDQAAQBAJ&source=gbs_api","authors":["Alexander Pilipas","Michael Sack"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VT3hAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"","description":"\"SQL Success\" is about problem-solving in SQL. It bridges the gap between dry and dull database theory books, and developer books that focus on giving recipes without explaining sufficiently the reasons behind the recipes or discussing alternative solutions. Many developers struggle with SQL due to the contrast between the top-down logic of most programming languages and SQL's set-based approach. \"SQL Success\" aims to be different. This book is more than syntax examples. \"SQL Success\" explains how to use SQL to solve problems, and covers syntax in the process-not as the focus, but as a tool toward accomplishing the objective. \"SQL Success\" also shows something that most other books do not: the pitfalls and traps of SQL, a deceptively simple language, and how easy it is to get a query wrong. Written in a conversational way, \"SQL Success\" talks about logic more than theory, avoids jargon, and refers to common-sense more than rules. It ignores features that are rarely used and tries to avoid information overload. The intention of \"SQL Success\" is not to cover every aspect of all variants of SQL. The goal is to cover everything that is of practical use. That goal is informed by the author's many years of practical experience leading an understanding of what professional developers need to know, the common mistakes that are made, and how those mistakes can be avoided. * Focuses on the practical implications of theory. * Emphasizes accuracy and efficiency. * Teaches how to \"think SQL\", not merely the syntax. * Applies to Oracle, SQL Server, MySQL, PostgreSQL, DB2, and SQLite. * Suitable for college-level database courses, SQL certification preparation, and professionals who want to take their database skills to the next level. * Bolstered by downloadable files and online database with practice exercises at edu.konagora.com. * Includes resources for instructors.","language":"en","currency":"USD","id":"1909765015","title":"SQL Success","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VT3hAAAAQBAJ&source=gbs_api","authors":["Stéphane Faroult"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Lwb9CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30,"subtitle":"Exam 1Z0-809","description":"Complete, trusted preparation for the Java Programmer II exam OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide is your comprehensive companion for preparing for Exam 1Z0-809 as well as upgrade Exam 1Z0-810 and Exam 1Z0-813. With full coverage of 100% of exam objectives, this invaluable guide reinforces what you know, teaches you what you don't know, and gives you the hands-on practice you need to boost your skills. Written by expert Java developers, this book goes beyond mere exam prep with the insight, explanations and perspectives that come from years of experience. You'll review the basics of object-oriented programming, understand functional programming, apply your knowledge to database work, and much more. From the basic to the advanced, this guide walks you through everything you need to know to confidently take the OCP 1Z0-809 Exam and upgrade exams 1Z0-810 and 1Z0-813. Java 8 represents the biggest changes to the language to date, and the latest exam now requires that you demonstrate functional programming competence in order to pass. This guide has you covered, with clear explanations and expert advice. Understand abstract classes, interfaces, and class design Learn object-oriented design principles and patterns Delve into functional programming, advanced strings, and localization Master IO, NIO, and JDBC with expert-led database practice If you're ready to take the next step in your IT career, OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide is your ideal companion on the road to certification.","language":"en","currency":"USD","id":"1119067898","title":"OCP: Oracle Certified Professional Java SE 8 Programmer II Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Lwb9CgAAQBAJ&source=gbs_api","authors":["Jeanne Boyarsky","Scott Selikoff"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qkP-zMrb3KIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"The new world of cloud computing needs data storage. CouchDB is the scalable, portable, simple database engine that is helping open source cloud architects put their data stores onto a firm foundation. Beginning CouchDB provides the tools to begin using this very powerful database engine without having to pay license fees for the software, or worry about administrator's certifications or vast hardware requirements. This book teaches the fundamentals of one of the most powerful database engines ever created for the price of a good lunch. After reading this book and working through the examples, you'll be able to write your own applications for CouchDB quickly and easily. In-depth, non-intimidating guide to CouchDB and how it differs from similar offerings such as SimpleDB and BigTable, and also how it differs from traditional relational and object-oriented databases such as Oracle, SQL Server, and MySQL. Detailed explanation of how CouchDB works, its suitability for use in distributed environments, the role of Erlang, and other technical topics in a manner that does not obfuscate methods or results. JavaScript is extremely popular as a development language for CouchDB. No Erlang is required, but a little bit can't hurt either. A tutorial-oriented approach to teaching readers how to use CouchDB, featuring many code examples and listings, as well as screenshots where relevant.","language":"en","currency":"USD","id":"1430272368","title":"Beginning CouchDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qkP-zMrb3KIC&source=gbs_api","authors":["Joe Lennon"]},{"pageCount":158,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MJrlDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"This book addresses the process of maintaining digital objects through time to ensure continued access, an aspect that has become a crucial issue in recent years. It offers a concise yet comprehensive discussion of key concepts and requirements for long-term digital preservation, and presents a pioneering framework for digital repositories that enables the long-term archiving and metadata management for large volumes of digital resources based on a system that has already been completely designed and launched. In the framework, the reliability of information readouts is ensured by the repository with two-level data recording replication and monitoring mechanisms in the repository management system (RMS) and the file systems, and by the RMS’s distributed nature. The advanced RMS allows operations on the archival storage to be scheduled, while also taking into account low energy consumption requirements. After presenting the framework in detail, the book assesses and demonstrates the approach’s viability in terms of delivering accessibility, authenticity and usability. As such, the book offers a valuable resource for information technology (IT) researchers and practitioners, as well as archivists and librarians.","language":"en","currency":"USD","id":"3319518011","title":"Digital Preservation: Putting It to Work","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MJrlDQAAQBAJ&source=gbs_api","authors":["Tomasz Traczyk","Włodzimierz Ogryczak","Piotr Pałka","Tomasz Śliwiński"]},{"pageCount":1184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9Xr9UB2x6n0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":52,"subtitle":null,"description":"Implement Proven Database Optimization Solutions Systematically identify and eliminate database performance problems with help from Oracle Certified Master Richard Niemiec. Filled with real-world case studies and best practices, Oracle Database 11g Release 2 Performance Tuning Tips & Techniques details the latest monitoring, troubleshooting, and optimization methods. Find out how to find and fix bottlenecks, configure storage devices, execute effective queries, and develop bug-free SQL and PL\/SQL code. Testing, reporting, and security enhancements are also covered in this Oracle Press guide. Properly index and partition Oracle Database 11g Release 2 Work with Oracle Exadata and Oracle Exalogic Elastic Cloud Efficiently manage disk drives, RAID arrays, and memory Tune queries with Oracle SQL hints and the TRACE utility Troubleshoot databases using V$ views and X$ tables Distribute workload using Oracle Real Application Testing Generate reports using Oracle's Statspack and Automatic Workload Repository tools Use sar, vmstat, and iostat to monitor system statistics “This is a timely update of Rich’s classic book on Oracle Database performance tuning to cover hot new topics like Oracle Database 11g Release 2 and Oracle Exadata. This is a must-have for DBAs moving to these new products.” --Andrew Mendelsohn, Senior Vice President, Oracle Database Server Technologies","language":"en","currency":"USD","id":"0071780270","title":"Oracle Database 11g Release 2 Performance Tuning Tips & Techniques","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9Xr9UB2x6n0C&source=gbs_api","authors":["Richard Niemiec"]},{"pageCount":832,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mCYuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"A fully updated, integrated self-study system for the Oracle Database SQL Exam This thoroughly revised Oracle Press guide offers 100% coverage of all objectives on the latest version of the Oracle Database SQL Exam. Ideal both as a study guide and on-the-job reference, OCA Oracle Database SQL Exam Guide (Exam 1Z0-071) features detailed explanations, examples, practice questions, and chapter summaries. “Certification Objectives,” “Exam Watch,” and “On the Job” sections reinforce salient points throughout. You will gain access to two complete practice exams that match the tone, tenor, and format of the live test. Get complete coverage every topic on Exam 1Z0-071, including: • DDL and SQL SELECT statements • Manipulating, restricting, and sorting data • Single-row and group functions • Displaying data from multiple tables • Subqueries • Schema objects • Set operators • Grouping related data • Report creation • Data dictionary views • Large data sets • Hierarchical retrieval • Regular expression support • User access control The electronic includes: • Two full practice exams • Detailed answers and explanations","language":"en","currency":"USD","id":"1259584615","title":"OCA Oracle Database SQL Exam Guide (Exam 1Z0-071)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mCYuDwAAQBAJ&source=gbs_api","authors":["Steve O'Hearn"]},{"pageCount":466,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mHkeEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39,"subtitle":null,"description":"All scheduling software is difficult to learn for a number of reasons. None have the optimal settings when installed and Layouts, User Preferences and default options need to be adjusted to obtain the best possible performance. Usually the Help files do not connect the user to real life situations and do not explain the practical use of functions. Furthermore, there are many flicks and switches with obscure names that are difficult to understand or decide what they do or which are important. These issues make learning the software very difficult without a comprehensive guide written by an experienced user. Investing in a book written by Paul E Harris will address all these issues and allow you to setup the software properly and understand all the obscure functions letting you become productive more quickly and enhance your career opportunities and salary with a solid understanding of the software. This book is an update of the author’s Primavera P6 Version 8 to 19 book and contains a new section on Visualizer. The workshops have been updated so they start in the future. The book has been written so it may be used with any software industry version. The book is packed with screen shots, constructive tips and contains workshops with solutions at the end of each chapter for the reader to practice the skills taught. It has been written so it may be used with either the Professional Project Management Client version or the Enterprise Project Portfolio Management Optional Client. The book is aimed at: 1. People who wish learn the software but are unable to attend a training course and find the software reference manual hard going. 2. Project management companies who wish to run their own software training courses or provide their employees with an alternative text to the vendor supplied user manual. 3. Training organizations requiring a training manual to run their own training courses. The book is designed to teach planners and schedulers in any industry how to setup and use the software in a project environment. It explains in plain English and in a logical sequence, the steps required to create and maintain an unresourced and resourced schedule. It tackles some of the more complex aspects of the software that the user manual does not address. It highlights the sources of information and the methods that should be employed to produce a realistic and useful project schedule. The book provides advice on how on how the many software options may be applied to projects environments and it aims to teach readers how to plan and control projects created within the software package and stays focused on explaining how to use Primavera to schedule projects by: Concentrating on the core functions required to set up an enterprise environment and how to plan and control projects. Providing command lists at the start of each chapter as a quick reference. Providing a comprehensive table of contents and index of all topics. The book is intended to be used: As a self-teach book, or A user guide, or A training manual for a three-day training course. This book is written by an experienced scheduler, who has used the software at the sharp end of projects and is not a techo. It draws on the author's practical experience in using the software in a wide variety of industries. It presents workable solutions to real day to day planning and scheduling problems and contains practical advice on how to set up the software and import data.","language":"en","currency":"USD","id":"192518580X","title":"Planning and Control Using Oracle Primavera P6 Versions 8 to 20 PPM Professional","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mHkeEAAAQBAJ&source=gbs_api","authors":["Paul E Harris"]},{"pageCount":296,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xN-ECgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":145.6,"subtitle":null,"description":"Advances in Computers carries on a tradition of excellence, presenting detailed coverage of innovations in computer hardware, software, theory, design, and applications. The book provides contributors with a medium in which they can explore their subjects in greater depth and breadth than journal articles typically allow. The articles included in this book will become standard references, with lasting value in this rapidly expanding field. Presents detailed coverage of recent innovations in computer hardware, software, theory, design, and applications Includes in-depth surveys and tutorials on new computer technology pertaining to computing: combinatorial testing, constraint-based testing, and black-box testing Written by well-known authors and researchers in the field Includes extensive bibliographies with most chapters Presents volumes devoted to single themes or subfields of computer science","language":"en","currency":"USD","id":"0128051736","title":"Energy Efficiency in Data Centers and Clouds","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xN-ECgAAQBAJ&source=gbs_api","authors":[]}]