[{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Your go-to guide to creating truly native iOS and Android mobile applications using React and JavaScript About This Book Build cross-platform best seller native mobile applications in JavaScript with React-Native framework Learn about real world examples like Whatsapp, Instagram or Twitter. Learn all steps in React Native application development workflow from prototyping to deployment Get familiar with various mobile APIs covered in React Native framework and learn how to extend it further to non-supported APIs Who This Book Is For This book is for JavaScript developers who want to learn how to create native mobile apps using React Native. What You Will Learn Understand how React Native works under the hood and what makes it an ultimate choice for app development for lots of businesses. Create real world native apps with complex animations and styles Get familiar with important iOS and Android native APIs and access them using React Native Learn authentication techniques and how to connect your app to a real data by using Firebase or your own server Get familiar with lots of community packages considered as industry standard Walk through the whole app development workflow by creating Twitter app clone from design to deployment. Understand application release process to the Apple App Store and Google's Play Store In Detail The emergence of React Native has made creating mobile apps in JavaScript easier for developers. This book introduces you to the React Native framework and the mobile apps development process. It starts with how React Native fits into the world of hybrid apps, and why it's a popular framework. You'll learn how React Native works under the hood--compiling JavaScript to Native code to bridge JavaScript and native apps. Also, you'll learn how to write React Native components and use the ReactJS way of structuring your app. Understand how to use the industry standard Redux architecture as well as MobX--a newly emerging approach for state management--making your apps more robust and scalable. The mobile native world can be intimidating, with lots of platform-specific APIs. In this book, you'll learn about the most important APIs with help of the real-world examples. You'll also learn about the community packages that can help speed up your development. The book explains how to use these packages with JavaScript code, include native modules in your application, and write the modules yourself. Throughout the book, you will see examples of WhatsApp, Instagram, and YouTube apps and learn how to recreate them. You'll also learn debugging and testing techniques, authentication, dealing with real data, and much more. At the end we will walk through design to production process of Twitter app clone and will explain application release process to App Store and Play Store Style and approach This book gives you a solid foundation in building apps with React Native, from the basics to creating a fully functional Twitter clone! With industry best practices, plenty of code examples and complete projects to walk through.","language":"en","currency":"USD","id":"1787129799","title":"React Native - Building Mobile Apps with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJZGDwAAQBAJ&source=gbs_api","authors":["Vladimir Novick"]},{"pageCount":198,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q5NoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Declarative Data Fetching for Modern Web Apps","description":"Why is GraphQL the most innovative technology for fetching data since Ajax? By providing a query language for your APIs and a runtime for fulfilling queries with your data, GraphQL presents a clear alternative to REST and ad hoc web service architectures. With this practical guide, Alex Banks and Eve Porcello deliver a clear learning path for frontend web developers, backend engineers, and project and product managers looking to get started with GraphQL. You’ll explore graph theory, the graph data structure, and GraphQL types before learning hands-on how to build a schema for a photo-sharing application. This book also introduces you to Apollo Client, a popular framework you can use to connect GraphQL to your user interface. Explore graph theory and review popular graph examples in use today Learn how GraphQL applies database querying methods to the internet Create a schema for a PhotoShare application that serves as a roadmap and a contract between the frontend and backend teams Use JavaScript to build a fully functioning GraphQL service and Apollo to implement a client Learn how to prepare GraphQL APIs and clients for production","language":"en","currency":"USD","id":"1492044865","title":"Learning GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q5NoDwAAQBAJ&source=gbs_api","authors":["Eve Porcello","Alex Banks"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=APuKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build fast and type-safe React applications that leverage the JavaScript and OCaml ecosystems","description":"A hands on approach to learning ReasonML from the perspective of a web developer. Key Features Hands on learning by building a real world app shell that includes client-side routing and more. Understand Reason’s ecosystem including BuckleScript and various npm workflows. Learn how Reason differs from TypeScript and Flow, and how to use it to make refactoring less stressful. Book Description ReasonML, also known as Reason, is a new syntax and toolchain for OCaml that was created by Facebook and is meant to be approachable for web developers. Although OCaml has several resources, most of them are from the perspective of systems development. This book, alternatively, explores Reason from the perspective of web development. You'll learn how to use Reason to build safer, simpler React applications and why you would want to do so. Reason supports immutability by default, which works quite well in the context of React. In learning Reason, you will also learn about its ecosystem – BuckleScript, JavaScript interoperability, and various npm workflows. We learn by building a real-world app shell, including a client-side router with page transitions, that we can customize for any Reason project. You'll learn how to leverage OCaml's excellent type system to enforce guarantees about business logic, as well as preventing runtime type errors.You'll also see how the type system can help offload concerns that we once had to keep in our heads. We'll explore using CSS-in-Reason, how to use external JSON in Reason, and how to unit-test critical business logic. By the end of the book, you'll understand why Reason is exploding in popularity and will have a solid foundation on which to continue your journey with Reason. What you will learn Learn why Reason is exploding in popularity and why it's the future of React Become familiar with Reason's syntax and semantics Learn about Reason's ecosystem: BuckleScript and JavaScript interoperability Learn how to build React applications with Reason Learn how to use Reason's type system as a tool to provide amazing guarantees Gain a solid foundation on which to continue your journey Who this book is for The target audience of this book is web developers who are somewhat familiar with ReactJS and who want to learn why ReasonML is the future of ReactJS.","language":"en","currency":"USD","id":"1789344239","title":"ReasonML Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=APuKDwAAQBAJ&source=gbs_api","authors":["Raphael Rafatpanah","Bruno Joseph D'mello"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xH3kDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Design and Build Engaging Intelligent Applications Using SharePoint Framework","description":"Step-by-step guide to learn SharePoint Framework DESCRIPTION SharePoint Framework is the new option for developing SharePoint solutions. In this book, you will learn the basic concepts of SharePoint Framework, how you can create modern solutions using modern open-source toolchain and JavaScript frameworks. You will also learn how you can work with SharePoint lists and libraries and can implement CRUD (create, read, update, and delete) operations. Later, you will also learn how you can work with third-party libraries in SPFx solutions and can create real-world solutions. In the end, you will find some frequently asked questions to work effectively with the SharePoint Framework. This book will give you in-depth knowledge of SharePoint Framework, by learning many real-time examples in SharePoint Online, based on the latest versions of SharePoint Framework. KEY FEATURES - Get an overview of the modern toolchain, node-based development, React JS, and SharePoint Framework - Understand how all the concepts covered in the book can be put to use in developing or building real-time applications using SharePoint Framework - A Step by Step easy to understand guide for beginners to understand the working of SharePoint Framework WHAT WILL YOU LEARN - Learn the basics of SharePoint Framework and modern toolchain - Understand the structure, files, and folders of a SharePoint Framework web part project - Implement web part property panes and develop client-side SharePoint Framework web parts - Integrate third party libraries like jQuery in SharePoint Framework web part - Develop SharePoint Framework extensions, which include Application Customizer, Field Customizer, and ListView Command Set extension - Develop library component type in SharePoint Framework WHO THIS BOOK IS FOR The book is for SharePoint developers, Technical specialists & Consultants. It is also for beginners, who are about to start their SharePoint development journey. Basic web development knowledge, including HTML, JavaScript, and CSS is a prerequisite. TABLE OF CONTENTS 1. Getting started with SharePoint Framework 2. Develop first client-side web part 3. Understanding SharePoint Framework Web Part project structure 4. Working with SharePoint Objects 5. Working with SPFx Web Part Property Pane 6. Different hosting options for SPFx Web Part 7. CRUD operations with different JavaScript frameworks 8. Logging and Debugging in SPFx web parts 9. SharePoint Framework Web part Examples 10. Overview of SharePoint Framework Extensions 11. Library Component Type in Sharepoint framework 12. Frequently Asked Questions in SharePoint Framework","language":"en","currency":"USD","id":"8194334462","title":"Getting Started with SharePoint Framework (SPFx)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xH3kDwAAQBAJ&source=gbs_api","authors":["Vipul Jain"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A fast-paced, hands-on guide to designing and building scalable and maintainable web apps with React 16","description":"Everything you need to start working with React 16 and assess React Fiber About This Book Hands-on examples and tutorials for the latest React 16 release Assess the impact of React Fiber for your future web development Build maintainable and high performance React 16 web applications Who This Book Is For If you're a frontend developer with some knowledge of native JavaScript development and frontend frameworks, wishing to learn the fastest web user interface library there is, then this book is ideal for you. What You Will Learn Learn to code React 16 with hands-on examples and clear tutorials Install powerful React 16 tools to make development much more efficient Understand the impact of React Fiber today and the future of your web development Utilize the Redux application architecture with your React components Create React 16 elements with properties and children Get started with stateless and stateful React components Use JSX to speed up your React 16 development process Add reactivity to your React 16 components with lifecycle methods Test your React 16 components with the Jest test framework In Detail React 16 Essentials, Second Edition, fully updated for React 16, takes you on a fast-paced journey through building your own maintainable React 16 applications. React experts Artemij Fedosejev and Adam Boduch give you all the essentials you need to know and start working with React 16, in this new edition of the best-selling React.js Essentials title. You'll find the latest React 16 code updates, assessment of React Fiber, new coverage of Redux, and how to work as a modern React developer. The authors offer you their current assessment of React Fiber, and you'll soon be exploring React 16 hands on, creating your own single and multiple user interface elements with React 16. You'll then see how to create stateless and stateful components and make them reactive. You'll also learn to interact between your components and lifecycle methods, and gauge how to effectively integrate your user interface components with other JavaScript libraries. Delve deep into the core elements of the Redux architecture and learn how to manage your application and data persistence. Then go the extra mile with the Jest test framework, and run multiple tests on your applications and find solutions to scale without complexity. Today React is used by Facebook, Instagram, Khan Academy, and Imperial College London, to name a few. Many new users recognize the benefits of React and adopt it in their own projects, forming a fast-growing community. The speed at which React has evolved promises a bright future for anyone who invests in learning it today. Let Artemij and Adam bring you a brand new look at React 16 and React Fiber, and move your web development into the future. Style and approach React 16 Essentials, Second Edition, will take you on a fast-paced, hands-on journey through building your own maintainable React 16 applications.","language":"en","currency":"USD","id":"178712634X","title":"React 16 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FkBPDwAAQBAJ&source=gbs_api","authors":["Artemij Fedosejev","Adam Boduch"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zpc9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":null,"description":"This book is a collection of in-depth guides to some some of the tools and resources most used with React, such as Jest and React Router, as well as a discussion about how React works well with D3, and a look at Preact, a lightweight React alternative. These tutorials were all selected from SitePoint's React Hub. It contains: Getting Started with Redux by Michael Wanyoike React Router v4: The Complete Guide by Manjunath M How to Test React Components Using Jest by Jack Franklin Building Animated Components, or How React Makes D3 Better by Swizec Teller Using Preact as a React Alternative by Ahmed Bouchefra","language":"en","currency":"USD","id":"1492065382","title":"React: Tools & Resources","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zpc9DwAAQBAJ&source=gbs_api","authors":["Michael Wanyoike","Manjunath M","Jack Franklin","Swizec Teller","Ahmed Bouchefra"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Ionic是目前集流行与成熟两个特点于一身的跨平台移动开发框架。本书以实例驱动讲解的方式，让仅有简单网页制作基础知识的读者，也能轻松掌握Ionic3.X下的移动应用开发。 本书分为4篇，第1篇是移动开发准备，介绍了Ionic、Phonegap、Cordova、HTML5和移动开发的一些基础知识；第2篇是Ionic基础知识准备与常用库，介绍了配置开发Ionic环境所依赖的Angular、SASS、Gulplodash等业内主流库和工具；第3篇是Ionic组件完全解析，对Ionic的内置样式和TypeScript组件类进行完整解析；第4篇是App项目实战和发布推广，介绍了如何按照业内通行实践的策划、设计、开发过程完成Ionic开发的完整App。在开发完成之后，详解如何为Android和iOS两大移动平台发布和推广更新自己的App。 本书内容详尽、实例丰富，是Ionic初学者、HTML 5爱好者、移动互联网创业者、移动开发人员必备的参考书，同时也适合高等院校和培训学校的师生学习阅读。","language":"zh-CN","currency":"USD","id":"7302503451","title":"Ionic移动开发入门与实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSf7DwAAQBAJ&source=gbs_api","authors":["秦超，李一鸣著"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QvwCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":"ASP. NET 是Microsoft公司推出的新一代建立动态Web应用程序的开发平台。自21世纪初至今，已在全世界普及推广，是目前主流的网络编程工具之一。 本书共八章，提供了前端 、C#基础、控件使用、数据库基础、小型系统开发示例、后端和Js的综合应用示例等各类知识。 本书内容通俗易懂，以由浅入深的方式，向读者介绍相关知识点，是一本较好的ASP. NET 前后端开发的入门书籍。 在讲解相关知识点时，本书设计了许多相关典型示例，做到了“一个知识点至少有一个示例和一个综合应用”，通过实例讲解分析，详尽讲述了实际开发中所需的各类知识。 利用本书，教师可以得心应手地教学，学生也可以轻松地自学。","language":"zh-CN","currency":null,"id":"7550444315","title":"ASP.NET Web应用系统开发：C#","infoLink":"http:\/\/books.google.com\/books?id=QvwCEAAAQBAJ&dq=reactjs&hl=&as_brr=5&source=gbs_api","authors":["彭芳策主编"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Develop microservice-based high performance web apps for the cloud with Go","description":"Discover practical techniques to build cloud-native apps that are scalable, reliable, and always available. Key Features Build well-designed and secure microservices. Enrich your microservices with continous integration and monitoring. Containerize your application with Docker Deploy your application to AWS. Learn how to utilize the powerful AWS services from within your application Book Description Awarded as one of the best books of all time by BookAuthority, Cloud Native Programming with Golang will take you on a journey into the world of microservices and cloud computing with the help of Go. Cloud computing and microservices are two very important concepts in modern software architecture. They represent key skills that ambitious software engineers need to acquire in order to design and build software applications capable of performing and scaling. Go is a modern cross-platform programming language that is very powerful yet simple; it is an excellent choice for microservices and cloud applications. Go is gaining more and more popularity, and becoming a very attractive skill. This book starts by covering the software architectural patterns of cloud applications, as well as practical concepts regarding how to scale, distribute, and deploy those applications. You will also learn how to build a JavaScript-based front-end for your application, using TypeScript and React. From there, we dive into commercial cloud offerings by covering AWS. Finally, we conclude our book by providing some overviews of other concepts and technologies that you can explore, to move from where the book leaves off. What you will learn Understand modern software applications architectures Build secure microservices that can effectively communicate with other services Get to know about event-driven architectures by diving into message queues such as Kafka, Rabbitmq, and AWS SQS. Understand key modern database technologies such as MongoDB, and Amazon’s DynamoDB Leverage the power of containers Explore Amazon cloud services fundamentals Know how to utilize the power of the Go language to access key services in the Amazon cloud such as S3, SQS, DynamoDB and more. Build front-end applications using ReactJS with Go Implement CD for modern applications Who this book is for This book is for developers who want to begin building secure, resilient, robust, and scalable Go applications that are cloud native. Some knowledge of the Go programming language should be sufficient.To build the front-end application, you will also need some knowledge of JavaScript programming.","language":"en","currency":"USD","id":"1787127966","title":"Cloud Native Programming with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvNFDwAAQBAJ&source=gbs_api","authors":["Mina Andrawos","Martin Helmich"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=euweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.35,"subtitle":null,"description":"Как решить проблемы front-end-разработчиков и сделать их жизнь более счастливой? Нужно всего лишь познакомиться с возможностями React! Только так вы сможете быстро выйти на новый уровень и получить не только моральное, но и материальное удовлетворение от веб-разработки. Успешные пользовательские интерфейсы должны быть визуально интересными, быстрыми и гибкими. React ускоряет тяжелые веб-приложения, улучшая поток данных между компонентами UI. Сайты начинают эффективно и плавно обновлять визуальные элементы, сводя к минимуму время на перезагрузку страниц. Перед вами труд, над которым на протяжении полутора лет работало более дюжины человек. Тщательно отобранные примеры и подробные комментарии позволяют разработчикам перейти на React быстро, чтобы затем эффективно создавать веб-приложения, используя всю мощь JavaScript. ВНУТРИ: • Основы React • Создание полнофункциональных веб-приложений с маршрутизацией • Тестирование • Оптимизация приложений React «Эта книга — лучший способ разобраться в React.js». Джон Сонмез, автора книги \"Путь программиста\" «Азат — один из самых авторитетных источников в области программирования. Эта книга выходит за рамки начального уровня и глубоко погружает в основы и архитектуру React». Эрик Хэнчетт, автор книги «Ember.js Cookbook» «React быстро — универсальный источник информации для читателя, который желает освоить React с его экосистемой инструментов, концепций и библиотек». Питер Купер, редактор «JavaScript Weekly» «Эта книга — отличный ресурс для изучения React. Четко и по делу. Я буду пользоваться ей в работе над своим следующим приложением». Натан Бэйли, полностековый разработчик, SpringboardAuto.com","language":"ru","currency":"USD","id":"544610952X","title":"React быстро. Веб-приложения на React, JSX, Redux и GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=euweEAAAQBAJ&source=gbs_api","authors":["Мардан Азат"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxWhDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Building Web Applications and Microservices for the Cloud with Go and React","description":"The Complete Guide to Building Cloud-Based Services Cloud Native Go shows developers how to build massive cloud applications that meet the insatiable demands of today’s customers, and will dynamically scale to handle virtually any volume of data, traffic, or users. Kevin Hoffman and Dan Nemeth describe the modern cloud-native application in detail, illuminating factors, disciplines, and habits associated with rapid, reliable cloud-native development. They also introduce Go, a “simply elegant” high-performance language that is especially well-suited for cloud development. You’ll walk through creating microservices in Go, adding front-end web components using ReactJS and Flux, and mastering advanced Go-based cloud-native techniques. Hoffman and Nemeth show how to build a continuous delivery pipeline with tools like Wercker, Docker, and Dockerhub; automatically push apps to leading platforms; and systematically monitor app performance in production. Learn “The Way of the Cloud”: why developing good cloud software is fundamentally about mindset and discipline Discover why Go is ideal for cloud-native microservices development Plan cloud apps that support continuous delivery and deployment Design service ecosystems, and then build them in a test-first manner Push work-in-progress to a cloud Use Event Sourcing and CQRS patterns to react and respond to enormous volume and throughput Secure cloud-based web applications: do’s, don’ts, and options Create reactive applications in the cloud with third-party messaging providers Build massive-scale, cloud-friendly GUIs with React and Flux Monitor dynamic scaling, failover, and fault tolerance in the cloud","language":"en","currency":"USD","id":"0134505808","title":"Cloud Native Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxWhDQAAQBAJ&source=gbs_api","authors":["Kevin Hoffman","Dan Nemeth"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n9itCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"This book is for web developers and designers who work with React.js and JavaScript and who are new to unit testing and automation. It's assumed that you have a basic knowledge of JavaScript and HTML.","language":"en","currency":"USD","id":"1785283200","title":"Jasmine JavaScript Testing - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n9itCAAAQBAJ&source=gbs_api","authors":["Paulo Ragonha"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BUIwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Leverage the full potential of the React Native framework to build and deploy your own native mobile applications for iOS and Android About This Book Work on native APIs and UI Elements using React Native Get the best of both worlds: the power of native approach and the fluidity of JavaScript Create increasingly complex real-world applications and dive deeper into React Native Who This Book Is For If you are keen on learning to use the revolutionary mobile development tool React Native to build native mobile applications, then this book is for you. Prior experience with JavaScript would be useful. What You Will Learn How to create mobile-performant iOS and Android apps using JavaScript and React The potential of each API and component, putting them into practice throughout the course of three projects The process of integrating the Facebook SDK to build an app that connects to third-party data Every step taken to implement Redux, a popular state management library, in your mobile apps The requirements for building and deploying your apps to market, with detailed instructions on how to release and beta test apps on both the Apple App Store and Google Play In Detail React Native's ability to build performant mobile applications with JavaScript has resulted in its popularity amongst developers. Developers now have the luxury to create incredible mobile experiences that look and feel native to their platforms with the comfort of a well-known language and the popular React.js library. This book will show you how to build your own native mobile applications for the iOS and Android platforms while leveraging the finesse and simplicity of JavaScript and React. Throughout the book you will build three projects, each of increasing complexity. You will also link up with the third-party Facebook SDK, convert an app to support the Redux architecture, and learn the process involved in making your apps available for sale on the iOS App Store and Google Play. At the end of this book, you will have learned and implemented a wide breadth of core APIs and components found in the React Native framework that are necessary in creating great mobile experiences. Style and approach Start building applications immediately using featured examples through an easy-to-follow approach. The book is based on three concrete projects with increasing levels of difficulty. Each chapter will introduce you to new and practical concepts and techniques, with the intent that you will be able to apply them in your own projects later.","language":"en","currency":"USD","id":"1786465647","title":"React Native By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BUIwDwAAQBAJ&source=gbs_api","authors":["Richard Kho"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tgCACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build efficient HTML, CSS and JavaScript applications using the powerful WebStorm IDE About This Book Get to grips with the newest features of WebStorm Use WebStorm to simplify your web development process and improve its efficiency Best practices and cutting-edge technologies for JavaScript development Who This Book Is For If you are a web developer who is new to WebStorm, this is the book for you. Knowledge of languages such as JavaScript, HTML, and CSS is assumed, with a reasonable understanding of frameworks such as AngularJS, Node.js, and Meteor. What You Will Learn Install and configure WebStorm to suit your workflow Develop mobile applications using web technologies with WebStorm Create simple web pages with the help of templates Improve your web development efficiency with WebStorm's built-in features Analyse and debug your code in WebStorm Perform unit testing and debugging in WebStorm to test your applications Get to grips with the latest version of WebStorm (WebStorm 10) to revolutionize your web development experience In Detail JetBrains WebStorm is a commercial and powerful IDE, perfectly equipped for complex client-side development and server-side development with Node.js. It provides first-class support for JavaScript, Node.js, HTML, and CSS. WebStorm is the number one choice for developing web applications due to its advanced features and integration with a plethora of topical technologies such as Meteor and Gulp. This book will be your companion in building high-quality web applications using WebStorm, taking advantage of the newest features of Webstorm 10. You will start with an introduction to the latest features of WebStorm and its interface, followed by learning how to set up a new project with the help of templates. You will then build a web application using AngularJS, ReactJs, Node.js, Express, and Meteor. This book will also show you how to use pioneering HTML5 technologies in mobile application development and package managers, as well as how to build automation tools for your application. Finally, you will discover how to perform debugging, tracing, profiling, and code style checking activities directly in WebStorm, followed by testing your application inside WebStorm, using some of the most popular testing libraries out there. By the end of this book, you will have a solid understanding of how to develop powerful web applications quickly and easily with WebStorm. Style and approach This book is a hands-on guide to getting to grips with WebStorm, complete with plenty of screenshots and tips. New features are introduced to you with the help of sample applications.","language":"en","currency":"USD","id":"1785286463","title":"WebStorm Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tgCACwAAQBAJ&source=gbs_api","authors":["Stefan Rosca","Den Patin"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LfeVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Implement advanced blockchain applications using Ethereum-supported tools, services, and protocols","description":"An expert guide to implementing fast, secure, and scalable decentralized applications that work with thousands of users in real time Key Features Implement advanced features of the Ethereum network to build powerful decentralized applications Build smart contracts on different domains using the programming techniques of Solidity and Vyper Explore the architecture of Ethereum network to understand advanced use cases of blockchain development Book Description Ethereum is one of the commonly used platforms for building blockchain applications. It's a decentralized platform for applications that can run exactly as programmed without being affected by fraud, censorship, or third-party interference. This book will give you a deep understanding of how blockchain works so that you can discover the entire ecosystem, core components, and its implementations. You will get started by understanding how to configure and work with various Ethereum protocols for developing dApps. Next, you will learn to code and create powerful smart contracts that scale with Solidity and Vyper. You will then explore the building blocks of the dApps architecture, and gain insights on how to create your own dApp through a variety of real-world examples. The book will even guide you on how to deploy your dApps on multiple Ethereum instances with the required best practices and techniques. The next few chapters will delve into advanced topics such as, building advanced smart contracts and multi-page frontends using Ethereum blockchain. You will also focus on implementing machine learning techniques to build decentralized autonomous applications, in addition to covering several use cases across a variety of domains such as, social media and e-commerce. By the end of this book, you will have the expertise you need to build decentralized autonomous applications confidently. What you will learn Apply scalability solutions on dApps with Plasma and state channels Understand the important metrics of blockchain for analyzing and determining its state Develop a decentralized web application using React.js and Node.js Create oracles with Node.js to provide external data to smart contracts Get to grips with using Etherscan and block explorers for various transactions Explore web3.js, Solidity, and Vyper for dApps communication Deploy apps with multiple Ethereum instances including TestRPC, private chain, test chain, and mainnet Who this book is for This book is for anyone who wants to build fast, highly secure, and transactional decentralized applications. If you are an Ethereum developer looking to perfect your existing skills in building powerful blockchain applications, then this book is for you. Basic knowledge of Ethereum and blockchain is necessary to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789537185","title":"Mastering Ethereum","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LfeVDwAAQBAJ&source=gbs_api","authors":["Merunas Grincalaitis"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K141DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"A Problem-Solution Approach","description":"Quickly find solutions to common web development problems. Content is presented in the popular problem-solution format. Look up the problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! ASP.NET Core Recipes is a practical guide for developers creating modern web applications, cutting through the complexities of ASP.NET, jQuery, React, and HTML5 to provide straightforward solutions to common web development problems using proven methods based on best practices. The problem-solution approach gets you in, out, and back to work quickly while deepening your understanding of the underlying platform and how to develop with it. Author John Ciliberti guides you through the MVC framework and development tools, presenting typical challenges, along with code solutions and clear, concise explanations, to accelerate application development. Solve problems immediately by pasting in code from the recipes, or put multiple recipe solutions together to overcome challenging development obstacles. What You'll Learn Take advantage of MVC's streamlined syntax Discover how to take full control over HTML Develop a simple API for creating RESTful web services Understand test-driven development Migrate a project from ASP.NET web forms to Core MVC, including recipes for converting DataGrids, Forms, Web Parts, Master Pages, and navigation controls Use Core MVC in combination with popular JavaScript libraries, including jQuery, React, Bootstrap, and more Write unit tests for your MVC controllers, views, custom filters, and HTML helpers Utilize the latest features in Visual Studio 2017 to accelerate your Core MVC projects Identify performance bottlenecks in your MVC application Who This Book Is For Web developers of all skill levels who are looking for a programming reference for ASP.NET Core MVC and would like to gain an understanding of the inner workings of the platform. In addition, parts of this book provide guidance to developers familiar with ASP.NET Web Forms who would like to update their skill set to include Core MVC.","language":"en","currency":"USD","id":"1484204271","title":"ASP.NET Core Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K141DwAAQBAJ&source=gbs_api","authors":["John Ciliberti"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ALFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Supercharge the client state in your React apps with MobX","description":"Apply functional Reactive programming for simple and scalable state management with MobX Key Features The easiest way to learn MobX to enhance your client-side state-management Understand how the concepts and components fit together Work through different state management scenarios with MobX Book Description MobX is a simple and highly scalable state management library in JavaScript. Its abstractions can help you manage state in small to extremely large applications. However, if you are just starting out, it is essential to have a guide that can help you take the first steps. This book aims to be that guide that will equip you with the skills needed to use MobX and effectively handle the state management aspects of your application. You will first learn about observables, actions, and reactions: the core concepts of MobX. To see how MobX really shines and simplifies state management, you'll work through some real-world use cases. Building on these core concepts and use cases, you will learn about advanced MobX, its APIs, and libraries that extend MobX. By the end of this book, you will not only have a solid conceptual understanding of MobX, but also practical experience. You will gain the confidence to tackle many of the common state management problems in your own projects. What you will learn Explore the fundamental concepts of MobX, such as observables, actions, and reactions Use observables to track state and react to its changes with validations and visual feedback (via React Components) Create a MobX observable from different data types Define form data as an observable state and tackle sync and async form validations Use the special APIs to directly manipulate observables, tracking its changes, and discovering the reasons behind a change Tackle any state management issue you may have in your app by combining mobx-utils and mobx-state-tree Explore the internals of the MobX reactive system by diving into its inner workings Who this book is for This book is for web developers who want to implement easy and scalable state management for their apps. Knowledge of HTML, CSS, and JavaScript is assumed","language":"en","currency":"USD","id":"1789348978","title":"MobX Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ALFmDwAAQBAJ&source=gbs_api","authors":["Pavan Podila","Michel Weststrate"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZGGLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.31,"subtitle":null,"description":"Vue.js – это популярная библиотека для создания пользовательских интерфейсов. В ней значительно переосмыслены реактивные идеи, впервые появившиеся в React.js. Книга «Vue.js в действии» рассказывает о создании быстрых и эластичных пользовательских интерфейсов для Интернета. Освоив ее, вы напишете полноценное приложение для интернет-магазина, где будут присутствовать списки товаров, админка, а также организован полноценный процесс онлайнового заказа.","language":"ru","currency":"USD","id":"5446110986","title":"Vue.js в действии","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZGGLDwAAQBAJ&source=gbs_api","authors":["Хэнчетт Эрик","Листуон Бенджамин"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nszcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to build amazing and complex reactive web applications easily with Vue.js About This Book Learn how to propagate DOM changes across the website without writing extensive jQuery callbacks code. Learn how to achieve reactivity and easily compose views with Vue.js and understand what it does behind the scenes. Explore the core features of Vue.js with small examples, learn how to build dynamic content into preexisting web applications, and build Vue.js applications from scratch. Who This Book Is For This book is perfect for novice web developer seeking to learn new technologies or frameworks and also for webdev gurus eager to enrich their experience. Whatever your level of expertise, this book is a great introduction to the wonderful world of reactive web apps. What You Will Learn Build a fully functioning reactive web application in Vue.js from scratch. The importance of the MVVM architecture and how Vue.js compares with other frameworks such as Angular.js and React.js. How to bring reactivity to an existing static application using Vue.js. How to use plugins to enrich your applications. How to develop customized plugins to meet your needs. How to use Vuex to manage global application's state. In Detail Vue.js is one of the latest new frameworks to have piqued the interest of web developers due to its reactivity, reusable components, and ease of use. This book shows developers how to leverage its features to build high-performing, reactive web interfaces with Vue.js. From the initial structuring to full deployment, this book provides step-by-step guidance to developing an interactive web interface from scratch with Vue.js. You will start by building a simple application in Vue.js which will let you observe its features in action. Delving into more complex concepts, you will learn about reactive data binding, reusable components, plugins, filters, and state management with Vuex. This book will also teach you how to bring reactivity to an existing static application using Vue.js. By the time you finish this book you will have built, tested, and deployed a complete reactive application in Vue.js from scratch. Style and approach This book is a thorough, step-by-step guide showing readers how to build complete web apps with Vue.js. While teaching its intricacies, this book shows how to implement the MVVM architecture in the real world and build high-performing web interfaces.","language":"en","currency":"USD","id":"1786461137","title":"Learning Vue.js 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nszcDgAAQBAJ&source=gbs_api","authors":["Olga Filipova"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"A project based guide to help you get started with web development by building real-world and modern web applications About This Book Learn JavaScript from scratch by building clones of popular web applications Understand the core concepts and techniques surrounding JavaScript with this power-packed hands-on guide Explore modern JavaScript frameworks and libraries such as Node, React and Webpack Who This Book Is For The target audience for this book is developers with little or basic knowledge of working with JavaScript. If you are an emerging web developer with experience in building static web pages using HTML and CSS, this book will teach you to add JavaScript elements to make your website interactive and dynamic. What You Will Learn A strong understanding of web application development with JavaScript and ES6. A firm foundation on which to master other JavaScript frameworks and libraries. Write maintainable and scalable code by organizing functions into modules. Importance of tools such as Node, NPM, Babel, and Webpack in Front-end development. Work with real-time data such as incoming video streams, texts, and so on Integrate React with JavaScript to build large-scale applications. Utilize Redux to manage data across React components and greatly speed up the development process In Detail JavaScript is the programming language that all web developers need to learn. The first item on our JavaScript to-do list is building g a To-do list app, which you'll have done by the end of the first chapter. You'll explore DOM manipulation with JavaScript and work with event listeners. You'll work with images and text to build a Meme creator. You will also learn about ES (ECMAScript) classes, and will be introduced to layouts using the CSS3 Flexbox. You'll also develop a responsive Event Registration form that allows users to register for your upcoming event and use charts and graphics to display registration data. You will then build a weather application, which will show you different ways perform AJAX requests and work with dynamic, external data. WebRTC enables real-time communication in a web browser; you'll learn how to use it when you build a real-time video-call and chat application later in the book. Towards the end of the book, you will meet React, Facebook's JavaScript library for building user interfaces. You'll throw together a blog with React, and get a feel for why this kind of JavaScript framework is used to build large-scale applications. To make your blog more maintainable and scalable, you'll use Redux to manage data across React components. Style and approach This project-based guide will teach you all the facets of JavaScript through real-world app examples.","language":"en","currency":"USD","id":"1788299000","title":"JavaScript by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJZGDwAAQBAJ&source=gbs_api","authors":["Dani Akash S"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CaGKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solve modern challenges with functional programming and test-driven techniques of C#","description":"Conquer complex and interesting programming challenges by building robust and concurrent applications with caches, cryptography, and parallel programming. Key Features Understand how to use .NET frameworks like the Task Parallel Library (TPL)and CryptoAPI Develop a containerized application based on microservices architecture Gain insights into memory management techniques in .NET Core Book Description This Learning Path shows you how to create high performing applications and solve programming challenges using a wide range of C# features. You’ll begin by learning how to identify the bottlenecks in writing programs, highlight common performance pitfalls, and apply strategies to detect and resolve these issues early. You'll also study the importance of micro-services architecture for building fast applications and implementing resiliency and security in .NET Core. Then, you'll study the importance of defining and testing boundaries, abstracting away third-party code, and working with different types of test double, such as spies, mocks, and fakes. In addition to describing programming trade-offs, this Learning Path will also help you build a useful toolkit of techniques, including value caching, statistical analysis, and geometric algorithms. This Learning Path includes content from the following Packt products: C# 7 and .NET Core 2.0 High Performance by Ovais Mehboob Ahmed Khan Practical Test-Driven Development using C# 7 by John Callaway, Clayton Hunt The Modern C# Challenge by Rod Stephens What you will learn Measure application performance using BenchmarkDotNet Leverage the Task Parallel Library (TPL) and Parallel Language Integrated Query (PLINQ)library to perform asynchronous operations Modify a legacy application to make it testable Use LINQ and PLINQ to search directories for files matching patterns Find areas of polygons using geometric operations Randomize arrays and lists with extension methods Use cryptographic techniques to encrypt and decrypt strings and files Who this book is for If you want to improve the speed of your code and optimize the performance of your applications, or are simply looking for a practical resource on test driven development, this is the ideal Learning Path for you. Some familiarity with C# and .NET will be beneficial.","language":"en","currency":"USD","id":"1838550313","title":"Improving your C# Skills","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CaGKDwAAQBAJ&source=gbs_api","authors":["Ovais Mehboob Ahmed Khan","John Callaway","Clayton Hunt","Rod Stephens"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hif4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop and run your application with Docker containers using DevOps tools for continuous delivery","description":"Learn how to deploy and test Linux-based Docker containers with the help of real-world use cases Key Features Understand how to make a deployment workflow run smoothly with Docker containers Learn Docker and DevOps concepts such as continuous integration and continuous deployment (CI\/CD) Gain insights into using various Docker tools and libraries Book Description Docker is the de facto standard for containerizing apps, and with an increasing number of software projects migrating to containers, it is crucial for engineers and DevOps teams to understand how to build, deploy, and secure Docker environments effectively. Docker for Developers will help you understand Docker containers from scratch while taking you through best practices and showing you how to address security concerns. Starting with an introduction to Docker, you'll learn how to use containers and VirtualBox for development. You'll explore how containers work and develop projects within them after you've explored different ways to deploy and run containers. The book will also show you how to use Docker containers in production in both single-host set-ups and in clusters and deploy them using Jenkins, Kubernetes, and Spinnaker. As you advance, you'll get to grips with monitoring, securing, and scaling Docker using tools such as Prometheus and Grafana. Later, you'll be able to deploy Docker containers to a variety of environments, including the cloud-native Amazon Elastic Kubernetes Service (Amazon EKS), before finally delving into Docker security concepts and best practices. By the end of the Docker book, you'll be able to not only work in a container-driven environment confidently but also use Docker for both new and existing projects. What you will learn Get up to speed with creating containers and understand how they work Package and deploy your containers to a variety of platforms Work with containers in the cloud and on the Kubernetes platform Deploy and then monitor the health and logs of running containers Explore best practices for working with containers from a security perspective Become familiar with scanning containers and using third-party security tools and libraries Who this book is for If you're a software engineer new to containerization or a DevOps engineer responsible for deploying Docker containers in the cloud and building DevOps pipelines for container-based projects, you'll find this book useful. This Docker containers book is also a handy reference guide for anyone working with a Docker-based DevOps ecosystem or interested in understanding the security implications and best practices for working in container-driven environments.","language":"en","currency":"USD","id":"178953948X","title":"Docker for Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hif4DwAAQBAJ&source=gbs_api","authors":["Richard Bullington-McGuire","Andrew K. Dennis","Michael Schwartz"]},{"pageCount":599,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aIdcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Enhance your JavaScript skills by venturing into the domain of developing mobile applications About This Book Extend your JavaScript skillset to build, test, and launch mobile apps with confidence Follow three sample projects to experience Ionic's impressive capabilities Extend the power of Apache Cordova by creating your own Apache Cordova cross-platform mobile plugins Who This Book Is For This Learning Path is for JavaScript web developers looking to develop mobile applications using various JavaScript descendent technologies. It is for anyone who wants to learn how to build fast and stylish native mobile app using the skills they already have. If you are already using React on the web, we're confident you'll be able to quickly get up and running with React Native for iOS and Android. See Ionic in action, and find out how it can transform the way you build mobile apps. What You Will Learn Develop, build, run, and deploy great cross-platform mobile applications using Apache Cordova Create complete mobile apps using Apache Cordova that runs on Apple iOS, Google Android, and Windows Phone Create a neat user interface for your mobile application using jQuery Mobile Gain an in-depth understanding of how React Native works behind the scenes Write your own custom native UI components Develop native modules in Objective-C and Java that interact with JavaScript Get to know Ionic by creating three complete mobile applications In Detail A great mobile app is rapidly becoming crucial for a huge range of businesses. With a great app, your customers or your readers don't come to you – you go with them, just a few clicks and swipes away. This Learning Path shows you how to build awesome mobile apps with some of the best tools currently being used by some of the smartest developers in the industry. Taking you through JavaScript impressive development ecosystem – from jQuery Mobile to React, through to Ionic – we'll show you how to put your skills into practice so you can build your next mobile apps with confidence and style. In this Learning Path, from jQuery to React, to Ionic, we'll cover everything you need to start In the first module you'll learn how to get stuck into Apache Cordova and find out how to use it as the key platform for developing your mobile app. It offers an efficient way to develop hybrid apps, which means you won't have to connect to platform specific APIs or use their UI framework, and can instead harness your JavaScript web development skills. Make sure you have your HTML, CSS and jQuery skills at the ready. In Module 2 we'll show you how to take advantage of React Native. It has a reputation for having a steep learning curve, but we'll make it easy for you, making sure you make full use of your existing knowledge and getting you up and running with a sample application. You'll also learn how to create components, how to create multiple screens, as well as using native UI components and accessing native APIs. In the third and final module you'll get started with Ionic. With three practical projects you can build yourself, we've made sure that you'll be learning by doing – which means you'll not only develop new skills much more quickly, but you'll have produced something tangible at the end of it! This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: JavaScript Mobile Application Development by Hazem Saleh Getting Started with React Native by Ethan Holmes and Tom Bray Ionic Framework By Example by Sani Yusuf Style and approach This Learning Path course provides a simple and easy way to build mobile applications in JavaScript descendent technologies such as jQuery, ReactJS, and Ionic.","language":"en","currency":"USD","id":"1787122247","title":"Mobile Application Development: JavaScript Frameworks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aIdcDgAAQBAJ&source=gbs_api","authors":["Hazem Saleh","Ethan Holmes","Tom Bray","Sani Yusuf"]},{"pageCount":475,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9XUpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Exam: 70-483","description":"Prepare for Microsoft Certification Exam 70-483: Programming in C#. The “What, Why, and How” of each concept is presented along with quick summaries, code challenges, and exam questions to review and practice key concepts. You will learn how to use: Lambda expressions to write LINQ query expressions Asynchronous programming with the Async and Await keywords to maximize performance of slow applications Regular expressions to validate user input Reflection to create and handle types at runtime and much more The source code in the book will be available in the form of iCanCSharp notebooks and scripts that allow you to try out examples and extend them in interesting ways. What You Will Learn Understand the necessary knowledge and skill set to prepare for Microsoft Exam 70-483 Study the code challenges and practice questions on C# that are relevant to the exam Master the C# programming language Who This Book Is For Experienced C# and .NET programmers and developers who are ready to take and pass the exam in order to get certified","language":"en","currency":"USD","id":"148422860X","title":"The C# Programmer’s Study Guide (MCSD)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9XUpDwAAQBAJ&source=gbs_api","authors":["Ali Asad","Hamza Ali"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"A complete guide to build robust and scalable web applications with Spring and Angular. About This Book This hands on guide will teach you how to build an end-to-end modern web application using Spring and Angular. It is easy to read and will benefit Java developers who have been used to develop the back-end part of web application while front-end (UI) has been left for UI developers. Learn the core aspects involved in developing the backend and the UI, right from designing to integrating and deploying. Who This Book Is For This book is targeted towards Java Web Developers with a basic knowledge of Spring who want to build complete web applications in a fast and effective way. They will want to gain a stronghold on both frontend and backend development to advance in their careers. What You Will Learn Set up development environment for Spring Web App and Angular app. Process web request and response and build REST API endpoints. Create data access components using Spring Web MVC framework and Hibernate Use Junit 5 to test your application Learn the fundamental concepts around building Angular Configure and use Routes and Components. Protect Angular app content from common web vulnerabilities and attacks. Integrate Angular apps with Spring Boot Web API endpoints Deploy the web application based on CI and CD using Jenkins and Docker containers In Detail Spring is the most popular application development framework being adopted by millions of developers around the world to create high performing, easily testable, reusable code. Its lightweight nature and extensibility helps you write robust and highly-scalable server-side web applications. Coupled with the power and efficiency of Angular, creating web applications has never been easier. If you want build end-to-end modern web application using Spring and Angular, then this book is for you. The book directly heads to show you how to create the backend with Spring, showing you how to configure the Spring MVC and handle Web requests. It will take you through the key aspects such as building REST API endpoints, using Hibernate, working with Junit 5 etc. Once you have secured and tested the backend, we will go ahead and start working on the front end with Angular. You will learn about fundamentals of Angular and Typescript and create an SPA using components, routing etc. Finally, you will see how to integrate both the applications with REST protocol and deploy the application using tools such as Jenkins and Docker. Style and approach This is a straightforward guide that shows how to build a complete web application in Angular and Spring.","language":"en","currency":"USD","id":"1787281523","title":"Building Web Apps with Spring 5 and Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpZGDwAAQBAJ&source=gbs_api","authors":["Ajitesh Shukla"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0a0IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.24,"subtitle":null,"description":"基於HTTP 協議運行的WWW (World Wide Web，萬維網) 服務是B\/ S 模式的底層支撐，WWW 簡稱為Web，亦指我們通常所說的網頁。Web 的運行包括兩部分: 前端與後端。通俗地講，Web 前端是指用戶在瀏覽器中能夠直觀看到的某一網頁的界面，它的作用是除了向用戶呈現合理、美觀的網頁內容外，還提供用戶與網站服務器端進行交互的功能，如點擊按鈕、連結等。Web 後端即網站的服務器端，在收到用戶通過前端發送來的訪問請求後，服務器端會自動調用和執行相關程序，如進行數學運算、操作數據庫等，並將程序執行結果返回給Web 前端。通過上述介紹可以看出，Web 前端負責提供良好的用戶體驗，Web 後端則重點負責網站業務邏輯的實現和數據的調度。 需要指出的是，隨著普通PC 和筆記本電腦性能的快速提升，現在越來越多的Web應用將業務邏輯的處理也交由客戶端瀏覽器實施，服務器端僅提供必要的用戶身分認證、數據調度等功能，大大減輕了服務器端的負擔，提升了網站的訪問效率。 Web 前端設計是指網站界面的設計，主要通過HTML、CSS 和JavaScript 三種技術實現。其中HTML 負責提供網頁的結構與內容，CSS 負責對內容進行修飾，JavaScript負責提供適當的動畫效果、用戶網站交互功能等，這三者各司其職、相互配合，共同支撐Web 前端的正常運行。 早期的Web 頁面基本上是純HTML 靜態網頁，僅提供廣播式的信息發布，被稱為Web1.0 時代，其特點是數據流量大；到了2010 年前後，隨著Web2.0 技術的發展，Web 頁面的內容與功能日趨豐富，其特點是互動性較強；目前，Web3.0 的概念已經出現，它的本質特徵是多種數據被整合利用，頁面的智能性高。 Web 前端開發是一個發展活躍的領域，圍繞頁面效率的提升和功能的豐富，新的開發技術不斷湧現，開發模式層出不窮。2006 年出現的jQuery 框架大大提升了JavaScript 語言的開發效率，其影響一直延續到現在；2009 年誕生的Angular.js 技術首次提出前端的MVC 模式(Model–View–Controller)，將網頁內容呈現與業務邏輯的處理分開，提升了開發、調試、運行等的效率；2013 年React.js 框架出現，它利用組件化的開發思想，提高了代碼的復用性，而且擁有較高的執行性能；2014 年，一款輕量級的漸進式前端框架Vue.js 正式發布，它只關注視圖層，學習門檻低，且在很大程度上綜合利用了Angular.js 和React.js 的優點，因而受到較多關注。從上述發展過程我們不難看出，Web 前端開發技術的變化基本上都圍繞JavaScript 語言展開，因此JavaScript 語言在Web 前端領域中有著越來越重要的地位。","language":"zh-TW","currency":"USD","id":"957680468X","title":"ASP.NET Web應用系統開發","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0a0IEAAAQBAJ&source=gbs_api","authors":["彭芳策"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rVhLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mission-critical enterprise applications using Spring Framework and Aspect Oriented Programming About This Book Step into more advanced features of aspect-oriented programming and API components to build enterprise grade systems Build lightning-fast web applications and REST APIs using Spring MVC and its asynchronous processing capabilities with the view technologies of your choice Explore simplified but powerful data access techniques including JPA (Java Persistence Architecture) repositories and NoSQL data access Who This Book Is For If you are a Java developer who is looking to master Enterprise Java Development using Spring Framework, then this book is ideal for you. Prior understanding of core Java programming and a high-level understanding of Spring Framework is recommended. Having sound knowledge of servlet-based web development in Java and basic Database concepts would be an advantage but not a requirement. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Get familiar with JSP Form processing using Spring and Form Tag Library Develop RESTful API applications for XML and JSON data transfers with non-blocking asynchronous capabilities Explore Spring's comprehensive transaction support for declarative Transaction Management and its integration with Spring's data access abstractions Investigate Spring Data access mechanisms with Spring Data Repositories, a simple and consistent data-access abstraction Construct real-time applications using WebSocket with a SockJS fallback option Understand how to secure your Spring Web and standalone applications using Spring Security declaratively and consistently Get to grips with the end-to-end development of an API-based modern SPA using EmberJS at the front end and SpringMVC at the back end In Detail Spring is an open source Java application development framework to build and deploy systems and applications that run on the JVM. It is the industry standard and the most popular framework among Java developers with over two-thirds of developers using it. Spring Essentials makes learning Spring so much quicker and easier with the help of illustrations and practical examples. Starting from the core concepts of features such as inversion of Control Container and BeanFactory, we move on to a detailed look at aspect-oriented programming. We cover the breadth and depth of Spring MVC, the WebSocket technology, Spring Data, and Spring Security with various authentication and authorization mechanisms. Packed with real-world examples, you'll get an insight into utilizing the power of Spring Expression Language in your applications for higher maintainability. You'll also develop full-duplex real-time communication channels using WebSocket and integrate Spring with web technologies such as JSF, Struts 2, and Tapestry. At the tail end, you will build a modern SPA using EmberJS at the front end and a Spring MVC-based API at the back end.By the end of the book, you will be able to develop your own dull-fledged applications with Spring. Style and approach This book is a practical guide based on logical modules of the whole Spring Framework family, with a start-small approach, increasing in complexity as it progresses. Every chapter is an amalgamation of theory and practical examples, with further discussion on additional features and approaches.","language":"en","currency":"USD","id":"1783982357","title":"Spring Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rVhLDAAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qnc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Design and develop next generation web applications using Angular 2 and Angular 4 About This Book Learn about the core building blocks of Angular Build and architect high performance web applications Implement the latest JavaScript concepts in ECMAScript 2015, ECMAScript 2016, and TypeScript Leverage the latest Angular features to get the most out of your web applications Who This Book Is For This book is targeted at JavaScript developers who are interested in learning how to build rich and powerful web applications with the latest version of Angular. Working knowledge of Angular 1 will be beneficial. What You Will Learn Develop a frontend web application using component-based architecture Use ES5, ES2015, and TypeScript to build Angular 4 UI applications Develop simple to complex user interfaces in Angular 4 Develop and handle forms in Angular 4 UI applications Test UIs built in Angular 4 Use material design components and animations in Angular 4 In Detail In the last few years, Angular has established itself as the number one choice of JavaScript Developers. What makes Angular special is performance and productivity. With Angular, developers can work on consistent coding patterns and build web applications that are powerful and scalable. This book will you get you up and running with Angular and teach how to build modern web applications. It starts with basics of Angular 2 and then brushes you up with the new features of Angular 4. You will learn the core concepts involved in building web applications with Angular such as Data Binding, Routing, Dependency Injection, and much more. The book teaches how to build components and use them to build web apps of your choice. It will help you to handle different kinds of forms and learn the concept of reactive programming. Finally the book teaches how to build visually appealing and responsive UIs. Style and approach It follows a practical approach to explain almost every feature of Angular 2 and Angular 4 and their concepts through real-world examples. In each chapter, a different example is used so that you can build a foundation and understand the concepts by applying them in different scenarios.","language":"en","currency":"USD","id":"1785880039","title":"Building Modern Web Applications Using Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qnc5DwAAQBAJ&source=gbs_api","authors":["Shravan Kumar Kasagoni"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-VMoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Enhance your testing skills to build powerful and fault-free applications in Angular v4 About This Book Learn test-driven development (TDD) for JavaScript Improve your Karma and Protractor expertise by setting up an Angular test suite A wide range of testing techniques for professional Angular applications accompanied by practical examples Who This Book Is For This book is for developers who have experience with Angular but want to understand the wider context of when, why, and how to apply testing techniques and best practices to create quality clean code. To get the most out of this book, you should have a good understanding of HTML and JavaScript and a basic understanding of Angular. What You Will Learn Get a clear overview of TDD in the context of JavaScript with a brief look at testing techniques, tools, and frameworks Get an overview of Karma and create test suites for an Angular application Install and configure Protractor for Angular and explore a few important Protractor APIs Understand automated testing and implement headless automated tests with Karma Implement testing techniques with mocks, broadcast events, and asynchronous behavior Integrate REST-based services and APIs into an application to extract data Automate Karma unit tests with Travis CI In Detail This is a complete guide that shows you testing techniques with Karma that will help you perform unit testing and end-to-end testing with Protractor. It will show you how to optimize your Angular development process using TDD techniques and ensure your final project is free of bugs. All examples in this book are based on Angular v2 and are compatible with Angular v4. We start by reviewing the TDD life cycle, TDD in the context of JavaScript, and various JavaScript test tools and frameworks. You will see how Karma and Protractor can make your life easier while running JavaScript unit tests. We will enable you to build a test suite for an Angular application and build a testable medium-to-large scale Angular application by handling REST API data. Building on the initial foundational aspects, we move on to testing for multiple classes, partial views, location references, CSS, and the HTML element. In addition, we will explore how to use a headless browser with Karma. We will also configure a Karma file to automate the testing and tackle elements of Angular (components, services, classes, and broadcasting) using TDD. Finally, you will find out how to pull data using an external API, set up and configure Protractor to use a standalone Selenium server, and set up Travis CI and Karma to test your application. Style and approach This book is a complete guide to Angular unit testing techniques using Karma and performing end-to-end testing with Protractor.","language":"en","currency":"USD","id":"1786462761","title":"Angular Test-Driven Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-VMoDwAAQBAJ&source=gbs_api","authors":["Md. Ziaul Haq"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, test, and deploy scalable and reactive microservices with Rust 2018","description":"A comprehensive guide in developing and deploying high performance microservices with Rust Key Features Start your microservices journey and get a broader perspective on microservices development using RUST 2018, Build, deploy, and test microservices using AWS Explore advanced techniques for developing microservices such as actor model, Requests Routing, and threads Book Description Microservice architecture is sweeping the world as the de facto pattern for building web-based applications. Rust is a language particularly well-suited for building microservices. It is a new system programming language that offers a practical and safe alternative to C. This book describes web development using the Rust programming language and will get you up and running with modern web frameworks and crates with examples of RESTful microservices creation. You will deep dive into Reactive programming, and asynchronous programming, and split your web application into a set of concurrent actors. The book provides several HTTP-handling examples with manageable memory allocations. You will walk through stateless high-performance microservices, which are ideally suitable for computation or caching tasks, and look at stateful microservices, which are filled with persistent data and database interactions. As we move along, you will learn how to use Rust macros to describe business or protocol entities of our application and compile them into native structs, which will be performed at full speed with the help of the server's CPU. Finally, you will be taken through examples of how to test and debug microservices and pack them into a tiny monolithic binary or put them into a container and deploy them to modern cloud platforms such as AWS. What you will learn Get acquainted with leveraging Rust web programming Get to grips with various Rust crates, such as hyper, Tokio, and Actix Explore RESTful microservices with Rust Understand how to pack Rust code to a container using Docker Familiarize yourself with Reactive microservices Deploy your microservices to modern cloud platforms such as AWS Who this book is for This book is for developers who have basic knowledge of RUST, and want to learn how to build, test, scale, and manage RUST microservices. No prior experience of writing microservices in RUST is assumed.","language":"en","currency":"USD","id":"1789341981","title":"Hands-On Microservices with Rust","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cGSGDwAAQBAJ&source=gbs_api","authors":["Denis Kolodin"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HNwkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book is intended for people who are not familiar with AngularJS and who want to take their PhoneGap development skills further by developing apps using different JavaScript libraries. People with some knowledge of PhoneGap, HTML, CSS, and JavaScript will find this book immediately useful.","language":"en","currency":"USD","id":"1783988932","title":"PhoneGap and AngularJS for Cross-platform Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HNwkBQAAQBAJ&source=gbs_api","authors":["Yuxian, Eugene Liang"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eWx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.08,"subtitle":null,"description":"Новое (5-е) издание признанного бестселлера, описывающее как клиентские, так и серверные аспекты веб-разработки. Эта книга поможет вам освоить динамическое веб-программирование с применением самых современных технологий. Книга наполнена ценными практическими советами, содержит подробный теоретический материал. Для закрепления материала автор рассказывает, как создать полнофункциональный сайт, работающий по принципу социальной сети Включая рассказ о React.js • Изучите важнейшие аспекты языка PHP и основы объектно-ориентированного программирования. • Познакомьтесь с базой данных MySQL. • Управляйте cookie-файлами и сеансами, обеспечивайте высокий уровень безопасности. • Пользуйтесь фундаментальными возможностями языка JavaScript. • Применяйте вызовы AJAX, чтобы значительно повысить динамику вашего сайта. • Изучите основы CSS для форматирования и оформления ваших страниц. • Освойте продвинутые возможности HTML5: геолокацию, обработку аудио и видео, отрисовку на холсте","language":"ru","currency":"USD","id":"5446108256","title":"Создаем динамические веб-сайты с помощью PHP, MySQL, JavaScript, CSS и HTML5. 5-е изд.","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eWx9DwAAQBAJ&source=gbs_api","authors":["Никсон Робин"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GqDcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unleash the power of Spring MVC and build enterprise-grade, lightning-fast web applications About This Book Configure Spring MVC to build logic-less controllers that transparently support the most advanced web techniques Secure your developments with easy-to-write, reliable unit and end-to-end tests Get this fast-paced, practical guide to produce REST resources and templates as required by the latest front-end best practices Who This Book Is For This Learning Path is for Java developers who want to exploit Spring MVC and its features to build web applications. It will help you step up in your career and stay up to date or learn more about Spring's web scalability. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Develop RESTful API applications for XML and JSON data transfers Investigate Spring data access mechanisms with Spring Data Repositories Generate templates for a responsive and powerful front end with AngularJS and Bootstrap Authenticate over REST with a BASIC authentication scheme and OAuth2; handle roles and permissions Communicate through WebSocket and STOMP messages Design complex advanced-level forms and validate the model Create maintainable unit and acceptance tests to secure the apps Deploy the web application to the cloud in a snap In Detail Spring MVC helps you build flexible and loosely coupled web applications. The Spring MVC Framework is designed in such a way that every piece of logic and functionality is highly configurable. This Learning Path aims to make you an expert in designing web applications with Spring MVC 4. In our first module, we'll begin with an introduction to the Spring framework. You'll then learn aspect-oriented programming. Packed with real-world examples, you'll get an insight into how you can use Spring Expression Language in your applications to make them easier to manage and maintain. In the second module, you'll learn everything you need to build modern Spring-based enterprise web applications. From practical development techniques and useful tools from the wider Spring ecosystem, to the new JEE standards, the impact of JavaScript, and even the Internet of Things, you'll feel confident that you can deploy Spring for an impressive range of creative purposes. In the final module, you'll find out how to take advantage of Spring MVC's advanced features - essential if you are to properly master the framework. To do this you'll investigate the inner mechanics of Spring MVC, and how they tie into to the broader principles that inform many modern web architectures. With further guidance on how to test, secure, and optimize your application, as well as designing RESTful services, you'll very quickly be ready to use Spring in your next web project. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Spring Essentials by Shameer Kunjumohamed, Hamidreza Sattari Spring MVC Cookbook by Alex Bretet Mastering Spring MVC 4 by Geoffroy Warin Style and approach This is a hands-on, practical guide based on logical modules of the whole Spring framework family, employing a combination of theory and examples with pro-level practices, techniques, and solutions.","language":"en","currency":"USD","id":"1787125084","title":"Spring MVC: Designing Real-World Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GqDcDgAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari","Alex Bretet","Geoffroy Warin"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Increase your productivity by implementing data structures About This Book Gain a complete understanding of data structures using a simple approach Analyze algorithms and learn when you should apply each solution Explore the true potential of functional data structures Who This Book Is For This book is for those who want to learn data structures and algorithms with PHP for better control over application-solution, efficiency, and optimization. A basic understanding of PHP data types, control structures, and other basic features is required What You Will Learn Gain a better understanding of PHP arrays as a basic data structure and their hidden power Grasp how to analyze algorithms and the Big O Notation Implement linked lists, double linked lists, stack, queues, and priority queues using PHP Work with sorting, searching, and recursive algorithms Make use of greedy, dynamic, and pattern matching algorithms Implement tree, heaps, and graph algorithms Apply PHP functional data structures and built-in data structures and algorithms In Detail PHP has always been the the go-to language for web based application development, but there are materials and resources you can refer to to see how it works. Data structures and algorithms help you to code and execute them effectively, cutting down on processing time significantly. If you want to explore data structures and algorithms in a practical way with real-life projects, then this book is for you. The book begins by introducing you to data structures and algorithms and how to solve a problem from beginning to end using them. Once you are well aware of the basics, it covers the core aspects like arrays, listed lists, stacks and queues. It will take you through several methods of finding efficient algorithms and show you which ones you should implement in each scenario. In addition to this, you will explore the possibilities of functional data structures using PHP and go through advanced algorithms and graphs as well as dynamic programming. By the end, you will be confident enough to tackle both basic and advanced data structures, understand how they work, and know when to use them in your day-to-day work Style and approach An easy-to-follow guide full of examples of implementation of data structures and real world examples to solve the problems faced. Each topic is first explained in general terms and then implemented using step by step explanation so that developers can understand each part of the discussion without any problem.","language":"en","currency":"USD","id":"1786463571","title":"PHP 7 Data Structures and Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xHc5DwAAQBAJ&source=gbs_api","authors":["Mizanur Rahman"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Your go-to guide to creating truly native iOS and Android mobile applications using React and JavaScript About This Book Build cross-platform best seller native mobile applications in JavaScript with React-Native framework Learn about real world examples like Whatsapp, Instagram or Twitter. Learn all steps in React Native application development workflow from prototyping to deployment Get familiar with various mobile APIs covered in React Native framework and learn how to extend it further to non-supported APIs Who This Book Is For This book is for JavaScript developers who want to learn how to create native mobile apps using React Native. What You Will Learn Understand how React Native works under the hood and what makes it an ultimate choice for app development for lots of businesses. Create real world native apps with complex animations and styles Get familiar with important iOS and Android native APIs and access them using React Native Learn authentication techniques and how to connect your app to a real data by using Firebase or your own server Get familiar with lots of community packages considered as industry standard Walk through the whole app development workflow by creating Twitter app clone from design to deployment. Understand application release process to the Apple App Store and Google's Play Store In Detail The emergence of React Native has made creating mobile apps in JavaScript easier for developers. This book introduces you to the React Native framework and the mobile apps development process. It starts with how React Native fits into the world of hybrid apps, and why it's a popular framework. You'll learn how React Native works under the hood--compiling JavaScript to Native code to bridge JavaScript and native apps. Also, you'll learn how to write React Native components and use the ReactJS way of structuring your app. Understand how to use the industry standard Redux architecture as well as MobX--a newly emerging approach for state management--making your apps more robust and scalable. The mobile native world can be intimidating, with lots of platform-specific APIs. In this book, you'll learn about the most important APIs with help of the real-world examples. You'll also learn about the community packages that can help speed up your development. The book explains how to use these packages with JavaScript code, include native modules in your application, and write the modules yourself. Throughout the book, you will see examples of WhatsApp, Instagram, and YouTube apps and learn how to recreate them. You'll also learn debugging and testing techniques, authentication, dealing with real data, and much more. At the end we will walk through design to production process of Twitter app clone and will explain application release process to App Store and Play Store Style and approach This book gives you a solid foundation in building apps with React Native, from the basics to creating a fully functional Twitter clone! With industry best practices, plenty of code examples and complete projects to walk through.","language":"en","currency":"USD","id":"1787129799","title":"React Native - Building Mobile Apps with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJZGDwAAQBAJ&source=gbs_api","authors":["Vladimir Novick"]},{"pageCount":198,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q5NoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Declarative Data Fetching for Modern Web Apps","description":"Why is GraphQL the most innovative technology for fetching data since Ajax? By providing a query language for your APIs and a runtime for fulfilling queries with your data, GraphQL presents a clear alternative to REST and ad hoc web service architectures. With this practical guide, Alex Banks and Eve Porcello deliver a clear learning path for frontend web developers, backend engineers, and project and product managers looking to get started with GraphQL. You’ll explore graph theory, the graph data structure, and GraphQL types before learning hands-on how to build a schema for a photo-sharing application. This book also introduces you to Apollo Client, a popular framework you can use to connect GraphQL to your user interface. Explore graph theory and review popular graph examples in use today Learn how GraphQL applies database querying methods to the internet Create a schema for a PhotoShare application that serves as a roadmap and a contract between the frontend and backend teams Use JavaScript to build a fully functioning GraphQL service and Apollo to implement a client Learn how to prepare GraphQL APIs and clients for production","language":"en","currency":"USD","id":"1492044865","title":"Learning GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q5NoDwAAQBAJ&source=gbs_api","authors":["Eve Porcello","Alex Banks"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=APuKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build fast and type-safe React applications that leverage the JavaScript and OCaml ecosystems","description":"A hands on approach to learning ReasonML from the perspective of a web developer. Key Features Hands on learning by building a real world app shell that includes client-side routing and more. Understand Reason’s ecosystem including BuckleScript and various npm workflows. Learn how Reason differs from TypeScript and Flow, and how to use it to make refactoring less stressful. Book Description ReasonML, also known as Reason, is a new syntax and toolchain for OCaml that was created by Facebook and is meant to be approachable for web developers. Although OCaml has several resources, most of them are from the perspective of systems development. This book, alternatively, explores Reason from the perspective of web development. You'll learn how to use Reason to build safer, simpler React applications and why you would want to do so. Reason supports immutability by default, which works quite well in the context of React. In learning Reason, you will also learn about its ecosystem – BuckleScript, JavaScript interoperability, and various npm workflows. We learn by building a real-world app shell, including a client-side router with page transitions, that we can customize for any Reason project. You'll learn how to leverage OCaml's excellent type system to enforce guarantees about business logic, as well as preventing runtime type errors.You'll also see how the type system can help offload concerns that we once had to keep in our heads. We'll explore using CSS-in-Reason, how to use external JSON in Reason, and how to unit-test critical business logic. By the end of the book, you'll understand why Reason is exploding in popularity and will have a solid foundation on which to continue your journey with Reason. What you will learn Learn why Reason is exploding in popularity and why it's the future of React Become familiar with Reason's syntax and semantics Learn about Reason's ecosystem: BuckleScript and JavaScript interoperability Learn how to build React applications with Reason Learn how to use Reason's type system as a tool to provide amazing guarantees Gain a solid foundation on which to continue your journey Who this book is for The target audience of this book is web developers who are somewhat familiar with ReactJS and who want to learn why ReasonML is the future of ReactJS.","language":"en","currency":"USD","id":"1789344239","title":"ReasonML Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=APuKDwAAQBAJ&source=gbs_api","authors":["Raphael Rafatpanah","Bruno Joseph D'mello"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xH3kDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Design and Build Engaging Intelligent Applications Using SharePoint Framework","description":"Step-by-step guide to learn SharePoint Framework DESCRIPTION SharePoint Framework is the new option for developing SharePoint solutions. In this book, you will learn the basic concepts of SharePoint Framework, how you can create modern solutions using modern open-source toolchain and JavaScript frameworks. You will also learn how you can work with SharePoint lists and libraries and can implement CRUD (create, read, update, and delete) operations. Later, you will also learn how you can work with third-party libraries in SPFx solutions and can create real-world solutions. In the end, you will find some frequently asked questions to work effectively with the SharePoint Framework. This book will give you in-depth knowledge of SharePoint Framework, by learning many real-time examples in SharePoint Online, based on the latest versions of SharePoint Framework. KEY FEATURES - Get an overview of the modern toolchain, node-based development, React JS, and SharePoint Framework - Understand how all the concepts covered in the book can be put to use in developing or building real-time applications using SharePoint Framework - A Step by Step easy to understand guide for beginners to understand the working of SharePoint Framework WHAT WILL YOU LEARN - Learn the basics of SharePoint Framework and modern toolchain - Understand the structure, files, and folders of a SharePoint Framework web part project - Implement web part property panes and develop client-side SharePoint Framework web parts - Integrate third party libraries like jQuery in SharePoint Framework web part - Develop SharePoint Framework extensions, which include Application Customizer, Field Customizer, and ListView Command Set extension - Develop library component type in SharePoint Framework WHO THIS BOOK IS FOR The book is for SharePoint developers, Technical specialists & Consultants. It is also for beginners, who are about to start their SharePoint development journey. Basic web development knowledge, including HTML, JavaScript, and CSS is a prerequisite. TABLE OF CONTENTS 1. Getting started with SharePoint Framework 2. Develop first client-side web part 3. Understanding SharePoint Framework Web Part project structure 4. Working with SharePoint Objects 5. Working with SPFx Web Part Property Pane 6. Different hosting options for SPFx Web Part 7. CRUD operations with different JavaScript frameworks 8. Logging and Debugging in SPFx web parts 9. SharePoint Framework Web part Examples 10. Overview of SharePoint Framework Extensions 11. Library Component Type in Sharepoint framework 12. Frequently Asked Questions in SharePoint Framework","language":"en","currency":"USD","id":"8194334462","title":"Getting Started with SharePoint Framework (SPFx)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xH3kDwAAQBAJ&source=gbs_api","authors":["Vipul Jain"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A fast-paced, hands-on guide to designing and building scalable and maintainable web apps with React 16","description":"Everything you need to start working with React 16 and assess React Fiber About This Book Hands-on examples and tutorials for the latest React 16 release Assess the impact of React Fiber for your future web development Build maintainable and high performance React 16 web applications Who This Book Is For If you're a frontend developer with some knowledge of native JavaScript development and frontend frameworks, wishing to learn the fastest web user interface library there is, then this book is ideal for you. What You Will Learn Learn to code React 16 with hands-on examples and clear tutorials Install powerful React 16 tools to make development much more efficient Understand the impact of React Fiber today and the future of your web development Utilize the Redux application architecture with your React components Create React 16 elements with properties and children Get started with stateless and stateful React components Use JSX to speed up your React 16 development process Add reactivity to your React 16 components with lifecycle methods Test your React 16 components with the Jest test framework In Detail React 16 Essentials, Second Edition, fully updated for React 16, takes you on a fast-paced journey through building your own maintainable React 16 applications. React experts Artemij Fedosejev and Adam Boduch give you all the essentials you need to know and start working with React 16, in this new edition of the best-selling React.js Essentials title. You'll find the latest React 16 code updates, assessment of React Fiber, new coverage of Redux, and how to work as a modern React developer. The authors offer you their current assessment of React Fiber, and you'll soon be exploring React 16 hands on, creating your own single and multiple user interface elements with React 16. You'll then see how to create stateless and stateful components and make them reactive. You'll also learn to interact between your components and lifecycle methods, and gauge how to effectively integrate your user interface components with other JavaScript libraries. Delve deep into the core elements of the Redux architecture and learn how to manage your application and data persistence. Then go the extra mile with the Jest test framework, and run multiple tests on your applications and find solutions to scale without complexity. Today React is used by Facebook, Instagram, Khan Academy, and Imperial College London, to name a few. Many new users recognize the benefits of React and adopt it in their own projects, forming a fast-growing community. The speed at which React has evolved promises a bright future for anyone who invests in learning it today. Let Artemij and Adam bring you a brand new look at React 16 and React Fiber, and move your web development into the future. Style and approach React 16 Essentials, Second Edition, will take you on a fast-paced, hands-on journey through building your own maintainable React 16 applications.","language":"en","currency":"USD","id":"178712634X","title":"React 16 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FkBPDwAAQBAJ&source=gbs_api","authors":["Artemij Fedosejev","Adam Boduch"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zpc9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":null,"description":"This book is a collection of in-depth guides to some some of the tools and resources most used with React, such as Jest and React Router, as well as a discussion about how React works well with D3, and a look at Preact, a lightweight React alternative. These tutorials were all selected from SitePoint's React Hub. It contains: Getting Started with Redux by Michael Wanyoike React Router v4: The Complete Guide by Manjunath M How to Test React Components Using Jest by Jack Franklin Building Animated Components, or How React Makes D3 Better by Swizec Teller Using Preact as a React Alternative by Ahmed Bouchefra","language":"en","currency":"USD","id":"1492065382","title":"React: Tools & Resources","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zpc9DwAAQBAJ&source=gbs_api","authors":["Michael Wanyoike","Manjunath M","Jack Franklin","Swizec Teller","Ahmed Bouchefra"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Ionic是目前集流行与成熟两个特点于一身的跨平台移动开发框架。本书以实例驱动讲解的方式，让仅有简单网页制作基础知识的读者，也能轻松掌握Ionic3.X下的移动应用开发。 本书分为4篇，第1篇是移动开发准备，介绍了Ionic、Phonegap、Cordova、HTML5和移动开发的一些基础知识；第2篇是Ionic基础知识准备与常用库，介绍了配置开发Ionic环境所依赖的Angular、SASS、Gulplodash等业内主流库和工具；第3篇是Ionic组件完全解析，对Ionic的内置样式和TypeScript组件类进行完整解析；第4篇是App项目实战和发布推广，介绍了如何按照业内通行实践的策划、设计、开发过程完成Ionic开发的完整App。在开发完成之后，详解如何为Android和iOS两大移动平台发布和推广更新自己的App。 本书内容详尽、实例丰富，是Ionic初学者、HTML 5爱好者、移动互联网创业者、移动开发人员必备的参考书，同时也适合高等院校和培训学校的师生学习阅读。","language":"zh-CN","currency":"USD","id":"7302503451","title":"Ionic移动开发入门与实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSf7DwAAQBAJ&source=gbs_api","authors":["秦超，李一鸣著"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QvwCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":"ASP. NET 是Microsoft公司推出的新一代建立动态Web应用程序的开发平台。自21世纪初至今，已在全世界普及推广，是目前主流的网络编程工具之一。 本书共八章，提供了前端 、C#基础、控件使用、数据库基础、小型系统开发示例、后端和Js的综合应用示例等各类知识。 本书内容通俗易懂，以由浅入深的方式，向读者介绍相关知识点，是一本较好的ASP. NET 前后端开发的入门书籍。 在讲解相关知识点时，本书设计了许多相关典型示例，做到了“一个知识点至少有一个示例和一个综合应用”，通过实例讲解分析，详尽讲述了实际开发中所需的各类知识。 利用本书，教师可以得心应手地教学，学生也可以轻松地自学。","language":"zh-CN","currency":null,"id":"7550444315","title":"ASP.NET Web应用系统开发：C#","infoLink":"http:\/\/books.google.com\/books?id=QvwCEAAAQBAJ&dq=reactjs&hl=&as_brr=5&source=gbs_api","authors":["彭芳策主编"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Develop microservice-based high performance web apps for the cloud with Go","description":"Discover practical techniques to build cloud-native apps that are scalable, reliable, and always available. Key Features Build well-designed and secure microservices. Enrich your microservices with continous integration and monitoring. Containerize your application with Docker Deploy your application to AWS. Learn how to utilize the powerful AWS services from within your application Book Description Awarded as one of the best books of all time by BookAuthority, Cloud Native Programming with Golang will take you on a journey into the world of microservices and cloud computing with the help of Go. Cloud computing and microservices are two very important concepts in modern software architecture. They represent key skills that ambitious software engineers need to acquire in order to design and build software applications capable of performing and scaling. Go is a modern cross-platform programming language that is very powerful yet simple; it is an excellent choice for microservices and cloud applications. Go is gaining more and more popularity, and becoming a very attractive skill. This book starts by covering the software architectural patterns of cloud applications, as well as practical concepts regarding how to scale, distribute, and deploy those applications. You will also learn how to build a JavaScript-based front-end for your application, using TypeScript and React. From there, we dive into commercial cloud offerings by covering AWS. Finally, we conclude our book by providing some overviews of other concepts and technologies that you can explore, to move from where the book leaves off. What you will learn Understand modern software applications architectures Build secure microservices that can effectively communicate with other services Get to know about event-driven architectures by diving into message queues such as Kafka, Rabbitmq, and AWS SQS. Understand key modern database technologies such as MongoDB, and Amazon’s DynamoDB Leverage the power of containers Explore Amazon cloud services fundamentals Know how to utilize the power of the Go language to access key services in the Amazon cloud such as S3, SQS, DynamoDB and more. Build front-end applications using ReactJS with Go Implement CD for modern applications Who this book is for This book is for developers who want to begin building secure, resilient, robust, and scalable Go applications that are cloud native. Some knowledge of the Go programming language should be sufficient.To build the front-end application, you will also need some knowledge of JavaScript programming.","language":"en","currency":"USD","id":"1787127966","title":"Cloud Native Programming with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvNFDwAAQBAJ&source=gbs_api","authors":["Mina Andrawos","Martin Helmich"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=euweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.35,"subtitle":null,"description":"Как решить проблемы front-end-разработчиков и сделать их жизнь более счастливой? Нужно всего лишь познакомиться с возможностями React! Только так вы сможете быстро выйти на новый уровень и получить не только моральное, но и материальное удовлетворение от веб-разработки. Успешные пользовательские интерфейсы должны быть визуально интересными, быстрыми и гибкими. React ускоряет тяжелые веб-приложения, улучшая поток данных между компонентами UI. Сайты начинают эффективно и плавно обновлять визуальные элементы, сводя к минимуму время на перезагрузку страниц. Перед вами труд, над которым на протяжении полутора лет работало более дюжины человек. Тщательно отобранные примеры и подробные комментарии позволяют разработчикам перейти на React быстро, чтобы затем эффективно создавать веб-приложения, используя всю мощь JavaScript. ВНУТРИ: • Основы React • Создание полнофункциональных веб-приложений с маршрутизацией • Тестирование • Оптимизация приложений React «Эта книга — лучший способ разобраться в React.js». Джон Сонмез, автора книги \"Путь программиста\" «Азат — один из самых авторитетных источников в области программирования. Эта книга выходит за рамки начального уровня и глубоко погружает в основы и архитектуру React». Эрик Хэнчетт, автор книги «Ember.js Cookbook» «React быстро — универсальный источник информации для читателя, который желает освоить React с его экосистемой инструментов, концепций и библиотек». Питер Купер, редактор «JavaScript Weekly» «Эта книга — отличный ресурс для изучения React. Четко и по делу. Я буду пользоваться ей в работе над своим следующим приложением». Натан Бэйли, полностековый разработчик, SpringboardAuto.com","language":"ru","currency":"USD","id":"544610952X","title":"React быстро. Веб-приложения на React, JSX, Redux и GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=euweEAAAQBAJ&source=gbs_api","authors":["Мардан Азат"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxWhDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Building Web Applications and Microservices for the Cloud with Go and React","description":"The Complete Guide to Building Cloud-Based Services Cloud Native Go shows developers how to build massive cloud applications that meet the insatiable demands of today’s customers, and will dynamically scale to handle virtually any volume of data, traffic, or users. Kevin Hoffman and Dan Nemeth describe the modern cloud-native application in detail, illuminating factors, disciplines, and habits associated with rapid, reliable cloud-native development. They also introduce Go, a “simply elegant” high-performance language that is especially well-suited for cloud development. You’ll walk through creating microservices in Go, adding front-end web components using ReactJS and Flux, and mastering advanced Go-based cloud-native techniques. Hoffman and Nemeth show how to build a continuous delivery pipeline with tools like Wercker, Docker, and Dockerhub; automatically push apps to leading platforms; and systematically monitor app performance in production. Learn “The Way of the Cloud”: why developing good cloud software is fundamentally about mindset and discipline Discover why Go is ideal for cloud-native microservices development Plan cloud apps that support continuous delivery and deployment Design service ecosystems, and then build them in a test-first manner Push work-in-progress to a cloud Use Event Sourcing and CQRS patterns to react and respond to enormous volume and throughput Secure cloud-based web applications: do’s, don’ts, and options Create reactive applications in the cloud with third-party messaging providers Build massive-scale, cloud-friendly GUIs with React and Flux Monitor dynamic scaling, failover, and fault tolerance in the cloud","language":"en","currency":"USD","id":"0134505808","title":"Cloud Native Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxWhDQAAQBAJ&source=gbs_api","authors":["Kevin Hoffman","Dan Nemeth"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n9itCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"This book is for web developers and designers who work with React.js and JavaScript and who are new to unit testing and automation. It's assumed that you have a basic knowledge of JavaScript and HTML.","language":"en","currency":"USD","id":"1785283200","title":"Jasmine JavaScript Testing - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n9itCAAAQBAJ&source=gbs_api","authors":["Paulo Ragonha"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BUIwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Leverage the full potential of the React Native framework to build and deploy your own native mobile applications for iOS and Android About This Book Work on native APIs and UI Elements using React Native Get the best of both worlds: the power of native approach and the fluidity of JavaScript Create increasingly complex real-world applications and dive deeper into React Native Who This Book Is For If you are keen on learning to use the revolutionary mobile development tool React Native to build native mobile applications, then this book is for you. Prior experience with JavaScript would be useful. What You Will Learn How to create mobile-performant iOS and Android apps using JavaScript and React The potential of each API and component, putting them into practice throughout the course of three projects The process of integrating the Facebook SDK to build an app that connects to third-party data Every step taken to implement Redux, a popular state management library, in your mobile apps The requirements for building and deploying your apps to market, with detailed instructions on how to release and beta test apps on both the Apple App Store and Google Play In Detail React Native's ability to build performant mobile applications with JavaScript has resulted in its popularity amongst developers. Developers now have the luxury to create incredible mobile experiences that look and feel native to their platforms with the comfort of a well-known language and the popular React.js library. This book will show you how to build your own native mobile applications for the iOS and Android platforms while leveraging the finesse and simplicity of JavaScript and React. Throughout the book you will build three projects, each of increasing complexity. You will also link up with the third-party Facebook SDK, convert an app to support the Redux architecture, and learn the process involved in making your apps available for sale on the iOS App Store and Google Play. At the end of this book, you will have learned and implemented a wide breadth of core APIs and components found in the React Native framework that are necessary in creating great mobile experiences. Style and approach Start building applications immediately using featured examples through an easy-to-follow approach. The book is based on three concrete projects with increasing levels of difficulty. Each chapter will introduce you to new and practical concepts and techniques, with the intent that you will be able to apply them in your own projects later.","language":"en","currency":"USD","id":"1786465647","title":"React Native By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BUIwDwAAQBAJ&source=gbs_api","authors":["Richard Kho"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tgCACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build efficient HTML, CSS and JavaScript applications using the powerful WebStorm IDE About This Book Get to grips with the newest features of WebStorm Use WebStorm to simplify your web development process and improve its efficiency Best practices and cutting-edge technologies for JavaScript development Who This Book Is For If you are a web developer who is new to WebStorm, this is the book for you. Knowledge of languages such as JavaScript, HTML, and CSS is assumed, with a reasonable understanding of frameworks such as AngularJS, Node.js, and Meteor. What You Will Learn Install and configure WebStorm to suit your workflow Develop mobile applications using web technologies with WebStorm Create simple web pages with the help of templates Improve your web development efficiency with WebStorm's built-in features Analyse and debug your code in WebStorm Perform unit testing and debugging in WebStorm to test your applications Get to grips with the latest version of WebStorm (WebStorm 10) to revolutionize your web development experience In Detail JetBrains WebStorm is a commercial and powerful IDE, perfectly equipped for complex client-side development and server-side development with Node.js. It provides first-class support for JavaScript, Node.js, HTML, and CSS. WebStorm is the number one choice for developing web applications due to its advanced features and integration with a plethora of topical technologies such as Meteor and Gulp. This book will be your companion in building high-quality web applications using WebStorm, taking advantage of the newest features of Webstorm 10. You will start with an introduction to the latest features of WebStorm and its interface, followed by learning how to set up a new project with the help of templates. You will then build a web application using AngularJS, ReactJs, Node.js, Express, and Meteor. This book will also show you how to use pioneering HTML5 technologies in mobile application development and package managers, as well as how to build automation tools for your application. Finally, you will discover how to perform debugging, tracing, profiling, and code style checking activities directly in WebStorm, followed by testing your application inside WebStorm, using some of the most popular testing libraries out there. By the end of this book, you will have a solid understanding of how to develop powerful web applications quickly and easily with WebStorm. Style and approach This book is a hands-on guide to getting to grips with WebStorm, complete with plenty of screenshots and tips. New features are introduced to you with the help of sample applications.","language":"en","currency":"USD","id":"1785286463","title":"WebStorm Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tgCACwAAQBAJ&source=gbs_api","authors":["Stefan Rosca","Den Patin"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LfeVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Implement advanced blockchain applications using Ethereum-supported tools, services, and protocols","description":"An expert guide to implementing fast, secure, and scalable decentralized applications that work with thousands of users in real time Key Features Implement advanced features of the Ethereum network to build powerful decentralized applications Build smart contracts on different domains using the programming techniques of Solidity and Vyper Explore the architecture of Ethereum network to understand advanced use cases of blockchain development Book Description Ethereum is one of the commonly used platforms for building blockchain applications. It's a decentralized platform for applications that can run exactly as programmed without being affected by fraud, censorship, or third-party interference. This book will give you a deep understanding of how blockchain works so that you can discover the entire ecosystem, core components, and its implementations. You will get started by understanding how to configure and work with various Ethereum protocols for developing dApps. Next, you will learn to code and create powerful smart contracts that scale with Solidity and Vyper. You will then explore the building blocks of the dApps architecture, and gain insights on how to create your own dApp through a variety of real-world examples. The book will even guide you on how to deploy your dApps on multiple Ethereum instances with the required best practices and techniques. The next few chapters will delve into advanced topics such as, building advanced smart contracts and multi-page frontends using Ethereum blockchain. You will also focus on implementing machine learning techniques to build decentralized autonomous applications, in addition to covering several use cases across a variety of domains such as, social media and e-commerce. By the end of this book, you will have the expertise you need to build decentralized autonomous applications confidently. What you will learn Apply scalability solutions on dApps with Plasma and state channels Understand the important metrics of blockchain for analyzing and determining its state Develop a decentralized web application using React.js and Node.js Create oracles with Node.js to provide external data to smart contracts Get to grips with using Etherscan and block explorers for various transactions Explore web3.js, Solidity, and Vyper for dApps communication Deploy apps with multiple Ethereum instances including TestRPC, private chain, test chain, and mainnet Who this book is for This book is for anyone who wants to build fast, highly secure, and transactional decentralized applications. If you are an Ethereum developer looking to perfect your existing skills in building powerful blockchain applications, then this book is for you. Basic knowledge of Ethereum and blockchain is necessary to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789537185","title":"Mastering Ethereum","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LfeVDwAAQBAJ&source=gbs_api","authors":["Merunas Grincalaitis"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K141DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"A Problem-Solution Approach","description":"Quickly find solutions to common web development problems. Content is presented in the popular problem-solution format. Look up the problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! ASP.NET Core Recipes is a practical guide for developers creating modern web applications, cutting through the complexities of ASP.NET, jQuery, React, and HTML5 to provide straightforward solutions to common web development problems using proven methods based on best practices. The problem-solution approach gets you in, out, and back to work quickly while deepening your understanding of the underlying platform and how to develop with it. Author John Ciliberti guides you through the MVC framework and development tools, presenting typical challenges, along with code solutions and clear, concise explanations, to accelerate application development. Solve problems immediately by pasting in code from the recipes, or put multiple recipe solutions together to overcome challenging development obstacles. What You'll Learn Take advantage of MVC's streamlined syntax Discover how to take full control over HTML Develop a simple API for creating RESTful web services Understand test-driven development Migrate a project from ASP.NET web forms to Core MVC, including recipes for converting DataGrids, Forms, Web Parts, Master Pages, and navigation controls Use Core MVC in combination with popular JavaScript libraries, including jQuery, React, Bootstrap, and more Write unit tests for your MVC controllers, views, custom filters, and HTML helpers Utilize the latest features in Visual Studio 2017 to accelerate your Core MVC projects Identify performance bottlenecks in your MVC application Who This Book Is For Web developers of all skill levels who are looking for a programming reference for ASP.NET Core MVC and would like to gain an understanding of the inner workings of the platform. In addition, parts of this book provide guidance to developers familiar with ASP.NET Web Forms who would like to update their skill set to include Core MVC.","language":"en","currency":"USD","id":"1484204271","title":"ASP.NET Core Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K141DwAAQBAJ&source=gbs_api","authors":["John Ciliberti"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ALFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Supercharge the client state in your React apps with MobX","description":"Apply functional Reactive programming for simple and scalable state management with MobX Key Features The easiest way to learn MobX to enhance your client-side state-management Understand how the concepts and components fit together Work through different state management scenarios with MobX Book Description MobX is a simple and highly scalable state management library in JavaScript. Its abstractions can help you manage state in small to extremely large applications. However, if you are just starting out, it is essential to have a guide that can help you take the first steps. This book aims to be that guide that will equip you with the skills needed to use MobX and effectively handle the state management aspects of your application. You will first learn about observables, actions, and reactions: the core concepts of MobX. To see how MobX really shines and simplifies state management, you'll work through some real-world use cases. Building on these core concepts and use cases, you will learn about advanced MobX, its APIs, and libraries that extend MobX. By the end of this book, you will not only have a solid conceptual understanding of MobX, but also practical experience. You will gain the confidence to tackle many of the common state management problems in your own projects. What you will learn Explore the fundamental concepts of MobX, such as observables, actions, and reactions Use observables to track state and react to its changes with validations and visual feedback (via React Components) Create a MobX observable from different data types Define form data as an observable state and tackle sync and async form validations Use the special APIs to directly manipulate observables, tracking its changes, and discovering the reasons behind a change Tackle any state management issue you may have in your app by combining mobx-utils and mobx-state-tree Explore the internals of the MobX reactive system by diving into its inner workings Who this book is for This book is for web developers who want to implement easy and scalable state management for their apps. Knowledge of HTML, CSS, and JavaScript is assumed","language":"en","currency":"USD","id":"1789348978","title":"MobX Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ALFmDwAAQBAJ&source=gbs_api","authors":["Pavan Podila","Michel Weststrate"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZGGLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.31,"subtitle":null,"description":"Vue.js – это популярная библиотека для создания пользовательских интерфейсов. В ней значительно переосмыслены реактивные идеи, впервые появившиеся в React.js. Книга «Vue.js в действии» рассказывает о создании быстрых и эластичных пользовательских интерфейсов для Интернета. Освоив ее, вы напишете полноценное приложение для интернет-магазина, где будут присутствовать списки товаров, админка, а также организован полноценный процесс онлайнового заказа.","language":"ru","currency":"USD","id":"5446110986","title":"Vue.js в действии","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZGGLDwAAQBAJ&source=gbs_api","authors":["Хэнчетт Эрик","Листуон Бенджамин"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nszcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to build amazing and complex reactive web applications easily with Vue.js About This Book Learn how to propagate DOM changes across the website without writing extensive jQuery callbacks code. Learn how to achieve reactivity and easily compose views with Vue.js and understand what it does behind the scenes. Explore the core features of Vue.js with small examples, learn how to build dynamic content into preexisting web applications, and build Vue.js applications from scratch. Who This Book Is For This book is perfect for novice web developer seeking to learn new technologies or frameworks and also for webdev gurus eager to enrich their experience. Whatever your level of expertise, this book is a great introduction to the wonderful world of reactive web apps. What You Will Learn Build a fully functioning reactive web application in Vue.js from scratch. The importance of the MVVM architecture and how Vue.js compares with other frameworks such as Angular.js and React.js. How to bring reactivity to an existing static application using Vue.js. How to use plugins to enrich your applications. How to develop customized plugins to meet your needs. How to use Vuex to manage global application's state. In Detail Vue.js is one of the latest new frameworks to have piqued the interest of web developers due to its reactivity, reusable components, and ease of use. This book shows developers how to leverage its features to build high-performing, reactive web interfaces with Vue.js. From the initial structuring to full deployment, this book provides step-by-step guidance to developing an interactive web interface from scratch with Vue.js. You will start by building a simple application in Vue.js which will let you observe its features in action. Delving into more complex concepts, you will learn about reactive data binding, reusable components, plugins, filters, and state management with Vuex. This book will also teach you how to bring reactivity to an existing static application using Vue.js. By the time you finish this book you will have built, tested, and deployed a complete reactive application in Vue.js from scratch. Style and approach This book is a thorough, step-by-step guide showing readers how to build complete web apps with Vue.js. While teaching its intricacies, this book shows how to implement the MVVM architecture in the real world and build high-performing web interfaces.","language":"en","currency":"USD","id":"1786461137","title":"Learning Vue.js 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nszcDgAAQBAJ&source=gbs_api","authors":["Olga Filipova"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"A project based guide to help you get started with web development by building real-world and modern web applications About This Book Learn JavaScript from scratch by building clones of popular web applications Understand the core concepts and techniques surrounding JavaScript with this power-packed hands-on guide Explore modern JavaScript frameworks and libraries such as Node, React and Webpack Who This Book Is For The target audience for this book is developers with little or basic knowledge of working with JavaScript. If you are an emerging web developer with experience in building static web pages using HTML and CSS, this book will teach you to add JavaScript elements to make your website interactive and dynamic. What You Will Learn A strong understanding of web application development with JavaScript and ES6. A firm foundation on which to master other JavaScript frameworks and libraries. Write maintainable and scalable code by organizing functions into modules. Importance of tools such as Node, NPM, Babel, and Webpack in Front-end development. Work with real-time data such as incoming video streams, texts, and so on Integrate React with JavaScript to build large-scale applications. Utilize Redux to manage data across React components and greatly speed up the development process In Detail JavaScript is the programming language that all web developers need to learn. The first item on our JavaScript to-do list is building g a To-do list app, which you'll have done by the end of the first chapter. You'll explore DOM manipulation with JavaScript and work with event listeners. You'll work with images and text to build a Meme creator. You will also learn about ES (ECMAScript) classes, and will be introduced to layouts using the CSS3 Flexbox. You'll also develop a responsive Event Registration form that allows users to register for your upcoming event and use charts and graphics to display registration data. You will then build a weather application, which will show you different ways perform AJAX requests and work with dynamic, external data. WebRTC enables real-time communication in a web browser; you'll learn how to use it when you build a real-time video-call and chat application later in the book. Towards the end of the book, you will meet React, Facebook's JavaScript library for building user interfaces. You'll throw together a blog with React, and get a feel for why this kind of JavaScript framework is used to build large-scale applications. To make your blog more maintainable and scalable, you'll use Redux to manage data across React components. Style and approach This project-based guide will teach you all the facets of JavaScript through real-world app examples.","language":"en","currency":"USD","id":"1788299000","title":"JavaScript by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJZGDwAAQBAJ&source=gbs_api","authors":["Dani Akash S"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CaGKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solve modern challenges with functional programming and test-driven techniques of C#","description":"Conquer complex and interesting programming challenges by building robust and concurrent applications with caches, cryptography, and parallel programming. Key Features Understand how to use .NET frameworks like the Task Parallel Library (TPL)and CryptoAPI Develop a containerized application based on microservices architecture Gain insights into memory management techniques in .NET Core Book Description This Learning Path shows you how to create high performing applications and solve programming challenges using a wide range of C# features. You’ll begin by learning how to identify the bottlenecks in writing programs, highlight common performance pitfalls, and apply strategies to detect and resolve these issues early. You'll also study the importance of micro-services architecture for building fast applications and implementing resiliency and security in .NET Core. Then, you'll study the importance of defining and testing boundaries, abstracting away third-party code, and working with different types of test double, such as spies, mocks, and fakes. In addition to describing programming trade-offs, this Learning Path will also help you build a useful toolkit of techniques, including value caching, statistical analysis, and geometric algorithms. This Learning Path includes content from the following Packt products: C# 7 and .NET Core 2.0 High Performance by Ovais Mehboob Ahmed Khan Practical Test-Driven Development using C# 7 by John Callaway, Clayton Hunt The Modern C# Challenge by Rod Stephens What you will learn Measure application performance using BenchmarkDotNet Leverage the Task Parallel Library (TPL) and Parallel Language Integrated Query (PLINQ)library to perform asynchronous operations Modify a legacy application to make it testable Use LINQ and PLINQ to search directories for files matching patterns Find areas of polygons using geometric operations Randomize arrays and lists with extension methods Use cryptographic techniques to encrypt and decrypt strings and files Who this book is for If you want to improve the speed of your code and optimize the performance of your applications, or are simply looking for a practical resource on test driven development, this is the ideal Learning Path for you. Some familiarity with C# and .NET will be beneficial.","language":"en","currency":"USD","id":"1838550313","title":"Improving your C# Skills","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CaGKDwAAQBAJ&source=gbs_api","authors":["Ovais Mehboob Ahmed Khan","John Callaway","Clayton Hunt","Rod Stephens"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hif4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop and run your application with Docker containers using DevOps tools for continuous delivery","description":"Learn how to deploy and test Linux-based Docker containers with the help of real-world use cases Key Features Understand how to make a deployment workflow run smoothly with Docker containers Learn Docker and DevOps concepts such as continuous integration and continuous deployment (CI\/CD) Gain insights into using various Docker tools and libraries Book Description Docker is the de facto standard for containerizing apps, and with an increasing number of software projects migrating to containers, it is crucial for engineers and DevOps teams to understand how to build, deploy, and secure Docker environments effectively. Docker for Developers will help you understand Docker containers from scratch while taking you through best practices and showing you how to address security concerns. Starting with an introduction to Docker, you'll learn how to use containers and VirtualBox for development. You'll explore how containers work and develop projects within them after you've explored different ways to deploy and run containers. The book will also show you how to use Docker containers in production in both single-host set-ups and in clusters and deploy them using Jenkins, Kubernetes, and Spinnaker. As you advance, you'll get to grips with monitoring, securing, and scaling Docker using tools such as Prometheus and Grafana. Later, you'll be able to deploy Docker containers to a variety of environments, including the cloud-native Amazon Elastic Kubernetes Service (Amazon EKS), before finally delving into Docker security concepts and best practices. By the end of the Docker book, you'll be able to not only work in a container-driven environment confidently but also use Docker for both new and existing projects. What you will learn Get up to speed with creating containers and understand how they work Package and deploy your containers to a variety of platforms Work with containers in the cloud and on the Kubernetes platform Deploy and then monitor the health and logs of running containers Explore best practices for working with containers from a security perspective Become familiar with scanning containers and using third-party security tools and libraries Who this book is for If you're a software engineer new to containerization or a DevOps engineer responsible for deploying Docker containers in the cloud and building DevOps pipelines for container-based projects, you'll find this book useful. This Docker containers book is also a handy reference guide for anyone working with a Docker-based DevOps ecosystem or interested in understanding the security implications and best practices for working in container-driven environments.","language":"en","currency":"USD","id":"178953948X","title":"Docker for Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hif4DwAAQBAJ&source=gbs_api","authors":["Richard Bullington-McGuire","Andrew K. Dennis","Michael Schwartz"]},{"pageCount":599,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aIdcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Enhance your JavaScript skills by venturing into the domain of developing mobile applications About This Book Extend your JavaScript skillset to build, test, and launch mobile apps with confidence Follow three sample projects to experience Ionic's impressive capabilities Extend the power of Apache Cordova by creating your own Apache Cordova cross-platform mobile plugins Who This Book Is For This Learning Path is for JavaScript web developers looking to develop mobile applications using various JavaScript descendent technologies. It is for anyone who wants to learn how to build fast and stylish native mobile app using the skills they already have. If you are already using React on the web, we're confident you'll be able to quickly get up and running with React Native for iOS and Android. See Ionic in action, and find out how it can transform the way you build mobile apps. What You Will Learn Develop, build, run, and deploy great cross-platform mobile applications using Apache Cordova Create complete mobile apps using Apache Cordova that runs on Apple iOS, Google Android, and Windows Phone Create a neat user interface for your mobile application using jQuery Mobile Gain an in-depth understanding of how React Native works behind the scenes Write your own custom native UI components Develop native modules in Objective-C and Java that interact with JavaScript Get to know Ionic by creating three complete mobile applications In Detail A great mobile app is rapidly becoming crucial for a huge range of businesses. With a great app, your customers or your readers don't come to you – you go with them, just a few clicks and swipes away. This Learning Path shows you how to build awesome mobile apps with some of the best tools currently being used by some of the smartest developers in the industry. Taking you through JavaScript impressive development ecosystem – from jQuery Mobile to React, through to Ionic – we'll show you how to put your skills into practice so you can build your next mobile apps with confidence and style. In this Learning Path, from jQuery to React, to Ionic, we'll cover everything you need to start In the first module you'll learn how to get stuck into Apache Cordova and find out how to use it as the key platform for developing your mobile app. It offers an efficient way to develop hybrid apps, which means you won't have to connect to platform specific APIs or use their UI framework, and can instead harness your JavaScript web development skills. Make sure you have your HTML, CSS and jQuery skills at the ready. In Module 2 we'll show you how to take advantage of React Native. It has a reputation for having a steep learning curve, but we'll make it easy for you, making sure you make full use of your existing knowledge and getting you up and running with a sample application. You'll also learn how to create components, how to create multiple screens, as well as using native UI components and accessing native APIs. In the third and final module you'll get started with Ionic. With three practical projects you can build yourself, we've made sure that you'll be learning by doing – which means you'll not only develop new skills much more quickly, but you'll have produced something tangible at the end of it! This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: JavaScript Mobile Application Development by Hazem Saleh Getting Started with React Native by Ethan Holmes and Tom Bray Ionic Framework By Example by Sani Yusuf Style and approach This Learning Path course provides a simple and easy way to build mobile applications in JavaScript descendent technologies such as jQuery, ReactJS, and Ionic.","language":"en","currency":"USD","id":"1787122247","title":"Mobile Application Development: JavaScript Frameworks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aIdcDgAAQBAJ&source=gbs_api","authors":["Hazem Saleh","Ethan Holmes","Tom Bray","Sani Yusuf"]},{"pageCount":475,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9XUpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Exam: 70-483","description":"Prepare for Microsoft Certification Exam 70-483: Programming in C#. The “What, Why, and How” of each concept is presented along with quick summaries, code challenges, and exam questions to review and practice key concepts. You will learn how to use: Lambda expressions to write LINQ query expressions Asynchronous programming with the Async and Await keywords to maximize performance of slow applications Regular expressions to validate user input Reflection to create and handle types at runtime and much more The source code in the book will be available in the form of iCanCSharp notebooks and scripts that allow you to try out examples and extend them in interesting ways. What You Will Learn Understand the necessary knowledge and skill set to prepare for Microsoft Exam 70-483 Study the code challenges and practice questions on C# that are relevant to the exam Master the C# programming language Who This Book Is For Experienced C# and .NET programmers and developers who are ready to take and pass the exam in order to get certified","language":"en","currency":"USD","id":"148422860X","title":"The C# Programmer’s Study Guide (MCSD)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9XUpDwAAQBAJ&source=gbs_api","authors":["Ali Asad","Hamza Ali"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"A complete guide to build robust and scalable web applications with Spring and Angular. About This Book This hands on guide will teach you how to build an end-to-end modern web application using Spring and Angular. It is easy to read and will benefit Java developers who have been used to develop the back-end part of web application while front-end (UI) has been left for UI developers. Learn the core aspects involved in developing the backend and the UI, right from designing to integrating and deploying. Who This Book Is For This book is targeted towards Java Web Developers with a basic knowledge of Spring who want to build complete web applications in a fast and effective way. They will want to gain a stronghold on both frontend and backend development to advance in their careers. What You Will Learn Set up development environment for Spring Web App and Angular app. Process web request and response and build REST API endpoints. Create data access components using Spring Web MVC framework and Hibernate Use Junit 5 to test your application Learn the fundamental concepts around building Angular Configure and use Routes and Components. Protect Angular app content from common web vulnerabilities and attacks. Integrate Angular apps with Spring Boot Web API endpoints Deploy the web application based on CI and CD using Jenkins and Docker containers In Detail Spring is the most popular application development framework being adopted by millions of developers around the world to create high performing, easily testable, reusable code. Its lightweight nature and extensibility helps you write robust and highly-scalable server-side web applications. Coupled with the power and efficiency of Angular, creating web applications has never been easier. If you want build end-to-end modern web application using Spring and Angular, then this book is for you. The book directly heads to show you how to create the backend with Spring, showing you how to configure the Spring MVC and handle Web requests. It will take you through the key aspects such as building REST API endpoints, using Hibernate, working with Junit 5 etc. Once you have secured and tested the backend, we will go ahead and start working on the front end with Angular. You will learn about fundamentals of Angular and Typescript and create an SPA using components, routing etc. Finally, you will see how to integrate both the applications with REST protocol and deploy the application using tools such as Jenkins and Docker. Style and approach This is a straightforward guide that shows how to build a complete web application in Angular and Spring.","language":"en","currency":"USD","id":"1787281523","title":"Building Web Apps with Spring 5 and Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpZGDwAAQBAJ&source=gbs_api","authors":["Ajitesh Shukla"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0a0IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.24,"subtitle":null,"description":"基於HTTP 協議運行的WWW (World Wide Web，萬維網) 服務是B\/ S 模式的底層支撐，WWW 簡稱為Web，亦指我們通常所說的網頁。Web 的運行包括兩部分: 前端與後端。通俗地講，Web 前端是指用戶在瀏覽器中能夠直觀看到的某一網頁的界面，它的作用是除了向用戶呈現合理、美觀的網頁內容外，還提供用戶與網站服務器端進行交互的功能，如點擊按鈕、連結等。Web 後端即網站的服務器端，在收到用戶通過前端發送來的訪問請求後，服務器端會自動調用和執行相關程序，如進行數學運算、操作數據庫等，並將程序執行結果返回給Web 前端。通過上述介紹可以看出，Web 前端負責提供良好的用戶體驗，Web 後端則重點負責網站業務邏輯的實現和數據的調度。 需要指出的是，隨著普通PC 和筆記本電腦性能的快速提升，現在越來越多的Web應用將業務邏輯的處理也交由客戶端瀏覽器實施，服務器端僅提供必要的用戶身分認證、數據調度等功能，大大減輕了服務器端的負擔，提升了網站的訪問效率。 Web 前端設計是指網站界面的設計，主要通過HTML、CSS 和JavaScript 三種技術實現。其中HTML 負責提供網頁的結構與內容，CSS 負責對內容進行修飾，JavaScript負責提供適當的動畫效果、用戶網站交互功能等，這三者各司其職、相互配合，共同支撐Web 前端的正常運行。 早期的Web 頁面基本上是純HTML 靜態網頁，僅提供廣播式的信息發布，被稱為Web1.0 時代，其特點是數據流量大；到了2010 年前後，隨著Web2.0 技術的發展，Web 頁面的內容與功能日趨豐富，其特點是互動性較強；目前，Web3.0 的概念已經出現，它的本質特徵是多種數據被整合利用，頁面的智能性高。 Web 前端開發是一個發展活躍的領域，圍繞頁面效率的提升和功能的豐富，新的開發技術不斷湧現，開發模式層出不窮。2006 年出現的jQuery 框架大大提升了JavaScript 語言的開發效率，其影響一直延續到現在；2009 年誕生的Angular.js 技術首次提出前端的MVC 模式(Model–View–Controller)，將網頁內容呈現與業務邏輯的處理分開，提升了開發、調試、運行等的效率；2013 年React.js 框架出現，它利用組件化的開發思想，提高了代碼的復用性，而且擁有較高的執行性能；2014 年，一款輕量級的漸進式前端框架Vue.js 正式發布，它只關注視圖層，學習門檻低，且在很大程度上綜合利用了Angular.js 和React.js 的優點，因而受到較多關注。從上述發展過程我們不難看出，Web 前端開發技術的變化基本上都圍繞JavaScript 語言展開，因此JavaScript 語言在Web 前端領域中有著越來越重要的地位。","language":"zh-TW","currency":"USD","id":"957680468X","title":"ASP.NET Web應用系統開發","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0a0IEAAAQBAJ&source=gbs_api","authors":["彭芳策"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rVhLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mission-critical enterprise applications using Spring Framework and Aspect Oriented Programming About This Book Step into more advanced features of aspect-oriented programming and API components to build enterprise grade systems Build lightning-fast web applications and REST APIs using Spring MVC and its asynchronous processing capabilities with the view technologies of your choice Explore simplified but powerful data access techniques including JPA (Java Persistence Architecture) repositories and NoSQL data access Who This Book Is For If you are a Java developer who is looking to master Enterprise Java Development using Spring Framework, then this book is ideal for you. Prior understanding of core Java programming and a high-level understanding of Spring Framework is recommended. Having sound knowledge of servlet-based web development in Java and basic Database concepts would be an advantage but not a requirement. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Get familiar with JSP Form processing using Spring and Form Tag Library Develop RESTful API applications for XML and JSON data transfers with non-blocking asynchronous capabilities Explore Spring's comprehensive transaction support for declarative Transaction Management and its integration with Spring's data access abstractions Investigate Spring Data access mechanisms with Spring Data Repositories, a simple and consistent data-access abstraction Construct real-time applications using WebSocket with a SockJS fallback option Understand how to secure your Spring Web and standalone applications using Spring Security declaratively and consistently Get to grips with the end-to-end development of an API-based modern SPA using EmberJS at the front end and SpringMVC at the back end In Detail Spring is an open source Java application development framework to build and deploy systems and applications that run on the JVM. It is the industry standard and the most popular framework among Java developers with over two-thirds of developers using it. Spring Essentials makes learning Spring so much quicker and easier with the help of illustrations and practical examples. Starting from the core concepts of features such as inversion of Control Container and BeanFactory, we move on to a detailed look at aspect-oriented programming. We cover the breadth and depth of Spring MVC, the WebSocket technology, Spring Data, and Spring Security with various authentication and authorization mechanisms. Packed with real-world examples, you'll get an insight into utilizing the power of Spring Expression Language in your applications for higher maintainability. You'll also develop full-duplex real-time communication channels using WebSocket and integrate Spring with web technologies such as JSF, Struts 2, and Tapestry. At the tail end, you will build a modern SPA using EmberJS at the front end and a Spring MVC-based API at the back end.By the end of the book, you will be able to develop your own dull-fledged applications with Spring. Style and approach This book is a practical guide based on logical modules of the whole Spring Framework family, with a start-small approach, increasing in complexity as it progresses. Every chapter is an amalgamation of theory and practical examples, with further discussion on additional features and approaches.","language":"en","currency":"USD","id":"1783982357","title":"Spring Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rVhLDAAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qnc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Design and develop next generation web applications using Angular 2 and Angular 4 About This Book Learn about the core building blocks of Angular Build and architect high performance web applications Implement the latest JavaScript concepts in ECMAScript 2015, ECMAScript 2016, and TypeScript Leverage the latest Angular features to get the most out of your web applications Who This Book Is For This book is targeted at JavaScript developers who are interested in learning how to build rich and powerful web applications with the latest version of Angular. Working knowledge of Angular 1 will be beneficial. What You Will Learn Develop a frontend web application using component-based architecture Use ES5, ES2015, and TypeScript to build Angular 4 UI applications Develop simple to complex user interfaces in Angular 4 Develop and handle forms in Angular 4 UI applications Test UIs built in Angular 4 Use material design components and animations in Angular 4 In Detail In the last few years, Angular has established itself as the number one choice of JavaScript Developers. What makes Angular special is performance and productivity. With Angular, developers can work on consistent coding patterns and build web applications that are powerful and scalable. This book will you get you up and running with Angular and teach how to build modern web applications. It starts with basics of Angular 2 and then brushes you up with the new features of Angular 4. You will learn the core concepts involved in building web applications with Angular such as Data Binding, Routing, Dependency Injection, and much more. The book teaches how to build components and use them to build web apps of your choice. It will help you to handle different kinds of forms and learn the concept of reactive programming. Finally the book teaches how to build visually appealing and responsive UIs. Style and approach It follows a practical approach to explain almost every feature of Angular 2 and Angular 4 and their concepts through real-world examples. In each chapter, a different example is used so that you can build a foundation and understand the concepts by applying them in different scenarios.","language":"en","currency":"USD","id":"1785880039","title":"Building Modern Web Applications Using Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qnc5DwAAQBAJ&source=gbs_api","authors":["Shravan Kumar Kasagoni"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-VMoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Enhance your testing skills to build powerful and fault-free applications in Angular v4 About This Book Learn test-driven development (TDD) for JavaScript Improve your Karma and Protractor expertise by setting up an Angular test suite A wide range of testing techniques for professional Angular applications accompanied by practical examples Who This Book Is For This book is for developers who have experience with Angular but want to understand the wider context of when, why, and how to apply testing techniques and best practices to create quality clean code. To get the most out of this book, you should have a good understanding of HTML and JavaScript and a basic understanding of Angular. What You Will Learn Get a clear overview of TDD in the context of JavaScript with a brief look at testing techniques, tools, and frameworks Get an overview of Karma and create test suites for an Angular application Install and configure Protractor for Angular and explore a few important Protractor APIs Understand automated testing and implement headless automated tests with Karma Implement testing techniques with mocks, broadcast events, and asynchronous behavior Integrate REST-based services and APIs into an application to extract data Automate Karma unit tests with Travis CI In Detail This is a complete guide that shows you testing techniques with Karma that will help you perform unit testing and end-to-end testing with Protractor. It will show you how to optimize your Angular development process using TDD techniques and ensure your final project is free of bugs. All examples in this book are based on Angular v2 and are compatible with Angular v4. We start by reviewing the TDD life cycle, TDD in the context of JavaScript, and various JavaScript test tools and frameworks. You will see how Karma and Protractor can make your life easier while running JavaScript unit tests. We will enable you to build a test suite for an Angular application and build a testable medium-to-large scale Angular application by handling REST API data. Building on the initial foundational aspects, we move on to testing for multiple classes, partial views, location references, CSS, and the HTML element. In addition, we will explore how to use a headless browser with Karma. We will also configure a Karma file to automate the testing and tackle elements of Angular (components, services, classes, and broadcasting) using TDD. Finally, you will find out how to pull data using an external API, set up and configure Protractor to use a standalone Selenium server, and set up Travis CI and Karma to test your application. Style and approach This book is a complete guide to Angular unit testing techniques using Karma and performing end-to-end testing with Protractor.","language":"en","currency":"USD","id":"1786462761","title":"Angular Test-Driven Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-VMoDwAAQBAJ&source=gbs_api","authors":["Md. Ziaul Haq"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, test, and deploy scalable and reactive microservices with Rust 2018","description":"A comprehensive guide in developing and deploying high performance microservices with Rust Key Features Start your microservices journey and get a broader perspective on microservices development using RUST 2018, Build, deploy, and test microservices using AWS Explore advanced techniques for developing microservices such as actor model, Requests Routing, and threads Book Description Microservice architecture is sweeping the world as the de facto pattern for building web-based applications. Rust is a language particularly well-suited for building microservices. It is a new system programming language that offers a practical and safe alternative to C. This book describes web development using the Rust programming language and will get you up and running with modern web frameworks and crates with examples of RESTful microservices creation. You will deep dive into Reactive programming, and asynchronous programming, and split your web application into a set of concurrent actors. The book provides several HTTP-handling examples with manageable memory allocations. You will walk through stateless high-performance microservices, which are ideally suitable for computation or caching tasks, and look at stateful microservices, which are filled with persistent data and database interactions. As we move along, you will learn how to use Rust macros to describe business or protocol entities of our application and compile them into native structs, which will be performed at full speed with the help of the server's CPU. Finally, you will be taken through examples of how to test and debug microservices and pack them into a tiny monolithic binary or put them into a container and deploy them to modern cloud platforms such as AWS. What you will learn Get acquainted with leveraging Rust web programming Get to grips with various Rust crates, such as hyper, Tokio, and Actix Explore RESTful microservices with Rust Understand how to pack Rust code to a container using Docker Familiarize yourself with Reactive microservices Deploy your microservices to modern cloud platforms such as AWS Who this book is for This book is for developers who have basic knowledge of RUST, and want to learn how to build, test, scale, and manage RUST microservices. No prior experience of writing microservices in RUST is assumed.","language":"en","currency":"USD","id":"1789341981","title":"Hands-On Microservices with Rust","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cGSGDwAAQBAJ&source=gbs_api","authors":["Denis Kolodin"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HNwkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book is intended for people who are not familiar with AngularJS and who want to take their PhoneGap development skills further by developing apps using different JavaScript libraries. People with some knowledge of PhoneGap, HTML, CSS, and JavaScript will find this book immediately useful.","language":"en","currency":"USD","id":"1783988932","title":"PhoneGap and AngularJS for Cross-platform Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HNwkBQAAQBAJ&source=gbs_api","authors":["Yuxian, Eugene Liang"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eWx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.08,"subtitle":null,"description":"Новое (5-е) издание признанного бестселлера, описывающее как клиентские, так и серверные аспекты веб-разработки. Эта книга поможет вам освоить динамическое веб-программирование с применением самых современных технологий. Книга наполнена ценными практическими советами, содержит подробный теоретический материал. Для закрепления материала автор рассказывает, как создать полнофункциональный сайт, работающий по принципу социальной сети Включая рассказ о React.js • Изучите важнейшие аспекты языка PHP и основы объектно-ориентированного программирования. • Познакомьтесь с базой данных MySQL. • Управляйте cookie-файлами и сеансами, обеспечивайте высокий уровень безопасности. • Пользуйтесь фундаментальными возможностями языка JavaScript. • Применяйте вызовы AJAX, чтобы значительно повысить динамику вашего сайта. • Изучите основы CSS для форматирования и оформления ваших страниц. • Освойте продвинутые возможности HTML5: геолокацию, обработку аудио и видео, отрисовку на холсте","language":"ru","currency":"USD","id":"5446108256","title":"Создаем динамические веб-сайты с помощью PHP, MySQL, JavaScript, CSS и HTML5. 5-е изд.","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eWx9DwAAQBAJ&source=gbs_api","authors":["Никсон Робин"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GqDcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unleash the power of Spring MVC and build enterprise-grade, lightning-fast web applications About This Book Configure Spring MVC to build logic-less controllers that transparently support the most advanced web techniques Secure your developments with easy-to-write, reliable unit and end-to-end tests Get this fast-paced, practical guide to produce REST resources and templates as required by the latest front-end best practices Who This Book Is For This Learning Path is for Java developers who want to exploit Spring MVC and its features to build web applications. It will help you step up in your career and stay up to date or learn more about Spring's web scalability. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Develop RESTful API applications for XML and JSON data transfers Investigate Spring data access mechanisms with Spring Data Repositories Generate templates for a responsive and powerful front end with AngularJS and Bootstrap Authenticate over REST with a BASIC authentication scheme and OAuth2; handle roles and permissions Communicate through WebSocket and STOMP messages Design complex advanced-level forms and validate the model Create maintainable unit and acceptance tests to secure the apps Deploy the web application to the cloud in a snap In Detail Spring MVC helps you build flexible and loosely coupled web applications. The Spring MVC Framework is designed in such a way that every piece of logic and functionality is highly configurable. This Learning Path aims to make you an expert in designing web applications with Spring MVC 4. In our first module, we'll begin with an introduction to the Spring framework. You'll then learn aspect-oriented programming. Packed with real-world examples, you'll get an insight into how you can use Spring Expression Language in your applications to make them easier to manage and maintain. In the second module, you'll learn everything you need to build modern Spring-based enterprise web applications. From practical development techniques and useful tools from the wider Spring ecosystem, to the new JEE standards, the impact of JavaScript, and even the Internet of Things, you'll feel confident that you can deploy Spring for an impressive range of creative purposes. In the final module, you'll find out how to take advantage of Spring MVC's advanced features - essential if you are to properly master the framework. To do this you'll investigate the inner mechanics of Spring MVC, and how they tie into to the broader principles that inform many modern web architectures. With further guidance on how to test, secure, and optimize your application, as well as designing RESTful services, you'll very quickly be ready to use Spring in your next web project. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Spring Essentials by Shameer Kunjumohamed, Hamidreza Sattari Spring MVC Cookbook by Alex Bretet Mastering Spring MVC 4 by Geoffroy Warin Style and approach This is a hands-on, practical guide based on logical modules of the whole Spring framework family, employing a combination of theory and examples with pro-level practices, techniques, and solutions.","language":"en","currency":"USD","id":"1787125084","title":"Spring MVC: Designing Real-World Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GqDcDgAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari","Alex Bretet","Geoffroy Warin"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Increase your productivity by implementing data structures About This Book Gain a complete understanding of data structures using a simple approach Analyze algorithms and learn when you should apply each solution Explore the true potential of functional data structures Who This Book Is For This book is for those who want to learn data structures and algorithms with PHP for better control over application-solution, efficiency, and optimization. A basic understanding of PHP data types, control structures, and other basic features is required What You Will Learn Gain a better understanding of PHP arrays as a basic data structure and their hidden power Grasp how to analyze algorithms and the Big O Notation Implement linked lists, double linked lists, stack, queues, and priority queues using PHP Work with sorting, searching, and recursive algorithms Make use of greedy, dynamic, and pattern matching algorithms Implement tree, heaps, and graph algorithms Apply PHP functional data structures and built-in data structures and algorithms In Detail PHP has always been the the go-to language for web based application development, but there are materials and resources you can refer to to see how it works. Data structures and algorithms help you to code and execute them effectively, cutting down on processing time significantly. If you want to explore data structures and algorithms in a practical way with real-life projects, then this book is for you. The book begins by introducing you to data structures and algorithms and how to solve a problem from beginning to end using them. Once you are well aware of the basics, it covers the core aspects like arrays, listed lists, stacks and queues. It will take you through several methods of finding efficient algorithms and show you which ones you should implement in each scenario. In addition to this, you will explore the possibilities of functional data structures using PHP and go through advanced algorithms and graphs as well as dynamic programming. By the end, you will be confident enough to tackle both basic and advanced data structures, understand how they work, and know when to use them in your day-to-day work Style and approach An easy-to-follow guide full of examples of implementation of data structures and real world examples to solve the problems faced. Each topic is first explained in general terms and then implemented using step by step explanation so that developers can understand each part of the discussion without any problem.","language":"en","currency":"USD","id":"1786463571","title":"PHP 7 Data Structures and Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xHc5DwAAQBAJ&source=gbs_api","authors":["Mizanur Rahman"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Your go-to guide to creating truly native iOS and Android mobile applications using React and JavaScript About This Book Build cross-platform best seller native mobile applications in JavaScript with React-Native framework Learn about real world examples like Whatsapp, Instagram or Twitter. Learn all steps in React Native application development workflow from prototyping to deployment Get familiar with various mobile APIs covered in React Native framework and learn how to extend it further to non-supported APIs Who This Book Is For This book is for JavaScript developers who want to learn how to create native mobile apps using React Native. What You Will Learn Understand how React Native works under the hood and what makes it an ultimate choice for app development for lots of businesses. Create real world native apps with complex animations and styles Get familiar with important iOS and Android native APIs and access them using React Native Learn authentication techniques and how to connect your app to a real data by using Firebase or your own server Get familiar with lots of community packages considered as industry standard Walk through the whole app development workflow by creating Twitter app clone from design to deployment. Understand application release process to the Apple App Store and Google's Play Store In Detail The emergence of React Native has made creating mobile apps in JavaScript easier for developers. This book introduces you to the React Native framework and the mobile apps development process. It starts with how React Native fits into the world of hybrid apps, and why it's a popular framework. You'll learn how React Native works under the hood--compiling JavaScript to Native code to bridge JavaScript and native apps. Also, you'll learn how to write React Native components and use the ReactJS way of structuring your app. Understand how to use the industry standard Redux architecture as well as MobX--a newly emerging approach for state management--making your apps more robust and scalable. The mobile native world can be intimidating, with lots of platform-specific APIs. In this book, you'll learn about the most important APIs with help of the real-world examples. You'll also learn about the community packages that can help speed up your development. The book explains how to use these packages with JavaScript code, include native modules in your application, and write the modules yourself. Throughout the book, you will see examples of WhatsApp, Instagram, and YouTube apps and learn how to recreate them. You'll also learn debugging and testing techniques, authentication, dealing with real data, and much more. At the end we will walk through design to production process of Twitter app clone and will explain application release process to App Store and Play Store Style and approach This book gives you a solid foundation in building apps with React Native, from the basics to creating a fully functional Twitter clone! With industry best practices, plenty of code examples and complete projects to walk through.","language":"en","currency":"USD","id":"1787129799","title":"React Native - Building Mobile Apps with JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YJZGDwAAQBAJ&source=gbs_api","authors":["Vladimir Novick"]},{"pageCount":198,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q5NoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Declarative Data Fetching for Modern Web Apps","description":"Why is GraphQL the most innovative technology for fetching data since Ajax? By providing a query language for your APIs and a runtime for fulfilling queries with your data, GraphQL presents a clear alternative to REST and ad hoc web service architectures. With this practical guide, Alex Banks and Eve Porcello deliver a clear learning path for frontend web developers, backend engineers, and project and product managers looking to get started with GraphQL. You’ll explore graph theory, the graph data structure, and GraphQL types before learning hands-on how to build a schema for a photo-sharing application. This book also introduces you to Apollo Client, a popular framework you can use to connect GraphQL to your user interface. Explore graph theory and review popular graph examples in use today Learn how GraphQL applies database querying methods to the internet Create a schema for a PhotoShare application that serves as a roadmap and a contract between the frontend and backend teams Use JavaScript to build a fully functioning GraphQL service and Apollo to implement a client Learn how to prepare GraphQL APIs and clients for production","language":"en","currency":"USD","id":"1492044865","title":"Learning GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q5NoDwAAQBAJ&source=gbs_api","authors":["Eve Porcello","Alex Banks"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=APuKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build fast and type-safe React applications that leverage the JavaScript and OCaml ecosystems","description":"A hands on approach to learning ReasonML from the perspective of a web developer. Key Features Hands on learning by building a real world app shell that includes client-side routing and more. Understand Reason’s ecosystem including BuckleScript and various npm workflows. Learn how Reason differs from TypeScript and Flow, and how to use it to make refactoring less stressful. Book Description ReasonML, also known as Reason, is a new syntax and toolchain for OCaml that was created by Facebook and is meant to be approachable for web developers. Although OCaml has several resources, most of them are from the perspective of systems development. This book, alternatively, explores Reason from the perspective of web development. You'll learn how to use Reason to build safer, simpler React applications and why you would want to do so. Reason supports immutability by default, which works quite well in the context of React. In learning Reason, you will also learn about its ecosystem – BuckleScript, JavaScript interoperability, and various npm workflows. We learn by building a real-world app shell, including a client-side router with page transitions, that we can customize for any Reason project. You'll learn how to leverage OCaml's excellent type system to enforce guarantees about business logic, as well as preventing runtime type errors.You'll also see how the type system can help offload concerns that we once had to keep in our heads. We'll explore using CSS-in-Reason, how to use external JSON in Reason, and how to unit-test critical business logic. By the end of the book, you'll understand why Reason is exploding in popularity and will have a solid foundation on which to continue your journey with Reason. What you will learn Learn why Reason is exploding in popularity and why it's the future of React Become familiar with Reason's syntax and semantics Learn about Reason's ecosystem: BuckleScript and JavaScript interoperability Learn how to build React applications with Reason Learn how to use Reason's type system as a tool to provide amazing guarantees Gain a solid foundation on which to continue your journey Who this book is for The target audience of this book is web developers who are somewhat familiar with ReactJS and who want to learn why ReasonML is the future of ReactJS.","language":"en","currency":"USD","id":"1789344239","title":"ReasonML Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=APuKDwAAQBAJ&source=gbs_api","authors":["Raphael Rafatpanah","Bruno Joseph D'mello"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xH3kDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Design and Build Engaging Intelligent Applications Using SharePoint Framework","description":"Step-by-step guide to learn SharePoint Framework DESCRIPTION SharePoint Framework is the new option for developing SharePoint solutions. In this book, you will learn the basic concepts of SharePoint Framework, how you can create modern solutions using modern open-source toolchain and JavaScript frameworks. You will also learn how you can work with SharePoint lists and libraries and can implement CRUD (create, read, update, and delete) operations. Later, you will also learn how you can work with third-party libraries in SPFx solutions and can create real-world solutions. In the end, you will find some frequently asked questions to work effectively with the SharePoint Framework. This book will give you in-depth knowledge of SharePoint Framework, by learning many real-time examples in SharePoint Online, based on the latest versions of SharePoint Framework. KEY FEATURES - Get an overview of the modern toolchain, node-based development, React JS, and SharePoint Framework - Understand how all the concepts covered in the book can be put to use in developing or building real-time applications using SharePoint Framework - A Step by Step easy to understand guide for beginners to understand the working of SharePoint Framework WHAT WILL YOU LEARN - Learn the basics of SharePoint Framework and modern toolchain - Understand the structure, files, and folders of a SharePoint Framework web part project - Implement web part property panes and develop client-side SharePoint Framework web parts - Integrate third party libraries like jQuery in SharePoint Framework web part - Develop SharePoint Framework extensions, which include Application Customizer, Field Customizer, and ListView Command Set extension - Develop library component type in SharePoint Framework WHO THIS BOOK IS FOR The book is for SharePoint developers, Technical specialists & Consultants. It is also for beginners, who are about to start their SharePoint development journey. Basic web development knowledge, including HTML, JavaScript, and CSS is a prerequisite. TABLE OF CONTENTS 1. Getting started with SharePoint Framework 2. Develop first client-side web part 3. Understanding SharePoint Framework Web Part project structure 4. Working with SharePoint Objects 5. Working with SPFx Web Part Property Pane 6. Different hosting options for SPFx Web Part 7. CRUD operations with different JavaScript frameworks 8. Logging and Debugging in SPFx web parts 9. SharePoint Framework Web part Examples 10. Overview of SharePoint Framework Extensions 11. Library Component Type in Sharepoint framework 12. Frequently Asked Questions in SharePoint Framework","language":"en","currency":"USD","id":"8194334462","title":"Getting Started with SharePoint Framework (SPFx)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xH3kDwAAQBAJ&source=gbs_api","authors":["Vipul Jain"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"A fast-paced, hands-on guide to designing and building scalable and maintainable web apps with React 16","description":"Everything you need to start working with React 16 and assess React Fiber About This Book Hands-on examples and tutorials for the latest React 16 release Assess the impact of React Fiber for your future web development Build maintainable and high performance React 16 web applications Who This Book Is For If you're a frontend developer with some knowledge of native JavaScript development and frontend frameworks, wishing to learn the fastest web user interface library there is, then this book is ideal for you. What You Will Learn Learn to code React 16 with hands-on examples and clear tutorials Install powerful React 16 tools to make development much more efficient Understand the impact of React Fiber today and the future of your web development Utilize the Redux application architecture with your React components Create React 16 elements with properties and children Get started with stateless and stateful React components Use JSX to speed up your React 16 development process Add reactivity to your React 16 components with lifecycle methods Test your React 16 components with the Jest test framework In Detail React 16 Essentials, Second Edition, fully updated for React 16, takes you on a fast-paced journey through building your own maintainable React 16 applications. React experts Artemij Fedosejev and Adam Boduch give you all the essentials you need to know and start working with React 16, in this new edition of the best-selling React.js Essentials title. You'll find the latest React 16 code updates, assessment of React Fiber, new coverage of Redux, and how to work as a modern React developer. The authors offer you their current assessment of React Fiber, and you'll soon be exploring React 16 hands on, creating your own single and multiple user interface elements with React 16. You'll then see how to create stateless and stateful components and make them reactive. You'll also learn to interact between your components and lifecycle methods, and gauge how to effectively integrate your user interface components with other JavaScript libraries. Delve deep into the core elements of the Redux architecture and learn how to manage your application and data persistence. Then go the extra mile with the Jest test framework, and run multiple tests on your applications and find solutions to scale without complexity. Today React is used by Facebook, Instagram, Khan Academy, and Imperial College London, to name a few. Many new users recognize the benefits of React and adopt it in their own projects, forming a fast-growing community. The speed at which React has evolved promises a bright future for anyone who invests in learning it today. Let Artemij and Adam bring you a brand new look at React 16 and React Fiber, and move your web development into the future. Style and approach React 16 Essentials, Second Edition, will take you on a fast-paced, hands-on journey through building your own maintainable React 16 applications.","language":"en","currency":"USD","id":"178712634X","title":"React 16 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FkBPDwAAQBAJ&source=gbs_api","authors":["Artemij Fedosejev","Adam Boduch"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zpc9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":null,"description":"This book is a collection of in-depth guides to some some of the tools and resources most used with React, such as Jest and React Router, as well as a discussion about how React works well with D3, and a look at Preact, a lightweight React alternative. These tutorials were all selected from SitePoint's React Hub. It contains: Getting Started with Redux by Michael Wanyoike React Router v4: The Complete Guide by Manjunath M How to Test React Components Using Jest by Jack Franklin Building Animated Components, or How React Makes D3 Better by Swizec Teller Using Preact as a React Alternative by Ahmed Bouchefra","language":"en","currency":"USD","id":"1492065382","title":"React: Tools & Resources","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zpc9DwAAQBAJ&source=gbs_api","authors":["Michael Wanyoike","Manjunath M","Jack Franklin","Swizec Teller","Ahmed Bouchefra"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSf7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Ionic是目前集流行与成熟两个特点于一身的跨平台移动开发框架。本书以实例驱动讲解的方式，让仅有简单网页制作基础知识的读者，也能轻松掌握Ionic3.X下的移动应用开发。 本书分为4篇，第1篇是移动开发准备，介绍了Ionic、Phonegap、Cordova、HTML5和移动开发的一些基础知识；第2篇是Ionic基础知识准备与常用库，介绍了配置开发Ionic环境所依赖的Angular、SASS、Gulplodash等业内主流库和工具；第3篇是Ionic组件完全解析，对Ionic的内置样式和TypeScript组件类进行完整解析；第4篇是App项目实战和发布推广，介绍了如何按照业内通行实践的策划、设计、开发过程完成Ionic开发的完整App。在开发完成之后，详解如何为Android和iOS两大移动平台发布和推广更新自己的App。 本书内容详尽、实例丰富，是Ionic初学者、HTML 5爱好者、移动互联网创业者、移动开发人员必备的参考书，同时也适合高等院校和培训学校的师生学习阅读。","language":"zh-CN","currency":"USD","id":"7302503451","title":"Ionic移动开发入门与实战","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSf7DwAAQBAJ&source=gbs_api","authors":["秦超，李一鸣著"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QvwCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":"ASP. NET 是Microsoft公司推出的新一代建立动态Web应用程序的开发平台。自21世纪初至今，已在全世界普及推广，是目前主流的网络编程工具之一。 本书共八章，提供了前端 、C#基础、控件使用、数据库基础、小型系统开发示例、后端和Js的综合应用示例等各类知识。 本书内容通俗易懂，以由浅入深的方式，向读者介绍相关知识点，是一本较好的ASP. NET 前后端开发的入门书籍。 在讲解相关知识点时，本书设计了许多相关典型示例，做到了“一个知识点至少有一个示例和一个综合应用”，通过实例讲解分析，详尽讲述了实际开发中所需的各类知识。 利用本书，教师可以得心应手地教学，学生也可以轻松地自学。","language":"zh-CN","currency":null,"id":"7550444315","title":"ASP.NET Web应用系统开发：C#","infoLink":"http:\/\/books.google.com\/books?id=QvwCEAAAQBAJ&dq=reactjs&hl=&as_brr=5&source=gbs_api","authors":["彭芳策主编"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.49,"subtitle":"Develop microservice-based high performance web apps for the cloud with Go","description":"Discover practical techniques to build cloud-native apps that are scalable, reliable, and always available. Key Features Build well-designed and secure microservices. Enrich your microservices with continous integration and monitoring. Containerize your application with Docker Deploy your application to AWS. Learn how to utilize the powerful AWS services from within your application Book Description Awarded as one of the best books of all time by BookAuthority, Cloud Native Programming with Golang will take you on a journey into the world of microservices and cloud computing with the help of Go. Cloud computing and microservices are two very important concepts in modern software architecture. They represent key skills that ambitious software engineers need to acquire in order to design and build software applications capable of performing and scaling. Go is a modern cross-platform programming language that is very powerful yet simple; it is an excellent choice for microservices and cloud applications. Go is gaining more and more popularity, and becoming a very attractive skill. This book starts by covering the software architectural patterns of cloud applications, as well as practical concepts regarding how to scale, distribute, and deploy those applications. You will also learn how to build a JavaScript-based front-end for your application, using TypeScript and React. From there, we dive into commercial cloud offerings by covering AWS. Finally, we conclude our book by providing some overviews of other concepts and technologies that you can explore, to move from where the book leaves off. What you will learn Understand modern software applications architectures Build secure microservices that can effectively communicate with other services Get to know about event-driven architectures by diving into message queues such as Kafka, Rabbitmq, and AWS SQS. Understand key modern database technologies such as MongoDB, and Amazon’s DynamoDB Leverage the power of containers Explore Amazon cloud services fundamentals Know how to utilize the power of the Go language to access key services in the Amazon cloud such as S3, SQS, DynamoDB and more. Build front-end applications using ReactJS with Go Implement CD for modern applications Who this book is for This book is for developers who want to begin building secure, resilient, robust, and scalable Go applications that are cloud native. Some knowledge of the Go programming language should be sufficient.To build the front-end application, you will also need some knowledge of JavaScript programming.","language":"en","currency":"USD","id":"1787127966","title":"Cloud Native Programming with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NvNFDwAAQBAJ&source=gbs_api","authors":["Mina Andrawos","Martin Helmich"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=euweEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.35,"subtitle":null,"description":"Как решить проблемы front-end-разработчиков и сделать их жизнь более счастливой? Нужно всего лишь познакомиться с возможностями React! Только так вы сможете быстро выйти на новый уровень и получить не только моральное, но и материальное удовлетворение от веб-разработки. Успешные пользовательские интерфейсы должны быть визуально интересными, быстрыми и гибкими. React ускоряет тяжелые веб-приложения, улучшая поток данных между компонентами UI. Сайты начинают эффективно и плавно обновлять визуальные элементы, сводя к минимуму время на перезагрузку страниц. Перед вами труд, над которым на протяжении полутора лет работало более дюжины человек. Тщательно отобранные примеры и подробные комментарии позволяют разработчикам перейти на React быстро, чтобы затем эффективно создавать веб-приложения, используя всю мощь JavaScript. ВНУТРИ: • Основы React • Создание полнофункциональных веб-приложений с маршрутизацией • Тестирование • Оптимизация приложений React «Эта книга — лучший способ разобраться в React.js». Джон Сонмез, автора книги \"Путь программиста\" «Азат — один из самых авторитетных источников в области программирования. Эта книга выходит за рамки начального уровня и глубоко погружает в основы и архитектуру React». Эрик Хэнчетт, автор книги «Ember.js Cookbook» «React быстро — универсальный источник информации для читателя, который желает освоить React с его экосистемой инструментов, концепций и библиотек». Питер Купер, редактор «JavaScript Weekly» «Эта книга — отличный ресурс для изучения React. Четко и по делу. Я буду пользоваться ей в работе над своим следующим приложением». Натан Бэйли, полностековый разработчик, SpringboardAuto.com","language":"ru","currency":"USD","id":"544610952X","title":"React быстро. Веб-приложения на React, JSX, Redux и GraphQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=euweEAAAQBAJ&source=gbs_api","authors":["Мардан Азат"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JxWhDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Building Web Applications and Microservices for the Cloud with Go and React","description":"The Complete Guide to Building Cloud-Based Services Cloud Native Go shows developers how to build massive cloud applications that meet the insatiable demands of today’s customers, and will dynamically scale to handle virtually any volume of data, traffic, or users. Kevin Hoffman and Dan Nemeth describe the modern cloud-native application in detail, illuminating factors, disciplines, and habits associated with rapid, reliable cloud-native development. They also introduce Go, a “simply elegant” high-performance language that is especially well-suited for cloud development. You’ll walk through creating microservices in Go, adding front-end web components using ReactJS and Flux, and mastering advanced Go-based cloud-native techniques. Hoffman and Nemeth show how to build a continuous delivery pipeline with tools like Wercker, Docker, and Dockerhub; automatically push apps to leading platforms; and systematically monitor app performance in production. Learn “The Way of the Cloud”: why developing good cloud software is fundamentally about mindset and discipline Discover why Go is ideal for cloud-native microservices development Plan cloud apps that support continuous delivery and deployment Design service ecosystems, and then build them in a test-first manner Push work-in-progress to a cloud Use Event Sourcing and CQRS patterns to react and respond to enormous volume and throughput Secure cloud-based web applications: do’s, don’ts, and options Create reactive applications in the cloud with third-party messaging providers Build massive-scale, cloud-friendly GUIs with React and Flux Monitor dynamic scaling, failover, and fault tolerance in the cloud","language":"en","currency":"USD","id":"0134505808","title":"Cloud Native Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JxWhDQAAQBAJ&source=gbs_api","authors":["Kevin Hoffman","Dan Nemeth"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n9itCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"This book is for web developers and designers who work with React.js and JavaScript and who are new to unit testing and automation. It's assumed that you have a basic knowledge of JavaScript and HTML.","language":"en","currency":"USD","id":"1785283200","title":"Jasmine JavaScript Testing - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n9itCAAAQBAJ&source=gbs_api","authors":["Paulo Ragonha"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BUIwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Leverage the full potential of the React Native framework to build and deploy your own native mobile applications for iOS and Android About This Book Work on native APIs and UI Elements using React Native Get the best of both worlds: the power of native approach and the fluidity of JavaScript Create increasingly complex real-world applications and dive deeper into React Native Who This Book Is For If you are keen on learning to use the revolutionary mobile development tool React Native to build native mobile applications, then this book is for you. Prior experience with JavaScript would be useful. What You Will Learn How to create mobile-performant iOS and Android apps using JavaScript and React The potential of each API and component, putting them into practice throughout the course of three projects The process of integrating the Facebook SDK to build an app that connects to third-party data Every step taken to implement Redux, a popular state management library, in your mobile apps The requirements for building and deploying your apps to market, with detailed instructions on how to release and beta test apps on both the Apple App Store and Google Play In Detail React Native's ability to build performant mobile applications with JavaScript has resulted in its popularity amongst developers. Developers now have the luxury to create incredible mobile experiences that look and feel native to their platforms with the comfort of a well-known language and the popular React.js library. This book will show you how to build your own native mobile applications for the iOS and Android platforms while leveraging the finesse and simplicity of JavaScript and React. Throughout the book you will build three projects, each of increasing complexity. You will also link up with the third-party Facebook SDK, convert an app to support the Redux architecture, and learn the process involved in making your apps available for sale on the iOS App Store and Google Play. At the end of this book, you will have learned and implemented a wide breadth of core APIs and components found in the React Native framework that are necessary in creating great mobile experiences. Style and approach Start building applications immediately using featured examples through an easy-to-follow approach. The book is based on three concrete projects with increasing levels of difficulty. Each chapter will introduce you to new and practical concepts and techniques, with the intent that you will be able to apply them in your own projects later.","language":"en","currency":"USD","id":"1786465647","title":"React Native By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BUIwDwAAQBAJ&source=gbs_api","authors":["Richard Kho"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tgCACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build efficient HTML, CSS and JavaScript applications using the powerful WebStorm IDE About This Book Get to grips with the newest features of WebStorm Use WebStorm to simplify your web development process and improve its efficiency Best practices and cutting-edge technologies for JavaScript development Who This Book Is For If you are a web developer who is new to WebStorm, this is the book for you. Knowledge of languages such as JavaScript, HTML, and CSS is assumed, with a reasonable understanding of frameworks such as AngularJS, Node.js, and Meteor. What You Will Learn Install and configure WebStorm to suit your workflow Develop mobile applications using web technologies with WebStorm Create simple web pages with the help of templates Improve your web development efficiency with WebStorm's built-in features Analyse and debug your code in WebStorm Perform unit testing and debugging in WebStorm to test your applications Get to grips with the latest version of WebStorm (WebStorm 10) to revolutionize your web development experience In Detail JetBrains WebStorm is a commercial and powerful IDE, perfectly equipped for complex client-side development and server-side development with Node.js. It provides first-class support for JavaScript, Node.js, HTML, and CSS. WebStorm is the number one choice for developing web applications due to its advanced features and integration with a plethora of topical technologies such as Meteor and Gulp. This book will be your companion in building high-quality web applications using WebStorm, taking advantage of the newest features of Webstorm 10. You will start with an introduction to the latest features of WebStorm and its interface, followed by learning how to set up a new project with the help of templates. You will then build a web application using AngularJS, ReactJs, Node.js, Express, and Meteor. This book will also show you how to use pioneering HTML5 technologies in mobile application development and package managers, as well as how to build automation tools for your application. Finally, you will discover how to perform debugging, tracing, profiling, and code style checking activities directly in WebStorm, followed by testing your application inside WebStorm, using some of the most popular testing libraries out there. By the end of this book, you will have a solid understanding of how to develop powerful web applications quickly and easily with WebStorm. Style and approach This book is a hands-on guide to getting to grips with WebStorm, complete with plenty of screenshots and tips. New features are introduced to you with the help of sample applications.","language":"en","currency":"USD","id":"1785286463","title":"WebStorm Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tgCACwAAQBAJ&source=gbs_api","authors":["Stefan Rosca","Den Patin"]},{"pageCount":490,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LfeVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Implement advanced blockchain applications using Ethereum-supported tools, services, and protocols","description":"An expert guide to implementing fast, secure, and scalable decentralized applications that work with thousands of users in real time Key Features Implement advanced features of the Ethereum network to build powerful decentralized applications Build smart contracts on different domains using the programming techniques of Solidity and Vyper Explore the architecture of Ethereum network to understand advanced use cases of blockchain development Book Description Ethereum is one of the commonly used platforms for building blockchain applications. It's a decentralized platform for applications that can run exactly as programmed without being affected by fraud, censorship, or third-party interference. This book will give you a deep understanding of how blockchain works so that you can discover the entire ecosystem, core components, and its implementations. You will get started by understanding how to configure and work with various Ethereum protocols for developing dApps. Next, you will learn to code and create powerful smart contracts that scale with Solidity and Vyper. You will then explore the building blocks of the dApps architecture, and gain insights on how to create your own dApp through a variety of real-world examples. The book will even guide you on how to deploy your dApps on multiple Ethereum instances with the required best practices and techniques. The next few chapters will delve into advanced topics such as, building advanced smart contracts and multi-page frontends using Ethereum blockchain. You will also focus on implementing machine learning techniques to build decentralized autonomous applications, in addition to covering several use cases across a variety of domains such as, social media and e-commerce. By the end of this book, you will have the expertise you need to build decentralized autonomous applications confidently. What you will learn Apply scalability solutions on dApps with Plasma and state channels Understand the important metrics of blockchain for analyzing and determining its state Develop a decentralized web application using React.js and Node.js Create oracles with Node.js to provide external data to smart contracts Get to grips with using Etherscan and block explorers for various transactions Explore web3.js, Solidity, and Vyper for dApps communication Deploy apps with multiple Ethereum instances including TestRPC, private chain, test chain, and mainnet Who this book is for This book is for anyone who wants to build fast, highly secure, and transactional decentralized applications. If you are an Ethereum developer looking to perfect your existing skills in building powerful blockchain applications, then this book is for you. Basic knowledge of Ethereum and blockchain is necessary to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789537185","title":"Mastering Ethereum","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LfeVDwAAQBAJ&source=gbs_api","authors":["Merunas Grincalaitis"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K141DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"A Problem-Solution Approach","description":"Quickly find solutions to common web development problems. Content is presented in the popular problem-solution format. Look up the problem that you want to solve. Read the solution. Apply the solution directly in your own code. Problem solved! ASP.NET Core Recipes is a practical guide for developers creating modern web applications, cutting through the complexities of ASP.NET, jQuery, React, and HTML5 to provide straightforward solutions to common web development problems using proven methods based on best practices. The problem-solution approach gets you in, out, and back to work quickly while deepening your understanding of the underlying platform and how to develop with it. Author John Ciliberti guides you through the MVC framework and development tools, presenting typical challenges, along with code solutions and clear, concise explanations, to accelerate application development. Solve problems immediately by pasting in code from the recipes, or put multiple recipe solutions together to overcome challenging development obstacles. What You'll Learn Take advantage of MVC's streamlined syntax Discover how to take full control over HTML Develop a simple API for creating RESTful web services Understand test-driven development Migrate a project from ASP.NET web forms to Core MVC, including recipes for converting DataGrids, Forms, Web Parts, Master Pages, and navigation controls Use Core MVC in combination with popular JavaScript libraries, including jQuery, React, Bootstrap, and more Write unit tests for your MVC controllers, views, custom filters, and HTML helpers Utilize the latest features in Visual Studio 2017 to accelerate your Core MVC projects Identify performance bottlenecks in your MVC application Who This Book Is For Web developers of all skill levels who are looking for a programming reference for ASP.NET Core MVC and would like to gain an understanding of the inner workings of the platform. In addition, parts of this book provide guidance to developers familiar with ASP.NET Web Forms who would like to update their skill set to include Core MVC.","language":"en","currency":"USD","id":"1484204271","title":"ASP.NET Core Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K141DwAAQBAJ&source=gbs_api","authors":["John Ciliberti"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ALFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Supercharge the client state in your React apps with MobX","description":"Apply functional Reactive programming for simple and scalable state management with MobX Key Features The easiest way to learn MobX to enhance your client-side state-management Understand how the concepts and components fit together Work through different state management scenarios with MobX Book Description MobX is a simple and highly scalable state management library in JavaScript. Its abstractions can help you manage state in small to extremely large applications. However, if you are just starting out, it is essential to have a guide that can help you take the first steps. This book aims to be that guide that will equip you with the skills needed to use MobX and effectively handle the state management aspects of your application. You will first learn about observables, actions, and reactions: the core concepts of MobX. To see how MobX really shines and simplifies state management, you'll work through some real-world use cases. Building on these core concepts and use cases, you will learn about advanced MobX, its APIs, and libraries that extend MobX. By the end of this book, you will not only have a solid conceptual understanding of MobX, but also practical experience. You will gain the confidence to tackle many of the common state management problems in your own projects. What you will learn Explore the fundamental concepts of MobX, such as observables, actions, and reactions Use observables to track state and react to its changes with validations and visual feedback (via React Components) Create a MobX observable from different data types Define form data as an observable state and tackle sync and async form validations Use the special APIs to directly manipulate observables, tracking its changes, and discovering the reasons behind a change Tackle any state management issue you may have in your app by combining mobx-utils and mobx-state-tree Explore the internals of the MobX reactive system by diving into its inner workings Who this book is for This book is for web developers who want to implement easy and scalable state management for their apps. Knowledge of HTML, CSS, and JavaScript is assumed","language":"en","currency":"USD","id":"1789348978","title":"MobX Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ALFmDwAAQBAJ&source=gbs_api","authors":["Pavan Podila","Michel Weststrate"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZGGLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.31,"subtitle":null,"description":"Vue.js – это популярная библиотека для создания пользовательских интерфейсов. В ней значительно переосмыслены реактивные идеи, впервые появившиеся в React.js. Книга «Vue.js в действии» рассказывает о создании быстрых и эластичных пользовательских интерфейсов для Интернета. Освоив ее, вы напишете полноценное приложение для интернет-магазина, где будут присутствовать списки товаров, админка, а также организован полноценный процесс онлайнового заказа.","language":"ru","currency":"USD","id":"5446110986","title":"Vue.js в действии","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZGGLDwAAQBAJ&source=gbs_api","authors":["Хэнчетт Эрик","Листуон Бенджамин"]},{"pageCount":334,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nszcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Learn how to build amazing and complex reactive web applications easily with Vue.js About This Book Learn how to propagate DOM changes across the website without writing extensive jQuery callbacks code. Learn how to achieve reactivity and easily compose views with Vue.js and understand what it does behind the scenes. Explore the core features of Vue.js with small examples, learn how to build dynamic content into preexisting web applications, and build Vue.js applications from scratch. Who This Book Is For This book is perfect for novice web developer seeking to learn new technologies or frameworks and also for webdev gurus eager to enrich their experience. Whatever your level of expertise, this book is a great introduction to the wonderful world of reactive web apps. What You Will Learn Build a fully functioning reactive web application in Vue.js from scratch. The importance of the MVVM architecture and how Vue.js compares with other frameworks such as Angular.js and React.js. How to bring reactivity to an existing static application using Vue.js. How to use plugins to enrich your applications. How to develop customized plugins to meet your needs. How to use Vuex to manage global application's state. In Detail Vue.js is one of the latest new frameworks to have piqued the interest of web developers due to its reactivity, reusable components, and ease of use. This book shows developers how to leverage its features to build high-performing, reactive web interfaces with Vue.js. From the initial structuring to full deployment, this book provides step-by-step guidance to developing an interactive web interface from scratch with Vue.js. You will start by building a simple application in Vue.js which will let you observe its features in action. Delving into more complex concepts, you will learn about reactive data binding, reusable components, plugins, filters, and state management with Vuex. This book will also teach you how to bring reactivity to an existing static application using Vue.js. By the time you finish this book you will have built, tested, and deployed a complete reactive application in Vue.js from scratch. Style and approach This book is a thorough, step-by-step guide showing readers how to build complete web apps with Vue.js. While teaching its intricacies, this book shows how to implement the MVVM architecture in the real world and build high-performing web interfaces.","language":"en","currency":"USD","id":"1786461137","title":"Learning Vue.js 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nszcDgAAQBAJ&source=gbs_api","authors":["Olga Filipova"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"A project based guide to help you get started with web development by building real-world and modern web applications About This Book Learn JavaScript from scratch by building clones of popular web applications Understand the core concepts and techniques surrounding JavaScript with this power-packed hands-on guide Explore modern JavaScript frameworks and libraries such as Node, React and Webpack Who This Book Is For The target audience for this book is developers with little or basic knowledge of working with JavaScript. If you are an emerging web developer with experience in building static web pages using HTML and CSS, this book will teach you to add JavaScript elements to make your website interactive and dynamic. What You Will Learn A strong understanding of web application development with JavaScript and ES6. A firm foundation on which to master other JavaScript frameworks and libraries. Write maintainable and scalable code by organizing functions into modules. Importance of tools such as Node, NPM, Babel, and Webpack in Front-end development. Work with real-time data such as incoming video streams, texts, and so on Integrate React with JavaScript to build large-scale applications. Utilize Redux to manage data across React components and greatly speed up the development process In Detail JavaScript is the programming language that all web developers need to learn. The first item on our JavaScript to-do list is building g a To-do list app, which you'll have done by the end of the first chapter. You'll explore DOM manipulation with JavaScript and work with event listeners. You'll work with images and text to build a Meme creator. You will also learn about ES (ECMAScript) classes, and will be introduced to layouts using the CSS3 Flexbox. You'll also develop a responsive Event Registration form that allows users to register for your upcoming event and use charts and graphics to display registration data. You will then build a weather application, which will show you different ways perform AJAX requests and work with dynamic, external data. WebRTC enables real-time communication in a web browser; you'll learn how to use it when you build a real-time video-call and chat application later in the book. Towards the end of the book, you will meet React, Facebook's JavaScript library for building user interfaces. You'll throw together a blog with React, and get a feel for why this kind of JavaScript framework is used to build large-scale applications. To make your blog more maintainable and scalable, you'll use Redux to manage data across React components. Style and approach This project-based guide will teach you all the facets of JavaScript through real-world app examples.","language":"en","currency":"USD","id":"1788299000","title":"JavaScript by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WJZGDwAAQBAJ&source=gbs_api","authors":["Dani Akash S"]},{"pageCount":606,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CaGKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solve modern challenges with functional programming and test-driven techniques of C#","description":"Conquer complex and interesting programming challenges by building robust and concurrent applications with caches, cryptography, and parallel programming. Key Features Understand how to use .NET frameworks like the Task Parallel Library (TPL)and CryptoAPI Develop a containerized application based on microservices architecture Gain insights into memory management techniques in .NET Core Book Description This Learning Path shows you how to create high performing applications and solve programming challenges using a wide range of C# features. You’ll begin by learning how to identify the bottlenecks in writing programs, highlight common performance pitfalls, and apply strategies to detect and resolve these issues early. You'll also study the importance of micro-services architecture for building fast applications and implementing resiliency and security in .NET Core. Then, you'll study the importance of defining and testing boundaries, abstracting away third-party code, and working with different types of test double, such as spies, mocks, and fakes. In addition to describing programming trade-offs, this Learning Path will also help you build a useful toolkit of techniques, including value caching, statistical analysis, and geometric algorithms. This Learning Path includes content from the following Packt products: C# 7 and .NET Core 2.0 High Performance by Ovais Mehboob Ahmed Khan Practical Test-Driven Development using C# 7 by John Callaway, Clayton Hunt The Modern C# Challenge by Rod Stephens What you will learn Measure application performance using BenchmarkDotNet Leverage the Task Parallel Library (TPL) and Parallel Language Integrated Query (PLINQ)library to perform asynchronous operations Modify a legacy application to make it testable Use LINQ and PLINQ to search directories for files matching patterns Find areas of polygons using geometric operations Randomize arrays and lists with extension methods Use cryptographic techniques to encrypt and decrypt strings and files Who this book is for If you want to improve the speed of your code and optimize the performance of your applications, or are simply looking for a practical resource on test driven development, this is the ideal Learning Path for you. Some familiarity with C# and .NET will be beneficial.","language":"en","currency":"USD","id":"1838550313","title":"Improving your C# Skills","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CaGKDwAAQBAJ&source=gbs_api","authors":["Ovais Mehboob Ahmed Khan","John Callaway","Clayton Hunt","Rod Stephens"]},{"pageCount":468,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hif4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop and run your application with Docker containers using DevOps tools for continuous delivery","description":"Learn how to deploy and test Linux-based Docker containers with the help of real-world use cases Key Features Understand how to make a deployment workflow run smoothly with Docker containers Learn Docker and DevOps concepts such as continuous integration and continuous deployment (CI\/CD) Gain insights into using various Docker tools and libraries Book Description Docker is the de facto standard for containerizing apps, and with an increasing number of software projects migrating to containers, it is crucial for engineers and DevOps teams to understand how to build, deploy, and secure Docker environments effectively. Docker for Developers will help you understand Docker containers from scratch while taking you through best practices and showing you how to address security concerns. Starting with an introduction to Docker, you'll learn how to use containers and VirtualBox for development. You'll explore how containers work and develop projects within them after you've explored different ways to deploy and run containers. The book will also show you how to use Docker containers in production in both single-host set-ups and in clusters and deploy them using Jenkins, Kubernetes, and Spinnaker. As you advance, you'll get to grips with monitoring, securing, and scaling Docker using tools such as Prometheus and Grafana. Later, you'll be able to deploy Docker containers to a variety of environments, including the cloud-native Amazon Elastic Kubernetes Service (Amazon EKS), before finally delving into Docker security concepts and best practices. By the end of the Docker book, you'll be able to not only work in a container-driven environment confidently but also use Docker for both new and existing projects. What you will learn Get up to speed with creating containers and understand how they work Package and deploy your containers to a variety of platforms Work with containers in the cloud and on the Kubernetes platform Deploy and then monitor the health and logs of running containers Explore best practices for working with containers from a security perspective Become familiar with scanning containers and using third-party security tools and libraries Who this book is for If you're a software engineer new to containerization or a DevOps engineer responsible for deploying Docker containers in the cloud and building DevOps pipelines for container-based projects, you'll find this book useful. This Docker containers book is also a handy reference guide for anyone working with a Docker-based DevOps ecosystem or interested in understanding the security implications and best practices for working in container-driven environments.","language":"en","currency":"USD","id":"178953948X","title":"Docker for Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hif4DwAAQBAJ&source=gbs_api","authors":["Richard Bullington-McGuire","Andrew K. Dennis","Michael Schwartz"]},{"pageCount":599,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aIdcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":null,"description":"Enhance your JavaScript skills by venturing into the domain of developing mobile applications About This Book Extend your JavaScript skillset to build, test, and launch mobile apps with confidence Follow three sample projects to experience Ionic's impressive capabilities Extend the power of Apache Cordova by creating your own Apache Cordova cross-platform mobile plugins Who This Book Is For This Learning Path is for JavaScript web developers looking to develop mobile applications using various JavaScript descendent technologies. It is for anyone who wants to learn how to build fast and stylish native mobile app using the skills they already have. If you are already using React on the web, we're confident you'll be able to quickly get up and running with React Native for iOS and Android. See Ionic in action, and find out how it can transform the way you build mobile apps. What You Will Learn Develop, build, run, and deploy great cross-platform mobile applications using Apache Cordova Create complete mobile apps using Apache Cordova that runs on Apple iOS, Google Android, and Windows Phone Create a neat user interface for your mobile application using jQuery Mobile Gain an in-depth understanding of how React Native works behind the scenes Write your own custom native UI components Develop native modules in Objective-C and Java that interact with JavaScript Get to know Ionic by creating three complete mobile applications In Detail A great mobile app is rapidly becoming crucial for a huge range of businesses. With a great app, your customers or your readers don't come to you – you go with them, just a few clicks and swipes away. This Learning Path shows you how to build awesome mobile apps with some of the best tools currently being used by some of the smartest developers in the industry. Taking you through JavaScript impressive development ecosystem – from jQuery Mobile to React, through to Ionic – we'll show you how to put your skills into practice so you can build your next mobile apps with confidence and style. In this Learning Path, from jQuery to React, to Ionic, we'll cover everything you need to start In the first module you'll learn how to get stuck into Apache Cordova and find out how to use it as the key platform for developing your mobile app. It offers an efficient way to develop hybrid apps, which means you won't have to connect to platform specific APIs or use their UI framework, and can instead harness your JavaScript web development skills. Make sure you have your HTML, CSS and jQuery skills at the ready. In Module 2 we'll show you how to take advantage of React Native. It has a reputation for having a steep learning curve, but we'll make it easy for you, making sure you make full use of your existing knowledge and getting you up and running with a sample application. You'll also learn how to create components, how to create multiple screens, as well as using native UI components and accessing native APIs. In the third and final module you'll get started with Ionic. With three practical projects you can build yourself, we've made sure that you'll be learning by doing – which means you'll not only develop new skills much more quickly, but you'll have produced something tangible at the end of it! This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: JavaScript Mobile Application Development by Hazem Saleh Getting Started with React Native by Ethan Holmes and Tom Bray Ionic Framework By Example by Sani Yusuf Style and approach This Learning Path course provides a simple and easy way to build mobile applications in JavaScript descendent technologies such as jQuery, ReactJS, and Ionic.","language":"en","currency":"USD","id":"1787122247","title":"Mobile Application Development: JavaScript Frameworks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aIdcDgAAQBAJ&source=gbs_api","authors":["Hazem Saleh","Ethan Holmes","Tom Bray","Sani Yusuf"]},{"pageCount":475,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9XUpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Exam: 70-483","description":"Prepare for Microsoft Certification Exam 70-483: Programming in C#. The “What, Why, and How” of each concept is presented along with quick summaries, code challenges, and exam questions to review and practice key concepts. You will learn how to use: Lambda expressions to write LINQ query expressions Asynchronous programming with the Async and Await keywords to maximize performance of slow applications Regular expressions to validate user input Reflection to create and handle types at runtime and much more The source code in the book will be available in the form of iCanCSharp notebooks and scripts that allow you to try out examples and extend them in interesting ways. What You Will Learn Understand the necessary knowledge and skill set to prepare for Microsoft Exam 70-483 Study the code challenges and practice questions on C# that are relevant to the exam Master the C# programming language Who This Book Is For Experienced C# and .NET programmers and developers who are ready to take and pass the exam in order to get certified","language":"en","currency":"USD","id":"148422860X","title":"The C# Programmer’s Study Guide (MCSD)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9XUpDwAAQBAJ&source=gbs_api","authors":["Ali Asad","Hamza Ali"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"A complete guide to build robust and scalable web applications with Spring and Angular. About This Book This hands on guide will teach you how to build an end-to-end modern web application using Spring and Angular. It is easy to read and will benefit Java developers who have been used to develop the back-end part of web application while front-end (UI) has been left for UI developers. Learn the core aspects involved in developing the backend and the UI, right from designing to integrating and deploying. Who This Book Is For This book is targeted towards Java Web Developers with a basic knowledge of Spring who want to build complete web applications in a fast and effective way. They will want to gain a stronghold on both frontend and backend development to advance in their careers. What You Will Learn Set up development environment for Spring Web App and Angular app. Process web request and response and build REST API endpoints. Create data access components using Spring Web MVC framework and Hibernate Use Junit 5 to test your application Learn the fundamental concepts around building Angular Configure and use Routes and Components. Protect Angular app content from common web vulnerabilities and attacks. Integrate Angular apps with Spring Boot Web API endpoints Deploy the web application based on CI and CD using Jenkins and Docker containers In Detail Spring is the most popular application development framework being adopted by millions of developers around the world to create high performing, easily testable, reusable code. Its lightweight nature and extensibility helps you write robust and highly-scalable server-side web applications. Coupled with the power and efficiency of Angular, creating web applications has never been easier. If you want build end-to-end modern web application using Spring and Angular, then this book is for you. The book directly heads to show you how to create the backend with Spring, showing you how to configure the Spring MVC and handle Web requests. It will take you through the key aspects such as building REST API endpoints, using Hibernate, working with Junit 5 etc. Once you have secured and tested the backend, we will go ahead and start working on the front end with Angular. You will learn about fundamentals of Angular and Typescript and create an SPA using components, routing etc. Finally, you will see how to integrate both the applications with REST protocol and deploy the application using tools such as Jenkins and Docker. Style and approach This is a straightforward guide that shows how to build a complete web application in Angular and Spring.","language":"en","currency":"USD","id":"1787281523","title":"Building Web Apps with Spring 5 and Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpZGDwAAQBAJ&source=gbs_api","authors":["Ajitesh Shukla"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0a0IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.24,"subtitle":null,"description":"基於HTTP 協議運行的WWW (World Wide Web，萬維網) 服務是B\/ S 模式的底層支撐，WWW 簡稱為Web，亦指我們通常所說的網頁。Web 的運行包括兩部分: 前端與後端。通俗地講，Web 前端是指用戶在瀏覽器中能夠直觀看到的某一網頁的界面，它的作用是除了向用戶呈現合理、美觀的網頁內容外，還提供用戶與網站服務器端進行交互的功能，如點擊按鈕、連結等。Web 後端即網站的服務器端，在收到用戶通過前端發送來的訪問請求後，服務器端會自動調用和執行相關程序，如進行數學運算、操作數據庫等，並將程序執行結果返回給Web 前端。通過上述介紹可以看出，Web 前端負責提供良好的用戶體驗，Web 後端則重點負責網站業務邏輯的實現和數據的調度。 需要指出的是，隨著普通PC 和筆記本電腦性能的快速提升，現在越來越多的Web應用將業務邏輯的處理也交由客戶端瀏覽器實施，服務器端僅提供必要的用戶身分認證、數據調度等功能，大大減輕了服務器端的負擔，提升了網站的訪問效率。 Web 前端設計是指網站界面的設計，主要通過HTML、CSS 和JavaScript 三種技術實現。其中HTML 負責提供網頁的結構與內容，CSS 負責對內容進行修飾，JavaScript負責提供適當的動畫效果、用戶網站交互功能等，這三者各司其職、相互配合，共同支撐Web 前端的正常運行。 早期的Web 頁面基本上是純HTML 靜態網頁，僅提供廣播式的信息發布，被稱為Web1.0 時代，其特點是數據流量大；到了2010 年前後，隨著Web2.0 技術的發展，Web 頁面的內容與功能日趨豐富，其特點是互動性較強；目前，Web3.0 的概念已經出現，它的本質特徵是多種數據被整合利用，頁面的智能性高。 Web 前端開發是一個發展活躍的領域，圍繞頁面效率的提升和功能的豐富，新的開發技術不斷湧現，開發模式層出不窮。2006 年出現的jQuery 框架大大提升了JavaScript 語言的開發效率，其影響一直延續到現在；2009 年誕生的Angular.js 技術首次提出前端的MVC 模式(Model–View–Controller)，將網頁內容呈現與業務邏輯的處理分開，提升了開發、調試、運行等的效率；2013 年React.js 框架出現，它利用組件化的開發思想，提高了代碼的復用性，而且擁有較高的執行性能；2014 年，一款輕量級的漸進式前端框架Vue.js 正式發布，它只關注視圖層，學習門檻低，且在很大程度上綜合利用了Angular.js 和React.js 的優點，因而受到較多關注。從上述發展過程我們不難看出，Web 前端開發技術的變化基本上都圍繞JavaScript 語言展開，因此JavaScript 語言在Web 前端領域中有著越來越重要的地位。","language":"zh-TW","currency":"USD","id":"957680468X","title":"ASP.NET Web應用系統開發","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0a0IEAAAQBAJ&source=gbs_api","authors":["彭芳策"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rVhLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mission-critical enterprise applications using Spring Framework and Aspect Oriented Programming About This Book Step into more advanced features of aspect-oriented programming and API components to build enterprise grade systems Build lightning-fast web applications and REST APIs using Spring MVC and its asynchronous processing capabilities with the view technologies of your choice Explore simplified but powerful data access techniques including JPA (Java Persistence Architecture) repositories and NoSQL data access Who This Book Is For If you are a Java developer who is looking to master Enterprise Java Development using Spring Framework, then this book is ideal for you. Prior understanding of core Java programming and a high-level understanding of Spring Framework is recommended. Having sound knowledge of servlet-based web development in Java and basic Database concepts would be an advantage but not a requirement. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Get familiar with JSP Form processing using Spring and Form Tag Library Develop RESTful API applications for XML and JSON data transfers with non-blocking asynchronous capabilities Explore Spring's comprehensive transaction support for declarative Transaction Management and its integration with Spring's data access abstractions Investigate Spring Data access mechanisms with Spring Data Repositories, a simple and consistent data-access abstraction Construct real-time applications using WebSocket with a SockJS fallback option Understand how to secure your Spring Web and standalone applications using Spring Security declaratively and consistently Get to grips with the end-to-end development of an API-based modern SPA using EmberJS at the front end and SpringMVC at the back end In Detail Spring is an open source Java application development framework to build and deploy systems and applications that run on the JVM. It is the industry standard and the most popular framework among Java developers with over two-thirds of developers using it. Spring Essentials makes learning Spring so much quicker and easier with the help of illustrations and practical examples. Starting from the core concepts of features such as inversion of Control Container and BeanFactory, we move on to a detailed look at aspect-oriented programming. We cover the breadth and depth of Spring MVC, the WebSocket technology, Spring Data, and Spring Security with various authentication and authorization mechanisms. Packed with real-world examples, you'll get an insight into utilizing the power of Spring Expression Language in your applications for higher maintainability. You'll also develop full-duplex real-time communication channels using WebSocket and integrate Spring with web technologies such as JSF, Struts 2, and Tapestry. At the tail end, you will build a modern SPA using EmberJS at the front end and a Spring MVC-based API at the back end.By the end of the book, you will be able to develop your own dull-fledged applications with Spring. Style and approach This book is a practical guide based on logical modules of the whole Spring Framework family, with a start-small approach, increasing in complexity as it progresses. Every chapter is an amalgamation of theory and practical examples, with further discussion on additional features and approaches.","language":"en","currency":"USD","id":"1783982357","title":"Spring Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rVhLDAAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qnc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Design and develop next generation web applications using Angular 2 and Angular 4 About This Book Learn about the core building blocks of Angular Build and architect high performance web applications Implement the latest JavaScript concepts in ECMAScript 2015, ECMAScript 2016, and TypeScript Leverage the latest Angular features to get the most out of your web applications Who This Book Is For This book is targeted at JavaScript developers who are interested in learning how to build rich and powerful web applications with the latest version of Angular. Working knowledge of Angular 1 will be beneficial. What You Will Learn Develop a frontend web application using component-based architecture Use ES5, ES2015, and TypeScript to build Angular 4 UI applications Develop simple to complex user interfaces in Angular 4 Develop and handle forms in Angular 4 UI applications Test UIs built in Angular 4 Use material design components and animations in Angular 4 In Detail In the last few years, Angular has established itself as the number one choice of JavaScript Developers. What makes Angular special is performance and productivity. With Angular, developers can work on consistent coding patterns and build web applications that are powerful and scalable. This book will you get you up and running with Angular and teach how to build modern web applications. It starts with basics of Angular 2 and then brushes you up with the new features of Angular 4. You will learn the core concepts involved in building web applications with Angular such as Data Binding, Routing, Dependency Injection, and much more. The book teaches how to build components and use them to build web apps of your choice. It will help you to handle different kinds of forms and learn the concept of reactive programming. Finally the book teaches how to build visually appealing and responsive UIs. Style and approach It follows a practical approach to explain almost every feature of Angular 2 and Angular 4 and their concepts through real-world examples. In each chapter, a different example is used so that you can build a foundation and understand the concepts by applying them in different scenarios.","language":"en","currency":"USD","id":"1785880039","title":"Building Modern Web Applications Using Angular","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qnc5DwAAQBAJ&source=gbs_api","authors":["Shravan Kumar Kasagoni"]},{"pageCount":252,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-VMoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Enhance your testing skills to build powerful and fault-free applications in Angular v4 About This Book Learn test-driven development (TDD) for JavaScript Improve your Karma and Protractor expertise by setting up an Angular test suite A wide range of testing techniques for professional Angular applications accompanied by practical examples Who This Book Is For This book is for developers who have experience with Angular but want to understand the wider context of when, why, and how to apply testing techniques and best practices to create quality clean code. To get the most out of this book, you should have a good understanding of HTML and JavaScript and a basic understanding of Angular. What You Will Learn Get a clear overview of TDD in the context of JavaScript with a brief look at testing techniques, tools, and frameworks Get an overview of Karma and create test suites for an Angular application Install and configure Protractor for Angular and explore a few important Protractor APIs Understand automated testing and implement headless automated tests with Karma Implement testing techniques with mocks, broadcast events, and asynchronous behavior Integrate REST-based services and APIs into an application to extract data Automate Karma unit tests with Travis CI In Detail This is a complete guide that shows you testing techniques with Karma that will help you perform unit testing and end-to-end testing with Protractor. It will show you how to optimize your Angular development process using TDD techniques and ensure your final project is free of bugs. All examples in this book are based on Angular v2 and are compatible with Angular v4. We start by reviewing the TDD life cycle, TDD in the context of JavaScript, and various JavaScript test tools and frameworks. You will see how Karma and Protractor can make your life easier while running JavaScript unit tests. We will enable you to build a test suite for an Angular application and build a testable medium-to-large scale Angular application by handling REST API data. Building on the initial foundational aspects, we move on to testing for multiple classes, partial views, location references, CSS, and the HTML element. In addition, we will explore how to use a headless browser with Karma. We will also configure a Karma file to automate the testing and tackle elements of Angular (components, services, classes, and broadcasting) using TDD. Finally, you will find out how to pull data using an external API, set up and configure Protractor to use a standalone Selenium server, and set up Travis CI and Karma to test your application. Style and approach This book is a complete guide to Angular unit testing techniques using Karma and performing end-to-end testing with Protractor.","language":"en","currency":"USD","id":"1786462761","title":"Angular Test-Driven Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-VMoDwAAQBAJ&source=gbs_api","authors":["Md. Ziaul Haq"]},{"pageCount":520,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cGSGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build, test, and deploy scalable and reactive microservices with Rust 2018","description":"A comprehensive guide in developing and deploying high performance microservices with Rust Key Features Start your microservices journey and get a broader perspective on microservices development using RUST 2018, Build, deploy, and test microservices using AWS Explore advanced techniques for developing microservices such as actor model, Requests Routing, and threads Book Description Microservice architecture is sweeping the world as the de facto pattern for building web-based applications. Rust is a language particularly well-suited for building microservices. It is a new system programming language that offers a practical and safe alternative to C. This book describes web development using the Rust programming language and will get you up and running with modern web frameworks and crates with examples of RESTful microservices creation. You will deep dive into Reactive programming, and asynchronous programming, and split your web application into a set of concurrent actors. The book provides several HTTP-handling examples with manageable memory allocations. You will walk through stateless high-performance microservices, which are ideally suitable for computation or caching tasks, and look at stateful microservices, which are filled with persistent data and database interactions. As we move along, you will learn how to use Rust macros to describe business or protocol entities of our application and compile them into native structs, which will be performed at full speed with the help of the server's CPU. Finally, you will be taken through examples of how to test and debug microservices and pack them into a tiny monolithic binary or put them into a container and deploy them to modern cloud platforms such as AWS. What you will learn Get acquainted with leveraging Rust web programming Get to grips with various Rust crates, such as hyper, Tokio, and Actix Explore RESTful microservices with Rust Understand how to pack Rust code to a container using Docker Familiarize yourself with Reactive microservices Deploy your microservices to modern cloud platforms such as AWS Who this book is for This book is for developers who have basic knowledge of RUST, and want to learn how to build, test, scale, and manage RUST microservices. No prior experience of writing microservices in RUST is assumed.","language":"en","currency":"USD","id":"1789341981","title":"Hands-On Microservices with Rust","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cGSGDwAAQBAJ&source=gbs_api","authors":["Denis Kolodin"]},{"pageCount":122,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HNwkBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book is intended for people who are not familiar with AngularJS and who want to take their PhoneGap development skills further by developing apps using different JavaScript libraries. People with some knowledge of PhoneGap, HTML, CSS, and JavaScript will find this book immediately useful.","language":"en","currency":"USD","id":"1783988932","title":"PhoneGap and AngularJS for Cross-platform Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HNwkBQAAQBAJ&source=gbs_api","authors":["Yuxian, Eugene Liang"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eWx9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.08,"subtitle":null,"description":"Новое (5-е) издание признанного бестселлера, описывающее как клиентские, так и серверные аспекты веб-разработки. Эта книга поможет вам освоить динамическое веб-программирование с применением самых современных технологий. Книга наполнена ценными практическими советами, содержит подробный теоретический материал. Для закрепления материала автор рассказывает, как создать полнофункциональный сайт, работающий по принципу социальной сети Включая рассказ о React.js • Изучите важнейшие аспекты языка PHP и основы объектно-ориентированного программирования. • Познакомьтесь с базой данных MySQL. • Управляйте cookie-файлами и сеансами, обеспечивайте высокий уровень безопасности. • Пользуйтесь фундаментальными возможностями языка JavaScript. • Применяйте вызовы AJAX, чтобы значительно повысить динамику вашего сайта. • Изучите основы CSS для форматирования и оформления ваших страниц. • Освойте продвинутые возможности HTML5: геолокацию, обработку аудио и видео, отрисовку на холсте","language":"ru","currency":"USD","id":"5446108256","title":"Создаем динамические веб-сайты с помощью PHP, MySQL, JavaScript, CSS и HTML5. 5-е изд.","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eWx9DwAAQBAJ&source=gbs_api","authors":["Никсон Робин"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GqDcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"Unleash the power of Spring MVC and build enterprise-grade, lightning-fast web applications About This Book Configure Spring MVC to build logic-less controllers that transparently support the most advanced web techniques Secure your developments with easy-to-write, reliable unit and end-to-end tests Get this fast-paced, practical guide to produce REST resources and templates as required by the latest front-end best practices Who This Book Is For This Learning Path is for Java developers who want to exploit Spring MVC and its features to build web applications. It will help you step up in your career and stay up to date or learn more about Spring's web scalability. What You Will Learn Set up and build standalone and web-based projects using Spring Framework with Maven or Gradle Develop RESTful API applications for XML and JSON data transfers Investigate Spring data access mechanisms with Spring Data Repositories Generate templates for a responsive and powerful front end with AngularJS and Bootstrap Authenticate over REST with a BASIC authentication scheme and OAuth2; handle roles and permissions Communicate through WebSocket and STOMP messages Design complex advanced-level forms and validate the model Create maintainable unit and acceptance tests to secure the apps Deploy the web application to the cloud in a snap In Detail Spring MVC helps you build flexible and loosely coupled web applications. The Spring MVC Framework is designed in such a way that every piece of logic and functionality is highly configurable. This Learning Path aims to make you an expert in designing web applications with Spring MVC 4. In our first module, we'll begin with an introduction to the Spring framework. You'll then learn aspect-oriented programming. Packed with real-world examples, you'll get an insight into how you can use Spring Expression Language in your applications to make them easier to manage and maintain. In the second module, you'll learn everything you need to build modern Spring-based enterprise web applications. From practical development techniques and useful tools from the wider Spring ecosystem, to the new JEE standards, the impact of JavaScript, and even the Internet of Things, you'll feel confident that you can deploy Spring for an impressive range of creative purposes. In the final module, you'll find out how to take advantage of Spring MVC's advanced features - essential if you are to properly master the framework. To do this you'll investigate the inner mechanics of Spring MVC, and how they tie into to the broader principles that inform many modern web architectures. With further guidance on how to test, secure, and optimize your application, as well as designing RESTful services, you'll very quickly be ready to use Spring in your next web project. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Spring Essentials by Shameer Kunjumohamed, Hamidreza Sattari Spring MVC Cookbook by Alex Bretet Mastering Spring MVC 4 by Geoffroy Warin Style and approach This is a hands-on, practical guide based on logical modules of the whole Spring framework family, employing a combination of theory and examples with pro-level practices, techniques, and solutions.","language":"en","currency":"USD","id":"1787125084","title":"Spring MVC: Designing Real-World Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GqDcDgAAQBAJ&source=gbs_api","authors":["Shameer Kunjumohamed","Hamidreza Sattari","Alex Bretet","Geoffroy Warin"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Increase your productivity by implementing data structures About This Book Gain a complete understanding of data structures using a simple approach Analyze algorithms and learn when you should apply each solution Explore the true potential of functional data structures Who This Book Is For This book is for those who want to learn data structures and algorithms with PHP for better control over application-solution, efficiency, and optimization. A basic understanding of PHP data types, control structures, and other basic features is required What You Will Learn Gain a better understanding of PHP arrays as a basic data structure and their hidden power Grasp how to analyze algorithms and the Big O Notation Implement linked lists, double linked lists, stack, queues, and priority queues using PHP Work with sorting, searching, and recursive algorithms Make use of greedy, dynamic, and pattern matching algorithms Implement tree, heaps, and graph algorithms Apply PHP functional data structures and built-in data structures and algorithms In Detail PHP has always been the the go-to language for web based application development, but there are materials and resources you can refer to to see how it works. Data structures and algorithms help you to code and execute them effectively, cutting down on processing time significantly. If you want to explore data structures and algorithms in a practical way with real-life projects, then this book is for you. The book begins by introducing you to data structures and algorithms and how to solve a problem from beginning to end using them. Once you are well aware of the basics, it covers the core aspects like arrays, listed lists, stacks and queues. It will take you through several methods of finding efficient algorithms and show you which ones you should implement in each scenario. In addition to this, you will explore the possibilities of functional data structures using PHP and go through advanced algorithms and graphs as well as dynamic programming. By the end, you will be confident enough to tackle both basic and advanced data structures, understand how they work, and know when to use them in your day-to-day work Style and approach An easy-to-follow guide full of examples of implementation of data structures and real world examples to solve the problems faced. Each topic is first explained in general terms and then implemented using step by step explanation so that developers can understand each part of the discussion without any problem.","language":"en","currency":"USD","id":"1786463571","title":"PHP 7 Data Structures and Algorithms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xHc5DwAAQBAJ&source=gbs_api","authors":["Mizanur Rahman"]}]