[{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZqP8E3CmWggC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Practical Techniques for Fast Data Manipulation","description":"Two years since its initial release, Redis already has an impressive list of adopters, including Engine Yard, GitHub, Craigslist, and Digg. This open source data structure server is built for speed and flexibility, making it ideal for many applications. If you're using Redis, or considering it, this concise cookbook provides recipes for a variety of issues you're likely to face. Each recipe solves a specific problem, and provides an in-depth discussion of how the solution works. You’ll discover that Redis, while simple in nature, offers extensive functionality for manipulating and storing data. Learn when it makes sense to use Redis Explore several methods for installing Redis Connect to Redis in a number of ways, ranging from the command line to popular languages such as Python and Ruby Solve a range of needs, from linked datasets to analytics Handle backups, sharding, datasets larger than available memory, and many other tasks","language":"en","currency":"USD","id":"1449315410","title":"Redis Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZqP8E3CmWggC&source=gbs_api","authors":["Tiago Macedo","Fred Oliveira"]},{"pageCount":366,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OANwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Take your knowledge of Redis to the next level to build enthralling applications with ease About This Book Detailed explanation on Data structure server with powerful strings, lists, sets, sorted-sets, and hashes Learn to Scale your data with Redis Cluster's distributed setup This is a fast paced practical guide full of screenshots and real work examples to help you get to grips with Redis in no time. Who This Book Is For If you are a software developer with some experience with Redis and would now like to elevate your Redis knowledge and skills even further, then this book is for you. What You Will Learn Choose the right Redis data structure for your problem Understand Redis event-loop and implement your own custom C commands Solve complex workflows with Redis server-side scripting with Lua Configure your Redis instance for optimal memory management Scale your data in a distributed manner with Redis Cluster Improve the stability of your Redis solution using Redis Sentinel Complement your existing database and NoSQL environment with Redis Exploit a wide range of features provided by Redis to become a DevOps expert. In Detail Redis is the most popular, open-source, key value data structure server that provides a wide range of capabilities on which multiple platforms can be be built. Its fast and flexible data structures give your existing applications an edge in the development environment. This book is a practical guide which aims to help you deep dive into the world of Redis data structure to exploit its excellent features. We start our journey by understanding the need of Redis in brief, followed by an explanation of Advanced key management. Next, you will learn about design patterns, best practices for using Redis in DevOps environment and Docker containerization paradigm in detail. After this, you will understand the concept of scaling with Redis cluster and Redis Sentinel , followed by a through explanation of incorporating Redis with NoSQL technologies such as Elasticsearch and MongoDB. At the end of this section, you will be able to develop competent applications using these technologies. You will then explore the message queuing and task management features of Redis and will be able to implement them in your applications. Finally, you will learn how Redis can be used to build real-time data analytic dashboards, for different disparate data streams. Style and approach This is a hands on guide full of easy-to-follow examples, that illustrate important concepts and techniques to solve complex problems with Redis.","language":"en","currency":"USD","id":"1783988193","title":"Mastering Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OANwDQAAQBAJ&source=gbs_api","authors":["Jeremy Nelson"]},{"pageCount":382,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VOtODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Over 80 hand-picked recipes for effective Redis development and administration","description":"Leverage the power of Redis 4.x to develop, optimize and administer your Redis solutions with ease Key Features Build, deploy and administer high performance and scalable applications in Redis Covers a range of important tasks - including development and administration of Redis A practical guide that takes your understanding of Redis to the next level Book Description Redis is considered the world's most popular key-value store database. Its versatility and the wide variety of use cases it enables have made it a popular choice of database for many enterprises. Based on the latest version of Redis, this book provides both step-by-step recipes and relevant the background information required to utilize its features to the fullest. It covers everything from a basic understanding of Redis data types to advanced aspects of Redis high availability, clustering, administration, and troubleshooting. This book will be your great companion to master all aspects of Redis. The book starts off by installing and configuring Redis for you to get started with ease. Moving on, all the data types and features of Redis are introduced in detail. Next, you will learn how to develop applications with Redis in Java, Python, and the Spring Boot web framework. You will also learn replication tasks, which will help you to troubleshoot replication issues. Furthermore, you will learn the steps that need to be undertaken to ensure high availability on your cluster and during production deployment. Toward the end of the book, you will learn the topmost tasks that will help you to troubleshoot your ecosystem efficiently, along with extending Redis by using different modules. What you will learn Install and configure your Redis instance Explore various data types and commands in Redis Build client-side applications as well as a Big Data framework with Redis Manage data replication and persistence in Redis Implement high availability and data sharding in Redis Extend Redis with Redis Module Benchmark, debug, fine-tune and troubleshoot various issues in Redis Who this book is for This book is for database administrators, developers and architects who want to tackle the common and not so common problems associated with the different development and administration-related tasks in Redis. A fundamental understanding of Redis is expected to get the best out of this book.","language":"en","currency":"USD","id":"1783988177","title":"Redis 4.x Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VOtODwAAQBAJ&source=gbs_api","authors":["Pengcheng Huang","Zuofei Wang"]},{"pageCount":228,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NsseEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.95,"subtitle":"Explore Redis - Its Architecture, Data Structures and Modules like Search, JSON, AI, Graph, Timeseries (English Edition)","description":"Complete reference guide to Redis KEY FEATURES ● Complete coverage of Redis Modules. ● Best practices, tips and tricks, and expert techniques to scale Redis. ● Troubleshooting solutions to perform real-time faster data processing for client applications. DESCRIPTION This book begins with teaching you to set up your own Redis environment, followed by Redis data structures, their architecture, and use cases. You get to learn the details about Redis Modules such as RediSearch, RedisJSON, RedisTimeSeries, RedisAI, and RedisGraph with specific business use-case examples. This book makes you a Redis Expert by getting you hands-on with best practices on Redis and some tricks to scale Redis activities. WHAT YOU WILL LEARN ● Redis’s advantages over the other NOSQL databases. ● Explore Redis Enterprise and its real gameplay in enterprise applications. ● Learn Redis data structures through practically demonstrated use cases. ● Learn from Industry expert to setup the Redis in production environment. ● Understand how Redis enterprise enhances Redis OSS. WHO THIS BOOK IS FOR This book is ideal for anyone who is interested in understanding the basic concepts of the Redis database. The book will help the IT professionals, Software developers, Technical leads, Architects. Readers should have a working knowledge of database designing, basic programming skills, and an understanding of the latest trends in cloud computing. TABLE OF CONTENTS 1. Introduction to NoSQL World 2. NoSQL database types 3. Are NoSQL databases better than traditional databases? 4. History of Redis 5. Getting started with Redis 6. Setting up Redis 7. Redis Data Structures in details 8. Scaling Redis 9. Modules 10. Redis use cases 11. Redis as database service - enterprise solutions 12. What is new in Redis 6? 13. Appendix A (i) Using Redis-cli (ii) RedisInsight tool (iii) Community helps","language":"en","currency":"USD","id":"8194837766","title":"Redis® Deep Dive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NsseEAAAQBAJ&source=gbs_api","authors":["Suyog Dilip Kale","Chinmay Kulkarni"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ON0DCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book will introduce Redis and help you understand its various facets. Starting with an introduction to NoSQL, you will learn how to install Redis and how to classify and work with data structures. By working with real world scenarios pertaining to using Redis, you will discover sharding and indexing techniques, along with how to improve scalability and performance through persistent strategies and data migration techniques. With the help of multiple examples, you will learn to design web and business applications. You will also learn how to configure Redis for setting up clusters and tuning it for performance. At the end of this book, you will find essential tips on backup and recovery strategies for the Redis environment.","language":"en","currency":"USD","id":"1783980133","title":"Learning Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ON0DCgAAQBAJ&source=gbs_api","authors":["Vinoo Das"]},{"pageCount":56,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bMIyjo6v3dgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. This book is written in a concise, focused style with numerous practical and hands-on recipes and examples. If you want to leverage Redis to create blazing fast applications, then this book is for you.This book is for developers who are already proficient in programming and traditional databases and want to start learning about Redis for its simplicity and fast performance. A basic understanding of Linux and proficiency in a programming language are required to get the most out of this book.","language":"en","currency":"USD","id":"1782164812","title":"Instant Redis Optimization How-To","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bMIyjo6v3dgC&source=gbs_api","authors":["Arun Chinnachamy"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0mKZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This book is for developers who are already proficient in programming and capable of designing systems using traditional databases, but are new to Redis. It is assumed that you understand the basics of Redis and are familiar with the various data structures. You are also expected to be proficient in one or more programming languages through which you want to use Redis.","language":"en","currency":"USD","id":"1783286725","title":"Redis Applied Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0mKZBAAAQBAJ&source=gbs_api","authors":["Arun Chinnachamy"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O5ifBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If the phrase scalability sounds alien to you, then this is an ideal book for you. You will not need much Node.js experience as each framework is demonstrated in a way that requires no previous knowledge of the framework. You will be building scalable Node.js applications in no time! Knowledge of JavaScript is required.","language":"en","currency":"USD","id":"178398449X","title":"Building Scalable Apps with Redis and Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O5ifBAAAQBAJ&source=gbs_api","authors":["Joshua Johanan"]},{"pageCount":230,"thumbnail":"http:\/\/books.google.com\/books\/content?id=08WGCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Harness the power of Redis to integrate and manage your projects efficiently About This Book Learn how to use Redis's data types efficiently to manage large data sets Scale Redis to multiple servers with Twemproxy, Redis Sentinel, and Redis Cluster A fast-paced guide, full of real-world examples to help you get the best out of the features offered by Redis Who This Book Is For If you are a competent developer with experience of working with data structure servers and want to boost your project's performance by learning about features of Redis, then this book is for you. What You Will Learn Build analytics applications using Bitmaps and Hyperloglogs Enhance scalability with Twemproxy, Redis Sentinel, and Redis Cluster Build a Time Series implementation in Node.js and Redis Create your own Redis commands by extending Redis with Lua Get to know security techniques to protect your data (SSL encryption, firewall rules, basic authorization) Persist data to disk and learn the trade-offs of AOF and RDB Understand how to use Node.js, PHP, Python, and Ruby clients for Redis Avoid common pitfalls when designing your next solution In Detail Redis is the most popular in-memory key-value data store. It's very lightweight and its data types give it an edge over the other competitors. If you need an in-memory database or a high-performance cache system that is simple to use and highly scalable, Redis is what you need. Redis Essentials is a fast-paced guide that teaches the fundamentals on data types, explains how to manage data through commands, and shares experiences from big players in the industry. We start off by explaining the basics of Redis followed by the various data types such as Strings, hashes, lists, and more. Next, Common pitfalls for various scenarios are described, followed by solutions to ensure you do not fall into common traps. After this, major differences between client implementations in PHP, Python, and Ruby are presented. Next, you will learn how to extend Redis with Lua, get to know security techniques such as basic authorization, firewall rules, and SSL encryption, and discover how to use Twemproxy, Redis Sentinel, and Redis Cluster to scale infrastructures horizontally. At the end of this book, you will be able to utilize all the essential features of Redis to optimize your project's performance. Style and approach A practical guide that offers the foundation upon which you can begin to understand the capabilities of Redis using a step-by-step approach. This book is full of real-world problems and in-depth knowledge of the concepts and features of Redis, with plenty of examples.","language":"en","currency":"USD","id":"1784396087","title":"Redis Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=08WGCgAAQBAJ&source=gbs_api","authors":["Maxwell Dayvson Da Silva","Hugo Lopes Tavares"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RX773LKyeUIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"Implement JPA repositories and harness the performance of Redis in your applications.","language":"en","currency":"USD","id":"1849519056","title":"Spring Data Standard Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RX773LKyeUIC&source=gbs_api","authors":["Petri Kainulainen"]},{"pageCount":444,"thumbnail":"http:\/\/books.google.com\/books\/content?id=x9hpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a .NET developer who is looking for a simpler way to build services, this is the book for you. It will show you how to write fast, maintainable APIs that are a pleasure to use and maintain starting from the database to the client and everything in-between.","language":"en","currency":"USD","id":"1783986573","title":"ServiceStack 4 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=x9hpBgAAQBAJ&source=gbs_api","authors":["Kyle Hodgson","Darren Reid"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fOgtAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book contains an extensive set of practical examples and an easy-to-follow approach to creating 3D objects.This book is great for anyone who already knows JavaScript and who wants to start creating 3D graphics that run in any browser. You don’t need to know anything about advanced math or WebGL; all that is needed is a general knowledge of JavaScript and HTML. The required materials and examples can be freely downloaded and all tools used in this book are open source.","language":"en","currency":"USD","id":"1782166335","title":"Mastering Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fOgtAgAAQBAJ&source=gbs_api","authors":["Sandro Pasquali"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UEOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Mongo, Express, AngularJS, and Node.js","description":"Traditionally, web applications have been architected so that the back-end houses all the front-end code. This has resulted in heavy projects that are difficult to manage and scale. This book will explain a new way to write web applications by treating the front-end as if it were a third-party (such as a mobile client). This book, written by a practicing MEAN developer, will take a holistic approach to using the MEAN JavaScript platform for creating modern web applications and lay out how to use the MEAN (Mongo, Express, AngularJS, and Node.js) set of tools to create a web application, from installation and setup of the tools to debugging and deploying your app. After an introduction to how web development is changing and the advantages of using the MEAN stack, the author jumps into an introduction to each tool and then dives into using the complete JavaScript-based application stack to build, test, and deploy apps.","language":"en","currency":"USD","id":"0133962377","title":"Write Modern Web Apps with the MEAN Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UEOZBAAAQBAJ&source=gbs_api","authors":["Jeff Dickey"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":60,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HE7Y4vmb93oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Writing Server-Side JavaScript Applications","description":"If you know how to use JavaScript in the browser, you already have the skills you need to put JavaScript to work on back-end servers with Node. This hands-on book shows you how to use this popular JavaScript platform to create simple server applications, communicate with the client, build dynamic pages, work with data, and tackle other tasks. Although Node has a complete library of developer-contributed modules to automate server-side development, this book will show you how to program with Node on your own, so you truly understand the platform. Discover firsthand how well Node works as a web server, and how easy it is to learn and use. Set up Node and learn how to build scaffolding for a web application Work with Node natively to see how it functions as a web server Understand how Node receives client data from GET and POST requests Use the Socket.IO module to facilitate realtime client-server communication Choose from among several Node templates to create dynamic pages Learn how to connect to a database, and store data in files Implement the Model-View-Controller pattern, and share Node modules with server and client","language":"en","currency":"USD","id":"1449329047","title":"Node for Front-End Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HE7Y4vmb93oC&source=gbs_api","authors":["Garann Means"]},{"pageCount":76,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0rY_ZksGY4oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Distilling Rich Information from Messy Data","description":"Millions of public Twitter streams harbor a wealth of data, and once you mine them, you can gain some valuable insights. This short and concise book offers a collection of recipes to help you extract nuggets of Twitter information using easy-to-learn Python tools. Each recipe offers a discussion of how and why the solution works, so you can quickly adapt it to fit your particular needs. The recipes include techniques to: Use OAuth to access Twitter data Create and analyze graphs of retweet relationships Use the streaming API to harvest tweets in realtime Harvest and analyze friends and followers Discover friendship cliques Summarize webpages from short URLs This book is a perfect companion to O’Reilly's Mining the Social Web.","language":"en","currency":"USD","id":"1449303854","title":"21 Recipes for Mining Twitter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0rY_ZksGY4oC&source=gbs_api","authors":["Matthew A. Russell"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AulODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Grasp the fundamentals of Spring 5.0 to build modern, robust, and scalable Java applications","description":"Discover the real power of Spring Framework 5.0 and learn to create powerful applications in its newest version Key Features Learn reactive programming by implementing a reactive application with Spring Webflux Create a robust and scalable messaging application with Spring messaging support Apply your knowledge to build three real-world projects in Spring Book Description With growing demands, organizations are looking for systems that are robust and scalable. Therefore, the Spring Framework has become the most popular framework for Java development. It not only simplifies software development but also improves developer productivity. This book covers effective ways to develop robust applications in Java using Spring. The book has three parts, where each one covers the building of a comprehensive project in Java and Spring. In the first part, you will construct a CMS Portal using Spring's support for building REST APIs. You will also learn to integrate these APIs with AngularJS and later develop this application in a reactive fashion using Project Reactor, Spring WebFlux, and Spring Data. In the second part, you’ll understand how to build a messaging application, which will consume the Twitter API and perform filtering and transformations. Here, you will also learn about server-sent events and explore Spring’s support for Kotlin, which makes application development quick and efficient. In the last part, you will build a real microservice application using the most important techniques and patterns such as service discovery, circuit breakers, security, data streams, monitoring, and a lot more from this architectural style. By the end of the book, you will be confident about using Spring to build your applications. What you will learn Implement REST APIs with Spring REST support Introduce the Spring Boot and understand how it makes creating robust applications extremely simple Understand how Spring Data helps us add persistence in MongoDB and SQL databases Introduce Reactive Programming and use this with Spring Webflux Implement a Reactive REST client and learn how it can create asynchronous applications Create a robust, scalable, and fault tolerant application with Spring Messaging Implement a websocket to add interactive behaviors in your applications Introduce the Spring Cloud projects Who this book is for If you’re a developer starting out with Spring, then this book will help you learn about the new Spring 5.0 framework concepts followed by their implementation in Java and Kotlin. The book will also help experienced Spring developers gain insights into the new features added in Spring 5.0.","language":"en","currency":"USD","id":"1788628020","title":"Spring 5.0 By Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AulODwAAQBAJ&source=gbs_api","authors":["Claudio Eduardo de Oliveira"]},{"pageCount":179,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oOjyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":null,"description":"Saber usar a melhor ferramenta para cada problema é determinante para qualquer pessoa ligada à área de tecnologia e, atualmente, com o desenvolvimento de novos bancos de dados, as opções para essa área aumentaram bastante, trazendo muito mais poder às aplicações. Neste livro, Rodrigo Lazoti mostrará por que trabalhar com o Redis e bancos de dados chave\/valor em memória pode trazer enormes ganhos de performance para sua aplicação, assim como ser uma excelente solução para diversos problemas que enfrentamos no dia a dia ao desenvolver software. Você vai aprender a trabalhar com estruturas clássicas e modernas de dados e armazenamento, filas, listas, conjuntos, além das configurações de mecanismos de publish e subscribe e, claro, como usar todo o poder da API do Redis. Nesta edição atualizada, estão presentes novidades como geolocalização e HyperLogLog, assim como a revisão de todo o seu conteúdo para a última versão do Redis.","language":"pt","currency":"USD","id":"6586110416","title":"Armazenando dados com Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oOjyDwAAQBAJ&source=gbs_api","authors":["Rodrigo Lazoti"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LiJ-BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"DevOps for VMware® Administrators is the first book focused on using DevOps tools and practices with VMware technologies. The authors introduce high-value tools from third parties and VMware itself, and guide you through using them to improve the performance of all your virtualized systems and applications. You’ll walk through automating and optimizing configuration management, provisioning, log management, continuous integration, and more. The authors also offer step-by-step coverage of deploying and managing applications at scale with Docker containers and Google Kubernetes. They conclude with an up-to-the-minute discussion of VMware’s newest DevOps initiatives, including VMware vRealize Automation and VMware vRealize Code Stream. Coverage includes • Understanding the challenges that DevOps tools and practices can help VMware administrators to solve • Using Vagrant to quickly deploy Dev and Test environments that match production system specifications • Writing Chef “recipes” that streamline server configuration and maintenance • Simplifying Unix\/Linux configuration management and orchestration with Ansible • Implementing Docker containers for faster and easier application management • Automating provisioning across the full lifecycle with Razor • Integrating Microsoft PowerShell Desired State Configuration (DSC) and VMware PowerCLI to automate key Windows Server and vSphere VM admin tasks • Using Puppet to automate infrastructure provisioning, configuration, orchestration, and reporting • Supercharging log management with ELK (Elasticsearch, Logstash, Kibana) • Supporting DevOps source code management with Git and continuous integration practices with Jenkins • Achieving continuous integration, delivery, and deployment with VMware’s vRealize Code Stream","language":"en","currency":"USD","id":"0133795268","title":"DevOps for VMware Administrators","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LiJ-BwAAQBAJ&source=gbs_api","authors":["Trevor A. Roberts Jr.","Josh Atwell","Egle Sigler","Yvo van Doorn"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=E7q9BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is intended for users with some knowledge of the Elixir language syntax and basic data types\/structures. Although this is a cookbook and no sequential reading is required, the book’s structure will allow less advanced users who follow it to be gradually exposed to some of Elixir’s features and concepts specific to functional programming. To get the most out of this book, you need to be well versed with Erlang.","language":"en","currency":"USD","id":"1784393487","title":"Elixir Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=E7q9BgAAQBAJ&source=gbs_api","authors":["Paulo A Pereira"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gV0-ZF_YXqYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28,"subtitle":null,"description":"Learn how to build apps for mobile devices on Cloud platforms The marketplace for apps is ever expanding, increasing the potential to make money. With this guide, you'll learn how to build cross-platform applications for mobile devices that are supported by the power of Cloud-based services such as Amazon Web Services. An introduction to Cloud-based applications explains how to use HTML5 to create cross-platform mobile apps and then use Cloud services to enhance those apps. You'll learn how to build your first app with HTML5 and set it up in the Cloud, while also discovering how to use jQuery to your advantage. Highlights the skills and knowledge you need to create successful apps for mobile devices with HTML5 Takes you through the steps for building web applications for the iPhone and Android Details how to enhance your app through faster launching, touch vs. click, storage capabilities, and a cache Looks at how best to use JSON, FourSquare, jQuery, AJAX, and more Shares tips for creating hybrid apps that run natively If you're interested in having your application be one of the 200,000+ apps featured in the iPhone store or the 50,000+ in the Android store, then you need this book.","language":"en","currency":"USD","id":"1118203356","title":"Beginning Mobile Application Development in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gV0-ZF_YXqYC&source=gbs_api","authors":["Richard Rodger"]},{"pageCount":816,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uT6eBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Solutions and Techniques in Ruby Programming","description":"For more than a decade, Ruby developers have turned to The Ruby Way for reliable “how-to” guidance on effective Ruby programming. Now, Hal Fulton and André Arko have thoroughly updated this classic guide to cover new language enhancements and developers’ experiences through Ruby 2.1. The new edition illuminates Ruby 2.1 through 400+ examples, each answering the question: “How do I do this in Ruby?” For each example, they present both a task description and realistic technical constraints. Next, they walk step-by-step through presenting one good solution, offering detailed explanations to promote deeper understanding. Conveniently organized by topic, The Ruby Way, Third Edition makes it easier than ever to find the specific solution you want—and to write better code by reflecting Ruby’s unique philosophy and spirit. Coverage includes Ruby 2.1 overview: terminology, philosophy, and basic principles Best practices for strings and regular expressions Efficiently internationalizing your code Performing calculations (including trigonometry, calculus, statistics, and time\/date calculations) Working with “Rubyesque” objects such as symbols and ranges Using arrays, hashes, stacks, queues, trees, graphs, and other data structures Efficiently storing data with YAML, JSON, and SQLite3 Leveraging object-oriented and dynamic features, from multiple constructors to program inspection Building GUIs with Shoes 4, Ruby\/Tk, Ruby\/GTK3, QtRuby, and other toolkits Improving thread performance by understanding Ruby’s synchronization methods and avoiding its pitfalls Automating system administration with Ruby Data formats: JSON, XML, RSS, Atom, RMagick, PDF, and more Testing and debugging with RSpec, Minitest, Cucumber, byebug, and pry Measuring Ruby program performance Packaging and distributing code, and managing dependencies with Bundler Network programming: clients, time servers, POP, SMTP, IMAP, Open-URI Web applications: HTTP servers, Rails, Sinatra, HTML generation, and more Writing distributed Ruby software with drb Choosing modern development tools that maximize your productivity All source code for this book may be downloaded at www.rubyhacker.com. informit.com\/aw informit.com\/ruby rubyhacker.com\/therubyway therubyway.io","language":"en","currency":"USD","id":"0132480379","title":"The Ruby Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uT6eBgAAQBAJ&source=gbs_api","authors":["Hal Fulton","André Arko"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":154,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RRdYBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"If you are a competent developer or DevOps with a good understanding of Linux filesystems but want to manage and orchestrate Docker services, images, and products using a multitude of techniques, then this book is for you. No prior knowledge of Docker or container virtualization is required.","language":"en","currency":"USD","id":"1783984791","title":"Orchestrating Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RRdYBgAAQBAJ&source=gbs_api","authors":["Shrikrishna Holla"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J0IwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Build, package, and deploy applications as easily manageable and shippable containers. About This Book Discover the secret to building highly portable apps that run on any machine with Windows Server 2016 anywhere, from laptops, desktop servers, and public or private clouds, without any changes to the code Build your company cost-effective, container-based apps that support large-scale, virtual cloud environments The most up-to-date help on the market, offering developers expert guidance in building and shipping high-quality apps, and also helping admins create infrastructure that's simple to maintain Who This Book Is For This book is for application developers with a basic programming knowledge of C#, ASP.NET, and PowerShell. IT Administrators or DevOps engineers with basic PowerShell experience can benefit by extending their learning to use PowerShell to manage containers on Windows environments and use additional management tools. What You Will Learn Build and deploy ASP.NET web applications as Windows Containers on Windows 10 (Desktop) and Azure using Visual Studio 2015, Docker, and PowerShell Build and manage custom images using Windows Server Core base OS image and Docker CLI, publish images to Docker, tag images, author Docker files, and so on Create enterprise-scale, production-grade container environments using Redis Cache containers and SQL Server containers with storage volumes, set up custom container networks, continuous integration, and deployment pipelines using VSTS, Azure, and Git Deploy a composite container environment using Docker Compose on Windows Learn to build applications using Microsoft's thinnest server platform - Nano Servers. Build custom Nano Server images and Nano Containers using Windows PowerShell and configure using PowerShell Core, DSC In Detail Windows Server Containers are independent, isolated, manageable and portable application environments which are light weight and shippable. Decomposing your application into smaller manageable components or MicroServices helps in building scalable and distributed application environments. Windows Server Containers have a significant impact on application developers, development operations (DevOps) and infrastructure management teams. Applications can be built, shipped and deployed in a fast-paced manner on an easily manageable and updatable environment. Learning Windows Server Containers teaches you to build simple to advanced production grade container based application using Asp.Net Core, Visual Studio, Azure, Docker and PowerShell technologies. The book teaches you to build and deploy simple web applications as Windows and Hyper-V containers on Windows 10 and Windows Server 2016 on Azure. You will learn to build on top of Windows Container Base OS Images, integrate with existing images from Docker Hub, create custom images and publish to Hub. You will also learn to work with storage containers built using Volumes and SQL Server as container, create and configure custom networks, integrate with Redis Cache containers, configure continuous integration and deployment pipelines using VSTS and Git Repository. Further you can also learn to manage resources for a container, setting up monitoring and diagnostics, deploy composite container environments using Docker Compose on Windows and manage container clusters using Docker Swarm. The last chapter of the book focuses on building applications using Microsoft's new and thinnest server platform – Nano Servers. Style and approach This hands-on tutorial helps you get started with Windows Server containers, the new trend in the container market. This example-driven guide is packed with real-world scenarios of Windows Server containers in production environments.","language":"en","currency":"USD","id":"1785885049","title":"Learning Windows Server Containers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J0IwDwAAQBAJ&source=gbs_api","authors":["Srikanth Machiraju"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6RhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"End-to-end penetration testing solutions","description":"Over 120 recipes to perform advanced penetration testing with Kali Linux About This Book Practical recipes to conduct effective penetration testing using the powerful Kali Linux Leverage tools like Metasploit, Wireshark, Nmap, and many more to detect vulnerabilities with ease Confidently perform networking and application attacks using task-oriented recipes Who This Book Is For This book is aimed at IT security professionals, pentesters, and security analysts who have basic knowledge of Kali Linux and want to conduct advanced penetration testing techniques. What You Will Learn Installing, setting up and customizing Kali for pentesting on multiple platforms Pentesting routers and embedded devices Bug hunting 2017 Pwning and escalating through corporate network Buffer overflows 101 Auditing wireless networks Fiddling around with software-defned radio Hacking on the run with NetHunter Writing good quality reports In Detail With the current rate of hacking, it is very important to pentest your environment in order to ensure advanced-level security. This book is packed with practical recipes that will quickly get you started with Kali Linux (version 2016.2) according to your needs, and move on to core functionalities. This book will start with the installation and configuration of Kali Linux so that you can perform your tests. You will learn how to plan attack strategies and perform web application exploitation using tools such as Burp, and Jexboss. You will also learn how to perform network exploitation using Metasploit, Sparta, and Wireshark. Next, you will perform wireless and password attacks using tools such as Patator, John the Ripper, and airoscript-ng. Lastly, you will learn how to create an optimum quality pentest report! By the end of this book, you will know how to conduct advanced penetration testing thanks to the book's crisp and task-oriented recipes. Style and approach This is a recipe-based book that allows you to venture into some of the most cutting-edge practices and techniques to perform penetration testing with Kali Linux.","language":"en","currency":"USD","id":"1787120287","title":"Kali Linux - An Ethical Hacker's Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6RhKDwAAQBAJ&source=gbs_api","authors":["Himanshu Sharma"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Transitioning monolithic architectures using microservices with .NET Core 2.0 using C# 7.0, 2nd Edition","description":"Architect your .NET applications by breaking them into really small pieces - microservices -using this practical, example-based guide. Key Features Start your microservices journey and get a broader perspective on microservices development using C# 7.0 with .NET Core 2.0 Build, deploy, and test microservices using ASP.Net Core, ASP.NET Core API, and Microsoft Azure Cloud Get the basics of reactive microservices Book Description The microservices architectural style promotes the development of complex applications as a suite of small services based on business capabilities. This book will help you identify the appropriate service boundaries within your business. We'll start by looking at what microservices are and their main characteristics. Moving forward, you will be introduced to real-life application scenarios; after assessing the current issues, we will begin the journey of transforming this application by splitting it into a suite of microservices using C# 7.0 with .NET Core 2.0. You will identify service boundaries, split the application into multiple microservices, and define service contracts. You will find out how to configure, deploy, and monitor microservices, and configure scaling to allow the application to quickly adapt to increased demand in the future. With an introduction to reactive microservices, you’ll strategically gain further value to keep your code base simple, focusing on what is more important rather than on messy asynchronous calls. What you will learn Get acquainted with Microsoft Azure Service Fabric Compare microservices with monolithic applications and SOA Learn Docker and Azure API management Define a service interface and implement APIs using ASP.NET Core 2.0 Integrate services using a synchronous approach via RESTful APIs with ASP.NET Core 2.0 Implement microservices security using Azure Active Directory, OpenID Connect, and OAuth 2.0 Understand the operation and scaling of microservices in .NET Core 2.0 Understand the key features of reactive microservices and implement them using reactive extensions Who this book is for This book is for .NET Core developers who want to learn and understand the microservices architecture and implement it in their .NET Core applications. It’s ideal for developers who are completely new to microservices or just have a theoretical understanding of this architectural approach and want to gain a practical perspective in order to better manage application complexities.","language":"en","currency":"USD","id":"178839996X","title":"Building Microservices with .NET Core 2.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PvNFDwAAQBAJ&source=gbs_api","authors":["Gaurav Aroraa"]},{"pageCount":230,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lhMKBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Updated for Logstash and ELK 5.0.0! A book designed for SysAdmins, Operations staff, Developers and DevOps who are interested in deploying a log management solution using the open source Elasticsearch, Logstash & Kibana (ELK) stack. In this book we will walk you through installing, deploying, managing and extending Logstash. We're going to do that by introducing you to Example.com, where you're going to start a new job as one of its SysAdmins. The first project you'll be in charge of is developing its new log management solution. We'll teach you how to: * Install and deploy Logstash. * Ship events from a Logstash Shipper to a central Logstash server. * Filter incoming events using a variety of techniques. * Add structured logging to your applications. * Output those events to a selection of useful destinations. * Use Logstash's awesome web interface Kibana. * Scale out your Logstash implementation as your environment grows. * Quickly and easily extend Logstash to deliver additional functionality that you might need. By the end of the book, you should have a functional and effective log management solution that you can deploy into your own environment. Updated for Logstash and ELK 5.0.0!","language":"en","currency":"USD","id":"0988820218","title":"The Logstash Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lhMKBAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":420,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OhtKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Protect your web applications using Spring Security","description":"Efficiently integrate OAuth 2.0 to protect your mobile, desktop, Cloud applications and APIs using Spring Security technologies. About This Book Interact with public OAuth 2.0 protected APIs such as Facebook, LinkedIn and Google. Use Spring Security and Spring Security OAuth2 to implement your own OAuth 2.0 provider Learn how to implement OAuth 2.0 native mobile clients for Android applications Who This Book Is For This book targets software engineers and security experts who are looking to develop their skills in API security and OAuth 2.0. Prior programming knowledge and a basic understanding of developing web applications are necessary. As this book's recipes mostly use Spring Security and Spring Security OAuth2, some prior experience with Spring Framework will be helpful. What You Will Learn Use Redis and relational databases to store issued access tokens and refresh tokens Access resources protected by the OAuth2 Provider using Spring Security Implement a web application that dynamically registers itself to the Authorization Server Improve the safety of your mobile client using dynamic client registration Protect your Android client with Proof Key for Code Exchange Protect the Authorization Server from COMPUTERS \/ Cloud Computing redirection In Detail OAuth 2.0 is a standard protocol for authorization and focuses on client development simplicity while providing specific authorization flows for web applications, desktop applications, mobile phones, and so on. This book also provides useful recipes for solving real-life problems using Spring Security and creating Android applications. The book starts by presenting you how to interact with some public OAuth 2.0 protected APIs such as Facebook, LinkedIn and Google. You will also be able to implement your own OAuth 2.0 provider with Spring Security OAuth2. Next, the book will cover practical scenarios regarding some important OAuth 2.0 profiles such as Dynamic Client Registration, Token Introspection and how to revoke issued access tokens. You will then be introduced to the usage of JWT, OpenID Connect, and how to safely implement native mobile OAuth 2.0 Clients. By the end of this book, you will be able to ensure that both the server and client are protected against common vulnerabilities. Style and approach With the help of real-world examples, this book provides step by step recipes for troubleshooting and extending your API security. The book also helps you with accessing and securing data on mobile, desktop, and cloud apps with OAuth 2.0.","language":"en","currency":"USD","id":"1788290631","title":"OAuth 2.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OhtKDwAAQBAJ&source=gbs_api","authors":["Adolfo Eloy Nascimento"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=irZTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Get up and running with the fundamentals and functionalities of seven of the most popular NoSQL databases","description":"A beginner's guide to get you up and running with Cassandra, DynamoDB, HBase, InfluxDB, MongoDB, Neo4j, and Redis Key Features Covers the basics of 7 NoSQL databases and how they are used in the enterprises Quick introduction to MongoDB, DynamoDB, Redis, Cassandra, Neo4j, InfluxDB, and HBase Includes effective techniques for database querying and management Book Description This is the golden age of open source NoSQL databases. With enterprises having to work with large amounts of unstructured data and moving away from expensive monolithic architecture, the adoption of NoSQL databases is rapidly increasing. Being familiar with the popular NoSQL databases and knowing how to use them is a must for budding DBAs and developers. This book introduces you to the different types of NoSQL databases and gets you started with seven of the most popular NoSQL databases used by enterprises today. We start off with a brief overview of what NoSQL databases are, followed by an explanation of why and when to use them. The book then covers the seven most popular databases in each of these categories: MongoDB, Amazon DynamoDB, Redis, HBase, Cassandra, InfluxDB, and Neo4j. The book doesn't go into too much detail about each database but teaches you enough to get started with them. By the end of this book, you will have a thorough understanding of the different NoSQL databases and their functionalities, empowering you to select and use the right database according to your needs. What you will learn Understand how MongoDB provides high-performance, high-availability, and automatic scaling Interact with your Neo4j instances via database queries, Python scripts, and Java application code Get familiar with common querying and programming methods to interact with Redis Study the different types of problems Cassandra can solve Work with HBase components to support common operations such as creating tables and reading\/writing data Discover data models and work with CRUD operations using DynamoDB Discover what makes InfluxDB a great choice for working with time-series data Who this book is for If you are a budding DBA or a developer who wants to get started with the fundamentals of NoSQL databases, this book is for you. Relational DBAs who want to get insights into the various offerings of popular NoSQL databases will also find this book to be very useful.","language":"en","currency":"USD","id":"1787127141","title":"Seven NoSQL Databases in a Week","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=irZTDwAAQBAJ&source=gbs_api","authors":["Xun (Brian) Wu","Sudarshan Kadambi","Devram Kandhare","Aaron Ploetz"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ys4GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you're a JavaScript developer interested in a deeper understanding of how to create and design Node.js applications, this is the book for you.","language":"en","currency":"USD","id":"1783287322","title":"Node.js Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ys4GBgAAQBAJ&source=gbs_api","authors":["Mario Casciaro"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AQu8AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.A short and precise guide to get you started with EaselJS , helping you to create some cool applications and games.EaselJS greatly simplifies application development in HTML5 Canvas using a syntax and an architecture very similar to the ActionScript 3.0 language. As a result, Flash \/ Flex developers will immediately feel at home but it’s very easy to learn even if you've never opened Flash in your life. The book targets Web designers, animators, Digital content producers, and Flash and Flex developers.","language":"en","currency":"USD","id":"1782162836","title":"Laravel Application Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AQu8AQAAQBAJ&source=gbs_api","authors":["Terry Matula"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KpZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Master the intricacies of Apache Storm and develop real-time stream processing applications with ease About This Book Exploit the various real-time processing functionalities offered by Apache Storm such as parallelism, data partitioning, and more Integrate Storm with other Big Data technologies like Hadoop, HBase, and Apache Kafka An easy-to-understand guide to effortlessly create distributed applications with Storm Who This Book Is For If you are a Java developer who wants to enter into the world of real-time stream processing applications using Apache Storm, then this book is for you. No previous experience in Storm is required as this book starts from the basics. After finishing this book, you will be able to develop not-so-complex Storm applications. What You Will Learn Understand the core concepts of Apache Storm and real-time processing Follow the steps to deploy multiple nodes of Storm Cluster Create Trident topologies to support various message-processing semantics Make your cluster sharing effective using Storm scheduling Integrate Apache Storm with other Big Data technologies such as Hadoop, HBase, Kafka, and more Monitor the health of your Storm cluster In Detail Apache Storm is a real-time Big Data processing framework that processes large amounts of data reliably, guaranteeing that every message will be processed. Storm allows you to scale your data as it grows, making it an excellent platform to solve your big data problems. This extensive guide will help you understand right from the basics to the advanced topics of Storm. The book begins with a detailed introduction to real-time processing and where Storm fits in to solve these problems. You'll get an understanding of deploying Storm on clusters by writing a basic Storm Hello World example. Next we'll introduce you to Trident and you'll get a clear understanding of how you can develop and deploy a trident topology. We cover topics such as monitoring, Storm Parallelism, scheduler and log processing, in a very easy to understand manner. You will also learn how to integrate Storm with other well-known Big Data technologies such as HBase, Redis, Kafka, and Hadoop to realize the full potential of Storm. With real-world examples and clear explanations, this book will ensure you will have a thorough mastery of Apache Storm. You will be able to use this knowledge to develop efficient, distributed real-time applications to cater to your business needs. Style and approach This easy-to-follow guide is full of examples and real-world applications to help you get an in-depth understanding of Apache Storm. This book covers the basics thoroughly and also delves into the intermediate and slightly advanced concepts of application development with Apache Storm.","language":"en","currency":"USD","id":"1787120406","title":"Mastering Apache Storm","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KpZGDwAAQBAJ&source=gbs_api","authors":["Ankit Jain"]},{"pageCount":404,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3crTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Develop elegant RESTful APIs with Golang for microservices and the cloud, 2nd Edition","description":"Design production-ready, testable, and maintainable RESTful web services for the modern web that scale easily Key Features Employ a combination of custom and open source solutions for application program interface (API) development Discover asynchronous API and API security patterns and learn how to deploy your web services to the cloud Apply design patterns and techniques to build reactive and scalable web services Book Description Building RESTful web services can be tough as there are countless standards and ways to develop API. In modern architectures such as microservices, RESTful APIs are common in communication, making idiomatic and scalable API development crucial. This book covers basic through to advanced API development concepts and supporting tools. You’ll start with an introduction to REST API development before moving on to building the essential blocks for working with Go. You’ll explore routers, middleware, and available open source web development solutions in Go to create robust APIs, and understand the application and database layers to build RESTful web services. You’ll learn various data formats like protocol buffers and JSON, and understand how to serve them over HTTP and gRPC. After covering advanced topics such as asynchronous API design and GraphQL for building scalable web services, you’ll discover how microservices can benefit from REST. You’ll also explore packaging artifacts in the form of containers and understand how to set up an ideal deployment ecosystem for web services. Finally, you’ll cover the provisioning of infrastructure using infrastructure as code (IaC) and secure your REST API. By the end of the book, you’ll have intermediate knowledge of web service development and be able to apply the skills you’ve learned in a practical way. What you will learn Explore the fundamentals of API development and web services Understand the various building blocks of API development in Go Use superior open source solutions for representational state transfer (REST) API development Scale a service using microservices and asynchronous design patterns Deliver containerized artifacts to the Amazon Web Services (AWS) Cloud Get to grips with API security and its implementation Who this book is for This book is for all the Go developers who are comfortable with the language and seeking to learn REST API development. Even senior engineers can enjoy this book, as it discusses many cutting-edge concepts, such as building microservices, developing API with GraphQL, using protocol buffers, asynchronous API design, and Infrastructure as a Code. Developers who are already familiar with REST concepts and stepping into the Go world from other platforms, such as Python and Ruby, can also benefit a lot.","language":"en","currency":"USD","id":"1838647546","title":"Hands-On RESTful Web Services with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3crTDwAAQBAJ&source=gbs_api","authors":["Naren Yellavula"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=f_qODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.99,"subtitle":"Build, Ship, and Run Your Applications Everywhere","description":"Docker does for DevOps what Rails did for web development--it gives you a new set of superpowers. Gone are \"works on my machine\" woes and lengthy setup tasks, replaced instead by a simple, consistent, Docker-based development environment that will have your team up and running in seconds. Gain hands-on, real-world experience with a tool that's rapidly becoming fundamental to software development. Go from zero all the way to production as Docker transforms the massive leap of deploying your app in the cloud into a baby step. Docker makes life as a Ruby and Rails developer easier. It helps build, ship, and run your applications, solving major problems you face every day. It allows you to run applications at scale, adding new resources as needed. Docker provides a reliable, consistent environment that's guaranteed to work the same everywhere. Docker lets you do all things DevOps without needing a PhD in infrastructure and operations. Want to spin up a cluster to run your app? No problem. Scale it up or down at will? You bet. Start by running a Ruby script without having Ruby installed on the local machine. Then Dockerize a Rails application and run it using containers, including creating your own custom Docker images tailored for running Rails apps. Describe your app declaratively using Docker Compose, specifying the software dependencies along with everything needed to run the application. Then set up continuous integration, as well as your deployment pipeline and infrastructure. Along the way, find out the best practices for using Docker in development and production environments. This book gives you a solid foundation on using Docker and fitting it into your development workflow and deployment process. What You Need: All you need is a Windows, Mac OS X or Linux machine to do development on. This book guides you through the process of installing Docker. Some basic familiarity with Linux\/Unix is recommended even if you're using a Windows machine.","language":"en","currency":"USD","id":"1680506757","title":"Docker for Rails Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=f_qODwAAQBAJ&source=gbs_api","authors":["Rob Isenberg"]},{"pageCount":668,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NulODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Effective ways to build modern, interactive web applications with ASP.NET Core MVC 2.0","description":"Learn to implement ASP.NET Core features to build effective software that can be scaled and maintained easily Key Features Practical solutions to recurring issues in the web development world Recipes on the latest features of ASP.Net Core 2.0 Coverage of Bootstrap, Angular, and JavaScript lets you supercharge your frontend Book Description The ASP.NET Core 2.0 Framework has been designed to meet all the needs of today’s web developers. It provides better control, support for test-driven development, and cleaner code. Moreover, it’s lightweight and allows you to run apps on Windows, OSX and Linux, making it the most popular web framework with modern day developers. This book takes a unique approach to web development, using real-world examples to guide you through problems with ASP.NET Core 2.0 web applications. It covers Visual Studio 2017- and ASP.NET Core 2.0-specifc changes and provides general MVC development recipes. It explores setting up .NET Core, Visual Studio 2017, Node.js modules, and NuGet. Next, it shows you how to work with Inversion of Control data pattern and caching. We explore everyday ASP.NET Core MVC 2.0 patterns and go beyond it into troubleshooting. Finally, we lead you through migrating, hosting, and deploying your code. By the end of the book, you’ll not only have explored every aspect of ASP.NET Core MVC 2.0, you’ll also have a reference you can keep coming back to whenever you need to get the job done. What you will learn Build ASP.Net Core 2.0 applications using HTTP services with WebApi Learn to unit-test, load test, and perform test applications using client-side and server-side frameworks Debug, monitor and troubleshoot ASP.Net Core 2.0 applications using popular tools Reuse components with NuGet and create modular components with middleware Create applications using client-side technologies such as HTML5, JavaScript, jQuery, and Angular Build responsive and dynamic UIs for your MVC apps using Bootstrap Leverage tools like Karma, Jasmine, QUnit, xUnit, Selenium, Microsoft Fakes, and Visual Studio 2017 Enterprise Who this book is for This book is written for the ASP.NET developer who wants to deliver professional-standard software, quickly and efficiently. It's filled with hands-on recipes, practical advice, and guidance to help developers with every aspect of the ASP.NET development cycle. Whether you've just started out or are a seasoned pro, the Asp.Net Core 2.0 Cookbook is written for you.","language":"en","currency":"USD","id":"1785889664","title":"ASP.NET Core MVC 2.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NulODwAAQBAJ&source=gbs_api","authors":["Jason De Oliveira","Engin Polat","Stephane Belkheraz"]},{"pageCount":792,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pTYkAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"Enterprise and the Cloud","description":"The Complete Guide to Optimizing Systems Performance Written by the winner of the 2013 LISA Award for Outstanding Achievement in System Administration Large-scale enterprise, cloud, and virtualized computing systems have introduced serious performance challenges. Now, internationally renowned performance expert Brendan Gregg has brought together proven methodologies, tools, and metrics for analyzing and tuning even the most complex environments. Systems Performance: Enterprise and the Cloud focuses on Linux® and Unix® performance, while illuminating performance issues that are relevant to all operating systems. You’ll gain deep insight into how systems work and perform, and learn methodologies for analyzing and improving system and application performance. Gregg presents examples from bare-metal systems and virtualized cloud tenants running Linux-based Ubuntu®, Fedora®, CentOS, and the illumos-based Joyent® SmartOS™ and OmniTI OmniOS®. He systematically covers modern systems performance, including the “traditional” analysis of CPUs, memory, disks, and networks, and new areas including cloud computing and dynamic tracing. This book also helps you identify and fix the “unknown unknowns” of complex performance: bottlenecks that emerge from elements and interactions you were not aware of. The text concludes with a detailed case study, showing how a real cloud customer issue was analyzed from start to finish. Coverage includes • Modern performance analysis and tuning: terminology, concepts, models, methods, and techniques • Dynamic tracing techniques and tools, including examples of DTrace, SystemTap, and perf • Kernel internals: uncovering what the OS is doing • Using system observability tools, interfaces, and frameworks • Understanding and monitoring application performance • Optimizing CPUs: processors, cores, hardware threads, caches, interconnects, and kernel scheduling • Memory optimization: virtual memory, paging, swapping, memory architectures, busses, address spaces, and allocators • File system I\/O, including caching • Storage devices\/controllers, disk I\/O workloads, RAID, and kernel I\/O • Network-related performance issues: protocols, sockets, interfaces, and physical connections • Performance implications of OS and hardware-based virtualization, and new issues encountered with cloud computing • Benchmarking: getting accurate results and avoiding common mistakes This guide is indispensable for anyone who operates enterprise or cloud environments: system, network, database, and web admins; developers; and other professionals. For students and others new to optimization, it also provides exercises reflecting Gregg’s extensive instructional experience.","language":"en","currency":"USD","id":"0133390101","title":"Systems Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pTYkAQAAQBAJ&source=gbs_api","authors":["Brendan Gregg"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YeH2k26PjtAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.33,"subtitle":"Engineering at Cloud Scale","description":"Cloud services are just as susceptible to network outages as any other platform. This concise book shows you how to prepare for potentially devastating interruptions by building your own resilient and reliable applications in the public cloud. Guided by engineers from 9apps—an independent provider of Amazon Web Services and Eucalyptus cloud solutions—you’ll learn how to combine AWS with open source tools such as PostgreSQL, MongoDB, and Redis. This isn’t a book on theory. With detailed examples, sample scripts, and solid advice, software engineers with operations experience will learn specific techniques that 9apps routinely uses in its cloud infrastructures. Build cloud applications with the \"rip, mix, and burn\" approach Get a crash course on Amazon Web Services Learn the top ten tips for surviving outages in the cloud Use elasticsearch to build a dependable NoSQL data store Combine AWS and PostgreSQL to build an RDBMS that scales well Create a highly available document database with MongoDB Replica Set and SimpleDB Augment Redis with AWS to provide backup\/restore, failover, and monitoring capabilities Work with CloudFront and Route 53 to safeguard global content delivery","language":"en","currency":"USD","id":"1449339255","title":"Resilience and Reliability on AWS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YeH2k26PjtAC&source=gbs_api","authors":["Jurg van Vliet","Flavia Paganelli","Jasper Geurtsen"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CDu-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Blueprints for Building Successful Applications on Kubernetes","description":"In this practical guide, four Kubernetes professionals with deep experience in distributed systems, enterprise application development, and open source will guide you through the process of building applications with this container orchestration system. Based on the experiences of companies that are running Kubernetes in production successfully, many of the methods are also backed by concrete code examples. This book is ideal for those already familiar with basic Kubernetes concepts who want to learn common best practices. You’ll learn exactly what you need to know to build your best app with Kubernetes the first time. Set up and develop applications in Kubernetes Learn patterns for monitoring, securing your systems, and managing upgrades, rollouts, and rollbacks Understand Kubernetes networking policies and where service mesh fits in Integrate services and legacy applications and develop higher-level platforms on top of Kubernetes Run machine learning workloads in Kubernetes","language":"en","currency":"USD","id":"1492056421","title":"Kubernetes Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CDu-DwAAQBAJ&source=gbs_api","authors":["Brendan Burns","Eddie Villalba","Dave Strebel","Lachlan Evenson"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q6i8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":6.11,"subtitle":null,"description":"En este libro se ofrece una introducción a las bases de datos NoSQL utilizando como elemento de ilustración Redis, una base de datos de tipo clave-valor, Se estructura en dos partes, En la primera, se describen los conceptos fundamentales de las bases de datos NoSQL, y en la segunda, se introduce Redis, Se explica su instalación, el modelo y las estructuras de datos, aspectos sobre replicación, particionamiento y tipos de persistencia, y algunos aspectos de administración de Redis, En el último capítulo se describe un ejemplo de aplicación real de este sistema,","language":"es","currency":"USD","id":"8491804862","title":"Introducción a las bases de datos NSQL clave-valor usando Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q6i8DwAAQBAJ&source=gbs_api","authors":["Antonio Sarasa"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=px9LDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"Combine the power of developer tools and techniques with the discipline and advocacy of writing excellent technical documentation. Why not treat docs like software code?","language":"en","currency":"USD","id":"1365750825","title":"Docs Like Code","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=px9LDgAAQBAJ&source=gbs_api","authors":["Anne Gentle"]},{"pageCount":218,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p5efBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you have some understanding of IT infrastructure principles and are ready to find out what Chef is all about, then this guide will show you all you need to know. In order to get the most out of this book, some experience of programming or scripting languages would be useful.","language":"en","currency":"USD","id":"1783983051","title":"Chef Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p5efBAAAQBAJ&source=gbs_api","authors":["John Ewart"]},{"pageCount":88,"thumbnail":"http:\/\/books.google.com\/books\/content?id=tUYiAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A simple, easy to understand tutorial guide on how to build teams and efficiently use version control, using GitLab.If you are a system administrator in a company that writes software or are in charge of an infrastructure, this book will show you the most important features of GitLab, including how to speed up the overall process","language":"en","currency":"USD","id":"1783281804","title":"GitLab Repository Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=tUYiAgAAQBAJ&source=gbs_api","authors":["Jonathan M. Hethey"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RyEHBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Building Real-World Scalable Web Apps","description":"Practical Node.js is your step-by-step guide to learning how to build a wide range of scalable real-world web applications using a professional development toolkit. Node.js is an innovative and highly efficient platform for creating web services. But Node.js doesn't live in a vacuum! In a modern web development, many different components need to be put together — routing, database driver, ORM, session management, OAuth, HTML template engine, CSS compiler and many more. If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages. As a web developer, you'll work with a varied collection of standards and frameworks - Practical Node.js shows you how all those pieces fit together. Practical Node.js takes you from installing all the necessary modules to writing full-stack web applications by harnessing the power of the Express.js and Hapi frameworks, the MongoDB database with Mongoskin and Mongoose, Jade and Handlebars template engines, Stylus and LESS CSS languages, OAuth and Everyauth libraries, and the Socket.IO and Derby libraries, and everything in between. The book also covers how to deploy to Heroku and AWS, daemonize apps, and write REST APIs. You'll build full-stack real-world Node.js apps from scratch, and also discover how to write your own Node.js modules and publish them on NPM. You already know what Node.js is; now learn what you can do with it and how far you can take it!","language":"en","currency":"USD","id":"1430265965","title":"Practical Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RyEHBAAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xBOjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19,"subtitle":"Get Up to Speed With Node.js in a Weekend","description":"Node.js is changing the way web apps are built. As Node.js apps are written in JavaScript, you can quickly and simply use your front-end skills to develop staggeringly fast, scalable real-time web applications. Read this book and, in a weekend, you’ll learn how to: Develop a complete working Node.js application - from start-to-finish Deploy your new application to a production server Scale your projects quickly and cheaply PLUS discover how to use Twitter Bootstrap, MongoDB and Back-bone.js to create fancy web apps, extend their storage, and dy-namically update them.","language":"en","currency":"USD","id":"1457192047","title":"Jump Start Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xBOjBgAAQBAJ&source=gbs_api","authors":["Don Nguyen"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GK7NBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is for anyone who's worked with Clojure and wants to use it to start developing applications for the Web. Experience or familiarity with basic Clojure syntax is a must, and exposure to Leiningen (or other similar build tools such as Maven) would be helpful.","language":"en","currency":"USD","id":"1784394874","title":"Clojure Web Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GK7NBgAAQBAJ&source=gbs_api","authors":["Ryan Baldwin"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RX773LKyeUIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"Implement JPA repositories and harness the performance of Redis in your applications.","language":"en","currency":"USD","id":"1849519056","title":"Spring Data Standard Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RX773LKyeUIC&source=gbs_api","authors":["Petri Kainulainen"]},{"pageCount":546,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2i8tDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.42,"subtitle":"Second International Conference, DMBD 2017, Fukuoka, Japan, July 27 – August 1, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the Second International Conference on Data Mining and Big Data, DMBD 2017, held in Fukuoka, Japan, in July\/August 2017. The 53 papers presented in this volume were carefully reviewed and selected from 96 submissions. They were organized in topical sections named: association analysis; clustering; prediction; classification; schedule and sequence analysis; big data; data analysis; data mining; text mining; deep learning; high performance computing; knowledge base and its framework; and fuzzy control.","language":"en","currency":"USD","id":"3319618458","title":"Data Mining and Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2i8tDwAAQBAJ&source=gbs_api","authors":["Ying Tan","Hideyuki Takagi","Yuhui Shi"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=82mRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Reusable Elements for Designing Cloud-Native Applications","description":"The way developers design, build, and run software has changed significantly with the evolution of microservices and containers. These modern architectures use new primitives that require a different set of practices than most developers, tech leads, and architects are accustomed to. With this focused guide, Bilgin Ibryam and Roland Huß from Red Hat provide common reusable elements, patterns, principles, and practices for designing and implementing cloud-native applications on Kubernetes. Each pattern includes a description of the problem and a proposed solution with Kubernetes specifics. Many patterns are also backed by concrete code examples. This book is ideal for developers already familiar with basic Kubernetes concepts who want to learn common cloud native patterns. You’ll learn about the following pattern categories: Foundational patterns cover the core principles and practices for building container-based cloud-native applications. Behavioral patterns explore finer-grained concepts for managing various types of container and platform interactions. Structural patterns help you organize containers within a pod, the atom of the Kubernetes platform. Configuration patterns provide insight into how application configurations can be handled in Kubernetes. Advanced patterns covers more advanced topics such as extending the platform with operators.","language":"en","currency":"USD","id":"1492050237","title":"Kubernetes Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=82mRDwAAQBAJ&source=gbs_api","authors":["Bilgin Ibryam","Roland Huß"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2CgvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Obey the Testing Goat: Using Django, Selenium, and JavaScript","description":"By taking you through the development of a real web application from beginning to end, the second edition of this hands-on guide demonstrates the practical advantages of test-driven development (TDD) with Python. You’ll learn how to write and run tests before building each part of your app, and then develop the minimum amount of code required to pass those tests. The result? Clean code that works. In the process, you’ll learn the basics of Django, Selenium, Git, jQuery, and Mock, along with current web development techniques. If you’re ready to take your Python skills to the next level, this book—updated for Python 3.6—clearly demonstrates how TDD encourages simple designs and inspires confidence. Dive into the TDD workflow, including the unit test\/code cycle and refactoring Use unit tests for classes and functions, and functional tests for user interactions within the browser Learn when and how to use mock objects, and the pros and cons of isolated vs. integrated tests Test and automate your deployments with a staging server Apply tests to the third-party plugins you integrate into your site Run tests automatically by using a Continuous Integration environment Use TDD to build a REST API with a front-end Ajax interface","language":"en","currency":"USD","id":"1491958650","title":"Test-Driven Development with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2CgvDwAAQBAJ&source=gbs_api","authors":["Harry Percival"]},{"pageCount":435,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2tlVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Accelerated Web Development with Ruby on Rails","description":"Learn to build Rails-based web applications using all the latest features offered in Rails 5.2. Author Stefan Wintermeyer begins by teaching the basics of Ruby 2.5 before proceeding through all aspects of Rails, utilizing clean, succinct examples – rather than a single large application. This book covers topics including Active Storage, Credentials, Active Record, Scaffolding, REST, Routing, Bundler, Forms, Cookies, and Sessions, all of which are vital for modern Rails web applications. To complement these topics you’ll also learn about test-driven development, Action Cable, Active Job, Action Mailer, I18n, Asset Pipeline, and caching. Finally, you’ll see a how-to for a production web server with nginx. This complete set of skills will set you up for a future of efficient and elegant Rails coding. What You Will Learn Use the Ruby on Rails web development framework Install and manage the Rails framework Persist data for your web application with Active Record Work with forms Apply a test-driven development approach to your Rails-based web applications Discover many Rails secrets and tips Who This Book Is For Beginners with at least some prior programming experience. Ruby experience is helpful, but not required.","language":"en","currency":"USD","id":"1484234898","title":"Learn Rails 5.2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2tlVDwAAQBAJ&source=gbs_api","authors":["Stefan Wintermeyer"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XyKeDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Architecting in the Cloud with Azure Data Lake, HDInsight, and Spark","description":"Microsoft Azure has over 20 platform-as-a-service (PaaS) offerings that can act in support of a big data analytics solution. So which one is right for your project? This practical book helps you understand the breadth of Azure services by organizing them into a reference framework you can use when crafting your own big data analytics solution. You’ll not only be able to determine which service best fits the job, but also learn how to implement a complete solution that scales, provides human fault tolerance, and supports future needs. Understand the fundamental patterns of the data lake and lambda architecture Recognize the canonical steps in the analytics data pipeline and learn how to use Azure Data Factory to orchestrate them Implement data lakes and lambda architectures, using Azure Data Lake Store, Data Lake Analytics, HDInsight (including Spark), Stream Analytics, SQL Data Warehouse, and Event Hubs Understand where Azure Machine Learning fits into your analytics pipeline Gain experience using these services on real-world data that has real-world problems, with scenarios ranging from aviation to Internet of Things (IoT)","language":"en","currency":"USD","id":"1491956607","title":"Mastering Azure Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XyKeDgAAQBAJ&source=gbs_api","authors":["Zoiner Tejada"]},{"pageCount":158,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ooQrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Algorithms and Information Retrieval in Java","description":"If you’re a student studying computer science or a software developer preparing for technical interviews, this practical book will help you learn and review some of the most important ideas in software engineering—data structures and algorithms—in a way that’s clearer, more concise, and more engaging than other materials. By emphasizing practical knowledge and skills over theory, author Allen Downey shows you how to use data structures to implement efficient algorithms, and then analyze and measure their performance. You’ll explore the important classes in the Java collections framework (JCF), how they’re implemented, and how they’re expected to perform. Each chapter presents hands-on exercises supported by test code online. Use data structures such as lists and maps, and understand how they work Build an application that reads Wikipedia pages, parses the contents, and navigates the resulting data tree Analyze code to predict how fast it will run and how much memory it will require Write classes that implement the Map interface, using a hash table and binary search tree Build a simple web search engine with a crawler, an indexer that stores web page contents, and a retriever that returns user query results Other books by Allen Downey include Think Java, Think Python, Think Stats, and Think Bayes.","language":"en","currency":"USD","id":"1491972319","title":"Think Data Structures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ooQrDwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ISYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product. This study guide covers 100% of the objectives for the AWS Certified SysOps Administrator Associate exam Take the challenging AWS Certified SysOps Administrator Associate exam with confidence using this highly effective self-study guide. You will learn how to provision systems, ensure data integrity, handle security, and monitor and tune Amazon Web Services performance. Written by an industry-leading expert, AWS Certified SysOps Administrator Associate All-in-One Exam Guide (Exam SOA-C01) fully covers every objective for the exam and follows a hands-on, step-by-step methodology. Beyond fully preparing you for the exam, the book also serves as a valuable on-the-job reference. Covers all exam topics, including:•Systems operations•Signing up, working with the AWS Management Console, and the AWS CLI•AWS Identity and Access Management (IAM) and AWS service security•AWS compute services and the Elastic Compute Cloud (EC2)•Amazon ECS, AWS Batch, AWS Lambda, and other compute services•Storage and archiving in the AWS cloud with Amazon EBS, Amazon EFS, and Amazon S3 Glacier•Managing databases in the cloud—Amazon RDS, Amazon Aurora, Amazon DynamoDB, Amazon ElastiCache, and Amazon Redshift•Application integration with Amazon SQS and Amazon SNS•AWS high availability strategies•Monitoring with Amazon CloudWatch, logging, and managing events•Managing AWS costs and billing•Infrastructure provisioning through AWS CloudFormation and AWS OpsWorks, application deployment, and creating scalable infrastructures Online content includes:•130 practice questions•Test engine that provides full-length practice exams or customized quizzes by chapter or by exam domain","language":"en","currency":"USD","id":"1260135551","title":"AWS Certified SysOps Administrator Associate All-in-One-Exam Guide (Exam SOA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ISYDwAAQBAJ&source=gbs_api","authors":["Sam R. Alapati"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o1EnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"Master Express.js: The Node.js Framework For Your Web Development","description":"Pro Express.js is for the reader who wants to quickly get up-to-speed with Express.js, the flexible Node.js framework. Author Azat Mardan clearly explains how to start developing with Express.js with a basic 'Hello World', and then delves into a deep API reference, before looking at common and abstract development problems. Lastly, you will learn how to build a series of real-world apps in order to cement your knowledge. In order to get the best from this book, you will be familiar with Node.js scripts and able to install packages using npm. In the deep API reference, each aspect of the Express.js API is explained clearly with a simple exercise to demonstrate its usage. This includes configuration, settings and environments; different middleware and its uses; templating engines; extracting parameters and routing; request and response; error handling; and running an app. In the next part you'll delve into abstraction, streams, authentication, multithreading, Socket.io, security, and more complex modules. You will also learn about smaller frameworks built using Express.js, such as Sails.js, and Derby. Finally you'll build real-world apps including a REST API, Todo App, and Instagram gallery. Express.js is used by a range of well-known companies such as MySpace and Storify, and it's becoming more and more likely that it'll be a required skill for new developers. With this book you can skip learning via complicated documentation, and get the information from a developer who's been using Express.js for long enough to explain things well. Add Pro Express.js to your library today.","language":"en","currency":"USD","id":"1484200373","title":"Pro Express.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o1EnCgAAQBAJ&source=gbs_api","authors":["Azat Mardan"]},{"pageCount":526,"thumbnail":"http:\/\/books.google.com\/books\/content?id=IHxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build powerful and reliable Python web applications from scratch","description":"Learn Django 2.0 with four end-to-end projects Key Features Learn Django by building real-world web applications from scratch Develop powerful web applications quickly using the best coding practices Integrate other technologies into your application with clear, step-by-step explanations and comprehensive example code Book Description If you want to learn about the entire process of developing professional web applications with Django, then this book is for you. This book will walk you through the creation of four professional Django projects, teaching you how to solve common problems and implement best practices. You will learn how to build a blog application, a social image-bookmarking website, an online shop, and an e-learning platform. The book will teach you how to enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. The book walks you through the creation of real-world applications, while solving common problems and implementing best practices. By the end of this book, you will have a deep understanding of Django and how to build advanced web applications What you will learn Build practical, real-world web applications with Django Use Django with other technologies, such as Redis and Celery Develop pluggable Django applications Create advanced features, optimize your code, and use the cache framework Add internationalization to your Django projects Enhance your user experience using JavaScript and AJAX Add social features to your projects Build RESTful APIs for your applications Who this book is for If you are a web developer who wants to see how to build professional sites with Django, this book is for you. You will need a basic knowledge of Python, HTML, and JavaScript, but you don't need to have worked with Django before.","language":"en","currency":"USD","id":"1788472004","title":"Django 2 by Example","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=IHxeDwAAQBAJ&source=gbs_api","authors":["Antonio Mele"]},{"pageCount":558,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9XHnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Best Practices for Designing, Implementing, and Maintaining Systems","description":"Can a system be considered truly reliable if it isn't fundamentally secure? Or can it be considered secure if it's unreliable? Security is crucial to the design and operation of scalable systems in production, as it plays an important part in product quality, performance, and availability. In this book, experts from Google share best practices to help your organization design scalable and reliable systems that are fundamentally secure. Two previous O’Reilly books from Google—Site Reliability Engineering and The Site Reliability Workbook—demonstrated how and why a commitment to the entire service lifecycle enables organizations to successfully build, deploy, monitor, and maintain software systems. In this latest guide, the authors offer insights into system design, implementation, and maintenance from practitioners who specialize in security and reliability. They also discuss how building and adopting their recommended best practices requires a culture that’s supportive of such change. You’ll learn about secure and reliable systems through: Design strategies Recommendations for coding, testing, and debugging practices Strategies to prepare for, respond to, and recover from incidents Cultural best practices that help teams across your organization collaborate effectively","language":"en","currency":"USD","id":"1492083070","title":"Building Secure and Reliable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9XHnDwAAQBAJ&source=gbs_api","authors":["Heather Adkins","Betsy Beyer","Paul Blankinship","Piotr Lewandowski","Ana Oprea","Adam Stubblefield"]},{"pageCount":526,"thumbnail":"http:\/\/books.google.com\/books\/content?id=55WqDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Get the best out of Node.js by mastering its most powerful components and patterns to create modular and scalable applications with ease About This Book Create reusable patterns and modules by leveraging the new features of Node.js . Understand the asynchronous single thread design of node and grasp all its features and patterns to take advantage of various functions. This unique guide will help you get the most out of Node.js and its ecosystem. Who This Book Is For The book is meant for developers and software architects with a basic working knowledge of JavaScript who are interested in acquiring a deeper understanding of how to design and develop enterprise-level Node.js applications. Basic knowledge of Node.js is also helpful to get the most out of this book. What You Will Learn Design and implement a series of server-side JavaScript patterns so you understand why and when to apply them in different use case scenarios Become comfortable with writing asynchronous code by leveraging constructs such as callbacks, promises, generators and the async-await syntax Identify the most important concerns and apply unique tricks to achieve higher scalability and modularity in your Node.js application Untangle your modules by organizing and connecting them coherently Reuse well-known techniques to solve common design and coding issues Explore the latest trends in Universal JavaScript, learn how to write code that runs on both Node.js and the browser and leverage React and its ecosystem to implement universal applications In Detail Node.js is a massively popular software platform that lets you use JavaScript to easily create scalable server-side applications. It allows you to create efficient code, enabling a more sustainable way of writing software made of only one language across the full stack, along with extreme levels of reusability, pragmatism, simplicity, and collaboration. Node.js is revolutionizing the web and the way people and companies create their software. In this book, we will take you on a journey across various ideas and components, and the challenges you would commonly encounter while designing and developing software using the Node.js platform. You will also discover the \"Node.js way\" of dealing with design and coding decisions. The book kicks off by exploring the basics of Node.js describing it's asynchronous single-threaded architecture and the main design patterns. It then shows you how to master the asynchronous control flow patterns,and the stream component and it culminates into a detailed list of Node.js implementations of the most common design patterns as well as some specific design patterns that are exclusive to the Node.js world.Lastly, it dives into more advanced concepts such as Universal Javascript, and scalability' and it's meant to conclude the journey by giving the reader all the necessary concepts to be able to build an enterprise grade application using Node.js. Style and approach This book takes its intended readers through a comprehensive explanation to create a scalable and efficient real-time server-side apps.","language":"en","currency":"USD","id":"1785887386","title":"Node.js Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=55WqDQAAQBAJ&source=gbs_api","authors":["Mario Casciaro","Luciano Mammino"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BCEOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This up-to-date study guide offers 100% coverage of every objective for the current version of the AWS Certified Solutions Architect Professional exam Get complete coverage of all objectives included on the SAA-C02 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect – Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. You’ll also build your practical knowledge with the many hands-on labs found throughout this guide. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: Design Resilient Architectures Design High-Performing Architectures Design Secure Applications and Architectures Design Cost-Optimized Architectures Online content includes: 130 practice exam questions Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260470199","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide, Second Edition (Exam SAA-C02)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BCEOEAAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kdEAEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"This study guide offers 100% coverage of every objective for the Google Cloud Certified Associate Cloud Engineer exam Take the challenging Google Cloud Certified Associate Cloud Engineer exam with confidence using the comprehensive information contained in this effective self-study guide. The book serves as an introduction to Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Associate Cloud Engineer All-In-One Exam Guide is based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and detailed explanations. You will discover how to plan set up, and configure GCP; ensure effective operation; and administer access and security. Covers every topic on the exam—demonstrated through exercises, sample exams, and practice use cases Provides online access to TotalTester customizable exam engine with additional practice questions Written by a cloud computing expert, educator, and experienced author","language":"en","currency":"USD","id":"1260473465","title":"Google Cloud Certified Associate Cloud Engineer All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kdEAEAAAQBAJ&source=gbs_api","authors":["Jack Hyman"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fElmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Practical Ways to Implement SRE","description":"In 2016, Google’s Site Reliability Engineering book ignited an industry discussion on what it means to run production services today—and why reliability considerations are fundamental to service design. Now, Google engineers who worked on that bestseller introduce The Site Reliability Workbook, a hands-on companion that uses concrete examples to show you how to put SRE principles and practices to work in your environment. This new workbook not only combines practical examples from Google’s experiences, but also provides case studies from Google’s Cloud Platform customers who underwent this journey. Evernote, The Home Depot, The New York Times, and other companies outline hard-won experiences of what worked for them and what didn’t. Dive into this workbook and learn how to flesh out your own SRE practice, no matter what size your company is. You’ll learn: How to run reliable services in environments you don’t completely control—like cloud Practical applications of how to create, monitor, and run your services via Service Level Objectives How to convert existing ops teams to SRE—including how to dig out of operational overload Methods for starting SRE from either greenfield or brownfield","language":"en","currency":"USD","id":"1492029459","title":"The Site Reliability Workbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fElmDwAAQBAJ&source=gbs_api","authors":["Betsy Beyer","Niall Richard Murphy","David K. Rensin","Kent Kawahara","Stephen Thorne"]},{"pageCount":340,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"A practical approach to conquering the complexities of Microservices using the Python tooling ecosystem About This Book A very useful guide for Python developers who are shifting to the new microservices-based development A concise, up-to-date guide to building efficient and lightweight microservices in Python using Flask, Tox, and other tools Learn to use Docker containers, CoreOS, and Amazon Web Services to deploy your services Who This Book Is For This book is for developers who have basic knowledge of Python, the command line, and HTTP-based application principles, and those who want to learn how to build, test, scale, and manage Python 3 microservices. No prior experience of writing microservices in Python is assumed. What You Will Learn Explore what microservices are and how to design them Use Python 3, Flask, Tox, and other tools to build your services using best practices Learn how to use a TDD approach Discover how to document your microservices Configure and package your code in the best way Interact with other services Secure, monitor, and scale your services Deploy your services in Docker containers, CoreOS, and Amazon Web Services In Detail We often deploy our web applications into the cloud, and our code needs to interact with many third-party services. An efficient way to build applications to do this is through microservices architecture. But, in practice, it's hard to get this right due to the complexity of all the pieces interacting with each other. This book will teach you how to overcome these issues and craft applications that are built as small standard units, using all the proven best practices and avoiding the usual traps. It's a practical book: you'll build everything using Python 3 and its amazing tooling ecosystem. You will understand the principles of TDD and apply them. You will use Flask, Tox, and other tools to build your services using best practices. You will learn how to secure connections between services, and how to script Nginx using Lua to build web application firewall features such as rate limiting. You will also familiarize yourself with Docker's role in microservices, and use Docker containers, CoreOS, and Amazon Web Services to deploy your services. This book will take you on a journey, ending with the creation of a complete Python application based on microservices. By the end of the book, you will be well versed with the fundamentals of building, designing, testing, and deploying your Python microservices. Style and approach This book is an linear, easy-to-follow guide on how to best design, write, test, and deploy your microservices. It includes real-world examples that will help Python developers create their own Python microservice using the most efficient methods.","language":"en","currency":"USD","id":"1785886789","title":"Python Microservices Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o-ZDDwAAQBAJ&source=gbs_api","authors":["Tarek Ziade"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6VKjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Developing Cloud-Native Applications","description":"If you’re looking to develop native applications in Kubernetes, this is your guide. Developers and AppOps administrators will learn how to build Kubernetes-native applications that interact directly with the API server to query or update the state of resources. AWS developer advocate Michael Hausenblas and Red Hat principal software engineer Stefan Schimanski explain the characteristics of these apps and show you how to program Kubernetes to build them. You’ll explore the basic building blocks of Kubernetes, including the client-go API library and custom resources. All you need to get started is a rudimentary understanding of development and system administration tools and practices, such as package management, the Go programming language, and Git. Walk through Kubernetes API basics and dive into the server’s inner structure Explore Kubernetes’s programming interface in Go, including Kubernetes API objects Learn about custom resources—the central extension tools used in the Kubernetes ecosystem Use tags to control Kubernetes code generators for custom resources Write custom controllers and operators and make them production ready Extend the Kubernetes API surface by implementing a custom API server","language":"en","currency":"USD","id":"1492047058","title":"Programming Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6VKjDwAAQBAJ&source=gbs_api","authors":["Michael Hausenblas","Stefan Schimanski"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZH6bpbcrlvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"Building Javascript Based Scalable Software","description":"Learn to build fast and scalable software in JavaScript with Node.js Node.js is a powerful and popular new framework for writing scalable network programs using JavaScript. This no nonsense book begins with an overview of Node.js and then quickly dives into the code, core concepts, and APIs. In-depth coverage pares down the essentials to cover debugging, unit testing, and flow control so that you can start building and testing your own modules right away. Covers node and asynchronous programming main concepts Addresses the basics: modules, buffers, events, and timers Explores streams, file systems, networking, and automated unit testing Goes beyond the basics, and shares techniques and tools for debugging, unit testing, and flow control If you already know JavaScript and are curious about the power of Node.js, then this is the ideal book for you.","language":"en","currency":"USD","id":"1118240561","title":"Professional Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZH6bpbcrlvYC&source=gbs_api","authors":["Pedro Teixeira"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XxNqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"COVERS THE NEW 2018 EXAM SAA-C01! This effective study guide provides 100% coverage of every topic on the AWS Certified Solutions Architect Associate exam. Get complete coverage of all objectives included on the February 2018 SAA-C01 exam from this comprehensive resource. Written by an expert AWS Solutions Architect and well-respected author, this authoritative guide fully addresses the knowledge and skills required for passing the AWS Certified Solutions Architect Associate exam. You’ll find learning objectives at the beginning of each chapter, exam tips, practice exam questions, and in-depth explanations. Designed to help you pass the exam with ease, this definitive volume also serves as an essential on-the-job reference. Covers all exam domains, including: •Design Resilient Architectures •Define Performant Architectures •Specify Secure Applications and Architectures •Design Cost-Optimized Architectures •Define Operationally Excellent Architectures Digital content includes: •130 practice exam questions•Test engine that provides practice exams or quizzes that can be customized by chapter or exam objective","language":"en","currency":"USD","id":"1260108260","title":"AWS Certified Solutions Architect Associate All-in-One Exam Guide (Exam SAA-C01)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XxNqDwAAQBAJ&source=gbs_api","authors":["Joyjeet Banerjee"]},{"pageCount":824,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ymLHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Learn to write clean, efficient code and build high-performance applications with Go","description":"The Go Workshop takes you from being a novice Go programmer to a confident developer who can leverage the key features of the language to build real-world applications. This book helps you cut through excessive theory and delve into the practical features and techniques that are commonly applied to design performant, scalable applications.","language":"en","currency":"USD","id":"1838640150","title":"The The Go Workshop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ymLHDwAAQBAJ&source=gbs_api","authors":["Delio D'Anna","Andrew Hayes","Sam Hennessy","Jeremy Leasor","Gobin Sougrakpam","Dániel Szabó"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=g5DqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"Charting Your Strategy for Next-Generation Business Analytics","description":"Learn all you need to know about seven key innovations disrupting business analytics today. These innovations—the open source business model, cloud analytics, the Hadoop ecosystem, Spark and in-memory analytics, streaming analytics, Deep Learning, and self-service analytics—are radically changing how businesses use data for competitive advantage. Taken together, they are disrupting the business analytics value chain, creating new opportunities. Enterprises who seize the opportunity will thrive and prosper, while others struggle and decline: disrupt or be disrupted. Disruptive Business Analytics provides strategies to profit from disruption. It shows you how to organize for insight, build and provision an open source stack, how to practice lean data warehousing, and how to assimilate disruptive innovations into an organization. Through a short history of business analytics and a detailed survey of products and services, analytics authority Thomas W. Dinsmore provides a practical explanation of the most compelling innovations available today. What You'll Learn Discover how the open source business model works and how to make it work for you See how cloud computing completely changes the economics of analytics Harness the power of Hadoop and its ecosystem Find out why Apache Spark is everywhere Discover the potential of streaming and real-time analytics Learn what Deep Learning can do and why it matters See how self-service analytics can change the way organizations do business Who This Book Is For Corporate actors at all levels of responsibility for analytics: analysts, CIOs, CTOs, strategic decision makers, managers, systems architects, technical marketers, product developers, IT personnel, and consultants.","language":"en","currency":"USD","id":"1484213114","title":"Disruptive Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=g5DqDAAAQBAJ&source=gbs_api","authors":["Thomas W. Dinsmore"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":392,"thumbnail":"http:\/\/books.google.com\/books\/content?id=N94oPslRUocC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 80 recipes to help you master using the Yii PHP framework.","language":"en","currency":"USD","id":"1849515492","title":"Yii 1.1 Application Development Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=N94oPslRUocC&source=gbs_api","authors":["Alexander Makarov"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XWT9AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":51.99,"subtitle":"HTTP Web Services in ASP.NET","description":"Pro ASP.NET Web API shows you how to build flexible, extensible web services that run seamlessly on a range of operating systems and devices, from desktops to tablets to smart phones—even the ones we don’t know today. ASP.NET Web API is a new framework designed to simplify web service architecture. So if you're tired of interoperability issues between inflexible web services and clients tied to specific platforms or programming languages, or if you've ever struggled with WCF, this book is for you. To start with, you'll get up to speed on Web API's modern HTTP programming model, REST and your hosting options. You'll then dive into building a real application over a series of three chapters, so you can get an immediate feel for how this technology works in practice. The second half of the book features dedicated chapters on topics like routing, controllers, validation and tracing, and the authors close with discussions on performance, hosting and an all-important look at unit testing to help you prepare your application for the real world. ASP.NET Web API makes HTTP a first-class citizen of .NET. With Pro ASP.NET Web API, you can build HTTP-based web services for your company or business, expose your data to the world across different formats and devices and gain the best possible global reach for your application.","language":"en","currency":"USD","id":"1430247266","title":"Pro ASP.NET Web API","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XWT9AAAAQBAJ&source=gbs_api","authors":["Ali Uurlu","Alexander Zeitler","Ali Kheyrollahi"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iRijBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29,"subtitle":"Write Cutting Edge Code","description":"PHP Master is tailor-made for the PHP developer who's serious about taking their server-side applications to the next level and who wants to really keep ahead of the game by adhering to best practice, employing the most effective object-oriented programming techniques, wrapping projects in layers of security and ensuring their code is doing its job perfectly. Create professional, dynamic applications according to an object-oriented programming blueprint Learn advanced performance evaluation techniques for maximum site efficiency Brush up on the best testing methods to refine your code and keep your applications watertight Protect your site against attacks and vulnerabilities with the latest security systems Plug in to some serious functionality with PHP's APIs and libraries","language":"en","currency":"USD","id":"1457192616","title":"PHP Master","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iRijBgAAQBAJ&source=gbs_api","authors":["Davey Shafik","Lorna Mitchell","Matthew Turland"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zyOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":"A hands-on guide to creating clean web applications with code examples in Java","description":"Gain insight into how hexagonal architecture can help to keep the cost of development low over the complete lifetime of an application Key Features Explore ways to make your software flexible, extensible, and adaptable Learn new concepts that you can easily blend with your own software development style Develop the mindset of building maintainable solutions instead of taking shortcuts Book Description We would all like to build software architecture that yields adaptable and flexible software with low development costs. But, unreasonable deadlines and shortcuts make it very hard to create such an architecture. Get Your Hands Dirty on Clean Architecture starts with a discussion about the conventional layered architecture style and its disadvantages. It also talks about the advantages of the domain-centric architecture styles of Robert C. Martin's Clean Architecture and Alistair Cockburn's Hexagonal Architecture. Then, the book dives into hands-on chapters that show you how to manifest a hexagonal architecture in actual code. You'll learn in detail about different mapping strategies between the layers of a hexagonal architecture and see how to assemble the architecture elements into an application. The later chapters demonstrate how to enforce architecture boundaries. You'll also learn what shortcuts produce what types of technical debt and how, sometimes, it is a good idea to willingly take on those debts. After reading this book, you'll have all the knowledge you need to create applications using the hexagonal architecture style of web development. What you will learn Identify potential shortcomings of using a layered architecture Apply methods to enforce architecture boundaries Find out how potential shortcuts can affect the software architecture Produce arguments for when to use which style of architecture Structure your code according to the architecture Apply various types of tests that will cover each element of the architecture Who this book is for This book is for you if you care about the architecture of the software you are building. To get the most out of this book, you must have some experience with web development. The code examples in this book are in Java. If you are not a Java programmer but can read object-oriented code in other languages, you will be fine. In the few places where Java or framework specifics are needed, they are thoroughly explained.","language":"en","currency":"USD","id":"1839212713","title":"Get Your Hands Dirty on Clean Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zyOzDwAAQBAJ&source=gbs_api","authors":["Tom Hombergs"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=aWYOGXQShegC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Drupal is the premier open source content management system available. It is used for high profile sites such as TheOnion.com and has been deployed by organizations such as NASA. Utilizing Drupal, you can create your own personal blog, a community driven site like Slashdot, or any other content oriented web site you can imagine. Pro Drupal Development is a book geared to professionals that need to deploy and customize Drupal. This book deeply delves into the internals of the Drupal system and teaches the reader everything they will need to know to deploy a highly customized and optimized Drupal installation.","language":"en","currency":"USD","id":"9781430201908","title":"Pro Drupal Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=aWYOGXQShegC&source=gbs_api","authors":["John VanDyk","Matt Westgate"]},{"pageCount":181,"thumbnail":"http:\/\/books.google.com\/books\/content?id=i_onDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"A Hands-on Approach to Microservice Infrastructure and Tooling","description":"Use the many types of tools required to navigate and maintain a microservice ecosystem. This book examines what is normally a complex system of interconnected services and clarifies them one at a time, first examining theoretical requirements then looking at concrete tools, configuration, and workflows. Building out these systems includes many concerns such as containerization, container orchestration, build pipelines and continuous integration solutions, automated testing, service discovery, logging and analytics. You will examine each of these tools and understand how they can be combined within an organization. You will design an automated build pipeline from Pull Request to container deployment, understand how to achieve High Availability and monitor application health with Service Discovery, and learn how to collaborate with other teams, write documentation, and describe bugs. Covering use of Jenkins, Docker, Kubernetes, the ELK stack (Elasticsearch, Logstash, and Kibana), and StatsD and Grafana for analytics, you will build on your existing knowledge of Service-Oriented Architecture and gain an advanced, practical understanding of everything from infrastructure development to team collaboration. What You'll Learn Design an API to be convenient for developers to consume. Deploy dynamic instances of Microservices and allow then to discover each other. Track the health of a Microservice and be notified in case of degraded performance. Write effective documentation and communicate efficiently with other teams. Who This Book Is For Those who would like a better understanding of System Oriented Architecture. Those who would like to break a monolith into smaller Microservices. Those who are familiar with Microservices and would like a better understanding of peripheral technologies.","language":"en","currency":"USD","id":"1484228871","title":"Advanced Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=i_onDwAAQBAJ&source=gbs_api","authors":["Thomas Hunter II"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xRcaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Everything you need to succeed on the Google Cloud Certified Professional Cloud Architect exam in one accessible study guide Take the challenging Google Cloud Certified Professional Cloud Architect exam with confidence using the comprehensive information contained in this invaluable self-study guide. The book provides a thorough overview of cloud architecture and Google Cloud Platform (GCP) and shows you how to pass the test. Beyond exam preparation, the guide also serves as a valuable on-the-job reference. Written by a recognized expert in the field, Google Cloud Certified Professional Cloud Architect All-In-One Exam Guideis based on proven pedagogy and features special elements that teach and reinforce practical skills. The book contains accurate practice questions and in-depth explanations. You will discover how to design, develop, and manage robust, secure, scalable, and highly available solutions to drive business objectives. Offers 100% coverage of every objective for the Google Cloud Certified Professional Cloud Architect exam Online content includes 100 additional practice questions in the TotalTester customizable exam engine Written by a Google Cloud Certified Professional Cloud Architect","language":"en","currency":"USD","id":"1264257287","title":"Google Cloud Certified Professional Cloud Architect All-in-One Exam Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xRcaEAAAQBAJ&source=gbs_api","authors":["Iman Ghanizada"]},{"pageCount":800,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qIZvBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.89,"subtitle":"실무에서 필요한 AWS 클라우드의 모든 것!","description":"실무에서 필요한 아마존 웹 서비스의 모든 것! 입문서에서 실전 시나리오까지 한 권으로! 인프라에 대한 기초 지식, 아마존 웹 서비스의 개별 서비스 사용법을 학습하고 실전 시나리오에 따른 서비스 인프라 구축까지 한 권으로 정리한다. 사용자 증가에 따라 서비스를 확장하는 시나리오로! 가장 처음 사용하게 되는 아마존 EC2, S3, EBS, Elastic IP로 시작해서 사용자가 증가함에 따라 필요한 서비스를 확장하는 시나리오로 설명한다. 서비스 확장에 따라 AMI, CloudWatch, CloudFront, Route 53, RDS, DynamoDB, VPC, CloudFormation을 비롯한 고급 기능을 소개한다. 게임 서버, 웹 서버 구축으로 실전까지! 인스타그램과 같은 글로벌 사진 사이트를 아마존 웹 서비스로 구축해보면서 인프라 구축을 실습해본다. 짧은 시간에 엄청나게 많은 사용자가 몰리는 티켓 예매 사이트나 모바일 게임 서버, 웹 서버를 구축해본다. 예제소스 : https:\/\/github.com\/gilbutitbook\/006736","language":"ko","currency":"USD","id":"8966188672","title":"아마존 웹 서비스를 다루는 기술","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qIZvBQAAQBAJ&source=gbs_api","authors":["이재홍"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZUjiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This book is designed to introduce you to using containers and Kubernetes for full-stack development. You'll learn how to develop a full-stack application using Node.js and MongoDB and how to and manage them using Docker, then Docker Compose, and finally Kubernetes.","language":"en","currency":"USD","id":"0999773054","title":"From Containers to Kubernetes with Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZUjiDwAAQBAJ&source=gbs_api","authors":["Kathleen Juell"]},{"pageCount":270,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EF8dDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Learn the art of efficient web scraping and crawling with Python About This Book Extract data from any source to perform real time analytics. Full of techniques and examples to help you crawl websites and extract data within hours. A hands-on guide to web scraping and crawling with real-life problems and solutions Who This Book Is For If you are a software developer, data scientist, NLP or machine-learning enthusiast or just need to migrate your company's wiki from a legacy platform, then this book is for you. It is perfect for someone , who needs instant access to large amounts of semi-structured data effortlessly. What You Will Learn Understand HTML pages and write XPath to extract the data you need Write Scrapy spiders with simple Python and do web crawls Push your data into any database, search engine or analytics system Configure your spider to download files, images and use proxies Create efficient pipelines that shape data in precisely the form you want Use Twisted Asynchronous API to process hundreds of items concurrently Make your crawler super-fast by learning how to tune Scrapy's performance Perform large scale distributed crawls with scrapyd and scrapinghub In Detail This book covers the long awaited Scrapy v 1.0 that empowers you to extract useful data from virtually any source with very little effort. It starts off by explaining the fundamentals of Scrapy framework, followed by a thorough description of how to extract data from any source, clean it up, shape it as per your requirement using Python and 3rd party APIs. Next you will be familiarised with the process of storing the scrapped data in databases as well as search engines and performing real time analytics on them with Spark Streaming. By the end of this book, you will perfect the art of scarping data for your applications with ease Style and approach It is a hands on guide, with first few chapters written as a tutorial, aiming to motivate you and get you started quickly. As the book progresses, more advanced features are explained with real world examples that can be reffered while developing your own web applications.","language":"en","currency":"USD","id":"1784390917","title":"Learning Scrapy","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EF8dDAAAQBAJ&source=gbs_api","authors":["Dimitrios Kouzis-Loukas"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UImUCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"From VBA to Google Apps Script","description":"Whether you’re moving from Microsoft Office to Google Docs or simply want to learn how to automate Docs with Google Apps Script, this practical guide shows you by example how to work with each of the major Apps Script services. Office still supports VBA, but it’s not likely to do so for much longer. If you’re a VBA or .NET developer, you’ll learn how to port existing VBA code and structure to their JavaScript-based Apps Script equivalents with minimal effort. Author Bruce Mcpherson introduces JavaScript basics for experienced developers unfamiliar with the language, and demonstrates ways to build real-world apps using all of the Apps Script services previously covered. Use App Script’s equivalent of Excel’s object model Target the most commonly used parts of Microsoft Word Automate processes in Gmail, Calendar, and Contacts Access the local client filesystem with Google Drive Build and run applications in a browser Store persistent data conveniently Render HTML content in response to HTTP requests Automate the maintenance and creation of pages and content Interact with a REST service or NoSQL database Access Apps Script capabilities from other platforms","language":"en","currency":"USD","id":"1491940417","title":"Going GAS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UImUCwAAQBAJ&source=gbs_api","authors":["Bruce Mcpherson"]},{"pageCount":323,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GPL1r8rQU6wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48.99,"subtitle":"Generic Programming and Design Patterns Applied","description":"Modern C++ Design, Andrei Alexandrescu opens new vistas for C++ programmers. Displaying extraordinary creativity and programming virtuosity, Alexandrescu offers a cutting-edge approach to design that unites design patterns, generic programming, and C++, enabling programmers to achieve expressive, flexible, and highly reusable code. This book introduces the concept of generic components–reusable design templates that produce boilerplate code for compiler consumption–all within C++. Generic components enable an easier and more seamless transition from design to application code, generate code that better expresses the original design intention, and support the reuse of design structures with minimal recoding. The author describes the specific C++ techniques and features that are used in building generic components and goes on to implement industrial strength generic components for real-world applications. Recurring issues that C++ developers face in their day-to-day activity are discussed in depth and implemented in a generic way. These include: Policy-based design for flexibility Partial template specialization Typelists–powerful type manipulation structures Patterns such as Visitor, Singleton, Command, and Factories Multi-method engines For each generic component, the book presents the fundamental problems and design options, and finally implements a generic solution. In addition, an accompanying Web site, http:\/\/www.awl.com\/cseng\/titles\/0-201-70431-5, makes the code implementations available for the generic components in the book and provides a free, downloadable C++ library, called Loki, created by the author. Loki provides out-of-the-box functionality for virtually any C++ project. Get a value-added service! Try out all the examples from this book at www.codesaw.com. CodeSaw is a free online learning tool that allows you to experiment with live code from your book right in your browser.","language":"en","currency":"USD","id":"0133387615","title":"Modern C++ Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GPL1r8rQU6wC&source=gbs_api","authors":["Andrei Alexandrescu"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5B2mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Develop faster with DevOps DevOps embraces a culture of unifying the creation and distribution of technology in a way that allows for faster release cycles and more resource-efficient product updating. DevOps For Dummies provides a guidebook for those on the development or operations side in need of a primer on this way of working. Inside, DevOps evangelist Emily Freeman provides a roadmap for adopting the management and technology tools, as well as the culture changes, needed to dive head-first into DevOps. Identify your organization’s needs Create a DevOps framework Change your organizational structure Manage projects in the DevOps world DevOps For Dummies is essential reading for developers and operations professionals in the early stages of DevOps adoption.","language":"en","currency":"USD","id":"1119552230","title":"DevOps For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5B2mDwAAQBAJ&source=gbs_api","authors":["Emily Freeman"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=io44nAL61JYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Building Effective Algorithms and Analytics for Hadoop and Other Systems","description":"Until now, design patterns for the MapReduce framework have been scattered among various research papers, blogs, and books. This handy guide brings together a unique collection of valuable MapReduce patterns that will save you time and effort regardless of the domain, language, or development framework you’re using. Each pattern is explained in context, with pitfalls and caveats clearly identified to help you avoid common design mistakes when modeling your big data architecture. This book also provides a complete overview of MapReduce that explains its origins and implementations, and why design patterns are so important. All code examples are written for Hadoop. Summarization patterns: get a top-level view by summarizing and grouping data Filtering patterns: view data subsets such as records generated from one user Data organization patterns: reorganize data to work with other systems, or to make MapReduce analysis easier Join patterns: analyze different datasets together to discover interesting relationships Metapatterns: piece together several patterns to solve multi-stage problems, or to perform several analytics in the same job Input and output patterns: customize the way you use Hadoop to load or store data \"A clear exposition of MapReduce programs for common data processing patterns—this book is indespensible for anyone using Hadoop.\" --Tom White, author of Hadoop: The Definitive Guide","language":"en","currency":"USD","id":"1449341985","title":"MapReduce Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=io44nAL61JYC&source=gbs_api","authors":["Donald Miner","Adam Shook"]},{"pageCount":86,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vfwcAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is a practical, hands-on guide to implementing and deploying apps on the AppFog platform. Implementing AppFog is for developers who want to be able to upload applications to the cloud, and for implementation specialists, who implement and deploy apps on the AppFog platform. It is best to have Ruby installed, but we will walk you through the installation process if you do not already have it. It would be ideal to have some knowledge of cloud computing and know about the basics of database and network deployment.","language":"en","currency":"USD","id":"1849698198","title":"Implementing AppFog","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vfwcAgAAQBAJ&source=gbs_api","authors":["Matthew Nohr","Isaac Rabinovitch"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-ZkQAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Modern Java Web Development","description":"Web development is still one of today's most popular, active, and important programming and development activities. From a single web page to an e-commerce-enabled web site to a fully-fledged web application, the Java programming language and its frameworks allow you great flexibility and productivity for your web application development. Learn Java for Web Development teaches web developers who are new to Java key skills, Java-based languages, and frameworks to build simple or complex web sites and applications. As soon as you pick up this book, Vishal Layka's experience guides you on a very practical learning and building journey. You will learn the Java nuts and bolts necessary to build a simple \"HelloWorld\" Java (native) application, as well as a \"HelloWorld\" Java-based web application example that utilizes servlets and Java Server Pages (JSPs). Over the course of the book, you'll learn more about servlets and JSPs and delve into Java Server Faces (JSFs) and the expression language found in each of these by applying them in a real-world case study—a book store e-commerce application. Then you’ll build your web application using Apache Struts2 and the Spring MVC framework. The book concludes by exploring the web application that you've built and examining industry best practices and how these might fit with your application, as well as covering alternative Java Web frameworks like Groovy\/Grails and Scala\/Play 2. You also can explore the basics of Java, Groovy, and Scala in the book’s appendices. While reading this book, you'll see all this in action and you can use it as a starting point for further Java web development. Study and experiment with the many source code examples, and later apply them to your own web application building endeavors and 2:00 AM challenges.","language":"en","currency":"USD","id":"1430259841","title":"Learn Java for Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-ZkQAwAAQBAJ&source=gbs_api","authors":["Vishal Layka"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_xu5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"7th International Conference, GPC 2012, Hong Kong, China, May 11-13, 2012, Proceedings","description":"This book constitutes the refereed proceedings of the 7th International Conference on Grid and Pervasive Computing, GPC 2012, held in Hong Kong, China, in May 2012. The 9 revised full papers and 19 short papers were carefully revised and selected from 55 submissions. They are organized in topical sections on cloud computing, grid and service computing, green computing, mobile and pervasive computing, scheduling and performance, and trust and security. Also included are 4 papers presented at the 2012 International Workshop on Mobile Cloud and Ubiquitous Computing (Mobi-Cloud 2012) held in conjunction with GPC 2012.","language":"en","currency":"USD","id":"3642307671","title":"Advances in Grid and Pervasive Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_xu5BQAAQBAJ&source=gbs_api","authors":["Ruixuan Li","Jiannong Cao","Julien Bourgeois"]},{"pageCount":121,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vpmiBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Issues and Current Trends","description":"This book offers readers a quick, comprehensive and up-to-date overview of the most important methodologies, technologies, APIs and standards related to the portability and interoperability of cloud applications and services, illustrated by a number of use cases representing a variety of interoperability and portability scenarios. The lack of portability and interoperability between cloud platforms at different service levels is the main issue affecting cloud-based services today. The brokering, negotiation, management, monitoring and reconfiguration of cloud resources are challenging tasks for developers and users of cloud applications due to the different business models associated with resource consumption, and to the variety of services and features offered by different cloud providers. In chapter 1 the concepts of cloud portability and interoperability are introduced, together with the issues and limitations arising when such features are lacking or ignored. Subsequently, chapter 2 provides an overview of the state-of-the-art methodologies and technologies that are currently used or being explored to enable cloud portability and interoperability. Chapter 3 illustrates the main cross-platform cloud APIs and how they can solve interoperability and portability issues. In turn, chapter 4 presents a set of ready-to-use solutions which, either because of their broad-scale use in cloud computing scenarios or because they utilize established or emerging standards, play a fundamental part in providing interoperable and portable solutions. Lastly, chapter 5 presents an overview of emerging standards for cloud Interoperability and portability. Researchers and developers of cloud-based services will find here a brief survey of the relevant methodologies, APIs and standards, illustrated by case studies and complemented by an extensive reference list for more detailed descriptions of every topic covered.","language":"en","currency":"USD","id":"3319137018","title":"Cloud Portability and Interoperability","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vpmiBwAAQBAJ&source=gbs_api","authors":["Beniamino Di Martino","Giuseppina Cretella","Antonio Esposito"]},{"pageCount":944,"thumbnail":"http:\/\/books.google.com\/books\/content?id=cHr0AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"The comprehensive Wrox guide for creating Java web applications for the enterprise This guide shows Java software developers and software engineers how to build complex web applications in an enterprise environment. You'll begin with an introduction to the Java Enterprise Edition and the basic web application, then set up a development application server environment, learn about the tools used in the development process, and explore numerous Java technologies and practices. The book covers industry-standard tools and technologies, specific technologies, and underlying programming concepts. Java is an essential programming language used worldwide for both Android app development and enterprise-level corporate solutions As a step-by-step guide or a general reference, this book provides an all-in-one Java development solution Explains Java Enterprise Edition 7 and the basic web application, how to set up a development application server environment, which tools are needed during the development process, and how to apply various Java technologies Covers new language features in Java 8, such as Lambda Expressions, and the new Java 8 Date & Time API introduced as part of JSR 310, replacing the legacy Date and Calendar APIs Demonstrates the new, fully-duplex WebSocket web connection technology and its support in Java EE 7, allowing the reader to create rich, truly interactive web applications that can push updated data to the client automatically Instructs the reader in the configuration and use of Log4j 2.0, Spring Framework 4 (including Spring Web MVC), Hibernate Validator, RabbitMQ, Hibernate ORM, Spring Data, Hibernate Search, and Spring Security Covers application logging, JSR 340 Servlet API 3.1, JSR 245 JavaServer Pages (JSP) 2.3 (including custom tag libraries), JSR 341 Expression Language 3.0, JSR 356 WebSocket API 1.0, JSR 303\/349 Bean Validation 1.1, JSR 317\/338 Java Persistence API (JPA) 2.1, full-text searching with JPA, RESTful and SOAP web services, Advanced Message Queuing Protocol (AMQP), and OAuth Professional Java for Web Applications is the complete Wrox guide for software developers who are familiar with Java and who are ready to build high-level enterprise Java web applications.","language":"en","currency":"USD","id":"1118909313","title":"Professional Java for Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=cHr0AgAAQBAJ&source=gbs_api","authors":["Nicholas S. Williams"]},{"pageCount":826,"thumbnail":"http:\/\/books.google.com\/books\/content?id=D0b_Xg3UeXEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":"Optimization, Backups, and Replication","description":"How can you bring out MySQL’s full power? With High Performance MySQL, you’ll learn advanced techniques for everything from designing schemas, indexes, and queries to tuning your MySQL server, operating system, and hardware to their fullest potential. This guide also teaches you safe and practical ways to scale applications through replication, load balancing, high availability, and failover. Updated to reflect recent advances in MySQL and InnoDB performance, features, and tools, this third edition not only offers specific examples of how MySQL works, it also teaches you why this system works as it does, with illustrative stories and case studies that demonstrate MySQL’s principles in action. With this book, you’ll learn how to think in MySQL. Learn the effects of new features in MySQL 5.5, including stored procedures, partitioned databases, triggers, and views Implement improvements in replication, high availability, and clustering Achieve high performance when running MySQL in the cloud Optimize advanced querying features, such as full-text searches Take advantage of modern multi-core CPUs and solid-state disks Explore backup and recovery strategies—including new tools for hot online backups","language":"en","currency":"USD","id":"1449332498","title":"High Performance MySQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=D0b_Xg3UeXEC&source=gbs_api","authors":["Baron Schwartz","Peter Zaitsev","Vadim Tkachenko"]},{"pageCount":106,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6AkPqcRZ328C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Continuous Streaming Computation with Twitter's Cluster Technology","description":"Even as big data is turning the world upside down, the next phase of the revolution is already taking shape: real-time data analysis. This hands-on guide introduces you to Storm, a distributed, JVM-based system for processing streaming data. Through simple tutorials, sample Java code, and a complete real-world scenario, you’ll learn how to build fast, fault-tolerant solutions that process results as soon as the data arrives. Discover how easy it is to set up Storm clusters for solving various problems, including continuous data computation, distributed remote procedure calls, and data stream processing. Learn how to program Storm components: spouts for data input and bolts for data transformation Discover how data is exchanged between spouts and bolts in a Storm topology Make spouts fault-tolerant with several commonly used design strategies Explore bolts—their life cycle, strategies for design, and ways to implement them Scale your solution by defining each component’s level of parallelism Study a real-time web analytics system built with Node.js, a Redis server, and a Storm topology Write spouts and bolts with non-JVM languages such as Python, Ruby, and Javascript","language":"en","currency":"USD","id":"1449324045","title":"Getting Started with Storm","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6AkPqcRZ328C&source=gbs_api","authors":["Jonathan Leibiusky","Gabriel Eisbruch","Dario Simonassi"]},{"pageCount":244,"thumbnail":"http:\/\/books.google.com\/books\/content?id=MFnTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is designed for software developers, primarily those with knowledge of C#, .NET, and JavaScript. Good knowledge and understanding of SignalR is assumed to allow efficient programming of core elements and applications in SignalR.","language":"en","currency":"USD","id":"1783983132","title":"SignalR Blueprints","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=MFnTBgAAQBAJ&source=gbs_api","authors":["Einar Ingebrigtsen"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LfsC03f8oGsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"Hands-on, practical guide to implementing SSL and TLS protocols for Internet security If you are a network professional who knows C programming, this practical book is for you. Focused on how to implement Secure Socket Layer (SSL) and Transport Layer Security (TLS), this book guides you through all necessary steps, whether or not you have a working knowledge of cryptography. The book covers SSLv2, TLS 1.0, and TLS 1.2, including implementations of the relevant cryptographic protocols, secure hashing, certificate parsing, certificate generation, and more. Coverage includes: Understanding Internet Security Protecting against Eavesdroppers with Symmetric Cryptography Secure Key Exchange over an Insecure Medium with Public Key Cryptography Authenticating Communications Using Digital Signatures Creating a Network of Trust Using X.509 Certificates A Usable, Secure Communications Protocol: Client-Side TLS Adding Server-Side TLS 1.0 Support Advanced SSL Topics Adding TLS 1.2 Support to Your TLS Library Other Applications of SSL A Binary Representation of Integers: A Primer Installing TCPDump and OpenSSL Understanding the Pitfalls of SSLv2 Set up and launch a working implementation of SSL with this practical guide.","language":"en","currency":"USD","id":"9781118038772","title":"Implementing SSL \/ TLS Using Cryptography and PKI","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LfsC03f8oGsC&source=gbs_api","authors":["Joshua Davies"]},{"pageCount":330,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CHx7Cb9a32cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Quickly create Web sites with this poweful tool Use this free and easy programming language for e-commercesites and blogs If you need to build Web and database applications quickly butyou don't dream in computer code, take heart! Ruby on Rails wascreated for you, and this book will have you up and running in notime. The Ruby scripting language and the Rails framework let youcreate full-featured Web applications fast. It's even fun! Discover how to Install and run Ruby and Rails Use the RadRails IDE Create a blog with Ruby Connect your Web site to a database Build a shopping cart Explore Ruby's syntax","language":"en","currency":"USD","id":"1118084780","title":"Ruby on Rails For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CHx7Cb9a32cC&source=gbs_api","authors":["Barry A. Burd"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":32.39,"subtitle":"Elements of Reusable Object-Oriented Software (Adobe Reader)","description":"Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.","language":"en","currency":"USD","id":"9780321700698","title":"Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6oHuKQe3TjQC&source=gbs_api","authors":["Erich Gamma","Richard Helm","Ralph Johnson","John Vlissides"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4ct1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Expert techniques to build scalable, reliable, and fault-tolerant database applications, 2nd Edition","description":"Master the capabilities of PostgreSQL 11 to efficiently manage and maintain your database Key Features Master advanced concepts of PostgreSQL 11 with real-world datasets and examples Explore query parallelism, data replication, and database performance while working with larger datasets Extend the functionalities of your PostgreSQL instance to suit your organization’s needs with minimal effort Book Description This second edition of Mastering PostgreSQL 11 helps you build dynamic database solutions for enterprise applications using the latest release of PostgreSQL, which enables database analysts to design both the physical and technical aspects of the system architecture with ease. This book begins with an introduction to the newly released features in PostgreSQL 11 to help you build efficient and fault-tolerant PostgreSQL applications. You’ll examine all of the advanced aspects of PostgreSQL in detail, including logical replication, database clusters, performance tuning, monitoring, and user management. You will also work with the PostgreSQL optimizer, configuring PostgreSQL for high speed, and see how to move from Oracle to PostgreSQL. As you progress through the chapters, you will cover transactions, locking, indexes, and optimizing queries to improve performance. Additionally, you’ll learn to manage network security and explore backups and replications, while understanding the useful extensions of PostgreSQL so that you can optimize the speed and performance of large databases. By the end of this book, you will be able to use your database to its utmost capacity by implementing advanced administrative tasks with ease. What you will learn Get to grips with advanced PostgreSQL 11 features and SQL functions Make use of the indexing features in PostgreSQL and fine-tune the performance of your queries Work with stored procedures and manage backup and recovery Master replication and failover techniques Troubleshoot your PostgreSQL instance for solutions to common and not-so-common problems Perform database migration from MySQL and Oracle to PostgreSQL with ease Who this book is for This book is for data and database professionals wanting to implement advanced functionalities and master complex administrative tasks with PostgreSQL 11. Prior experience of database administration with PostgreSQL database will aid in understanding the concepts covered in this book.","language":"en","currency":"USD","id":"178953917X","title":"Mastering PostgreSQL 11","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4ct1DwAAQBAJ&source=gbs_api","authors":["Hans-Jürgen Schönig"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dXwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Real-Time Data and Stream Processing at Scale","description":"Every enterprise application creates data, whether it’s log messages, metrics, user activity, outgoing messages, or something else. And how to move all of this data becomes nearly as important as the data itself. If you’re an application architect, developer, or production engineer new to Apache Kafka, this practical guide shows you how to use this open source streaming platform to handle real-time data feeds. Engineers from Confluent and LinkedIn who are responsible for developing Kafka explain how to deploy production Kafka clusters, write reliable event-driven microservices, and build scalable stream-processing applications with this platform. Through detailed examples, you’ll learn Kafka’s design principles, reliability guarantees, key APIs, and architecture details, including the replication protocol, the controller, and the storage layer. Understand publish-subscribe messaging and how it fits in the big data ecosystem. Explore Kafka producers and consumers for writing and reading messages Understand Kafka patterns and use-case requirements to ensure reliable data delivery Get best practices for building data pipelines and applications with Kafka Manage Kafka in production, and learn to perform monitoring, tuning, and maintenance tasks Learn the most critical metrics among Kafka’s operational measurements Explore how Kafka’s stream delivery capabilities make it a perfect source for stream processing systems","language":"en","currency":"USD","id":"1491936118","title":"Kafka: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dXwzDwAAQBAJ&source=gbs_api","authors":["Neha Narkhede","Gwen Shapira","Todd Palino"]},{"pageCount":232,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sZc7B6wnmNcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Relational Theory for Practitioners","description":"This book sheds light on the principles behind the relational model, which is fundamental to all database-backed applications--and, consequently, most of the work that goes on in the computing world today. Database in Depth: The Relational Model for Practitioners goes beyond the hype and gets to the heart of how relational databases actually work.Ideal for experienced database developers and designers, this concise guide gives you a clear view of the technology--a view that's not influenced by any vendor or product. Featuring an extensive set of exercises, it will help you: understand why and how the relational model is still directly relevant to modern database technology (and will remain so for the foreseeable future) see why and how the SQL standard is seriously deficient use the best current theoretical knowledge in the design of their databases and database applications make informed decisions in their daily database professional activities Database in Depth will appeal not only to database developers and designers, but also to a diverse field of professionals and academics, including database administrators (DBAs), information modelers, database consultants, and more. Virtually everyone who deals with relational databases should have at least a passing understanding of the fundamentals of working with relational models.Author C.J. Date has been involved with the relational model from its earliest days. An exceptionally clear-thinking writer, Date lays out principle and theory in a manner that is easily understood. Few others can speak as authoritatively the topic of relational databases as Date can.","language":"en","currency":"USD","id":"1449342647","title":"Database in Depth","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sZc7B6wnmNcC&source=gbs_api","authors":["C.J. Date"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":474,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AzqbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Distributed search, analytics, and visualization using Elasticsearch, Logstash, Beats, and Kibana, 2nd Edition","description":"A beginner's guide to storing, managing, and analyzing data with the updated features of Elastic 7.0 Key Features Gain access to new features and updates introduced in Elastic Stack 7.0 Grasp the fundamentals of Elastic Stack including Elasticsearch, Logstash, and Kibana Explore useful tips for using Elastic Cloud and deploying Elastic Stack in production environments Book Description The Elastic Stack is a powerful combination of tools for techniques such as distributed search, analytics, logging, and visualization of data. Elastic Stack 7.0 encompasses new features and capabilities that will enable you to find unique insights into analytics using these techniques. This book will give you a fundamental understanding of what the stack is all about, and help you use it efficiently to build powerful real-time data processing applications. The first few sections of the book will help you understand how to set up the stack by installing tools, and exploring their basic configurations. You’ll then get up to speed with using Elasticsearch for distributed searching and analytics, Logstash for logging, and Kibana for data visualization. As you work through the book, you will discover the technique of creating custom plugins using Kibana and Beats. This is followed by coverage of the Elastic X-Pack, a useful extension for effective security and monitoring. You’ll also find helpful tips on how to use Elastic Cloud and deploy Elastic Stack in production environments. By the end of this book, you’ll be well versed with the fundamental Elastic Stack functionalities and the role of each component in the stack to solve different data processing problems. What you will learn Install and configure an Elasticsearch architecture Solve the full-text search problem with Elasticsearch Discover powerful analytics capabilities through aggregations using Elasticsearch Build a data pipeline to transfer data from a variety of sources into Elasticsearch for analysis Create interactive dashboards for effective storytelling with your data using Kibana Learn how to secure, monitor and use Elastic Stack’s alerting and reporting capabilities Take applications to an on-premise or cloud-based production environment with Elastic Stack Who this book is for This book is for entry-level data professionals, software engineers, e-commerce developers, and full-stack developers who want to learn about Elastic Stack and how the real-time processing and search engine works for business analytics and enterprise search applications. Previous experience with Elastic Stack is not required, however knowledge of data warehousing and database concepts will be helpful.","language":"en","currency":"USD","id":"1789958539","title":"Learning Elastic Stack 7.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AzqbDwAAQBAJ&source=gbs_api","authors":["Pranav Shukla","Sharath Kumar M N"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AwpnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Your stepping stone to penetration testing","description":"Learn how to hack systems like black hat hackers and secure them like security experts Key Features Understand how computer systems work and their vulnerabilities Exploit weaknesses and hack into machines to test their security Learn how to secure systems from hackers Book Description This book starts with the basics of ethical hacking, how to practice hacking safely and legally, and how to install and interact with Kali Linux and the Linux terminal. You will explore network hacking, where you will see how to test the security of wired and wireless networks. You’ll also learn how to crack the password for any Wi-Fi network (whether it uses WEP, WPA, or WPA2) and spy on the connected devices. Moving on, you will discover how to gain access to remote computer systems using client-side and server-side attacks. You will also get the hang of post-exploitation techniques, including remotely controlling and interacting with the systems that you compromised. Towards the end of the book, you will be able to pick up web application hacking techniques. You'll see how to discover, exploit, and prevent a number of website vulnerabilities, such as XSS and SQL injections. The attacks covered are practical techniques that work against real systems and are purely for educational purposes. At the end of each section, you will learn how to detect, prevent, and secure systems from these attacks. What you will learn Understand ethical hacking and the different fields and types of hackers Set up a penetration testing lab to practice safe and legal hacking Explore Linux basics, commands, and how to interact with the terminal Access password-protected networks and spy on connected clients Use server and client-side attacks to hack and control remote computers Control a hacked system remotely and use it to hack other systems Discover, exploit, and prevent a number of web application vulnerabilities such as XSS and SQL injections Who this book is for Learning Ethical Hacking from Scratch is for anyone interested in learning how to hack and test the security of systems like professional hackers and security experts.","language":"en","currency":"USD","id":"1788624785","title":"Learn Ethical Hacking from Scratch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AwpnDwAAQBAJ&source=gbs_api","authors":["Zaid Sabih"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wfnOBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"The Easy, Common-Sense Guide to Solving Real Problems with NoSQL The Mere Mortals ® tutorials have earned worldwide praise as the clearest, simplest way to master essential database technologies. Now, there’s one for today’s exciting new NoSQL databases. NoSQL for Mere Mortals guides you through solving real problems with NoSQL and achieving unprecedented scalability, cost efficiency, flexibility, and availability. Drawing on 20+ years of cutting-edge database experience, Dan Sullivan explains the advantages, use cases, and terminology associated with all four main categories of NoSQL databases: key-value, document, column family, and graph databases. For each, he introduces pragmatic best practices for building high-value applications. Through step-by-step examples, you’ll discover how to choose the right database for each task, and use it the right way. Coverage includes --Getting started: What NoSQL databases are, how they differ from relational databases, when to use them, and when not to Data management principles and design criteria: Essential knowledge for creating any database solution, NoSQL or relational --Key-value databases: Gaining more utility from data structures --Document databases: Schemaless databases, normalization and denormalization, mutable documents, indexing, and design patterns --Column family databases: Google’s BigTable design, table design, indexing, partitioning, and Big Data Graph databases: Graph\/network modeling, design tips, query methods, and traps to avoid Whether you’re a database developer, data modeler, database user, or student, learning NoSQL can open up immense new opportunities. As thousands of database professionals already know, For Mere Mortals is the fastest, easiest route to mastery.","language":"en","currency":"USD","id":"0134029887","title":"NoSQL for Mere Mortals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wfnOBwAAQBAJ&source=gbs_api","authors":["Dan Sullivan"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AxdxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.99,"subtitle":null,"description":"How deep learning—from Google Translate to driverless cars to personal cognitive assistants—is changing our lives and transforming every sector of the economy. The deep learning revolution has brought us driverless cars, the greatly improved Google Translate, fluent conversations with Siri and Alexa, and enormous profits from automated trading on the New York Stock Exchange. Deep learning networks can play poker better than professional poker players and defeat a world champion at Go. In this book, Terry Sejnowski explains how deep learning went from being an arcane academic field to a disruptive technology in the information economy. Sejnowski played an important role in the founding of deep learning, as one of a small group of researchers in the 1980s who challenged the prevailing logic-and-symbol based version of AI. The new version of AI Sejnowski and others developed, which became deep learning, is fueled instead by data. Deep networks learn from data in the same way that babies experience the world, starting with fresh eyes and gradually acquiring the skills needed to navigate novel environments. Learning algorithms extract information from raw data; information can be used to create knowledge; knowledge underlies understanding; understanding leads to wisdom. Someday a driverless car will know the road better than you do and drive with more skill; a deep learning network will diagnose your illness; a personal cognitive assistant will augment your puny human brain. It took nature many millions of years to evolve human intelligence; AI is on a trajectory measured in decades. Sejnowski prepares us for a deep learning future.","language":"en","currency":"USD","id":"0262346834","title":"The Deep Learning Revolution","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AxdxDwAAQBAJ&source=gbs_api","authors":["Terrence J. Sejnowski"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fYAos2KxquEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This is a step-by-step tutorial for developing web applications using Yii. This book follows the test-first, incremental, and iterative approach to software development while developing a project task management application. If you are a PHP programmer with knowledge of object oriented programming and want to rapidly develop modern, sophisticated web applications, then this book is for you. No prior knowledge of Yii is required to read this book.","language":"en","currency":"USD","id":"1849518734","title":"Web Application Development with Yii and PHP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fYAos2KxquEC&source=gbs_api","authors":["Jeffrey Winesett"]}]