[{"pageCount":522,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Get the most out of the Elastic Stack for various complex analytics using this comprehensive and practical guide About This Book Your one-stop solution to perform advanced analytics with Elasticsearch, Logstash, and Kibana Learn how to make better sense of your data by searching, analyzing, and logging data in a systematic way This highly practical guide takes you through an advanced implementation on the ELK stack in your enterprise environment Who This Book Is For This book cater to developers using the Elastic stack in their day-to-day work who are familiar with the basics of Elasticsearch, Logstash, and Kibana, and now want to become an expert at using the Elastic stack for data analytics. What You Will Learn Build a pipeline with help of Logstash and Beats to visualize Elasticsearch data in Kibana Use Beats to ship any type of data to the Elastic stack Understand Elasticsearch APIs, modules, and other advanced concepts Explore Logstash and it's plugins Discover how to utilize the new Kibana UI for advanced analytics See how to work with the Elastic Stack using other advanced configurations Customize the Elastic Stack and plugin development for each of the component Work with the Elastic Stack in a production environment Explore the various components of X-Pack in detail. In Detail Even structured data is useless if it can't help you to take strategic decisions and improve existing system. If you love to play with data, or your job requires you to process custom log formats, design a scalable analysis system, and manage logs to do real-time data analysis, this book is your one-stop solution. By combining the massively popular Elasticsearch, Logstash, Beats, and Kibana, elastic.co has advanced the end-to-end stack that delivers actionable insights in real time from almost any type of structured or unstructured data source. If your job requires you to process custom log formats, design a scalable analysis system, explore a variety of data, and manage logs, this book is your one-stop solution. You will learn how to create real-time dashboards and how to manage the life cycle of logs in detail through real-life scenarios. This book brushes up your basic knowledge on implementing the Elastic Stack and then dives deeper into complex and advanced implementations of the Elastic Stack. We'll help you to solve data analytics challenges using the Elastic Stack and provide practical steps on centralized logging and real-time analytics with the Elastic Stack in production. You will get to grip with advanced techniques for log analysis and visualization. Newly announced features such as Beats and X-Pack are also covered in detail with examples. Toward the end, you will see how to use the Elastic stack for real-world case studies and we'll show you some best practices and troubleshooting techniques for the Elastic Stack. Style and approach This practical guide shows you how to perform advanced analytics with the Elastic stack through real-world use cases. It includes common and some not so common scenarios to use the Elastic stack for data analysis.","language":"en","currency":"USD","id":"1786468050","title":"Mastering Elastic Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVQoDwAAQBAJ&source=gbs_api","authors":["Yuvraj Gupta","Ravi Kumar Gupta"]},{"pageCount":128,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9-wtAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This is a practical and fast-paced guide that gives you all the information you need to start implementing secure OAuth 2.0 implementations in your web applications.OAuth 2.0 Identity and Access Management Patterns is intended for software developers, software architects, and enthusiasts working with the OAuth 2.0 framework. In order to learn and understand the OAuth 2.0 grant flow, it is assumed that you have some basic knowledge of HTTP communication. For the practical examples, basic knowledge of HTML templating, programming languages, and executing commands in the command line terminal is assumed.","language":"en","currency":"USD","id":"1783285605","title":"OAuth 2.0 Identity and Access Management Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9-wtAgAAQBAJ&source=gbs_api","authors":["Martin Spasovski"]},{"pageCount":445,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sNPvDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Apache Spark is a fast, scalable, and flexible open source distributed processing engine for big data systems and is one of the most active open source big data projects to date. In just 24 lessons of one hour or less, Sams Teach Yourself Apache Spark in 24 Hours helps you build practical Big Data solutions that leverage Spark’s amazing speed, scalability, simplicity, and versatility. This book’s straightforward, step-by-step approach shows you how to deploy, program, optimize, manage, integrate, and extend Spark–now, and for years to come. You’ll discover how to create powerful solutions encompassing cloud computing, real-time stream processing, machine learning, and more. Every lesson builds on what you’ve already learned, giving you a rock-solid foundation for real-world success. Whether you are a data analyst, data engineer, data scientist, or data steward, learning Spark will help you to advance your career or embark on a new career in the booming area of Big Data. Learn how to • Discover what Apache Spark does and how it fits into the Big Data landscape • Deploy and run Spark locally or in the cloud • Interact with Spark from the shell • Make the most of the Spark Cluster Architecture • Develop Spark applications with Scala and functional Python • Program with the Spark API, including transformations and actions • Apply practical data engineering\/analysis approaches designed for Spark • Use Resilient Distributed Datasets (RDDs) for caching, persistence, and output • Optimize Spark solution performance • Use Spark with SQL (via Spark SQL) and with NoSQL (via Cassandra) • Leverage cutting-edge functional programming techniques • Extend Spark with streaming, R, and Sparkling Water • Start building Spark-based machine learning and graph-processing applications • Explore advanced messaging technologies, including Kafka • Preview and prepare for Spark’s next generation of innovations Instructions walk you through common questions, issues, and tasks; Q-and-As, Quizzes, and Exercises build and test your knowledge; \"Did You Know?\" tips offer insider advice and shortcuts; and \"Watch Out!\" alerts help you avoid pitfalls. By the time you're finished, you'll be comfortable using Apache Spark to solve a wide spectrum of Big Data problems.","language":"en","currency":"USD","id":"0134445821","title":"Apache Spark in 24 Hours, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sNPvDAAAQBAJ&source=gbs_api","authors":["Jeffrey Aven"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-uhODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Build fast Delphi applications using concurrency, parallel programming and memory management","description":"Build fast, scalable, and high performing applications with Delphi Key Features Build efficient and concurrent applications in Delphi with focused examples Identify performance bottlenecks and apply the correct algorithm to increase the performance of applications. Delve into parallel programming and memory management to optimize your code Book Description Delphi is a cross-platform Integrated Development Environment (IDE) that supports rapid application development for Microsoft Windows, Apple Mac OS X, Google Android, iOS, and now Linux with RAD Studio 10.2. This book will be your guide to build efficient high performance applications with Delphi. The book begins by explaining how to find performance bottlenecks and apply the correct algorithm to fix them. It will teach you how to improve your algorithms before taking you through parallel programming. You’ll then explore various tools to build highly concurrent applications. After that, you’ll delve into improving the performance of your code and master cross-platform RTL improvements. Finally, we’ll go through memory management with Delphi and you’ll see how to leverage several external libraries to write better performing programs. By the end of the book, you’ll have the knowledge to create high performance applications with Delphi. What you will learn Find performance bottlenecks and easily mitigate them Discover different approaches to fix algorithms Understand parallel programming and work with various tools included with Delphi Master the RTL for code optimization Explore memory managers and their implementation Leverage external libraries to write better performing programs Who this book is for This book is for Delphi developers who would like to build high performance applications with Delphi. Prior knowledge of Delphi is assumed.","language":"en","currency":"USD","id":"1788621247","title":"Delphi High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-uhODwAAQBAJ&source=gbs_api","authors":["Primož Gabrijelčič"]},{"pageCount":322,"thumbnail":"http:\/\/books.google.com\/books\/content?id=T1fTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you are a Big Data enthusiast and wish to use Hadoop v2 to solve your problems, then this book is for you. This book is for Java programmers with little to moderate knowledge of Hadoop MapReduce. This is also a one-stop reference for developers and system admins who want to quickly get up to speed with using Hadoop v2. It would be helpful to have a basic knowledge of software development using Java and a basic working knowledge of Linux.","language":"en","currency":"USD","id":"1783285486","title":"Hadoop MapReduce v2 Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=T1fTBgAAQBAJ&source=gbs_api","authors":["Thilina Gunarathne"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=orgrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":23.99,"subtitle":"The Definitive Guide to Testing and Securing Deployments","description":"A comprehensive guide to penetration testing cloud services deployed with Microsoft Azure, the popular cloud computing service provider used by companies like Warner Brothers and Apple. Pentesting Azure Applications is a comprehensive guide to penetration testing cloud services deployed in Microsoft Azure, the popular cloud computing service provider used by numerous companies. You'll start by learning how to approach a cloud-focused penetration test and how to obtain the proper permissions to execute it; then, you'll learn to perform reconnaissance on an Azure subscription, gain access to Azure Storage accounts, and dig into Azure's Infrastructure as a Service (IaaS). You'll also learn how to: - Uncover weaknesses in virtual machine settings that enable you to acquire passwords, binaries, code, and settings files - Use PowerShell commands to find IP addresses, administrative users, and resource details - Find security issues related to multi-factor authentication and management certificates - Penetrate networks by enumerating firewall rules - Investigate specialized services like Azure Key Vault, Azure Web Apps, and Azure Automation - View logs and security events to find out when you've been caught Packed with sample pentesting scripts, practical advice for completing security assessments, and tips that explain how companies can configure Azure to foil common attacks, Pentesting Azure Applications is a clear overview of how to effectively perform cloud-focused security tests and provide accurate findings and recommendations.","language":"en","currency":"USD","id":"1593278640","title":"Pentesting Azure Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=orgrDwAAQBAJ&source=gbs_api","authors":["Matt Burrough"]},{"pageCount":174,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yaS_CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are an IT administrator and you want to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Basic knowledge of Linux and server technology is beneficial to get the most out of the book.","language":"en","currency":"USD","id":"178528956X","title":"OpenStack Object Storage (Swift) Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yaS_CQAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Kris Rajana","Sreedhar Varma"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sAh5DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Dataflow Scripting with Hadoop","description":"For many organizations, Hadoop is the first step for dealing with massive amounts of data. The next step? Processing and analyzing datasets with the Apache Pig scripting platform. With Pig, you can batch-process data without having to create a full-fledged application, making it easy to experiment with new datasets. Updated with use cases and programming examples, this second edition is the ideal learning tool for new and experienced users alike. You’ll find comprehensive coverage on key features such as the Pig Latin scripting language and the Grunt shell. When you need to analyze terabytes of data, this book shows you how to do it efficiently with Pig. Delve into Pig’s data model, including scalar and complex data types Write Pig Latin scripts to sort, group, join, project, and filter your data Use Grunt to work with the Hadoop Distributed File System (HDFS) Build complex data processing pipelines with Pig’s macros and modularity features Embed Pig Latin in Python for iterative processing and other advanced tasks Use Pig with Apache Tez to build high-performance batch and interactive data processing applications Create your own load and store functions to handle data formats and storage mechanisms","language":"en","currency":"USD","id":"1491937041","title":"Programming Pig","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sAh5DQAAQBAJ&source=gbs_api","authors":["Alan Gates","Daniel Dai"]},{"pageCount":807,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7YJcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":57.59,"subtitle":null,"description":"Learn how you can put the features of OpenStack to work in the real world in this comprehensive path About This Book Harness the abilities of experienced OpenStack administrators and architects, and run your own private cloud successfully Learn how to install, configure, and manage all of the OpenStack core projects including topics on Object Storage, Block Storage, and Neutron Networking services such as LBaaS and FWaaS Get better equipped to troubleshoot and solve common problems in performance, availability, and automation that confront production-ready OpenStack environments Who This Book Is For This course is for those who are new to OpenStack who want to learn the cloud networking fundamentals and get started with OpenStack networking. Basic understanding of Linux Operating System, Virtualization, and Networking, and Storage principles will come in handy. What You Will Learn Get an introduction to OpenStack and its components Store and retrieve data and images using storage components, such as Cinder, Swift, and Glance Install and configure Swift, the OpenStack Object Storage service, including configuring Container Replication between datacenters Gain hands on experience and familiarity with Horizon, the OpenStack Dashboard user interface Learn how to automate OpenStack installations using Ansible and Foreman Follow practical advice and examples for running OpenStack in production Fix common issues with images served through Glance and master the art of troubleshooting Neutron networking In Detail OpenStack is a collection of software projects that work together to provide a cloud fabric. Learning OpenStack Cloud Computing course is an exquisite guide that you will need to build cloud environments proficiently. This course will help you gain a clearer understanding of OpenStack's components and their interaction with each other to build a cloud environment. The first module, Learning OpenStack, starts with a brief look into the need for authentication and authorization, the different aspects of dashboards, cloud computing fabric controllers, along with 'Networking as a Service' and 'Software defined Networking'. Then, you will focus on installing, configuring, and troubleshooting different architectures such as Keystone, Horizon, Nova, Neutron, Cinder, Swift, and Glance. After getting familiar with the fundamentals and application of OpenStack, let's move deeper into the realm of OpenStack. In the second module, OpenStack Cloud Computing Cookbook, preview how to build and operate OpenStack cloud computing, storage, networking, and automation. Dive into Neutron, the OpenStack Networking service, and get your hands dirty with configuring ML2, networks, routers, and distributed virtual routers. Further, you'll learn practical examples of Block Storage, LBaaS, and FBaaS. The final module, Troubleshooting OpenStack, will help you quickly diagnose, troubleshoot, and correct problems in your OpenStack. We will diagnose and remediate issues in Keystone, Glance, Neutron networking, Nova, Cinder block storage, Swift object storage, and issues caused by Heat orchestration. This Learning Path combines some of the best that Packt has to offer in one complete, curated package. It includes content from the following Packt products: Learning OpenStack by Alok Shrivastwa, Sunil Sarat OpenStack Cloud Computing Cookbook - Third Edition by Kevin Jackson , Cody Bunch, Egle Sigler Troubleshooting OpenStack by Tony Campbell Style and approach This course aims to create a smooth learning path that will teach you how to get started with setting up private and public clouds using a free and open source cloud computing platform—OpenStack. Through this comprehensive course, you'll learn OpenStack Cloud computing from scratch to finish and more!","language":"en","currency":"USD","id":"1787129411","title":"OpenStack: Building a Cloud Environment","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7YJcDgAAQBAJ&source=gbs_api","authors":["Alok Shrivastwa","Sunil Sarat","Kevin Jackson","Cody Bunch","Egle Sigler","Tony Campbell"]},{"pageCount":265,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XpDqDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"A Guide to Hadoop's Data Warehouse System","description":"Dive into the world of SQL on Hadoop and get the most out of your Hive data warehouses. This book is your go-to resource for using Hive: authors Scott Shaw, Ankur Gupta, David Kjerrumgaard, and Andreas Francois Vermeulen take you through learning HiveQL, the SQL-like language specific to Hive, to analyze, export, and massage the data stored across your Hadoop environment. From deploying Hive on your hardware or virtual machine and setting up its initial configuration to learning how Hive interacts with Hadoop, MapReduce, Tez and other big data technologies, Practical Hive gives you a detailed treatment of the software. In addition, this book discusses the value of open source software, Hive performance tuning, and how to leverage semi-structured and unstructured data. What You Will Learn Install and configure Hive for new and existing datasets Perform DDL operations Execute efficient DML operations Use tables, partitions, buckets, and user-defined functions Discover performance tuning tips and Hive best practices Who This Book Is For Developers, companies, and professionals who deal with large amounts of data and could use software that can efficiently manage large volumes of input. It is assumed that readers have the ability to work with SQL.","language":"en","currency":"USD","id":"1484202716","title":"Practical Hive","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XpDqDAAAQBAJ&source=gbs_api","authors":["Scott Shaw","Andreas François Vermeulen","Ankur Gupta","David Kjerrumgaard"]},{"pageCount":268,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HftzBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you already have basic knowledge of GNU\/Linux and storage systems, but have no experience of software-defined storage solutions and Ceph, and are eager to learn about it, this is the book for you. If you are looking for your next career jump as a Ceph administrator, this book is also ideal for you.","language":"en","currency":"USD","id":"1783985631","title":"Learning Ceph","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HftzBgAAQBAJ&source=gbs_api","authors":["Karan Singh"]},{"pageCount":266,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5xhKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"Effective data processing with MySQL 8, Hadoop, NoSQL APIs, and other Big Data tools","description":"Uncover the power of MySQL 8 for Big Data About This Book Combine the powers of MySQL and Hadoop to build a solid Big Data solution for your organization Integrate MySQL with different NoSQL APIs and Big Data tools such as Apache Sqoop A comprehensive guide with practical examples on building a high performance Big Data pipeline with MySQL Who This Book Is For This book is intended for MySQL database administrators and Big Data professionals looking to integrate MySQL 8 and Hadoop to implement a high performance Big Data solution. Some previous experience with MySQL will be helpful, although the book will highlight the newer features introduced in MySQL 8. What You Will Learn Explore the features of MySQL 8 and how they can be leveraged to handle Big Data Unlock the new features of MySQL 8 for managing structured and unstructured Big Data Integrate MySQL 8 and Hadoop for efficient data processing Perform aggregation using MySQL 8 for optimum data utilization Explore different kinds of join and union in MySQL 8 to process Big Data efficiently Accelerate Big Data processing with Memcached Integrate MySQL with the NoSQL API Implement replication to build highly available solutions for Big Data In Detail With organizations handling large amounts of data on a regular basis, MySQL has become a popular solution to handle this structured Big Data. In this book, you will see how DBAs can use MySQL 8 to handle billions of records, and load and retrieve data with performance comparable or superior to commercial DB solutions with higher costs. Many organizations today depend on MySQL for their websites and a Big Data solution for their data archiving, storage, and analysis needs. However, integrating them can be challenging. This book will show you how to implement a successful Big Data strategy with Apache Hadoop and MySQL 8. It will cover real-time use case scenario to explain integration and achieve Big Data solutions using technologies such as Apache Hadoop, Apache Sqoop, and MySQL Applier. Also, the book includes case studies on Apache Sqoop and real-time event processing. By the end of this book, you will know how to efficiently use MySQL 8 to manage data for your Big Data applications. Style and approach Step by Step guide filled with real-world practical examples.","language":"en","currency":"USD","id":"1788390423","title":"MySQL 8 for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5xhKDwAAQBAJ&source=gbs_api","authors":["Shabbir Challawala","Jaydip Lakhatariya","Chintan Mehta","Kandarp Patel"]},{"pageCount":300,"thumbnail":"http:\/\/books.google.com\/books\/content?id=knUDHEa-dP8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"Individual self-contained code recipes. Solve specific problems using individual recipes, or work through the book to develop your capabilities. If you are a big data enthusiast and striving to use Hadoop to solve your problems, this book is for you. Aimed at Java programmers with some knowledge of Hadoop MapReduce, this is also a comprehensive reference for developers and system admins who want to get up to speed using Hadoop.","language":"en","currency":"USD","id":"1849517290","title":"Hadoop MapReduce Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=knUDHEa-dP8C&source=gbs_api","authors":["Srinath Perera"]},{"pageCount":450,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y4DQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond","description":"Coding and testing are generally considered separate areas of expertise. In this practical book, Java expert Scott Oaks takes the approach that anyone who works with Java should be adept at understanding how code behaves in the Java Virtual Machine—including the tunings likely to help performance. This updated second edition helps you gain in-depth knowledge of Java application performance using both the JVM and the Java platform. Developers and performance engineers alike will learn a variety of features, tools, and processes for improving the way the Java 8 and 11 LTS releases perform. While the emphasis is on production-supported releases and features, this book also features previews of exciting new technologies such as ahead-of-time compilation and experimental garbage collections. Understand how various Java platforms and compilers affect performance Learn how Java garbage collection works Apply four principles to obtain best results from performance testing Use the JDK and other tools to learn how a Java application is performing Minimize the garbage collector’s impact through tuning and programming practices Tackle performance issues in Java APIs Improve Java-driven database application performance","language":"en","currency":"USD","id":"1492056065","title":"Java Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y4DQDwAAQBAJ&source=gbs_api","authors":["Scott Oaks"]},{"pageCount":304,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iY_zAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":"Building Secure Web Applications","description":"Proven Methods for Building Secure Java-Based Web Applications Develop, deploy, and maintain secure Java applications using the expert techniques and open source libraries described in this Oracle Press guide. Iron-Clad Java presents the processes required to build robust and secure applications from the start and explains how to eliminate existing security bugs. Best practices for authentication, access control, data protection, attack prevention, error handling, and much more are included. Using the practical advice and real-world examples provided in this authoritative resource, you'll gain valuable secure software engineering skills. Establish secure authentication and session management processes Implement a robust access control design for multi-tenant web applications Defend against cross-site scripting, cross-site request forgery, and clickjacking Protect sensitive data while it is stored or in transit Prevent SQL injection and other injection attacks Ensure safe file I\/O and upload Use effective logging, error handling, and intrusion detection methods Follow a comprehensive secure software development lifecycle \"In this book, Jim Manico and August Detlefsen tackle security education from a technical perspective and bring their wealth of industry knowledge and experience to application designers. A significant amount of thought was given to include the most useful and relevant security content for designers to defend their applications. This is not a book about security theories, it’s the hard lessons learned from those who have been exploited, turned into actionable items for application designers, and condensed into print.\"—From the Foreword by Milton Smith, Oracle Senior Principal Security Product Manager, Java","language":"en","currency":"USD","id":"007183589X","title":"Iron-Clad Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iY_zAwAAQBAJ&source=gbs_api","authors":["Jim Manico","August Detlefsen"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8-ZDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Unleash the data processing and analytics capability of Apache Spark with the language of choice: Java About This Book Perform big data processing with Spark—without having to learn Scala! Use the Spark Java API to implement efficient enterprise-grade applications for data processing and analytics Go beyond mainstream data processing by adding querying capability, Machine Learning, and graph processing using Spark Who This Book Is For If you are a Java developer interested in learning to use the popular Apache Spark framework, this book is the resource you need to get started. Apache Spark developers who are looking to build enterprise-grade applications in Java will also find this book very useful. What You Will Learn Process data using different file formats such as XML, JSON, CSV, and plain and delimited text, using the Spark core Library. Perform analytics on data from various data sources such as Kafka, and Flume using Spark Streaming Library Learn SQL schema creation and the analysis of structured data using various SQL functions including Windowing functions in the Spark SQL Library Explore Spark Mlib APIs while implementing Machine Learning techniques to solve real-world problems Get to know Spark GraphX so you understand various graph-based analytics that can be performed with Spark In Detail Apache Spark is the buzzword in the big data industry right now, especially with the increasing need for real-time streaming and data processing. While Spark is built on Scala, the Spark Java API exposes all the Spark features available in the Scala version for Java developers. This book will show you how you can implement various functionalities of the Apache Spark framework in Java, without stepping out of your comfort zone. The book starts with an introduction to the Apache Spark 2.x ecosystem, followed by explaining how to install and configure Spark, and refreshes the Java concepts that will be useful to you when consuming Apache Spark's APIs. You will explore RDD and its associated common Action and Transformation Java APIs, set up a production-like clustered environment, and work with Spark SQL. Moving on, you will perform near-real-time processing with Spark streaming, Machine Learning analytics with Spark MLlib, and graph processing with GraphX, all using various Java packages. By the end of the book, you will have a solid foundation in implementing components in the Spark framework in Java to build fast, real-time applications. Style and approach This practical guide teaches readers the fundamentals of the Apache Spark framework and how to implement components using the Java language. It is a unique blend of theory and practical examples, and is written in a way that will gradually build your knowledge of Apache Spark.","language":"en","currency":"USD","id":"178712942X","title":"Apache Spark 2.x for Java Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8-ZDDwAAQBAJ&source=gbs_api","authors":["Sourav Gulati","Sumit Kumar"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wljJZbEO8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Fundamental Design Solutions for SOAP\/WSDL and RESTful Web Services","description":"Web services have been used for many years. In this time, developers and architects have encountered a number of recurring design challenges related to their usage, and have learned that certain service design approaches work better than others to solve certain problems. In Service Design Patterns, Rob Daigneau codifies proven design solutions for web services that follow the REST architectural style or leverage the SOAP\/WSDL specifications. This catalogue identifies the fundamental topics in web service design and lists the common design patterns for each topic. All patterns identify the context in which they may be used, explain the constituent design elements, and explore the relative strengths and trade-offs. Code examples are provided to help you better understand how the patterns work but are kept general so that you can see how the solutions may be applied to disparate technologies that will inevitably change in the years to come. This book will help readers answer the following questions: How do you create a web service API, what are the common API styles, and when should a particular style be used? How can clients and web services communicate, and what are the foundations for creating complex conversations in which multiple parties exchange data over extended periods of time? What are the options for implementing web service logic, and when should a particular approach be used? How can clients become less coupled to the underlying systems used by a service? How can information about a web service be discovered? How can generic functions like authentication, validation, caching, and logging be supported on the client or service? What changes to a service cause clients to break? What are the common ways to version a service? How can web services be designed to support the continuing evolution of business logic without forcing clients to constantly upgrade? This book is an invaluable resource for enterprise architects, solution architects, and developers who use web services to create enterprise IT applications, commercial or open source products, and Software as a Service (SaaS) products that leverage emerging Cloud platforms.","language":"en","currency":"USD","id":"0321669606","title":"Service Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wljJZbEO8ZQC&source=gbs_api","authors":["Robert Daigneau"]},{"pageCount":358,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B-dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Your one-stop guide to the common patterns and practices, showing you how to apply these using the Go programming language About This Book This short, concise, and practical guide is packed with real-world examples of building microservices with Go It is easy to read and will benefit smaller teams who want to extend the functionality of their existing systems Using this practical approach will save your money in terms of maintaining a monolithic architecture and demonstrate capabilities in ease of use Who This Book Is For You should have a working knowledge of programming in Go, including writing and compiling basic applications. However, no knowledge of RESTful architecture, microservices, or web services is expected. If you are looking to apply techniques to your own projects, taking your first steps into microservice architecture, this book is for you. What You Will Learn Plan a microservice architecture and design a microservice Write a microservice with a RESTful API and a database Understand the common idioms and common patterns in microservices architecture Leverage tools and automation that helps microservices become horizontally scalable Get a grounding in containerization with Docker and Docker-Compose, which will greatly accelerate your development lifecycle Manage and secure Microservices at scale with monitoring, logging, service discovery, and automation Test microservices and integrate API tests in Go In Detail Microservice architecture is sweeping the world as the de facto pattern to build web-based applications. Golang is a language particularly well suited to building them. Its strong community, encouragement of idiomatic style, and statically-linked binary artifacts make integrating it with other technologies and managing microservices at scale consistent and intuitive. This book will teach you the common patterns and practices, showing you how to apply these using the Go programming language. It will teach you the fundamental concepts of architectural design and RESTful communication, and show you patterns that provide manageable code that is supportable in development and at scale in production. We will provide you with examples on how to put these concepts and patterns into practice with Go. Whether you are planning a new application or working in an existing monolith, this book will explain and illustrate with practical examples how teams of all sizes can start solving problems with microservices. It will help you understand Docker and Docker-Compose and how it can be used to isolate microservice dependencies and build environments. We finish off by showing you various techniques to monitor, test, and secure your microservices. By the end, you will know the benefits of system resilience of a microservice and the advantages of Go stack. Style and approach The step-by-step tutorial focuses on building microservices. Each chapter expands upon the previous one, teaching you the main skills and techniques required to be a successful microservice practitioner.","language":"en","currency":"USD","id":"1786469790","title":"Building Microservices with Go","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B-dDDwAAQBAJ&source=gbs_api","authors":["Nic Jackson"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Wn1MDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Best Practices","description":"Developers, designers, engineers, and creators can no longer afford to pass responsibility for identity and data security onto others. Web developers who don’t understand how to obscure data in transmission, for instance, can open security flaws on a site without realizing it. With this practical guide, you’ll learn how and why everyone working on a system needs to ensure that users and data are protected. Authors Jonathan LeBlanc and Tim Messerschmidt provide a deep dive into the concepts, technology, and programming methodologies necessary to build a secure interface for data and identity—without compromising usability. You’ll learn how to plug holes in existing systems, protect against viable attack vectors, and work in environments that sometimes are naturally insecure. Understand the state of web and application security today Design security password encryption, and combat password attack vectors Create digital fingerprints to identify users through browser, device, and paired device detection Build secure data transmission systems through OAuth and OpenID Connect Use alternate methods of identification for a second factor of authentication Harden your web applications against attack Create a secure data transmission system using SSL\/TLS, and synchronous and asynchronous cryptography","language":"en","currency":"USD","id":"1491936967","title":"Identity and Data Security for Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Wn1MDAAAQBAJ&source=gbs_api","authors":["Jonathan LeBlanc","Tim Messerschmidt"]},{"pageCount":48,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mZAjAOqQ8nIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.This book is written in practical Starter style with lots of helpful examples which will guide you gently into the world of nginx.This book is targeted at those people who are new to nginx and want to learn the intricacies of nginx web server.The book assumes that the readers have basic knowledge of Linux and backends such as PHP, Apache, Ruby, and Python.","language":"en","currency":"USD","id":"1782165134","title":"Instant Nginx Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mZAjAOqQ8nIC&source=gbs_api","authors":["Martin Fjordvald"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nk5sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is a detailed, practical, hands-on guide packed with real-life scenarios and examples which will show you how to implement an ElasticSearch search engine on your own websites. If you are a web developer or a user who wants to learn more about ElasticSearch, then this is the book for you. You do not need to know anything about ElastiSeach, Java, or Apache Lucene in order to use this book, though basic knowledge about databases and queries is required.","language":"en","currency":"USD","id":"1783980532","title":"Elasticsearch Server: Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nk5sAwAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":508,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1nc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Enhance the performance of your PostgreSQL system with this handy guide while avoiding common pitfalls that can slow it down. About This Book Learn the right techniques to obtain optimal PostgreSQL database performance, ranging from initial design to routine maintenance Fine tune the performance of your queries and avoid the common pitfalls that can slow your system down Contains tips and tricks on scaling successful database installations, and ensuring a highly available PostgreSQL solution Who This Book Is For This book is for intermediate to advanced database administrators and developers who use or plan to exploit the features of PostgreSQL in the best possible manner. While administrators can benefit from the topics related to the installation, configuration, and optimization of the server, developers will learn how to write optimal queries and address performance issues in their database design. This book will also benefit the PostgreSQL internal architects in being able to monitor the performance using benchmarking tools. What You Will Learn Learn the best practices to configure your PostgreSQL 9.6 database for optimal performance Write optimal queries and techniques to detect performance issue in queries Fine tune the performance of your queries using benchmarking and indexing techniques Ensure high performance and a highly available database using the scaling and replication techniques Discover how to make informed speed and reliability trade-offs Handle increasing database workloads without any hassle Use monitoring insights to continuously rework the design and configuration for best performance In Detail Database administrators and developers spend years learning techniques to configure their PostgreSQL database servers for optimal performance, mostly when they encounter performance issues. Scalability and high availability of the database solution is equally important these days. This book will show you how to configure new database installations and optimize existing database server installations using PostgreSQL 9.6. You will start with the basic concepts of database performance, because all successful database applications are destined to eventually run into issues when scaling up their performance. You will not only learn to optimize your database and queries for optimal performance, but also detect the real performance bottlenecks using PostgreSQL tools and some external tools. Next, you will learn how to benchmark your hardware and tune your operating system. Optimize your queries against the database with the help of right indexes, and monitor every layer, ranging from hardware to queries. Moving on, you will see how connection pooling, caching, partitioning, and replication will help you handle increasing database workloads. Achieving high database performance is not easy, but you can learn it by using the right guide—PostgreSQL 9.6 High Performance. Style and approach This book has been organized in such a manner that will help you understand basic PostgreSQL 9.6 performance tuning to advanced-level configuration. There are many real-world problems explained in this book and explained in clear language, because improving database performance requires an equal mix of understanding theoretical concepts and working through hands-on examples.","language":"en","currency":"USD","id":"1784396508","title":"PostgreSQL 9.6 High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1nc5DwAAQBAJ&source=gbs_api","authors":["Ibrar Ahmed","Gregory Smith"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"A practical book on real-world NGINX deployments to get you up and running quickly. About This Book Be the first to immerse yourself in the NGINX 1.9x web server and explore the plethora of advanced features. Master the skills of load balancing TCP-based applications and implementing HTTP\/2. A recipe-based approach book that provides you with up-to-date information on NGINX, allowing you to implement specific use cases immediately. Who This Book Is For This book is aimed at smaller-to-medium developers, who are just getting started with NGINX. It assumes they already understand the basics of how a web server works and how basic networking works. What You Will Learn Practical, real-world examples and recipes on how to use NGINX Common CMS deployments such as WordPress, Joomla and more NGINX configurations for frameworks such as Ruby on Rails, Django and more Detailed SSL recipes, including HTTP\/2 Real world rewrite examples Basic web and TCP load balancing configuration Bandwidth management and connection limiting Detailed NGINX deployment scenarios with Docker Performance tuning and monitoring of your NGINX deployments OpenResty deployment guides Advanced deployments with NGINX Plus features In Detail NGINX Cookbook covers the basics of configuring NGINX as a web server for use with common web frameworks such as WordPress and Ruby on Rails, through to utilization as a reverse proxy. Designed as a go-to reference guide, this book will give you practical answers based on real-world deployments to get you up and running quickly. Recipes have also been provided for multiple SSL configurations, different logging scenarios, practical rewrites, and multiple load balancing scenarios. Advanced topics include covering bandwidth management, Docker container usage, performance tuning, OpenResty, and the NGINX Plus commercial features. By the time you've read this book, you will be able to adapt and use a wide variety of NGINX implementations to solve any problems you have.","language":"en","currency":"USD","id":"1786469774","title":"NGINX Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KJZGDwAAQBAJ&source=gbs_api","authors":["Tim Butler"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5ef7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. A concise guide full of step-by-step recipes to teach you how to install and configure a Debian web server.This is an ideal book if you are an administrator on a Development Operations team or infrastructure management, who is passionate about Linux and their Web applications but have no previous experience with Debian or APT-based systems.","language":"en","currency":"USD","id":"1849518858","title":"Instant Debian – Build a Web Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5ef7AAAAQBAJ&source=gbs_api","authors":["Jose Miguel Parrella"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w1MoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Expert tabular modeling techniques for building and deploying cutting-edge business analytical reporting solutions About This Book Build and deploy Tabular Model projects from relational data sources Leverage DAX and create high-performing calculated fields and measures Create ad-hoc reports based on a Tabular Model solution Useful tips to monitor and optimize your tabular solutions Who This Book Is For This book is for SQL BI professionals and Architects who want to exploit the full power of the new Tabular models in Analysis Services. Some knowledge of previous versions of Analysis services would be helpful but is not essential. What You Will Learn Learn all about Tabular services mode and how it speeds up development Build solutions using sample datasets Explore built-in actions and transitions in SSAS 2016 Implement row-column, and role-based security in a Tabular Data model Realize the benefits of in-memory and DirectQuery deployment modes Get up to date with the new features added to SQL Server 2016 Analysis Services Optimize Data Models and Relationships Usage In Detail SQL Server Analysis Service (SSAS) has been widely used across multiple businesses to build smart online analytical reporting solutions. It includes two different types of modeling for analysis services: Tabular and Multi Dimensional. This book covers Tabular modeling, which uses tables and relationships with a fast in-memory engine to provide state of the art compression algorithms and query performance. The book begins by quickly taking you through the concepts required to model tabular data and set up the necessary tools and services. As you learn to create tabular models using tools such as Excel and Power View, you'll be shown various strategies to deploy your model on the server and choose a query mode (In-memory or DirectQuery) that best suits your reporting needs. You'll also learn how to implement key and newly introduced DAX functions to create calculated columns and measures for your model data. Last but not least, you'll be shown techniques that will help you administer and secure your BI implementation along with some widely used tips and tricks to optimize your reporting solution. By the end of this book, you'll have gained hands-on experience with the powerful new features that have been added to Tabular models in SSAS 2016 and you'll be able to improve user satisfaction with faster reports and analytical queries. Style and approach This book takes a practical, recipe-based approach where each recipe lists the steps to address or implement a solution. You will be provided with several approaches to creating a business intelligence semantic model using analysis services.","language":"en","currency":"USD","id":"1786461501","title":"Tabular Modeling with SQL Server 2016 Analysis Services Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w1MoDwAAQBAJ&source=gbs_api","authors":["Derek Wilson"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUhiQxUXVpMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Random Access to Your Planet-Size Data","description":"If you're looking for a scalable storage solution to accommodate a virtually endless amount of data, this book shows you how Apache HBase can fulfill your needs. As the open source implementation of Google's BigTable architecture, HBase scales to billions of rows and millions of columns, while ensuring that write and read performance remain constant. Many IT executives are asking pointed questions about HBase. This book provides meaningful answers, whether you’re evaluating this non-relational database or planning to put it into practice right away. Discover how tight integration with Hadoop makes scalability with HBase easier Distribute large datasets across an inexpensive cluster of commodity servers Access HBase with native Java clients, or with gateway servers providing REST, Avro, or Thrift APIs Get details on HBase’s architecture, including the storage format, write-ahead log, background processes, and more Integrate HBase with Hadoop's MapReduce framework for massively parallelized data processing jobs Learn how to tune clusters, design schemas, copy tables, import bulk data, decommission nodes, and many other tasks","language":"en","currency":"USD","id":"1449315224","title":"HBase: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUhiQxUXVpMC&source=gbs_api","authors":["Lars George"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iCdFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Concise Introduction Using Java","description":"This accessible and engaging textbook\/guide provides a concise introduction to data structures and associated algorithms. Emphasis is placed on the fundamentals of data structures, enabling the reader to quickly learn the key concepts, and providing a strong foundation for later studies of more complex topics. The coverage includes discussions on stacks, queues, lists, (using both arrays and links), sorting, and elementary binary trees, heaps, and hashing. This content is also a natural continuation from the material provided in the separate Springer title Guide to Java by the same authors.Topics and features: reviews the preliminary concepts, and introduces stacks and queues using arrays, along with a discussion of array-based lists; examines linked lists, the implementation of stacks and queues using references, binary trees, a range of varied sorting techniques, heaps, and hashing; presents both primitive and generic data types in each chapter, and makes use of contour diagrams to illustrate object-oriented concepts; includes chapter summaries, and asks the reader questions to help them interact with the material; contains numerous examples and illustrations, and one or more complete program in every chapter; provides exercises at the end of each chapter, as well as solutions to selected exercises, and a glossary of important terms. This clearly-written work is an ideal classroom text for a second semester course in programming using the Java programming language, in preparation for a subsequent advanced course in data structures and algorithms. The book is also eminently suitable as a self-study guide in either academe or industry.","language":"en","currency":"USD","id":"3319700855","title":"Guide to Data Structures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iCdFDwAAQBAJ&source=gbs_api","authors":["James T. Streib","Takako Soma"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_yuqyIZl33EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"A Cookbook with plenty of practical recipes for different uses of Storm.If you are a Java developer with basic knowledge of real-time processing and would like to learn Storm to process unbounded streams of data in real time, then this book is for you.","language":"en","currency":"USD","id":"178216443X","title":"Storm Real-Time Processing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_yuqyIZl33EC&source=gbs_api","authors":["Quinton Anderson"]},{"pageCount":309,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hdQkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"For Advanced Projects and Large Development Teams","description":"Successfully architect a Drupal 8 website that scales to meet project requirements of any size and scope. Starting with a one-chapter review of Drupal basics, you'll dive into deeper topics including software development processes, architecting a Drupal site, scaling Drupal, working effectively with themes, and more. In addition to a thorough discussion of custom module development and how to develop modules as building blocks, you'll also review many common ways of integrating Drupal with other 3rd party systems. Building and maintaining an enterprise-ready Drupal website presents a unique set of challenges and complexities. From development processes and content management to deployments, version control and more, all aspects of Drupal development are impacted when two or more developers are on a project. If you are involved in a Drupal project that requires frequent updates and long-term support from a team of developers, system administrators, and end-users, Enterprise Drupal 8 Development is for you. Whether you're an experienced Drupal developer looking to expand your skills, a systems administrator managing a Drupal project, or a PHP developer new to Drupal, Enterprise Drupal 8 Development will give you the knowledge and inspiration you need to manage large and complex projects. What You'll Learn Architect Drupal for development teams and apply best practices for large Drupal projects Integrate 3rd party applications with Drupal Manage content, code, and configuration across multiple staging environments Build a consistent user experience for administrators and content creators Who This Book Is For The primary audience is intermediate to advanced Drupal developers who are working on large-scale Drupal projects and advanced PHP developers new to Drupal The secondary audience is IT Professionals such as Systems Administrators managing Drupal projects","language":"en","currency":"USD","id":"1484202538","title":"Enterprise Drupal 8 Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hdQkDwAAQBAJ&source=gbs_api","authors":["Todd Tomlinson"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Wn1MDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Best Practices","description":"Developers, designers, engineers, and creators can no longer afford to pass responsibility for identity and data security onto others. Web developers who don’t understand how to obscure data in transmission, for instance, can open security flaws on a site without realizing it. With this practical guide, you’ll learn how and why everyone working on a system needs to ensure that users and data are protected. Authors Jonathan LeBlanc and Tim Messerschmidt provide a deep dive into the concepts, technology, and programming methodologies necessary to build a secure interface for data and identity—without compromising usability. You’ll learn how to plug holes in existing systems, protect against viable attack vectors, and work in environments that sometimes are naturally insecure. Understand the state of web and application security today Design security password encryption, and combat password attack vectors Create digital fingerprints to identify users through browser, device, and paired device detection Build secure data transmission systems through OAuth and OpenID Connect Use alternate methods of identification for a second factor of authentication Harden your web applications against attack Create a secure data transmission system using SSL\/TLS, and synchronous and asynchronous cryptography","language":"en","currency":"USD","id":"1491936967","title":"Identity and Data Security for Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Wn1MDAAAQBAJ&source=gbs_api","authors":["Jonathan LeBlanc","Tim Messerschmidt"]},{"pageCount":48,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mZAjAOqQ8nIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.This book is written in practical Starter style with lots of helpful examples which will guide you gently into the world of nginx.This book is targeted at those people who are new to nginx and want to learn the intricacies of nginx web server.The book assumes that the readers have basic knowledge of Linux and backends such as PHP, Apache, Ruby, and Python.","language":"en","currency":"USD","id":"1782165134","title":"Instant Nginx Starter","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mZAjAOqQ8nIC&source=gbs_api","authors":["Martin Fjordvald"]},{"pageCount":508,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1nc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Enhance the performance of your PostgreSQL system with this handy guide while avoiding common pitfalls that can slow it down. About This Book Learn the right techniques to obtain optimal PostgreSQL database performance, ranging from initial design to routine maintenance Fine tune the performance of your queries and avoid the common pitfalls that can slow your system down Contains tips and tricks on scaling successful database installations, and ensuring a highly available PostgreSQL solution Who This Book Is For This book is for intermediate to advanced database administrators and developers who use or plan to exploit the features of PostgreSQL in the best possible manner. While administrators can benefit from the topics related to the installation, configuration, and optimization of the server, developers will learn how to write optimal queries and address performance issues in their database design. This book will also benefit the PostgreSQL internal architects in being able to monitor the performance using benchmarking tools. What You Will Learn Learn the best practices to configure your PostgreSQL 9.6 database for optimal performance Write optimal queries and techniques to detect performance issue in queries Fine tune the performance of your queries using benchmarking and indexing techniques Ensure high performance and a highly available database using the scaling and replication techniques Discover how to make informed speed and reliability trade-offs Handle increasing database workloads without any hassle Use monitoring insights to continuously rework the design and configuration for best performance In Detail Database administrators and developers spend years learning techniques to configure their PostgreSQL database servers for optimal performance, mostly when they encounter performance issues. Scalability and high availability of the database solution is equally important these days. This book will show you how to configure new database installations and optimize existing database server installations using PostgreSQL 9.6. You will start with the basic concepts of database performance, because all successful database applications are destined to eventually run into issues when scaling up their performance. You will not only learn to optimize your database and queries for optimal performance, but also detect the real performance bottlenecks using PostgreSQL tools and some external tools. Next, you will learn how to benchmark your hardware and tune your operating system. Optimize your queries against the database with the help of right indexes, and monitor every layer, ranging from hardware to queries. Moving on, you will see how connection pooling, caching, partitioning, and replication will help you handle increasing database workloads. Achieving high database performance is not easy, but you can learn it by using the right guide—PostgreSQL 9.6 High Performance. Style and approach This book has been organized in such a manner that will help you understand basic PostgreSQL 9.6 performance tuning to advanced-level configuration. There are many real-world problems explained in this book and explained in clear language, because improving database performance requires an equal mix of understanding theoretical concepts and working through hands-on examples.","language":"en","currency":"USD","id":"1784396508","title":"PostgreSQL 9.6 High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1nc5DwAAQBAJ&source=gbs_api","authors":["Ibrar Ahmed","Gregory Smith"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nk5sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is a detailed, practical, hands-on guide packed with real-life scenarios and examples which will show you how to implement an ElasticSearch search engine on your own websites. If you are a web developer or a user who wants to learn more about ElasticSearch, then this is the book for you. You do not need to know anything about ElastiSeach, Java, or Apache Lucene in order to use this book, though basic knowledge about databases and queries is required.","language":"en","currency":"USD","id":"1783980532","title":"Elasticsearch Server: Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nk5sAwAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":278,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"A practical book on real-world NGINX deployments to get you up and running quickly. About This Book Be the first to immerse yourself in the NGINX 1.9x web server and explore the plethora of advanced features. Master the skills of load balancing TCP-based applications and implementing HTTP\/2. A recipe-based approach book that provides you with up-to-date information on NGINX, allowing you to implement specific use cases immediately. Who This Book Is For This book is aimed at smaller-to-medium developers, who are just getting started with NGINX. It assumes they already understand the basics of how a web server works and how basic networking works. What You Will Learn Practical, real-world examples and recipes on how to use NGINX Common CMS deployments such as WordPress, Joomla and more NGINX configurations for frameworks such as Ruby on Rails, Django and more Detailed SSL recipes, including HTTP\/2 Real world rewrite examples Basic web and TCP load balancing configuration Bandwidth management and connection limiting Detailed NGINX deployment scenarios with Docker Performance tuning and monitoring of your NGINX deployments OpenResty deployment guides Advanced deployments with NGINX Plus features In Detail NGINX Cookbook covers the basics of configuring NGINX as a web server for use with common web frameworks such as WordPress and Ruby on Rails, through to utilization as a reverse proxy. Designed as a go-to reference guide, this book will give you practical answers based on real-world deployments to get you up and running quickly. Recipes have also been provided for multiple SSL configurations, different logging scenarios, practical rewrites, and multiple load balancing scenarios. Advanced topics include covering bandwidth management, Docker container usage, performance tuning, OpenResty, and the NGINX Plus commercial features. By the time you've read this book, you will be able to adapt and use a wide variety of NGINX implementations to solve any problems you have.","language":"en","currency":"USD","id":"1786469774","title":"NGINX Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KJZGDwAAQBAJ&source=gbs_api","authors":["Tim Butler"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5ef7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. A concise guide full of step-by-step recipes to teach you how to install and configure a Debian web server.This is an ideal book if you are an administrator on a Development Operations team or infrastructure management, who is passionate about Linux and their Web applications but have no previous experience with Debian or APT-based systems.","language":"en","currency":"USD","id":"1849518858","title":"Instant Debian – Build a Web Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5ef7AAAAQBAJ&source=gbs_api","authors":["Jose Miguel Parrella"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w1MoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Expert tabular modeling techniques for building and deploying cutting-edge business analytical reporting solutions About This Book Build and deploy Tabular Model projects from relational data sources Leverage DAX and create high-performing calculated fields and measures Create ad-hoc reports based on a Tabular Model solution Useful tips to monitor and optimize your tabular solutions Who This Book Is For This book is for SQL BI professionals and Architects who want to exploit the full power of the new Tabular models in Analysis Services. Some knowledge of previous versions of Analysis services would be helpful but is not essential. What You Will Learn Learn all about Tabular services mode and how it speeds up development Build solutions using sample datasets Explore built-in actions and transitions in SSAS 2016 Implement row-column, and role-based security in a Tabular Data model Realize the benefits of in-memory and DirectQuery deployment modes Get up to date with the new features added to SQL Server 2016 Analysis Services Optimize Data Models and Relationships Usage In Detail SQL Server Analysis Service (SSAS) has been widely used across multiple businesses to build smart online analytical reporting solutions. It includes two different types of modeling for analysis services: Tabular and Multi Dimensional. This book covers Tabular modeling, which uses tables and relationships with a fast in-memory engine to provide state of the art compression algorithms and query performance. The book begins by quickly taking you through the concepts required to model tabular data and set up the necessary tools and services. As you learn to create tabular models using tools such as Excel and Power View, you'll be shown various strategies to deploy your model on the server and choose a query mode (In-memory or DirectQuery) that best suits your reporting needs. You'll also learn how to implement key and newly introduced DAX functions to create calculated columns and measures for your model data. Last but not least, you'll be shown techniques that will help you administer and secure your BI implementation along with some widely used tips and tricks to optimize your reporting solution. By the end of this book, you'll have gained hands-on experience with the powerful new features that have been added to Tabular models in SSAS 2016 and you'll be able to improve user satisfaction with faster reports and analytical queries. Style and approach This book takes a practical, recipe-based approach where each recipe lists the steps to address or implement a solution. You will be provided with several approaches to creating a business intelligence semantic model using analysis services.","language":"en","currency":"USD","id":"1786461501","title":"Tabular Modeling with SQL Server 2016 Analysis Services Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w1MoDwAAQBAJ&source=gbs_api","authors":["Derek Wilson"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUhiQxUXVpMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Random Access to Your Planet-Size Data","description":"If you're looking for a scalable storage solution to accommodate a virtually endless amount of data, this book shows you how Apache HBase can fulfill your needs. As the open source implementation of Google's BigTable architecture, HBase scales to billions of rows and millions of columns, while ensuring that write and read performance remain constant. Many IT executives are asking pointed questions about HBase. This book provides meaningful answers, whether you’re evaluating this non-relational database or planning to put it into practice right away. Discover how tight integration with Hadoop makes scalability with HBase easier Distribute large datasets across an inexpensive cluster of commodity servers Access HBase with native Java clients, or with gateway servers providing REST, Avro, or Thrift APIs Get details on HBase’s architecture, including the storage format, write-ahead log, background processes, and more Integrate HBase with Hadoop's MapReduce framework for massively parallelized data processing jobs Learn how to tune clusters, design schemas, copy tables, import bulk data, decommission nodes, and many other tasks","language":"en","currency":"USD","id":"1449315224","title":"HBase: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUhiQxUXVpMC&source=gbs_api","authors":["Lars George"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iCdFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"A Concise Introduction Using Java","description":"This accessible and engaging textbook\/guide provides a concise introduction to data structures and associated algorithms. Emphasis is placed on the fundamentals of data structures, enabling the reader to quickly learn the key concepts, and providing a strong foundation for later studies of more complex topics. The coverage includes discussions on stacks, queues, lists, (using both arrays and links), sorting, and elementary binary trees, heaps, and hashing. This content is also a natural continuation from the material provided in the separate Springer title Guide to Java by the same authors.Topics and features: reviews the preliminary concepts, and introduces stacks and queues using arrays, along with a discussion of array-based lists; examines linked lists, the implementation of stacks and queues using references, binary trees, a range of varied sorting techniques, heaps, and hashing; presents both primitive and generic data types in each chapter, and makes use of contour diagrams to illustrate object-oriented concepts; includes chapter summaries, and asks the reader questions to help them interact with the material; contains numerous examples and illustrations, and one or more complete program in every chapter; provides exercises at the end of each chapter, as well as solutions to selected exercises, and a glossary of important terms. This clearly-written work is an ideal classroom text for a second semester course in programming using the Java programming language, in preparation for a subsequent advanced course in data structures and algorithms. The book is also eminently suitable as a self-study guide in either academe or industry.","language":"en","currency":"USD","id":"3319700855","title":"Guide to Data Structures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iCdFDwAAQBAJ&source=gbs_api","authors":["James T. Streib","Takako Soma"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_yuqyIZl33EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"A Cookbook with plenty of practical recipes for different uses of Storm.If you are a Java developer with basic knowledge of real-time processing and would like to learn Storm to process unbounded streams of data in real time, then this book is for you.","language":"en","currency":"USD","id":"178216443X","title":"Storm Real-Time Processing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_yuqyIZl33EC&source=gbs_api","authors":["Quinton Anderson"]},{"pageCount":309,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hdQkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"For Advanced Projects and Large Development Teams","description":"Successfully architect a Drupal 8 website that scales to meet project requirements of any size and scope. Starting with a one-chapter review of Drupal basics, you'll dive into deeper topics including software development processes, architecting a Drupal site, scaling Drupal, working effectively with themes, and more. In addition to a thorough discussion of custom module development and how to develop modules as building blocks, you'll also review many common ways of integrating Drupal with other 3rd party systems. Building and maintaining an enterprise-ready Drupal website presents a unique set of challenges and complexities. From development processes and content management to deployments, version control and more, all aspects of Drupal development are impacted when two or more developers are on a project. If you are involved in a Drupal project that requires frequent updates and long-term support from a team of developers, system administrators, and end-users, Enterprise Drupal 8 Development is for you. Whether you're an experienced Drupal developer looking to expand your skills, a systems administrator managing a Drupal project, or a PHP developer new to Drupal, Enterprise Drupal 8 Development will give you the knowledge and inspiration you need to manage large and complex projects. What You'll Learn Architect Drupal for development teams and apply best practices for large Drupal projects Integrate 3rd party applications with Drupal Manage content, code, and configuration across multiple staging environments Build a consistent user experience for administrators and content creators Who This Book Is For The primary audience is intermediate to advanced Drupal developers who are working on large-scale Drupal projects and advanced PHP developers new to Drupal The secondary audience is IT Professionals such as Systems Administrators managing Drupal projects","language":"en","currency":"USD","id":"1484202538","title":"Enterprise Drupal 8 Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hdQkDwAAQBAJ&source=gbs_api","authors":["Todd Tomlinson"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=bV5X_LQL5dwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Follow the creation of a multi-site instance with Drupal. The practical examples and accompanying screenshots will help you to get multiple Drupal sites set up in no time. This book is for Drupal site builders. It is assumed that readers are familiar with Drupal already, with a basic grasp of its concepts and components. System administration concepts, such as configuring Apache, MySQL, and Vagrant are covered but no previous knowledge of these tools is required.","language":"en","currency":"USD","id":"1849518017","title":"Drupal 7 Multi Sites Configuration","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=bV5X_LQL5dwC&source=gbs_api","authors":["Matt Butcher"]},{"pageCount":134,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UwR0uFRKTMkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.34,"subtitle":null,"description":"The book follows a standard tutorial-based approach to create, retrieve, update, and delete Drupal 7 entities, their properties and fields.Programming Drupal 7 Entities is perfect for intermediate or advanced developers new to Drupal entity development who are looking to get a good grounding in how to code using the new paradigm. It's assumed that you will have some experience in PHP development already, and being vaguely familiar with Drupal, GIT, and Drush will also help.","language":"en","currency":"USD","id":"178216653X","title":"Programming Drupal 7 Entities","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UwR0uFRKTMkC&source=gbs_api","authors":["Sammy Spets"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-m5g0CVCCNYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"This cookbook has recipes written in simple, easy to understand format with lots of screenshots and insightful tips and hints. If you are an Oracle Database Administrator, Security Manager or Security Auditor looking to secure the Oracle Database or prevent it from being hacked, then this book is for you. This book assumes you have a basic understanding of security concepts.","language":"en","currency":"USD","id":"9781849685276","title":"Oracle 11g Anti-Hacker's Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-m5g0CVCCNYC&source=gbs_api","authors":["Adrian Neagu"]},{"pageCount":204,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Aigg5gl_CTYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Scalable Server-Side Code with JavaScript","description":"This book introduces you to Node, the new web development framework written in JavaScript. You'll learn hands-on how Node makes life easier for experienced JavaScript developers: not only can you work on the front end and back end in the same language, you'll also have more flexibility in choosing how to divide application logic between client and server. Written by a core contributor to the framework, Node: Up and Running shows you how Node scales up to support large numbers of simultaneous connections across multiple servers, and scales down to let you create quick one-off applications with minimal infrastructure. Built on the V8 JavaScript engine that runs Google Chrome, Node is already winning the hearts and minds of many companies, including Google and Yahoo! This book shows you why. Understand Node's event-loop architecture, non-blocking I\/O, and event-driven programming Discover how Node supports a variety of database and data storage tools Learn best practices for writing easy-to-maintain code for Node Get concrete examples of how to use the various Node APIs in practice Take advantage of the book’s complete API reference","language":"en","currency":"USD","id":"1449336957","title":"Node: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Aigg5gl_CTYC&source=gbs_api","authors":["Tom Hughes-Croucher","Mike Wilson"]},{"pageCount":596,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iaDcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":null,"description":"Create interactive cross-platform reports and dashboards using SQL Server 2016 Reporting Services About This Book Get up to speed with the newly-introduced enhancements and the more advanced query and reporting features Easily access your important data by creating visually appealing dashboards in the Power BI practical recipe Create cross-browser and cross-platform reports using SQL Server 2016 Reporting Services Who This Book Is For This book is for software professionals who develop and implement reporting solutions using Microsoft SQL Server. It is especially relevant for professionals who are software engineers, software architects, DW\/BI engineers, and DW\/BI architects who perform simple to complex report authoring implementations. This book is also suitable for those who develop software solutions that integrate reporting solutions and are keen to learn about Microsoft SQL Server 2016's features and capabilities. What You Will Learn Key capabilities, architecture, and components of Reporting Services New features that have been added to Reporting Services Design the architecture for reporting solutions Design the architecture for BI solutions Implement reporting solutions using Reporting Services Improve the performance, availability, and scalability of the reporting solution Enhance reporting solutions with custom programming and improved security In Detail Microsoft SQL Server 2016 Reporting Services comes with many new features. It offers different types of reporting such as Production, Ad-hoc, Dashboard, Mash-up, and Analytical. SQL Server 2016 also has a surfeit of new features including Mobile Reporting, and Power BI integration. This book contains recipes that explore the new and advanced features added to SQL Server 2016. The first few chapters cover recipes on configuring components and how to explore these new features. You'll learn to build your own reporting solution with data tools and report builder, along with learning techniques to create visually appealing reports. This book also has recipes for enhanced mobile reporting solutions, accessing these solutions effectively, and delivering interactive business intelligence solutions. Towards the end of the book, you'll get to grips with running reporting services in SharePoint integrated mode and be able to administer, monitor, and secure your reporting solution. This book covers about the new offerings of Microsoft SQL Server 2016 Reporting Services in comprehensive detail and uses examples of real-world problem-solving business scenarios. Style and approach This comprehensive cookbook follows a problem-solution approach to help you overcome any obstacle when creating interactive, visually-appealing reports using SQL Server 2016 Reporting Services. Each recipe focuses on a specific task and is written in a clear, solution-focused style.","language":"en","currency":"USD","id":"1786467992","title":"SQL Server 2016 Reporting Services Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iaDcDgAAQBAJ&source=gbs_api","authors":["Dinesh Priyankara","Robert C. Cain"]},{"pageCount":144,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Dh8ZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A sequential and easy-to-follow guide which allows you to understand the concepts related to securing web apps\/services quickly and efficiently, since each topic is explained and described with the help of an example and in a step-by-step manner, helping you to easily implement the examples in your own projects. This book is intended for web application developers who use RESTful web services to power their websites. Prior knowledge of RESTful is not mandatory, but would be advisable.","language":"en","currency":"USD","id":"1783980117","title":"RESTful Java Web Services Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Dh8ZBAAAQBAJ&source=gbs_api","authors":["René Enríquez","Andrés Salazar C."]},{"pageCount":487,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeXF6MVAR6kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":191.2,"subtitle":null,"description":"This volume reviews cutting-edge technologies and insights related to XML-based and multimedia information access and data retrieval. And by applying new techniques to real-world scenarios, it details how organizations can gain competitive advantages.","language":"en","currency":"USD","id":"9781849960748","title":"Emergent Web Intelligence: Advanced Information Retrieval","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeXF6MVAR6kC&source=gbs_api","authors":["Richard Chbeir","Youakim Badr","Ajith Abraham","Aboul-Ella Hassanien"]},{"pageCount":160,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iarh6-JYNaIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book is written in simple, easy to understand format with lots of screenshots and step-by-step explanations. If you are a WebLogic Server administrator looking forward to a step by step guide to administer and configure WebLogic security, then this is the guide for you. Working knowledge of WebLogic is required.","language":"en","currency":"USD","id":"184968779X","title":"Securing WebLogic Server 12c","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iarh6-JYNaIC&source=gbs_api","authors":["Luca Masini"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Iym6CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.99,"subtitle":null,"description":"Microsoft Excel is a powerful tool that can transform the way you use data. This book explains in comprehensive and user-friendly detail how to manage, make sense of, explore and share data, giving scientists at all levels the skills they need to maximize the usefulness of their data. Readers will learn how to use Excel to: * Build a dataset – how to handle variables and notes, rearrangements and edits to data. * Check datasets – dealing with typographic errors, data validation and numerical errors. * Make sense of data – including datasets for regression and correlation; summarizing data with averages and variability; and visualizing data with graphs, pivot charts and sparklines. * Explore regression data – finding, highlighting and visualizing correlations. * Explore time-related data – using pivot tables, sparklines and line plots. * Explore association data – creating and visualizing contingency tables. * Explore differences – pivot tables and data visualizations including box-whisker plots. * Share data – methods for exporting and sharing your datasets, summaries and graphs. Alongside the text, Have a Go exercises, Tips and Notes give readers practical experience and highlight important points, and helpful self-assessment exercises and summary tables can be found at the end of each chapter. Supplementary material can also be downloaded on the companion website. Managing Data Using Excel is an essential book for all scientists and students who use data and are seeking to manage data more effectively. It is aimed at scientists at all levels but it is especially useful for university-level research, from undergraduates to postdoctoral researchers.","language":"en","currency":"USD","id":"1784270296","title":"Managing Data Using Excel","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Iym6CAAAQBAJ&source=gbs_api","authors":["Mark Gardener"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GYWMBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Note about this ebook: This ebook exploits many advanced capabilities with images, hypertext, and interactivity and is optimized for EPUB3-compliant book readers, especially Apple's iBooks and browser plugins. These features may not work on all ebook readers. We organize things. We organize information, information about things, and information about information. Organizing is a fundamental issue in many professional fields, but these fields have only limited agreement in how they approach problems of organizing and in what they seek as their solutions. The Discipline of Organizing synthesizes insights from library science, information science, computer science, cognitive science, systems analysis, business, and other disciplines to create an Organizing System for understanding organizing. This framework is robust and forward-looking, enabling effective sharing of insights and design patterns between disciplines that weren’t possible before. The Professional Edition includes new and revised content about the active resources of the \"Internet of Things,\" and how the field of Information Architecture can be viewed as a subset of the discipline of organizing. You’ll find: 600 tagged endnotes that connect to one or more of the contributing disciplines Nearly 60 new pictures and illustrations Links to cross-references and external citations Interactive study guides to test on key points The Professional Edition is ideal for practitioners and as a primary or supplemental text for graduate courses on information organization, content and knowledge management, and digital collections. FOR INSTRUCTORS: Supplemental materials (lecture notes, assignments, exams, etc.) are available at http:\/\/disciplineoforganizing.org. FOR STUDENTS: Make sure this is the edition you want to buy. There's a newer one and maybe your instructor has adopted that one instead.","language":"en","currency":"USD","id":"1491911719","title":"The Discipline of Organizing: Professional Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GYWMBAAAQBAJ&source=gbs_api","authors":["Robert J. Glushko"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uQkLr5ZnSmUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.08,"subtitle":null,"description":"Security Smarts for the Self-Guided IT Professional “Get to know the hackers—or plan on getting hacked. Sullivan and Liu have created a savvy, essentials-based approach to web app security packed with immediately applicable tools for any information security practitioner sharpening his or her tools or just starting out.” —Ryan McGeehan, Security Manager, Facebook, Inc. Secure web applications from today's most devious hackers. Web Application Security: A Beginner's Guide helps you stock your security toolkit, prevent common hacks, and defend quickly against malicious attacks. This practical resource includes chapters on authentication, authorization, and session management, along with browser, database, and file security--all supported by true stories from industry. You'll also get best practices for vulnerability detection and secure development, as well as a chapter that covers essential security fundamentals. This book's templates, checklists, and examples are designed to help you get started right away. Web Application Security: A Beginner's Guide features: Lingo--Common security terms defined so that you're in the know on the job IMHO--Frank and relevant opinions based on the authors' years of industry experience Budget Note--Tips for getting security technologies and processes into your organization's budget In Actual Practice--Exceptions to the rules of security explained in real-world contexts Your Plan--Customizable checklists you can use on the job now Into Action--Tips on how, why, and when to apply new skills and techniques at work","language":"en","currency":"USD","id":"0071776125","title":"Web Application Security, A Beginner's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uQkLr5ZnSmUC&source=gbs_api","authors":["Bryan Sullivan","Vincent Liu"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CP9vDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Create fast, scalable, and high performance applications with C#, ASP.NET Core 1.0, and MVC 6 About This Book Learn the importance of measuring, profiling, and locating the most impactful problems Discover the common areas you might encounter performance problems and areas you don't need to worry about Understand the differences between development workstations and production infrastructure and how these can amplify problems Design workflows that run asynchronously and are resilient to transient performance issues Who This Book Is For This book is for ASP.NET and C# developers who have experience with the MVC framework for web application development and are looking to deploy applications that will perform well in live production environments. These could be virtual machines or hosted by a cloud service provider such as AWS or Azure. What You Will Learn Why performance matters and when it should be considered Use different tools to measure performance Spot common performance issues, their root causes, and how to easily mitigate them Improve performance at the network level and I\/O level, and how to optimize the application as a whole Work with caching and message queuing tools, including patterns and strategies Discover the dark side of performance improvement and find out how to manage complexity Monitor performance as part of continuous integration and regression testing Assess and solve performance issues with other advanced technologies In Detail ASP.NET Core is the new, open source, and cross-platform, web-application framework from Microsoft. It's a stripped down version of ASP.NET that's lightweight and fast. This book will show you how to make your web apps deliver high performance when using it. We'll address many performance improvement techniques from both a general web standpoint and from a C#, ASP.NET Core, and .NET Core perspective. This includes delving into the latest frameworks and demonstrating software design patterns that improve performance. We will highlight common performance pitfalls, which can often occur unnoticed on developer workstations, along with strategies to detect and resolve these issues early. By understanding and addressing challenges upfront, you can avoid nasty surprises when it comes to deployment time. We will introduce performance improvements along with the trade-offs that they entail. We will strike a balance between premature optimization and inefficient code by taking a scientific- and evidence-based approach. We'll remain pragmatic by focusing on the big problems. By reading this book, you'll learn what problems can occur when web applications are deployed at scale and know how to avoid or mitigate these issues. You'll gain experience of how to write high-performance applications without having to learn about issues the hard way. You'll see what's new in ASP.NET Core, why it's been rebuilt from the ground up, and what this means for performance. You will understand how you can now develop on and deploy to Windows, Mac OS X, and Linux using cross-platform tools, such as Visual Studio Code. Style and approach Starting with a drill down into the nuts and bolts of various performance parameters, you will get an understanding of the ASP.NET MVC 6 framework with the help of rich code-based examples that will equip you to build highly scalable and optimized applications.","language":"en","currency":"USD","id":"1785880829","title":"ASP.NET Core 1.0 High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CP9vDQAAQBAJ&source=gbs_api","authors":["James Singleton"]},{"pageCount":832,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mCYuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":48,"subtitle":null,"description":"A fully updated, integrated self-study system for the Oracle Database SQL Exam This thoroughly revised Oracle Press guide offers 100% coverage of all objectives on the latest version of the Oracle Database SQL Exam. Ideal both as a study guide and on-the-job reference, OCA Oracle Database SQL Exam Guide (Exam 1Z0-071) features detailed explanations, examples, practice questions, and chapter summaries. “Certification Objectives,” “Exam Watch,” and “On the Job” sections reinforce salient points throughout. You will gain access to two complete practice exams that match the tone, tenor, and format of the live test. Get complete coverage every topic on Exam 1Z0-071, including: • DDL and SQL SELECT statements • Manipulating, restricting, and sorting data • Single-row and group functions • Displaying data from multiple tables • Subqueries • Schema objects • Set operators • Grouping related data • Report creation • Data dictionary views • Large data sets • Hierarchical retrieval • Regular expression support • User access control The electronic includes: • Two full practice exams • Detailed answers and explanations","language":"en","currency":"USD","id":"1259584615","title":"OCA Oracle Database SQL Exam Guide (Exam 1Z0-071)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mCYuDwAAQBAJ&source=gbs_api","authors":["Steve O'Hearn"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6WPjLbZU_wEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"By following a simple ticket booking example, you will learn how to use each of Infinispan's features in the real-world. Lots of practical examples and screenshots help you to get to grips with Infinispan quickly and easily..This book is for Enterprise developers and architects who want to use a distributed caching and data grid solution. You should have programming knowledge of Java and a general familiarity with concepts like data caching and clustering.","language":"en","currency":"USD","id":"1849518238","title":"Infinispan Data Grid Platform","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6WPjLbZU_wEC&source=gbs_api","authors":["Francesco Marchioni","Manik Surtani"]},{"pageCount":68,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fp_Sa9CKIgsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. Instant Microsoft SQL Server Analysis Services 2012 Cube Security is a practical, hands-on guide that provides a number of clear, step-by-step exercises for getting started with cube security.This book is aimed at Database Administrators, Data Architects, and Systems Administrators who are managing the SQL Server data platform. It is also beneficial for analysis services developers who already have some experience with the technology, but who want to go into more detail on advanced topics and learn best practices for cube design.","language":"en","currency":"USD","id":"1849688710","title":"Instant SQL Server Analysis Services 2012 Cube Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fp_Sa9CKIgsC&source=gbs_api","authors":["Satya S. K. Jayanty"]},{"pageCount":221,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sPyeMYUGZ_UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Design and develop Asterisk-based VoIP telephony platforms and services using PHP and PHPAGI","language":"en","currency":"USD","id":"1847194478","title":"Asterisk Gateway Interface 1.4 and 1.6 Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sPyeMYUGZ_UC&source=gbs_api","authors":["Nir Simionovich"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uduYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This tutorial-based book has a step-by-step approach for each topic, ensuring it is thoroughly covered and easy to follow. If you are an IT architect or administrator who wants to enter the world of cloud storage using OpenStack Swift, then this book is ideal for you. Whether your job is to build, manage, or use OpenStack Swift, this book is an excellent way to move your career ahead.","language":"en","currency":"USD","id":"1782168060","title":"Implementing Cloud Storage with OpenStack Swift","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uduYAwAAQBAJ&source=gbs_api","authors":["Amar Kapadia","Sreedhar Varma","Kris Rajana"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H-cbfj82BPYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Annotation From smaller businesses through to huge enterprises _ users all over the world often require access to data 24 hours a day. Distributed database systems proliferate the world of data sharing providing an ability to access real-time data anywhere, anytime. Oracle Streams, a built-in feature of the Oracle database, is a data replication and integration feature critical to the success and wellbeing of enterprises in today's fast moving economy. This book provides the reader with solid techniques to master Oracle Streams technology and successfully deploy distributed database systems. This book quickly goes over the basics and gets you up and running with a simple Oracle 11g Streams environment. It will serve as an excellent companion to the Oracle Streams Administration Guide. It is intended for Oracle database architects and administrators, and provides in-depth discussion on must-know information for the design, implementation, and maintenance of an Oracle Streams environment. The book does not attempt to regurgitate all the information in the Oracle Streams Administration Guides, but rather provides additional clarification and explanation of design, implementation, and troubleshooting concepts that are often elusive in Streams documentation. It also identifies helpful tools and Oracle resources to add to your knowledge base, as well as tried and tested tricks and tips to help you tame Oracle Streams. The book starts by introducing and explaining the components of Oracle Streams and how they work together. It then moves on logically, helping you to determine your distributed environment requirements and design your Streams implementation to meet those requirements. Once these concepts are discussed, the book moves to configuration and basic implementation examples to help solidify those concepts. It then addresses advanced features such as tags, down-stream capture, and conflict resolution. You then move on to maintenance techniques such as documenting the environment, effectively planning and implementing changes to the environment, and monitoring and troubleshooting the environment. When you have studied the techniques and completed the hands-on examples, you will have an understanding of Oracle Streams' core concepts and functionally that will allow you to successfully design, implement, and maintain an Oracle Streamed environment.","language":"en","currency":"USD","id":"1847199712","title":"Oracle 11g Streams Implementer's Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H-cbfj82BPYC&source=gbs_api","authors":["Ann L. R. McKinnell","Eric Yen"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_-BPBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Securing APIs with OAuth 2.0, OpenID Connect, JWS, and JWE","description":"Advanced API Security is a complete reference to the next wave of challenges in enterprise security--securing public and private APIs. API adoption in both consumer and enterprises has gone beyond predictions. It has become the ‘coolest’ way of exposing business functionalities to the outside world. Both your public and private APIs, need to be protected, monitored and managed. Security is not an afterthought, but API security has evolved a lot in last five years. The growth of standards, out there, has been exponential. That's where AdvancedAPI Security comes in--to wade through the weeds and help you keep the bad guys away while realizing the internal and external benefits of developing APIs for your services. Our expert author guides you through the maze of options and shares industry leading best practices in designing APIs for rock-solid security. The book will explain, in depth, securing APIs from quite traditional HTTP Basic Authentication to OAuth 2.0 and the standards built around it. Build APIs with rock-solid security today with Advanced API Security. Takes you through the best practices in designing APIs for rock-solid security. Provides an in depth tutorial of most widely adopted security standards for API security. Teaches you how to compare and contrast different security standards\/protocols to find out what suits your business needs the best.","language":"en","currency":"USD","id":"1430268174","title":"Advanced API Security","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_-BPBAAAQBAJ&source=gbs_api","authors":["Prabath Siriwardena"]},{"pageCount":218,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BTD5eXfhC-wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Managing Your Team and Projects with Request Tracker","description":"In a typical organization, there's always plenty that to do such as: pay vendors, invoice customers, answer customer inquiries, and fix bugs in hardware or software. You need to know who wants what and keep track of what is left to do. This is where a ticketing system comes in. A ticketing system allows you to check the status of various tasks: when they were requested, who requested them and why, when they were completed, and more. RT is a high-level, open source ticketing system efficiently enabling a group of people to manage tasks, issues, and requests submitted by a community of users. RT Essentials, co-written by one of the RT's original core developers, Jesse Vincent, starts off with a quick background lesson about ticketing systems and then shows you how to install and configure RT. This comprehensive guide explains how to perform day-to-day tasks to turn your RT server into a highly useful tracking tool. One way it does this is by examining how a company could use RT to manage its internal processes. Advanced chapters focus on developing add-on tools and utilities using Perl and Mason. There's also chapter filled with suggested uses for RT inside your organization. No matter what kind of data your organization tracks--from sales inquiries to security incidents or anything in between--RT Essentials helps you use RT to provide order when you need it most.","language":"en","currency":"USD","id":"9780596550707","title":"RT Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BTD5eXfhC-wC&source=gbs_api","authors":["Jesse Vincent","Robert Spier","Dave Rolsky","Darren Chamberlain","Richard Foley"]},{"pageCount":213,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OtgoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"22nd International Conference, CIAA 2017, Marne-la-Vallée, France, June 27-30, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 22nd International Conference on Implementation and Application of Automata, CIAA 2017,held in Marne-la-Vallée, France, in June 2017. The 17 revised full papers presented were carefully reviewed and selected from 31 submissions. The topics of the presented papers include state complexity of automata; implementations of automata and experiments; enhanced regular expressions; and complexity analysis.","language":"en","currency":"USD","id":"3319601342","title":"Implementation and Application of Automata","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OtgoDwAAQBAJ&source=gbs_api","authors":["Arnaud Carayol","Cyril Nicaud"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=17juuNZONoEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":null,"description":"The bestselling Excel book on the market, updated for Excel 2010 As the world's leading spreadsheet application, Excel has a huge user base. The release of Office 2010 brings major changes to Excel, so Excel For Dummies comes to the rescue once more! In the friendly and non-threatening For Dummies style, this popular guide shows beginners how to get up and running with Excel and helps more experienced users get comfortable with new features. Excel is the number one spreadsheet application worldwide, and Excel For Dummies is the number one guide to using it With the major changes in Microsoft Office 2010, Excel has new features and a new interface design; users need help to get up to speed The book includes everything you need to know to perform basic Excel 2010 tasks Covers creating and editing worksheets and charts, formatting cells, entering formulas, inserting graphs, designing database forms, and adding database records Also covers printing, adding hyperlinks to worksheets, saving worksheets as Web pages, adding existing worksheet data to an existing Web page, and much more Whether you're new to Excel or just need to understand the 2010 version, Excel 2010 For Dummies provides what you need to know.","language":"en","currency":"USD","id":"9780470634707","title":"Excel 2010 For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=17juuNZONoEC&source=gbs_api","authors":["Greg Harvey"]},{"pageCount":250,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UUYk_B3pKsEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":119.2,"subtitle":"VOLUME 2: Statistical, Bayesian, Time Series and other Theoretical Aspects","description":"There are many invaluable books available on data mining theory and applications. However, in compiling a volume titled “DATA MINING: Foundations and Intelligent Paradigms: Volume 2: Core Topics including Statistical, Time-Series and Bayesian Analysis” we wish to introduce some of the latest developments to a broad audience of both specialists and non-specialists in this field.","language":"en","currency":"USD","id":"3642232418","title":"Data Mining: Foundations and Intelligent Paradigms","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UUYk_B3pKsEC&source=gbs_api","authors":["Dawn E. Holmes","Lakhmi C Jain"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=hx4VRqWRA94C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"My Evernote® Step-by-step instructions with callouts to photos that show you exactly what to do Help when you run into problems or limitations with Evernote Tips and Notes to help you take full advantage of Evernote on your smartphone, tablet, or computer Full-color, step-by-step tasks walk you through making the most of Evernote –free or premium, on any device! Learn how to • Install and use Evernote on your iPhone, Android, iPad, BlackBerry, Windows Phone, PC or Mac, and beyond • Create and share notebooks, customized just the way you like, and organize your notes your way • Save images, drawings, handwriting, web content, even webcam snapshots in notes you can access anywhere, anytime • Add notes straight from Twitter or Google+, and link Evernote to your Facebook account • Format your notes to look great, and easily print the notes you want to file the old-fashioned way • Build easy-to-use To Do lists, complete with checkboxes • Sync your notes across multiple devices, and store them in the cloud so they’re always available over the Web • Import notes from other popular note-taking tools, such as Microsoft OneNote and Google Notebooks • Record high-quality audio notes and organize and share them as needed • Send notes to Evernote from Apple’s Siri digital assistant • Organize, tag, and search your notebooks to instantly find whatever you’re looking for • Install and use the Evernote Web Clipper in all popular web browsers • Securely share notebooks publicly or privately and collaborate with teams, wherever they are • Find apps and add-ons that make Evernote do even more for you CATEGORY: Desktop Applications COVERS: Evernote USER LEVEL: Beginning-Intermediate","language":"en","currency":"USD","id":"0132957647","title":"My Evernote","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=hx4VRqWRA94C&source=gbs_api","authors":["Katherine Murray","James Floyd Kelly"]},{"pageCount":196,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LGuDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 215 Advanced SAS Interview Questions · 77 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests Advanced SAS Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. Includes: a) 215 Advanced SAS Interview Questions, Answers and Proven Strategies for getting hired as an IT professional b) Dozens of examples to respond to interview questions c) 77 HR Questions with Answers and Proven strategies to give specific, impressive, answers that help nail the interviews d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383759","title":"Advanced SAS Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LGuDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VpPurk2kcT8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Visual QuickStart Guide","description":"This Visual QuickStart Guide will help you get up and running with the Nexus 7, Google's much-anticipated entry into the tablet market. This guide connects all the capabilities of the Nexus 7 for you, using full-color images and step-by-step instruction. You'll learn how to tap and swipe, search and use voice control, find the best apps, read books, watch movies, and listen to songs. Along the way, you'll pick up indispensable tips for getting the most out of your tablet.","language":"en","currency":"USD","id":"0133156788","title":"Google Nexus 7 Tablet","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VpPurk2kcT8C&source=gbs_api","authors":["Chris Fehily"]},{"pageCount":185,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9GqDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.49,"subtitle":null,"description":"· 250 C & C++ Interview Questions · 76 HR Interview Questions · Real life scenario based questions · Strategies to respond to interview questions · 2 Aptitude Tests C & C++ Interview Questions You'll Most Likely Be Asked is a perfect companion to stand ahead above the rest in today's competitive job market. Rather than going through comprehensive, textbook-sized reference guides, this book includes only the information required immediately for job search to build an IT career. This book puts the interviewee in the driver's seat and helps them steer their way to impress the interviewer. The following is included in this book: (a) 250 C & C++ Interview Questions, Answers and proven strategies for getting hired as an IT professional (b) Dozens of examples to respond to interview questions (c) 76 HR Questions with Answers and proven strategies to give specific, impressive, answers that help nail the interviews (d) 2 Aptitude Tests download available on www.vibrantpublishers.com","language":"en","currency":"USD","id":"1946383198","title":"C & C++ Interview Questions You'll Most Likely Be Asked","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9GqDDwAAQBAJ&source=gbs_api","authors":["Vibrant Publishers"]},{"pageCount":171,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p0JJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Third International Workshop, ALGOCLOUD 2017, Vienna, Austria, September 5, 2017, Revised Selected Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the Second International Workshop on Algorithmic Aspects of Cloud Computing, ALGOCLOUD 2017, held in Vienna, Austria, in September 2017. The 9 revised full papers were carefully reviewed and selected from 27 submissions. The aim of the workshop is to present research activities and results on topics related to algorithmic, design, and development aspects of modern cloud-based systems.","language":"en","currency":"USD","id":"3319748750","title":"Algorithmic Aspects of Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p0JJDwAAQBAJ&source=gbs_api","authors":["Dan Alistarh","Alex Delis","George Pallis"]},{"pageCount":696,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lLz_DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"Exam CWSP-205","description":"The most detailed, comprehensive coverage of CWSP-205 exam objectives CWSP: Certified Wireless Security Professional Study Guide offers comprehensive preparation for the CWSP-205 exam. Fully updated to align with the new 2015 exam, this guide covers all exam objectives and gives you access to the Sybex interactive online learning system so you can go into the test fully confident in your skills. Coverage includes WLAN discovery, intrusion and attack, 802.11 protocol analysis, wireless intrusion prevention system implementation, Layer 2 and 3 VPN over 802.11 networks, managed endpoint security systems, and more. Content new to this edition features discussions about BYOD and guest access, as well as detailed and insightful guidance on troubleshooting. With more than double the coverage of the “official” exam guide, plus access to interactive learning tools, this book is your ultimate solution for CWSP-205 exam prep. The CWSP is the leading vendor-neutral security certification administered for IT professionals, developed for those working with and securing wireless networks. As an advanced certification, the CWSP requires rigorous preparation — and this book provides more coverage and expert insight than any other source. Learn the ins and outs of advanced network security Study 100 percent of CWSP-205 objectives Test your understanding with two complete practice exams Gauge your level of preparedness with a pre-test assessment The CWSP is a springboard for more advanced certifications, and the premier qualification employers look for in the field. If you’ve already earned the CWTS and the CWNA, it’s time to take your career to the next level. CWSP: Certified Wireless Security Professional Study Guide is your ideal companion for effective, efficient CWSP-205 preparation.","language":"en","currency":"USD","id":"1119244137","title":"CWSP Certified Wireless Security Professional Study Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lLz_DAAAQBAJ&source=gbs_api","authors":["David D. Coleman","David A. Westcott","Bryan E. Harkins"]}]