[{"pageCount":714,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nh0okI1a1sQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Code You Can Believe In","description":"This easy-to-use, fast-moving tutorial introduces you to functional programming with Haskell. You'll learn how to use Haskell in a variety of practical ways, from short scripts to large and demanding applications. Real World Haskell takes you through the basics of functional programming at a brisk pace, and then helps you increase your understanding of Haskell in real-world issues like I\/O, performance, dealing with data, concurrency, and more as you move through each chapter.","language":"en","currency":"USD","id":"9780596554309","title":"Real World Haskell","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nh0okI1a1sQC&source=gbs_api","authors":["Bryan O'Sullivan","John Goerzen","Donald Bruce Stewart"]},{"pageCount":188,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UG15DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":30.49,"subtitle":"Operating Kubernetes Clusters in the Real World","description":"While Kubernetes has greatly simplified the task of deploying containerized applications, managing this orchestration framework on a daily basis can still be a complex undertaking. With this practical book, site reliability and DevOps engineers will learn how to build, operate, manage, and upgrade a Kubernetes cluster—whether it resides on cloud infrastructure or on-premises. Brendan Burns, cofounder of Kubernetes, and Craig Tracey, staff field engineer at Heptio, dissect how Kubernetes works internally and demonstrate ways to maintain, adjust, and improve the cluster to suit your particular use case. You’ll learn how to make architectural choices for designing a cluster, managing access control, monitoring and alerting, and upgrading Kubernetes. Dive in and discover how to take full advantage of this orchestration framework’s capabilities. Learn how your cluster operates, how developers use it to deploy applications, and how Kubernetes can facilitate a developer’s job Adjust, secure, and tune your cluster by understanding Kubernetes APIs and configuration options Detect cluster-level problems early and learn the steps necessary to respond and recover quickly Determine how and when to add libraries, tools, and platforms that build on, extend, or otherwise improve a Kubernetes cluster","language":"en","currency":"USD","id":"1492033863","title":"Managing Kubernetes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UG15DwAAQBAJ&source=gbs_api","authors":["Brendan Burns","Craig Tracey"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Perform fast and efficient data analysis with the power of SQL","description":"SQL for Data Analytics teaches everything you need to know to progress from basic SQL to identifying trends and creating compelling narratives with data. With this book, you will be able to look at data with the critical eye of an analytics professional and extract meaningful insights that will improve your business.","language":"en","currency":"USD","id":"1789803845","title":"SQL for Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VyisDwAAQBAJ&source=gbs_api","authors":["Upom Malik","Matt Goldwasser","Benjamin Johnston"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4fnJDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Build well-structured, testable applications and APIs using hapi.js About This Book With the help of this book, you will improve your productivity as a developer and that of your team by focusing on business logic utilizing the structure that Hapi.js provides You will be introduced to a real-world problem and we'll demonstrate how to use the tools Hapi provides to resolve it This is the only book with a learn-by-example approach Who This Book Is For If you are a JavaScript developer with or without Node.js experience and would like to learn to build applications, APIs, and web servers with the best-in-class framework hapi.js, this book is perfect for you. What You Will Learn Increase your productivity by taking advantage of the out-of-the-box features hapi.js provides Build secure API servers Create websites and applications using your favorite templating language Leverage hapi.js plugins to better structure your codebase Simplify your security workflows with the built-in authentication and authorization functionality of hapi.js Ensure application reliability with testing and code coverage Reduce code complexity using reusable validation logic with joi Gather insight into your application performance via logging Start the journey to building robust production-ready applications In Detail This book will introduce hapi.js and walk you through the creation of your first working application using the out-of-the-box features hapi.js provides. Packed with real-world problems and examples, this book introduces some of the basic concepts of hapi.js and Node.js and takes you through the typical journey you'll face when developing an application. Starting with easier concepts such as routing requests, building APIs serving JSON, using templates to build websites and applications, and connecting databases, we then move on to more complex problems such as authentication, model validation, caching, and techniques for structuring your codebase to scale gracefully. You will also develop skills to ensure your application's reliability through testing, code coverage, and logging. By the end of this book, you'll be equipped with all the skills you need to build your first fully featured application. This book will be invaluable if you are investigating Node.js frameworks or planning on using hapi.js in your next project. Style and approach This book takes a step-by-step approach to building an application or web server using hapi.js though examples.","language":"en","currency":"USD","id":"1785889680","title":"Getting Started with hapi.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4fnJDAAAQBAJ&source=gbs_api","authors":["John Brett"]},{"pageCount":501,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dVJvr8PtCMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"* Treats LISP as a language for commercial applications, not a language for academic AI concerns. This could be considered to be a secondary text for the Lisp course that most schools teach . This would appeal to students who sat through a LISP course in college without quite getting it – so a \"nostalgia\" approach, as in \"wow-lisp can be practical...\" * Discusses the Lisp programming model and environment. Contains an introduction to the language and gives a thorough overview of all of Common Lisp’s main features. * Designed for experienced programmers no matter what languages they may be coming from and written for a modern audience—programmers who are familiar with languages like Java, Python, and Perl. * Includes several examples of working code that actually does something useful like Web programming and database access.","language":"en","currency":"USD","id":"1430200170","title":"Practical Common Lisp","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dVJvr8PtCMUC&source=gbs_api","authors":["Peter Seibel"]},{"pageCount":625,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q4fkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":111.2,"subtitle":null,"description":"The primary audience for this book are advanced undergraduate students and graduate students. Computer architecture, as it happened in other fields such as electronics, evolved from the small to the large, that is, it left the realm of low-level hardware constructs, and gained new dimensions, as distributed systems became the keyword for system implementation. As such, the system architect, today, assembles pieces of hardware that are at least as large as a computer or a network router or a LAN hub, and assigns pieces of software that are self-contained, such as client or server programs, Java applets or pro tocol modules, to those hardware components. The freedom she\/he now has, is tremendously challenging. The problems alas, have increased too. What was before mastered and tested carefully before a fully-fledged mainframe or a closely-coupled computer cluster came out on the market, is today left to the responsibility of computer engineers and scientists invested in the role of system architects, who fulfil this role on behalf of software vendors and in tegrators, add-value system developers, R&D institutes, and final users. As system complexity, size and diversity grow, so increases the probability of in consistency, unreliability, non responsiveness and insecurity, not to mention the management overhead. What System Architects Need to Know The insight such an architect must have includes but goes well beyond, the functional properties of distributed systems.","language":"en","currency":"USD","id":"1461516633","title":"Distributed Systems for System Architects","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q4fkBwAAQBAJ&source=gbs_api","authors":["Paulo Veríssimo","Luís Rodrigues"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RfSeDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Building Standardized Systems Across an Engineering Organization","description":"One of the biggest challenges for organizations that have adopted microservice architecture is the lack of architectural, operational, and organizational standardization. After splitting a monolithic application or building a microservice ecosystem from scratch, many engineers are left wondering what’s next. In this practical book, author Susan Fowler presents a set of microservice standards in depth, drawing from her experience standardizing over a thousand microservices at Uber. You’ll learn how to design microservices that are stable, reliable, scalable, fault tolerant, performant, monitored, documented, and prepared for any catastrophe. Explore production-readiness standards, including: Stability and Reliability: develop, deploy, introduce, and deprecate microservices; protect against dependency failures Scalability and Performance: learn essential components for achieving greater microservice efficiency Fault Tolerance and Catastrophe Preparedness: ensure availability by actively pushing microservices to fail in real time Monitoring: learn how to monitor, log, and display key metrics; establish alerting and on-call procedures Documentation and Understanding: mitigate tradeoffs that come with microservice adoption, including organizational sprawl and technical debt","language":"en","currency":"USD","id":"1491965924","title":"Production-Ready Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RfSeDQAAQBAJ&source=gbs_api","authors":["Susan J. Fowler"]},{"pageCount":637,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oy3RDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"This book is designed to help newcomers and experienced users alike learn about Kubernetes. Its chapters are designed to introduce core Kubernetes concepts and to build on them to a level where running an application on a production cluster is a familiar, repeatable, and automated process. From there, more advanced topics are introduced, like how to manage a Kubernetes cluster itself.","language":"en","currency":"USD","id":"0999773038","title":"Kubernetes for Full-Stack Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oy3RDwAAQBAJ&source=gbs_api","authors":[]},{"pageCount":664,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zSOzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Fast-track your web development career using the powerful features of advanced JavaScript","description":"Develop your JavaScript programming skills by learning strategies and techniques commonly used in modern full-stack application development Key Features Write and deploy full-stack applications efficiently with JavaScript Delve into JavaScript’s multiple programming paradigms Get up to speed with core concepts such as modularity and functional programming to write efficient code Book Description In depth knowledge of JavaScript makes it easier to learn a variety of other frameworks, including React, Angular, and related tools and libraries. This book is designed to help you cover the core JavaScript concepts you need to build modern applications. You'll start by learning how to represent an HTML document in the Document Object Model (DOM). Then, you'll combine your knowledge of the DOM and Node.js to create a web scraper for practical situations. As you read through further lessons, you'll create a Node.js-based RESTful API using the Express library for Node.js. You'll also understand how modular designs can be used for better reusability and collaboration with multiple developers on a single project. Later lessons will guide you through building unit tests, which ensure that the core functionality of your program is not affected over time. The book will also demonstrate how constructors, async\/await, and events can load your applications quickly and efficiently. Finally, you'll gain useful insights into functional programming concepts such as immutability, pure functions, and higher-order functions. By the end of this book, you'll have the skills you need to tackle any real-world JavaScript development problem using a modern JavaScript approach, both for the client and server sides. What you will learn Apply the core concepts of functional programming Build a Node.js project that uses the Express.js library to host an API Create unit tests for a Node.js project to validate it Use the Cheerio library with Node.js to create a basic web scraper Develop a React interface to build processing flows Use callbacks as a basic way to bring control back Who this book is for If you want to advance from being a frontend developer to a full-stack developer and learn how Node.js can be used for hosting full-stack applications, this is an ideal book for you. After reading this book, you'll be able to write better JavaScript code and learn about the latest trends in the language. To easily grasp the concepts explained here, you should know the basic syntax of JavaScript and should've worked with popular frontend libraries such as jQuery. You should have also used JavaScript with HTML and CSS but not necessarily Node.js.","language":"en","currency":"USD","id":"1838822755","title":"Professional JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zSOzDwAAQBAJ&source=gbs_api","authors":["Hugo Di Francesco","Siyuan Gao","Vinicius Isola","Philip Kirkbride"]},{"pageCount":592,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YSCTDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"Scrape, Clean, Explore & Transform Your Data","description":"Learn how to turn raw data into rich, interactive web visualizations with the powerful combination of Python and JavaScript. With this hands-on guide, author Kyran Dale teaches you how build a basic dataviz toolchain with best-of-breed Python and JavaScript libraries—including Scrapy, Matplotlib, Pandas, Flask, and D3—for crafting engaging, browser-based visualizations. As a working example, throughout the book Dale walks you through transforming Wikipedia’s table-based list of Nobel Prize winners into an interactive visualization. You’ll examine steps along the entire toolchain, from scraping, cleaning, exploring, and delivering data to building the visualization with JavaScript’s D3 library. If you’re ready to create your own web-based data visualizations—and know either Python or JavaScript— this is the book for you. Learn how to manipulate data with Python Understand the commonalities between Python and JavaScript Extract information from websites by using Python’s web-scraping tools, BeautifulSoup and Scrapy Clean and explore data with Python’s Pandas, Matplotlib, and Numpy libraries Serve data and create RESTful web APIs with Python’s Flask framework Create engaging, interactive web visualizations with JavaScript’s D3 library","language":"en","currency":"USD","id":"149192053X","title":"Data Visualization with Python and JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YSCTDAAAQBAJ&source=gbs_api","authors":["Kyran Dale"]},{"pageCount":394,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fEqgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Developing Open Serverless Solutions","description":"Serverless computing greatly simplifies software development. Your team can focus solely on your application while the cloud provider manages the servers you need. This practical guide shows you step-by-step how to build and deploy complex applications in a flexible multicloud, multilanguage environment using Apache OpenWhisk. You’ll learn how this platform enables you to pursue a vendor-independent approach using preconfigured containers, microservices, and Kubernetes as your cloud operating system. Michele Sciabarrà demonstrates how to build a serverless application using classical design patterns and the programming language or languages that best fit your task. You’ll start by building a simple serverless application hands-on before diving into the more complex aspects of the OpenWhisk platform. Examine how OpenWhisk’s serverless architecture works, including the use of packages, actions, sequences, triggers, rules, and feeds Learn how OpenWhisk compares to existing architectures, such as Java Enterprise Edition Manipulate OpenWhisk features using the command-line interface or a JavaScript API Design applications using common Gang of Four design patterns Use architectural design patterns such as model-view-controller to combine several OpenWhisk actions Learn how to test and debug your code in a serverless environment","language":"en","currency":"USD","id":"1492046124","title":"Learning Apache OpenWhisk","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fEqgDwAAQBAJ&source=gbs_api","authors":["Michele Sciabarrà"]},{"pageCount":796,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KSyBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Get hands-on with Python Programming and Django web development","description":"A comprehensive guide to Python programming for web development using the most popular Python web framework - Django Key Features Learn the fundamentals of programming with Python and building web apps Build web applications from scratch with Django Create real-world RESTful web services with the latest Django framework Book Description If you want to develop complete Python web apps with Django, this Learning Path is for you. It will walk you through Python programming techniques and guide you in implementing them when creating 4 professional Django projects, teaching you how to solve common problems and develop RESTful web services with Django and Python. You will learn how to build a blog application, a social image bookmarking website, an online shop, and an e-learning platform. Learn Web Development with Python will get you started with Python programming techniques, show you how to enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. Last but not least, you’ll learn the best practices for creating real-world applications. By the end of this Learning Path, you will have a full understanding of how Django works and how to use it to build web applications from scratch. This Learning Path includes content from the following Packt products: Learn Python Programming by Fabrizio Romano Django RESTful Web Services by Gastón C. Hillar Django Design Patterns and Best Practices by Arun Ravindran What you will learn Explore the fundamentals of Python programming with interactive projects Grasp essential coding concepts along with the basics of data structures and control flow Develop RESTful APIs from scratch with Django and the Django REST Framework Create automated tests for RESTful web services Debug, test, and profile RESTful web services with Django and the Django REST Framework Use Django with other technologies such as Redis and Celery Who this book is for If you have little experience in coding or Python and want to learn how to build full-fledged web apps, this Learning Path is for you. No prior experience with RESTful web services, Python, or Django is required, but basic Python programming experience is needed to understand the concepts covered.","language":"en","currency":"USD","id":"1789950880","title":"Learn Web Development with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KSyBDwAAQBAJ&source=gbs_api","authors":["Fabrizio Romano","Gaston C. Hillar","Arun Ravindran"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Discover over 65 recipes to help you create breathtaking data visualizations using the latest features of D3 About This Book Learn about D3 4.0 from the inside out and master its new features Utilize D3 packages to generate graphs, manipulate data, and create beautiful presentations Solve real-world visualization problems with the help of practical recipes Who This Book Is For If you are a developer familiar with HTML, CSS, and JavaScript, and you wish to get the most out of D3, then this book is for you. This book can serve as a desktop quick-reference guide for experienced data visualization developers. You'll also find this book useful if you're a D3 user who wants to take advantage of the new features introduced in D3 4.0. You should have previous experience with D3. What You Will Learn Get a solid understanding of the D3 fundamentals and idioms Use D3 to load, manipulate, and map data to any kind of visual representation on the web Create data-driven dynamic visualizations that update as the data does Leverage the various modules provided by D3 to create sophisticated, dynamic, and interactive charts and graphics Create data-driven transitions and animations within your visualizations Understand and leverage more advanced concepts such as force, touch, and Geo data visualizations In Detail This book gives you all the guidance you need to start creating modern data visualizations with D3 4.x that take advantage of the latest capabilities of JavaScript. The book starts with the basic D3 structure and building blocks and quickly moves on to writing idiomatic D3-style JavaScript code. You will learn how to work with selection to target certain visual elements on the page, then you will see techniques to represent data both in programming constructs and its visual metaphor. You will learn how map values in your data domain to the visual domain using scales, and use the various shape functions supported by D3 to create SVG shapes in visualizations. Moving on, you'll see how to use and customize various D3 axes and master transition to add bells and whistles to otherwise dry visualizations. You'll also learn to work with charts, hierarchy, graphs, and build interactive visualizations. Next you'll work with Force, which is one of the most awe-inspiring techniques you can add to your visualizations, and you'll implement a fully functional Choropleth map (a special purpose colored map) in D3. Finally, you'll learn to unit test data visualization code and test-driven development in a visualization project so you know how to produce high-quality D3 code. Style and approach This step-by-step guide to mastering data visualizations with D3 will help you create amazing data visualizations with professional efficiency and precision. It is a solution-based guide in which you learn through practical recipes, illustrations, and code samples.","language":"en","currency":"USD","id":"1786469960","title":"Data Visualization with D3 4.x Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DVQoDwAAQBAJ&source=gbs_api","authors":["Nick Zhu"]},{"pageCount":208,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YIgdrqKZzYMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":null,"description":"The Definitive Guide to HTML5 WebSocket is the ultimate insider’s WebSocket resource. This revolutionary new web technology enables you to harness the power of true real-time connectivity and build responsive, modern web applications. This book contains everything web developers and architects need to know about WebSocket. It discusses how WebSocket-based architectures provide a dramatic reduction in unnecessary network overhead and latency compared to older HTTP (Ajax) architectures, how to layer widely used protocols such as XMPP and STOMP on top of WebSocket, and how to secure WebSocket connections and deploy WebSocket-based applications to the enterprise. Build real-time web applications with HTML5. This book: Introduces you to the WebSocket API and protocol Describes and provides real-world examples of protocol communication over WebSocket Explains WebSocket security and enterprise deployment","language":"en","currency":"USD","id":"143024741X","title":"The Definitive Guide to HTML5 WebSocket","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YIgdrqKZzYMC&source=gbs_api","authors":["Vanessa Wang","Frank Salim","Peter Moskovits"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Q9B5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Making the Right Decisions in an Evolving Landscape","description":"A lot of work is required to release an API, but the effort doesn’t always pay off. Overplanning before an API matures is a wasted investment, while underplanning can lead to disaster. This practical guide provides maturity models for individual APIs and multi-API landscapes to help you invest the right human and company resources for the right maturity level at the right time. How do you balance the desire for agility and speed with the need for robust and scalable operations? Four experts from the API Academy show software architects, program directors, and product owners how to maximize the value of their APIs by managing them as products through a continuous life cycle. Learn which API decisions you need to govern and how and where to do so Design, deploy, and manage APIs using an API-as-a-product (AaaP) approach Examine ten pillars that form the foundation of API product work Learn how the continuous improvement model governs changes throughout an API’s lifetime Explore the five stages of a complete API product life cycle Delve into team roles needed to design, build, and maintain your APIs Learn how to manage your API landscape—the set of APIs published by your organization","language":"en","currency":"USD","id":"1492043508","title":"Continuous API Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Q9B5DwAAQBAJ&source=gbs_api","authors":["Mehdi Medjaoui","Erik Wilde","Ronnie Mitra","Mike Amundsen"]},{"pageCount":1272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rnPiKXCRciMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":null,"description":"A comprehensive guide to programming for Access 2010 and 2007 Millions of people use the Access database applications, and hundreds of thousands of developers work with Access daily. Access 2010 brings better integration with SQL Server and enhanced XML support; this Wrox guide shows developers how to take advantage of these and other improvements. With in-depth coverage of VBA, macros, and other programming methods for building Access applications, this book also provides real-world code examples to demonstrate each topic. Access 2010 Programmer's Referenceis a comprehensive guide to the best-of-breed techniques for programming Access applications. Coverage Includes: Introduction to Microsoft Access 2010 New Features Upgrading and Converting to Access 2010 Macros in Access 2010 Using the VBA Editor VBA Basics Using VBA in Access Creating Classes in VBA Extending VBA with APIs Working with the Windows Registry Using DAO to Access Data Using ADO to Access Data Using SQL with VBA Using VBA to Enhance Forms Enhancing Reports with VBA Customizing the Ribbon Customizing the Office Backstage Working with Office 2010 Working with SharePoint Working with .NET Building Client-Server Applications with Access The Access 2010 Templates Access Runtime Deployment Database Security Access 2010 Security Features","language":"en","currency":"USD","id":"9780470938966","title":"Access 2010 Programmer's Reference","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rnPiKXCRciMC&source=gbs_api","authors":["Teresa Hennig","Rob Cooper","Geoffrey L. Griffith","Jerry Dennison"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EXfcAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.89,"subtitle":null,"description":"The C++11 standard allows programmers to express ideas more clearly, simply, and directly, and to write faster, more efficient code. Bjarne Stroustrup, the designer and original implementer of C++, thoroughly covers the details of this language and its use in his definitive reference, The C++ Programming Language, Fourth Edition. In A Tour of C++ , Stroustrup excerpts the overview chapters from that complete reference, expanding and enhancing them to give an experienced programmer–in just a few hours–a clear idea of what constitutes modern C++. In this concise, self-contained guide, Stroustrup covers most major language features and the major standard-library components–not, of course, in great depth, but to a level that gives programmers a meaningful overview of the language, some key examples, and practical help in getting started. Stroustrup presents the C++ features in the context of the programming styles they support, such as object-oriented and generic programming. His tour is remarkably comprehensive. Coverage begins with the basics, then ranges widely through more advanced topics, including many that are new in C++11, such as move semantics, uniform initialization, lambda expressions, improved containers, random numbers, and concurrency. The tour ends with a discussion of the design and evolution of C++ and the extensions added for C++11. This guide does not aim to teach you how to program (see Stroustrup’s Programming: Principles and Practice Using C++ for that); nor will it be the only resource you’ll need for C++ mastery (see Stroustrup’s The C++ Programming Language, Fourth Edition, for that). If, however, you are a C or C++ programmer wanting greater familiarity with the current C++ language, or a programmer versed in another language wishing to gain an accurate picture of the nature and benefits of modern C++, you can’t find a shorter or simpler introduction than this tour provides.","language":"en","currency":"USD","id":"0133549003","title":"A Tour of C++","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EXfcAAAAQBAJ&source=gbs_api","authors":["Bjarne Stroustrup"]},{"pageCount":400,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gVQnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Guide to the ISTQB Expert Level Certification","description":"This book covers the ISTQB Expert Level Test Manager syllabus and is a complete, one-stop preparation guide for the reader who is otherwise qualified (based on experience as a test manager) to take the Expert Level Test Manager exam. Included are extensive hands-on exercises and sample exam questions that comply with ISTQB standards for Expert Level exams. p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Verdana; min-height: 13.0px} The ISTQB certification program is the leading software tester certification program in the world. With more than 500,000 certificates issued and a global presence in 70 countries, you can be confident in the value and international stature that the ISTQB Expert Level certificate can offer you.","language":"en","currency":"USD","id":"1681983184","title":"The Expert Test Manager","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gVQnDwAAQBAJ&source=gbs_api","authors":["Rex Black","James L. Rommens","Leo Van Der Aalst"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xTpUCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"A General Management Perspective","description":"Business Intelligence Strategy and Big Data Analytics is written for business leaders, managers, and analysts - people who are involved with advancing the use of BI at their companies or who need to better understand what BI is and how it can be used to improve profitability. It is written from a general management perspective, and it draws on observations at 12 companies whose annual revenues range between $500 million and $20 billion. Over the past 15 years, my company has formulated vendor-neutral business-focused BI strategies and program execution plans in collaboration with manufacturers, distributors, retailers, logistics companies, insurers, investment companies, credit unions, and utilities, among others. It is through these experiences that we have validated business-driven BI strategy formulation methods and identified common enterprise BI program execution challenges. In recent years, terms like “big data” and “big data analytics” have been introduced into the business and technical lexicon. Upon close examination, the newer terminology is about the same thing that BI has always been about: analyzing the vast amounts of data that companies generate and\/or purchase in the course of business as a means of improving profitability and competitiveness. Accordingly, we will use the terms BI and business intelligence throughout the book, and we will discuss the newer concepts like big data as appropriate. More broadly, the goal of this book is to share methods and observations that will help companies achieve BI success and thereby increase revenues, reduce costs, or both. Provides ideas for improving the business performance of one’s company or business functions Emphasizes proven, practical, step-by-step methods that readers can readily apply in their companies Includes exercises and case studies with road-tested advice about formulating BI strategies and program plans","language":"en","currency":"USD","id":"0128094893","title":"Business Intelligence Strategy and Big Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xTpUCwAAQBAJ&source=gbs_api","authors":["Steve Williams"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8lHVFeJ6EQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"In modern computing a program is usually distributed among several processes. The fundamental challenge when developing reliable and secure distributed programs is to support the cooperation of processes required to execute a common task, even when some of these processes fail. Failures may range from crashes to adversarial attacks by malicious processes. Cachin, Guerraoui, and Rodrigues present an introductory description of fundamental distributed programming abstractions together with algorithms to implement them in distributed systems, where processes are subject to crashes and malicious attacks. The authors follow an incremental approach by first introducing basic abstractions in simple distributed environments, before moving to more sophisticated abstractions and more challenging environments. Each core chapter is devoted to one topic, covering reliable broadcast, shared memory, consensus, and extensions of consensus. For every topic, many exercises and their solutions enhance the understanding This book represents the second edition of \"Introduction to Reliable Distributed Programming\". Its scope has been extended to include security against malicious actions by non-cooperating processes. This important domain has become widely known under the name \"Byzantine fault-tolerance\".","language":"en","currency":"USD","id":"9783642152603","title":"Introduction to Reliable and Secure Distributed Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8lHVFeJ6EQC&source=gbs_api","authors":["Christian Cachin","Rachid Guerraoui","Luís Rodrigues"]},{"pageCount":378,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ug9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Design and Deploy Production-Ready Software","description":"A single dramatic software failure can cost a company millions of dollars - but can be avoided with simple changes to design and architecture. This new edition of the best-selling industry standard shows you how to create systems that run longer, with fewer failures, and recover better when bad things happen. New coverage includes DevOps, microservices, and cloud-native architecture. Stability antipatterns have grown to include systemic problems in large-scale systems. This is a must-have pragmatic guide to engineering for production systems. If you're a software developer, and you don't want to get alerts every night for the rest of your life, help is here. With a combination of case studies about huge losses - lost revenue, lost reputation, lost time, lost opportunity - and practical, down-to-earth advice that was all gained through painful experience, this book helps you avoid the pitfalls that cost companies millions of dollars in downtime and reputation. Eighty percent of project life-cycle cost is in production, yet few books address this topic. This updated edition deals with the production of today's systems - larger, more complex, and heavily virtualized - and includes information on chaos engineering, the discipline of applying randomness and deliberate stress to reveal systematic problems. Build systems that survive the real world, avoid downtime, implement zero-downtime upgrades and continuous delivery, and make cloud-native applications resilient. Examine ways to architect, design, and build software - particularly distributed systems - that stands up to the typhoon winds of a flash mob, a Slashdotting, or a link on Reddit. Take a hard look at software that failed the test and find ways to make sure your software survives. To skip the pain and get the experience...get this book.","language":"en","currency":"USD","id":"1680504525","title":"Release It!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ug9QDwAAQBAJ&source=gbs_api","authors":["Michael T. Nygard"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CL8tBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Using REST, WebSockets, and Backbone","description":"How can you take advantage of the Django framework to integrate complex client-side interactions and real-time features into your web applications? Through a series of rapid application development projects, this hands-on book shows experienced Django developers how to include REST APIs, WebSockets, and client-side MVC frameworks such as Backbone.js into new or existing projects. Learn how to make the most of Django’s decoupled design by choosing the components you need to build the lightweight applications you want. Once you finish this book, you’ll know how to build single-page applications that respond to interactions in real time. If you’re familiar with Python and JavaScript, you’re good to go. Learn a lightweight approach for starting a new Django project Break reusable applications into smaller services that communicate with one another Create a static, rapid prototyping site as a scaffold for websites and applications Build a REST API with django-rest-framework Learn how to use Django with the Backbone.js MVC framework Create a single-page web application on top of your REST API Integrate real-time features with WebSockets and the Tornado networking library Use the book’s code-driven examples in your own projects","language":"en","currency":"USD","id":"1491946296","title":"Lightweight Django","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CL8tBQAAQBAJ&source=gbs_api","authors":["Julia Elman","Mark Lavin"]},{"pageCount":275,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9qR5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Creating Reusable Software Components","description":"Apply design principles to your classes, preparing them for reuse. You will use package design principles to create packages that are just right in terms of cohesion and coupling, and are user- and maintainer-friendly at the same time. The first part of this book walks you through the five SOLID principles that will help you improve the design of your classes. The second part introduces you to the best practices of package design, and covers both package cohesion principles and package coupling principles. Cohesion principles show you which classes should be put together in a package, when to split packages, and if a combination of classes may be considered a \"package\" in the first place. Package coupling principles help you choose the right dependencies and prevent wrong directions in the dependency graph of your packages. What You'll Learn Apply the SOLID principles of class design Determine if classes belong in the same package Know whether it is safe for packages to depend on each other Who This Book Is For Software developers with a broad range of experience in the field, who are looking for ways to reuse,share, and distribute their code","language":"en","currency":"USD","id":"1484241193","title":"Principles of Package Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9qR5DwAAQBAJ&source=gbs_api","authors":["Matthias Noback"]},{"pageCount":254,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RUjnAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Robust Web Architecture with Node, HTML5, and Modern JS Libraries","description":"Take advantage of JavaScript’s power to build robust web-scale or enterprise applications that are easy to extend and maintain. By applying the design patterns outlined in this practical book, experienced JavaScript developers will learn how to write flexible and resilient code that’s easier—yes, easier—to work with as your code base grows. JavaScript may be the most essential web programming language, but in the real world, JavaScript applications often break when you make changes. With this book, author Eric Elliott shows you how to add client- and server-side features to a large JavaScript application without negatively affecting the rest of your code. Examine the anatomy of a large-scale JavaScript application Build modern web apps with the capabilities of desktop applications Learn best practices for code organization, modularity, and reuse Separate your application into different layers of responsibility Build efficient, self-describing hypermedia APIs with Node.js Test, integrate, and deploy software updates in rapid cycles Control resource access with user authentication and authorization Expand your application’s reach through internationalization","language":"en","currency":"USD","id":"1491950250","title":"Programming JavaScript Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RUjnAwAAQBAJ&source=gbs_api","authors":["Eric Elliott"]},{"pageCount":132,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4FB7AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.74,"subtitle":"Taming Callback Hell with Deferreds and Promises","description":"Orchestrating asynchronous function calls in JavaScript often leads to callback hell, but there is a reliable way to avoid this painful state of affairs. With this concise and simple guide, you’ll learn how to use jQuery deferreds and promises, an elegant approach for managing asynchronous calls in both client and server applications. This book contains 18 examples that use deferreds to solve progressively challenging real-world programming problems, along with 75 stimulating puzzles (and their solutions) that will help you understand how and when to use deferreds. Experienced JavaScript programmers will learn new tricks in a fun way, and become immersed in the practice of event-based programming. Understand the logic behind creating deferreds and returning promises Get a structured explanation of jQuery’s deferred API Delve into the dynamics of using deferreds Explore a broad collection of useful deferred recipes developed by the authors Gain hands-on experience by solving challenges that accompany each recipe Go deeper into deferreds: encounter novel abstractions and mind-bending use cases","language":"en","currency":"USD","id":"1449369359","title":"Learning jQuery Deferreds","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4FB7AgAAQBAJ&source=gbs_api","authors":["Terry Jones","Nicholas H. Tollervey"]},{"pageCount":432,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DFnOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":"Techniques to Analyze and Visualize Streaming Data","description":"Construct a robust end-to-end solution for analyzing andvisualizing streaming data Real-time analytics is the hottest topic in data analyticstoday. In Real-Time Analytics: Techniques to Analyze andVisualize Streaming Data, expert Byron Ellis teaches dataanalysts technologies to build an effective real-time analyticsplatform. This platform can then be used to make sense of theconstantly changing data that is beginning to outpace traditionalbatch-based analysis platforms. The author is among a very few leading experts in the field. Hehas a prestigious background in research, development, analytics,real-time visualization, and Big Data streaming and is uniquelyqualified to help you explore this revolutionary field. Moving froma description of the overall analytic architecture of real-timeanalytics to using specific tools to obtain targeted results,Real-Time Analytics leverages open source and moderncommercial tools to construct robust, efficient systems that canprovide real-time analysis in a cost-effective manner. The bookincludes: A deep discussion of streaming data systems andarchitectures Instructions for analyzing, storing, and delivering streamingdata Tips on aggregating data and working with sets Information on data warehousing options and techniques Real-Time Analytics includes in-depth case studies forwebsite analytics, Big Data, visualizing streaming and mobile data,and mining and visualizing operational data flows. The book's\"recipe\" layout lets readers quickly learn and implement differenttechniques. All of the code examples presented in the book, alongwith their related data sets, are available on the companionwebsite.","language":"en","currency":"USD","id":"1118838025","title":"Real-Time Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DFnOAwAAQBAJ&source=gbs_api","authors":["Byron Ellis"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n1nTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you're an application developer familiar with SQL databases such as MySQL or Postgres, and you want to explore distributed databases such as Cassandra, this is the perfect guide for you. Even if you've never worked with a distributed database before, Cassandra's intuitive programming interface coupled with the step-by-step examples in this book will have you building highly scalable persistence layers for your applications in no time.","language":"en","currency":"USD","id":"1783989211","title":"Learning Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n1nTBgAAQBAJ&source=gbs_api","authors":["Mat Brown"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SwLVBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":null,"description":"CCNP Routing and Switching Portable Command Guide All ROUTE (300-101) and SWITCH (300-115) Commands in One Compact, Portable Resource Preparing for the CCNP® ROUTE or CCNP SWITCH exam? Working as a network professional? Here are all the CCNP-level commands you’ll need, in one handy resource. The CCNP Routing and Switching Portable Command Guide is filled with valuable, easy-to-access information, and it’s portable enough to use whether you’re in the server room or the equipment closet. This guide helps you memorize commands and concepts as you prepare to pass the CCNP ROUTE (300-101) or CCNP SWITCH (300-115) exams. It summarizes all CCNP certification-level Cisco IOS® Software commands, keywords, command arguments, and associated prompts, offering tips and examples for applying them in real-world environments. Throughout, configuration examples deepen your understanding of how these commands are used in actual network designs. Whenever you’re researching routing or switching solutions, you won’t find a quicker, more useful offline resource. --Logical “how-to” topic groupings inside the front and back covers provide one-stop research --Compact size makes it easy to carry with you, wherever you go --Helps you review important commands before taking the CCNP ROUTE or CCNP SWITCH certification exam --“Create Your Own Journal” appendix with blank, lined pages enables you to personalize the book for your own needs --“What Do You Want to Do?” chart inside front and back covers helps you to quickly reference specific tasks","language":"en","currency":"USD","id":"0133990893","title":"CCNP Routing and Switching Portable Command Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SwLVBQAAQBAJ&source=gbs_api","authors":["Scott Empson","Patrick Gargano","Hans Roth"]},{"pageCount":170,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EVvTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"This book is for those application developers who want to achieve greater flexibility and scalability from their software. Whether you are familiar with other NoSQL databases or have only used relational systems, this book will provide you with enough background to move you along at your own pace. If you are new to NoSQL document databases, the design discussions and introductory material will give you the information you need to get started with Couchbase.","language":"en","currency":"USD","id":"1784397857","title":"Couchbase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EVvTBgAAQBAJ&source=gbs_api","authors":["John Zablocki"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OXpzPr1C4o4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Nmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities. \"Nmap 6: Network exploration and security auditing cookbook\" will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts. \"Nmap 6: Network exploration and security auditing cookbook\" is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system. The book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.","language":"en","currency":"USD","id":"1849517495","title":"Nmap 6: Network Exploration and Security Auditing Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OXpzPr1C4o4C&source=gbs_api","authors":["Paulino Calderon Pale"]},{"pageCount":178,"thumbnail":"http:\/\/books.google.com\/books\/content?id=u1bTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":13.94,"subtitle":null,"description":"If you are a Hadoop programmer who wants to learn about Flume to be able to move datasets into Hadoop in a timely and replicable manner, then this book is ideal for you. No prior knowledge about Apache Flume is necessary, but a basic knowledge of Hadoop and the Hadoop File System (HDFS) is assumed.","language":"en","currency":"USD","id":"1784399140","title":"Apache Flume: Distributed Log Collection for Hadoop - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=u1bTBgAAQBAJ&source=gbs_api","authors":["Steve Hoffman"]},{"pageCount":216,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5PGuBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.59,"subtitle":null,"description":"Sams Teach Yourself Gmail in 10 Minutes, Second Edition , gives you straightforward, practical answers when you need fast results. Work through its 10-minute lessons to make the most of the world’s most powerful and popular email system! This book will show you how to send and receive email from any web browser or smartphone using Gmail. You’ll learn how to send pictures and other file attachments, add a signature to your outgoing messages, and customize Gmail for your own personal use. You’ll even learn how to create and organize your Gmail contacts! Tips point out shortcuts and solutions. Cautions help you avoid common pitfalls. Notes provide additional information. 10 minutes is all you need to learn how to... Create, send, receive, read, forward, and reply to emails Format your email to be more attractive--and effective Include pictures, web links, and file attachments Add an email signature to all your messages Organize stored messages and flag important ones Work with Gmail offline Store information about people, businesses, and organizations Automate how Gmail handles specific messages Use Vacation Responder to tell contacts you’re away Customize Gmail’s appearance and behavior Deal with annoying spam Participate in free Hangout video chats Use Gmail on your smartphone or tablet","language":"en","currency":"USD","id":"0133798666","title":"Gmail in 10 Minutes, Sams Teach Yourself","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5PGuBAAAQBAJ&source=gbs_api","authors":["Michael R. Miller"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OWQdAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Distributed Process Coordination","description":"Building distributed applications is difficult enough without having to coordinate the actions that make them work. This practical guide shows how Apache ZooKeeper helps you manage distributed systems, so you can focus mainly on application logic. Even with ZooKeeper, implementing coordination tasks is not trivial, but this book provides good practices to give you a head start, and points out caveats that developers and administrators alike need to watch for along the way. In three separate sections, ZooKeeper contributors Flavio Junqueira and Benjamin Reed introduce the principles of distributed systems, provide ZooKeeper programming techniques, and include the information you need to administer this service. Learn how ZooKeeper solves common coordination tasks Explore the ZooKeeper API’s Java and C implementations and how they differ Use methods to track and react to ZooKeeper state changes Handle failures of the network, application processes, and ZooKeeper itself Learn about ZooKeeper’s trickier aspects dealing with concurrency, ordering, and configuration Use the Curator high-level interface for connection management Become familiar with ZooKeeper internals and administration tools","language":"en","currency":"USD","id":"1449361269","title":"ZooKeeper","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OWQdAgAAQBAJ&source=gbs_api","authors":["Flavio Junqueira","Benjamin Reed"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XaDNBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"Learning Heroku Postgres is targeted at developers and database admins. Even if you're new to Heroku Postgres, you'll be able to master both the basic as well as advanced features of Heroku Postgres. Since Heroku Postgres is incredibly user-friendly, no previous experience in computer coding or programming is required.","language":"en","currency":"USD","id":"1782173463","title":"Learning Heroku Postgres","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XaDNBgAAQBAJ&source=gbs_api","authors":["Patrick Espake"]},{"pageCount":362,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ecJqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Enterprise Developer Handbook","description":"Get up to speed on the principal technologies in the Java Platform, Enterprise Edition 7, and learn how the latest version embraces HTML5, focuses on higher productivity, and provides functionality to meet enterprise demands. Written by Arun Gupta, a key member of the Java EE team, this book provides a chapter-by-chapter survey of several Java EE 7 specifications, including WebSockets, Batch Processing, RESTful Web Services, and Java Message Service. You’ll also get self-paced instructions for building an end-to-end application with many of the technologies described in the book, which will help you understand the design patterns vital to Java EE development. Understand the key components of the Java EE platform, with easy-to-understand explanations and extensive code samples Examine all the new components that have been added to Java EE 7 platform, such as WebSockets, JSON, Batch, and Concurrency Learn about RESTful Web Services, SOAP XML-based messaging protocol, and Java Message Service Explore Enterprise JavaBeans, Contexts and Dependency Injection, and the Java Persistence API Discover how different components were updated from Java EE 6 to Java EE 7","language":"en","currency":"USD","id":"1449370608","title":"Java EE 7 Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ecJqAAAAQBAJ&source=gbs_api","authors":["Arun Gupta"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U1RwBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Covering 14.10 and 15.04","description":"Ubuntu Unleashed 2015 Edition is filled with unique and advanced information for everyone who wants to make the most of the Linux-based Ubuntu operating system. This new edition has been thoroughly revised and updated by a long-time Ubuntu community leader to reflect the exciting new Ubuntu 14.10 while including tons of information that will continue to apply to future editions. Former Ubuntu Forum administrator Matthew Helmke covers all you need to know about Ubuntu 14.10 installation, configuration, productivity, multimedia, development, system administration, server operations, networking, virtualization, security, DevOps, and more–including intermediate-to-advanced techniques you won’t find in any other book. Helmke presents up-to-the-minute introductions to Ubuntu’s key productivity and Web development tools, programming languages, hardware support, and more. You’ll find new or improved coverage of Ubuntu’s Unity interface, various types of servers, software repositories, database options, virtualization and cloud services, development tools, monitoring, troubleshooting, Ubuntu’s push into mobile and other touch screen devices, and much more. Detailed information on how to… Configure and customize the Unity desktop Get started with multimedia and productivity applications, including LibreOffice Manage Linux services, users, and software packages Administer and run Ubuntu from the command line Automate tasks and use shell scripting Provide secure remote access and configure a secure VPN Manage kernels and modules Administer file, print, email, proxy, LDAP, DNS, and HTTP servers (Apache, Nginx, or alternatives) Learn about new options for managing large numbers of servers Work with databases (both SQL and the newest NoSQL alternatives) Get started with virtualization Build a private cloud with Juju and Charms Learn the basics about popular programming languages including Python, PHP, Perl, and new alternatives such as Go and Rust Learn about Ubuntu’s work toward usability on touch-screen and phone devices Ubuntu 14.10 on DVD DVD includes the full Ubuntu 14.10 distribution for 64 bit computers (most desktop and notebooks systems today) as well as the complete LibreOffice office suite and hundreds of additional programs and utilities. Free Kick Start Chapter! Purchase this book and receive a free Ubuntu 15.04 Kick Start chapter after Ubuntu 15.04 is released. See inside back cover for details","language":"en","currency":"USD","id":"0133794067","title":"Ubuntu Unleashed 2015 Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U1RwBQAAQBAJ&source=gbs_api","authors":["Matthew Helmke"]},{"pageCount":174,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3OVrBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"If you are a system administrator who manages multiple servers, then you know how difficult it is to keep your infrastructure in line. If you've been searching for an easier way, this book is for you. No prior experience with SaltStack is required.","language":"en","currency":"USD","id":"1784399019","title":"Learning SaltStack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3OVrBgAAQBAJ&source=gbs_api","authors":["Colton Myers"]},{"pageCount":54,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zRk0IhwCohQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. This Instant book will get you started with vert.x. You will learn everything you need to know to become an independent web application developer.This book is great for developers new to asynchronous programming. It's assumed that you will have some experience in JavaScript and the use of terminal and HTML. Many of the same basic concepts of Node.js can be reused.","language":"en","currency":"USD","id":"1783282924","title":"Instant Vert.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zRk0IhwCohQC&source=gbs_api","authors":["Simone Scarduzio"]},{"pageCount":838,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Fp3jCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"A one-stop guide to the essentials of web development including popular frameworks such as jQuery, Bootstrap, AngularJS, and Node.js About This Book Understand the essential elements of HTML, CSS, and JavaScript, including how and when to use them Walk through three of the best and most popular web development frameworks – jQuery, Bootstrap, and AngularJS References for any function you will need in your day-to-day web development Who This Book Is For This book is perfect for beginners but more advanced web developers will also benefit. Laid out so you can refer to as much or as little as you need to, with this book you can exhaustively explore essential concepts for modern web developers. What You Will Learn Explore detailed explanations of all the major HTML elements and attributes, illustrated with examples Take a deep dive into CSS properties and functions and master their usage Find clear, concise descriptions of JavaScript syntax and expressions Recognize various JavaScript design patterns and learn the basics of JavaScript object-orientated programming Implement the latest ECMAScript 6 for client-side scripting in your web applications Discover new ways to develop your website's front end quickly and easily using Bootstrap Write JavaScript extensibly using jQuery-JavaScript's feature-rich library Delve into the key Node.js modules used in JavaScript server-side programming Access AngularJS 's important modules, controllers, directives, and services quickly In Detail This comprehensive reference guide takes you through each topic in web development and highlights the most popular and important elements of each area. Starting with HTML, you will learn key elements and attributes and how they relate to each other. Next, you will explore CSS pseudo-classes and pseudo-elements, followed by CSS properties and functions. This will introduce you to many powerful and new selectors. You will then move on to JavaScript. This section will not just introduce functions, but will provide you with an entire reference for the language and paradigms. You will discover more about three of the most popular frameworks today—Bootstrap, which builds on CSS, jQuery which builds on JavaScript, and AngularJS, which also builds on JavaScript. Finally, you will take a walk-through Node.js, which is a server-side framework that allows you to write programs in JavaScript. Style and approach This book is an easy-to-follow, comprehensive reference guide. Each topic, function, or element is listed methodically along with parameters, return values, and descriptions. Examples are also included to help you put the concepts to use quickly in the real world.","language":"en","currency":"USD","id":"178355214X","title":"Web Developer's Reference Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Fp3jCwAAQBAJ&source=gbs_api","authors":["Joshua Johanan","Talha Khan","Ricardo Zea"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gUraVwmKTz8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Fast-track your Web application development by harnessing the power of the Yii PHP framework","language":"en","currency":"USD","id":"1847199593","title":"Agile Web Application Development with Yii1.1 and PHP5","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gUraVwmKTz8C&source=gbs_api","authors":["Jeffrey Winesett"]},{"pageCount":409,"thumbnail":"http:\/\/books.google.com\/books\/content?id=P3B_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Building Projects and Applications with Real-Time Capabilities","description":"Learn how to rapidly build your own ecommerce site by applying Django’s battle-tested components. This book demonstrates Django’s features and conventions to help you develop modern web applications quickly. You'll adopt a \"learn by doing\" approach and gain a deeper understanding Django by working through a project in which the real-time component will be critical. The book starts with the basics and explains the difference between a Django project and a Django app, the most important settings, how to change them, and the fundamentals of packaging. You'll then be introduced to all the standard tools of Django, along with a sample project. The book then moves on to Channels, a recent addition to the Django ecosystem. It extends the framework with support for real-time operations such as Websockets and other asynchronous features. Practical Django 2 and Channels 2 provides the practical concepts needed to create complex, database-driven websites as easily as possible. What You'll Learn Build and deploy a simple company site with Django Develop more complex, data-heavy sites using the Django ORM Integrate Django with Channels Unit-test your solutions Who This Book Is For Python developers and web developers wanting to learn Django 2 and Channels 2","language":"en","currency":"USD","id":"1484240995","title":"Practical Django 2 and Channels 2","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=P3B_DwAAQBAJ&source=gbs_api","authors":["Federico Marani"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j2Rg2cIL3hEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"50 Principles for Scaling Web Sites","description":"50 Powerful, Easy-to-Use Rules for Supporting Hypergrowth in Any Environment Scalability Rules is the easy-to-use scalability primer and reference for every architect, developer, web professional, and manager. Authors Martin L. Abbott and Michael T. Fisher have helped scale more than 200 hypergrowth Internet sites through their consulting practice. Now, drawing on their unsurpassed experience, they present 50 clear, proven scalability rules—and practical guidance for applying them. Abbott and Fisher transform scalability from a “black art” to a set of realistic, technology-agnostic best practices for supporting hypergrowth in nearly any environment, including both frontend and backend systems. For architects, they offer powerful new insights for creating and evaluating designs. For developers, they share specific techniques for handling everything from databases to state. For managers, they provide invaluable help in goal-setting, decision-making, and interacting with technical teams. Whatever your role, you’ll find practical risk\/benefit guidance for setting priorities—and getting maximum “bang for the buck.” • Simplifying architectures and avoiding “over-engineering” • Scaling via cloning, replication, separating functionality, and splitting data sets • Scaling out, not up • Getting more out of databases without compromising scalability • Avoiding unnecessary redirects and redundant double-checking • Using caches and content delivery networks more aggressively, without introducing unacceptable complexity • Designing for fault tolerance, graceful failure, and easy rollback • Striving for statelessness when you can; efficiently handling state when you must • Effectively utilizing asynchronous communication • Learning quickly from mistakes, and much more","language":"en","currency":"USD","id":"9780132613989","title":"Scalability Rules","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j2Rg2cIL3hEC&source=gbs_api","authors":["Martin L. Abbott","Michael T. Fisher"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=M68hAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.02,"subtitle":"How to Think Like a Computer Scientist","description":"A no-nonsense introduction to software design using the Python programming language. Written for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters. The focus is on the programming process, with special emphasis on debugging. The book includes a wide range of exercises, from short examples to substantial projects, so that students have ample opportunity to practise each new concept. Exercise solutions and code examples are available from thinkpython.com, along with Swampy, a suite of Python programs that is used in some of the exercises.","language":"en","currency":"USD","id":"1139479229","title":"Python for Software Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=M68hAwAAQBAJ&source=gbs_api","authors":["Allen B. Downey"]},{"pageCount":640,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mWbMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21.74,"subtitle":"Move beyond basic programming to design and build reliable software with clean code","description":"Explore software engineering methodologies, techniques, and best practices in Go programming to build easy-to-maintain software that can effortlessly scale on demand Key Features Apply best practices to produce lean, testable, and maintainable Go code to avoid accumulating technical debt Explore Go’s built-in support for concurrency and message passing to build high-performance applications Scale your Go programs across machines and manage their life cycle using Kubernetes Book Description Over the last few years, Go has become one of the favorite languages for building scalable and distributed systems. Its opinionated design and built-in concurrency features make it easy for engineers to author code that efficiently utilizes all available CPU cores. This Golang book distills industry best practices for writing lean Go code that is easy to test and maintain, and helps you to explore its practical implementation by creating a multi-tier application called Links ‘R’ Us from scratch. You’ll be guided through all the steps involved in designing, implementing, testing, deploying, and scaling an application. Starting with a monolithic architecture, you’ll iteratively transform the project into a service-oriented architecture (SOA) that supports the efficient out-of-core processing of large link graphs. You’ll learn about various cutting-edge and advanced software engineering techniques such as building extensible data processing pipelines, designing APIs using gRPC, and running distributed graph processing algorithms at scale. Finally, you’ll learn how to compile and package your Go services using Docker and automate their deployment to a Kubernetes cluster. By the end of this book, you’ll know how to think like a professional software developer or engineer and write lean and efficient Go code. What you will learn Understand different stages of the software development life cycle and the role of a software engineer Create APIs using gRPC and leverage the middleware offered by the gRPC ecosystem Discover various approaches to managing package dependencies for your projects Build an end-to-end project from scratch and explore different strategies for scaling it Develop a graph processing system and extend it to run in a distributed manner Deploy Go services on Kubernetes and monitor their health using Prometheus Who this book is for This Golang programming book is for developers and software engineers looking to use Go to design and build scalable distributed systems effectively. Knowledge of Go programming and basic networking principles is required.","language":"en","currency":"USD","id":"1838550240","title":"Hands-On Software Engineering with Golang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mWbMDwAAQBAJ&source=gbs_api","authors":["Achilleas Anagnostopoulos"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=439Is75pU5cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":"A Project Lifecycle Approach Using Oracle Technology","description":"Over 80 quick and advanced recipes that focus on real world techniques and solutions to manage, design, and build data warehouse and business intelligence projects with this book and ebook.","language":"en","currency":"USD","id":"1849685495","title":"Business Intelligence Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=439Is75pU5cC&source=gbs_api","authors":["John Heaton"]},{"pageCount":720,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KXQrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Brain-Friendly Guide","description":"Learning a complex new language is no easy task especially when it s an object-oriented computer programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. It's constantly searching, scanning, waiting for something unusual to happen. After all, that's the way it was built to help you stay alive. It takes all the routine, ordinary, dull stuff and filters it to the background so it won't interfere with your brain's real work--recording things that matter. How does your brain know what matters? It's like the creators of the Head First approach say, suppose you're out for a hike and a tiger jumps in front of you, what happens in your brain? Neurons fire. Emotions crank up. Chemicals surge. That's how your brain knows. And that's how your brain will learn Java. Head First Java combines puzzles, strong visuals, mysteries, and soul-searching interviews with famous Java objects to engage you in many different ways. It's fast, it's fun, and it's effective. And, despite its playful appearance, Head First Java is serious stuff: a complete introduction to object-oriented programming and Java. You'll learn everything from the fundamentals to advanced topics, including threads, network sockets, and distributed programming with RMI. And the new. second edition focuses on Java 5.0, the latest version of the Java language and development platform. Because Java 5.0 is a major update to the platform, with deep, code-level changes, even more careful study and implementation is required. So learning the Head First way is more important than ever. If you've read a Head First book, you know what to expect--a visually rich format designed for the way your brain works. If you haven't, you're in for a treat. You'll see why people say it's unlike any other Java book you've ever read. By exploiting how your brain works, Head First Java compresses the time it takes to learn and retain--complex information. Its unique approach not only shows you what you need to know about Java syntax, it teaches you to think like a Java programmer. If you want to be bored, buy some other book. But if you want to understand Java, this book's for you.","language":"en","currency":"USD","id":"1449331440","title":"Head First Java","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KXQrAQAAQBAJ&source=gbs_api","authors":["Kathy Sierra","Bert Bates"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TAxlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"The What, Where, When, and How of Large-Scale Data Processing","description":"Streaming data is a big deal in big data these days. As more and more businesses seek to tame the massive unbounded data sets that pervade our world, streaming systems have finally reached a level of maturity sufficient for mainstream adoption. With this practical guide, data engineers, data scientists, and developers will learn how to work with streaming data in a conceptual and platform-agnostic way. Expanded from Tyler Akidau’s popular blog posts \"Streaming 101\" and \"Streaming 102\", this book takes you from an introductory level to a nuanced understanding of the what, where, when, and how of processing real-time data streams. You’ll also dive deep into watermarks and exactly-once processing with co-authors Slava Chernyak and Reuven Lax. You’ll explore: How streaming and batch data processing patterns compare The core principles and concepts behind robust out-of-order data processing How watermarks track progress and completeness in infinite datasets How exactly-once data processing techniques ensure correctness How the concepts of streams and tables form the foundations of both batch and streaming data processing The practical motivations behind a powerful persistent state mechanism, driven by a real-world example How time-varying relations provide a link between stream processing and the world of SQL and relational algebra","language":"en","currency":"USD","id":"1491983825","title":"Streaming Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TAxlDwAAQBAJ&source=gbs_api","authors":["Tyler Akidau","Slava Chernyak","Reuven Lax"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":704,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eSIsAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"A Brain-Friendly Guide","description":"What will you learn from this book? This brain-friendly guide teaches you everything from JavaScript language fundamentals to advanced topics, including objects, functions, and the browser’s document object model. You won’t just be reading—you’ll be playing games, solving puzzles, pondering mysteries, and interacting with JavaScript in ways you never imagined. And you’ll write real code, lots of it, so you can start building your own web applications. Prepare to open your mind as you learn (and nail) key topics including: The inner details of JavaScript How JavaScript works with the browser The secrets of JavaScript types Using arrays The power of functions How to work with objects Making use of prototypes Understanding closures Writing and testing applications What’s so special about this book? We think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First JavaScript Programming uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. This book replaces Head First JavaScript, which is now out of print.","language":"en","currency":"USD","id":"1449343988","title":"Head First JavaScript Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eSIsAwAAQBAJ&source=gbs_api","authors":["Eric Freeman","Elisabeth Robson"]},{"pageCount":586,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0ZjBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A hands-on guide to becoming an accomplished SOLIDWORKS Associate and Professional","description":"Explore a practical and example-driven approach to understanding SOLIDWORKS 2020 and achieving CSWA and CSWP certification Key Features Gain comprehensive insights into the core aspects of mechanical part modeling Get up to speed with generating assembly designs with both standard and advanced mates Focus on design practices for both 2D as well as 3D modeling and prepare to achieve CWSP and CWSA certification Book Description SOLIDWORKS is the leading choice for 3D engineering and product design applications across industries such as aviation, automobiles, and consumer product design. This book takes a practical approach to getting you up and running with SOLIDWORKS 2020. You'll start with the basics, exploring the software interface and working with drawing files. The book then guides you through topics such as sketching, building complex 3D models, generating dynamic and static assemblies, and generating 2D engineering drawings to equip you for mechanical design projects. You'll also do practical exercises to get hands-on with creating sketches, 3D part models, assemblies, and drawings. To reinforce your understanding of SOLIDWORKS, the book is supplemented by downloadable files that will help you follow up with the concepts and exercises found in the book. By the end of this book, you'll have gained the skills you need to create professional 3D mechanical models using SOLIDWORKS, and you'll be able to prepare effectively for the Certified SOLIDWORKS Associate (CSWA) and Certified SOLIDWORKS Professional (CSWP) exams. What you will learn Understand the fundamentals of SOLIDWORKS and parametric modeling Create professional 2D sketches as bases for 3D models using simple and advanced modeling techniques Use SOLIDWORKS drawing tools to generate standard engineering drawings Evaluate mass properties and materials for designing parts and assemblies Understand the objectives and the formats of the CSWA and CSWP exams Discover expert tips and tricks to generate different part and assembly configurations for your mechanical designs Who this book is for This book is for aspiring engineers, designers, drafting technicians, or anyone looking to get started with the latest version of SOLIDWORKS. Anyone interested in becoming a Certified SOLIDWORKS Associate (CSWA) or Certified SOLIDWORKS Professional (CSWP) will also find this book useful.","language":"en","currency":"USD","id":"1789801958","title":"Learn SOLIDWORKS 2020","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0ZjBDwAAQBAJ&source=gbs_api","authors":["Tayseer Almattar"]},{"pageCount":610,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xXMrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.91,"subtitle":"Building Web Apps with JavaScript","description":"HTML has been on a wild ride. Sure, HTML started as a mere markup language, but more recently HTML’s put on some major muscle. Now we’ve got a language tuned for building web applications with Web storage, 2D drawing, offline support, sockets and threads, and more. And to speak this language you’ve got to go beyond HTML5 markup and into the world of the DOM, events, and JavaScript APIs. Now you probably already know all about HTML markup (otherwise known as structure) and you know all aboutCSS style (presentation), but what you’ve been missing is JavaScript (behavior). If all you know about are structure and presentation, you can create some great looking pages, but they’re still just pages. When you add behavior with JavaScript, you can create an interactive experience; even better, you can create full blown web applications. Head First HTML5 Programming is your ultimate tour guide to creating web applications with HTML5 and JavaScript, and we give you everything you need to know to build them, including: how to add interactivity to your pages, how to communicate with the world of Web services, and how to use the great new APIs being developed for HTML5. Here are just some of the things you’ll learn in Head First HTML5 Programing: Learn how to make your pages truly interactive by using the power of the DOM. Finally understand how JavaScript works and take yourself from novice to well-informed in just a few chapters. Learn how JavaScript APIs fit into the HTML5 ecosystem, and how to use any API in your web pages. Use the Geolocation API to know where your users are. Bring out your inner artist with Canvas, HTML5’s new 2D drawing surface. Go beyond just plugging a video into your pages, and create custom video experiences. Learn the secret to grabbing five megabytes of storage in every user’s browser. Improve your page’s responsiveness and performance with Web workers. And much more.","language":"en","currency":"USD","id":"1449331513","title":"Head First HTML5 Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xXMrAQAAQBAJ&source=gbs_api","authors":["Eric Freeman","Elisabeth Robson"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=KDrO5CWG42wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.2,"subtitle":null,"description":"Master Application Development with Java WebSocket Build dynamic enterprise Web applications that fully leverage state-of-the-art communication technologies. Written by the leading expert on Java WebSocket programming, this Oracle Press guide offers practical development strategies and detailed example applications. Java WebSocket Programming explains how to design client\/server applications, incorporate full-duplex messaging, establish connections, create endpoints, handle path mapping, and secure data. You’ll also learn how to encrypt Web transmissions and enrich legacy applications with Java WebSocket. Develop Web applications using the Java WebSocket API Create and publish annotated and programmatic endpoints Manage the lifecycle events of WebSocket endpoints Maintain reliable connections across the endpoint lifecycle Manage synchronous and asynchronous messaging Define encoding and decoding strategies for complex messaging Configure message timeouts, size limits, and exceptions Map message paths and route incoming URIs to Web containers Secure data, authenticate users, and encrypt connections","language":"en","currency":"USD","id":"0071827188","title":"Java WebSocket Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=KDrO5CWG42wC&source=gbs_api","authors":["Dr. Danny Coward"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CC-zDFiWlcAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.2,"subtitle":null,"description":"Sams Teach Yourself SQL in 10 Minutes has established itself as the gold standard for introductory SQL books, offering a fast-paced accessible tutorial to the major themes and techniques involved in applying the SQL language. Forta¿s examples are clear and his writing style is crisp and concise. As with earlier editions, this revision includes coverage of current versions of all major commercial SQL platforms. New this time around is coverage of MySQL, and PostgreSQL. All examples have been tested against each SQL platform, with incompatibilities or platform distinctives called out and explained.","language":"en","currency":"USD","id":"9780132173889","title":"Sams Teach Yourself SQL in 10 Minutes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CC-zDFiWlcAC&source=gbs_api","authors":["Ben Forta"]},{"pageCount":750,"thumbnail":"http:\/\/books.google.com\/books\/content?id=w5QfDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.99,"subtitle":"","description":"A hands-on and introductory guide to the art of modern application and infrastructure monitoring and metrics. We start small and then build on what you learn to scale out to multi-site, multi-tier applications. The book is written for both developers and sysadmins. We focus on building monitored and measurable applications. We also use tools that are designed to handle the challenges of managing Cloud, containerised and distributed applications and infrastructure. In the book we'll deliver: * An introduction to monitoring, metrics and measurement. * A scalable framework for monitoring hosts (including Docker and containers), services and applications built on top of the Riemann event stream processor. * Graphing and metric storage using Graphite and Grafana. * Logging with Logstash. * A framework for high quality and useful notifications * Techniques for developing and building monitorable applications * A capstone that puts all the pieces together to monitor a multi-tier application.","language":"en","currency":"USD","id":"0988820242","title":"The Art of Monitoring","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=w5QfDAAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":462,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nZWqDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Over 140 practical recipes to help you make sense of your data with ease and build production-ready data apps About This Book Analyze Big Data sets, create attractive visualizations, and manipulate and process various data types Packed with rich recipes to help you learn and explore amazing algorithms for statistics and machine learning Authored by Ivan Idris, expert in python programming and proud author of eight highly reviewed books Who This Book Is For This book teaches Python data analysis at an intermediate level with the goal of transforming you from journeyman to master. Basic Python and data analysis skills and affinity are assumed. What You Will Learn Set up reproducible data analysis Clean and transform data Apply advanced statistical analysis Create attractive data visualizations Web scrape and work with databases, Hadoop, and Spark Analyze images and time series data Mine text and analyze social networks Use machine learning and evaluate the results Take advantage of parallelism and concurrency In Detail Data analysis is a rapidly evolving field and Python is a multi-paradigm programming language suitable for object-oriented application development and functional design patterns. As Python offers a range of tools and libraries for all purposes, it has slowly evolved as the primary language for data science, including topics on: data analysis, visualization, and machine learning. Python Data Analysis Cookbook focuses on reproducibility and creating production-ready systems. You will start with recipes that set the foundation for data analysis with libraries such as matplotlib, NumPy, and pandas. You will learn to create visualizations by choosing color maps and palettes then dive into statistical data analysis using distribution algorithms and correlations. You'll then help you find your way around different data and numerical problems, get to grips with Spark and HDFS, and then set up migration scripts for web mining. In this book, you will dive deeper into recipes on spectral analysis, smoothing, and bootstrapping methods. Moving on, you will learn to rank stocks and check market efficiency, then work with metrics and clusters. You will achieve parallelism to improve system performance by using multiple threads and speeding up your code. By the end of the book, you will be capable of handling various data analysis techniques in Python and devising solutions for problem scenarios. Style and Approach The book is written in “cookbook” style striving for high realism in data analysis. Through the recipe-based format, you can read each recipe separately as required and immediately apply the knowledge gained.","language":"en","currency":"USD","id":"1785283855","title":"Python Data Analysis Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nZWqDQAAQBAJ&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":346,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0nvGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"Build solid enterprise software using task parallelism and multithreading","description":"Enhance your enterprise application development skills by mastering parallel programming techniques in .NET and C# Key Features Write efficient, fine-grained, and scalable parallel code with C# and .NET Core Experience how parallel programming works by building a powerful application Learn the fundamentals of multithreading by working with IIS and Kestrel Book Description In today’s world, every CPU has a multi-core processor. However, unless your application has implemented parallel programming, it will fail to utilize the hardware’s full processing capacity. This book will show you how to write modern software on the optimized and high-performing .NET Core 3 framework using C# 8. Hands-On Parallel Programming with C# 8 and .NET Core 3 covers how to build multithreaded, concurrent, and optimized applications that harness the power of multi-core processors. Once you’ve understood the fundamentals of threading and concurrency, you’ll gain insights into the data structure in .NET Core that supports parallelism. The book will then help you perform asynchronous programming in C# and diagnose and debug parallel code effectively. You’ll also get to grips with the new Kestrel server and understand the difference between the IIS and Kestrel operating models. Finally, you’ll learn best practices such as test-driven development, and run unit tests on your parallel code. By the end of the book, you’ll have developed a deep understanding of the core concepts of concurrency and asynchrony to create responsive applications that are not CPU-intensive. What you will learn Analyze and break down a problem statement for parallelism Explore the APM and EAP patterns and how to move legacy code to Task Apply reduction techniques to get aggregated results Create PLINQ queries and study the factors that impact their performance Solve concurrency problems caused by producer-consumer race conditions Discover the synchronization primitives available in .NET Core Understand how the threading model works with IIS and Kestrel Find out how you can make the most of server resources Who this book is for If you want to learn how task parallelism is used to build robust and scalable enterprise architecture, this book is for you. Whether you are a beginner to parallelism in C# or an experienced architect, you’ll find this book useful to gain insights into the different threading models supported in .NET Standard and .NET Core. Prior knowledge of C# is required to understand the concepts covered in this book.","language":"en","currency":"USD","id":"1789133610","title":"Hands-On Parallel Programming with C# 8 and .NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0nvGDwAAQBAJ&source=gbs_api","authors":["Shakti Tanwar"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Practical, Server-Side JavaScript That Scales","description":"Node.js is the platform of choice for creating modern web services. This fast-paced book gets you up to speed on server-side programming with Node.js 8, as you develop real programs that are small, fast, low-profile, and useful. Take JavaScript beyond the browser, explore dynamic language features, and embrace evented programming.Harness the power of the event loop and non-blocking I\/O to create highly parallel microservices and applications. This expanded and updated second edition showcases the latest ECMAScript features, current best practices, and modern development techniques. JavaScript is the backbone of the modern web, powering nearly every web app's user interface. Node.js is JavaScript for the server. This greatly expanded second edition introduces new language features while dramatically increasing coverage of core topics. Each hands-on chapter offers progressively more challenging topics and techniques, broadening your skill set and enabling you to think in Node.js. Write asynchronous, non-blocking code using Node.js's style and patterns. Cluster and load balance services with Node.js core features and third-party tools. Harness the power of databases such as Elasticsearch and Redis. Work with many protocols, create RESTful web services, TCP socket clients and servers, and more. Test your code's functionality with Mocha, and manage its life cycle with npm. Discover how Node.js pairs a server-side event loop with a JavaScript runtime to produce screaming fast, non-blocking concurrency. Through a series of practical programming domains, use the latest available ECMAScript features and harness key Node.js classes and popular modules. Create rich command-line tools and a web-based UI using modern web development techniques. Join the smart and diverse community that's rapidly advancing the state of the art in JavaScript development. What You Need: Node.js 8.x Operating system with bash-like shell OMQ (pronounced \"Zero-M-Q\") library, version 3.2 or higher Elasticsearch version 5.0 or higher jq version 1.5 or higher Redis version 3.2 or higher","language":"en","currency":"USD","id":"168050536X","title":"Node.js 8 the Right Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oA9QDwAAQBAJ&source=gbs_api","authors":["Jim Wilson"]},{"pageCount":350,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EtlfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Learn how to implement metrics-centric monitoring with Prometheus. This introductory book teaches you how to use Prometheus to monitor hosts, applications, and services. We cover installation, basic monitoring, service discovery, alerting, log monitoring, scaling, and visualization. Includes introducing you to monitoring basics, methodologies and approaches. Learn how to monitor in a metric-centric world including building dynamic thresholds, basic anomaly detection, monitoring aggregation, and federation. We'll look at how to apply modern patterns like Google's Four Golden Signals, the USE method, and the RED method. We cover monitoring Kubernetes, Docker containers, databases, and we look at instrumenting applications and integrating logging. We focus on the particular challenges of monitoring highly dynamic, transitory environments and new architectures like microservices. We focus on monitoring in the Cloud, including looking at service discovery and monitoring for Cloud platforms.","language":"en","currency":"USD","id":"0988820285","title":"Monitoring with Prometheus","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EtlfDwAAQBAJ&source=gbs_api","authors":["James Turnbull"]},{"pageCount":564,"thumbnail":"http:\/\/books.google.com\/books\/content?id=94LoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Query and manipulate databases from popular relational database servers using SQL","description":"Learn everything you need to know to build efficient SQL queries using this easy-to-follow beginner’s guide Key Features Explore all SQL statements in depth using a variety of examples Get to grips with database querying, data aggregate, manipulation, and much more Understand how to explore and process data of varying complexity to tell a story Book Description SQL is a powerful querying language that's used to store, manipulate, and retrieve data, and it is one of the most popular languages used by developers to query and analyze data efficiently. If you're looking for a comprehensive introduction to SQL, Learn SQL Database Programming will help you to get up to speed with using SQL to streamline your work in no time. Starting with an overview of relational database management systems, this book will show you how to set up and use MySQL Workbench and design a database using practical examples. You'll also discover how to query and manipulate data with SQL programming using MySQL Workbench. As you advance, you’ll create a database, query single and multiple tables, and modify data using SQL querying. This SQL book covers advanced SQL techniques, including aggregate functions, flow control statements, error handling, and subqueries, and helps you process your data to present your findings. Finally, you’ll implement best practices for writing SQL and designing indexes and tables. By the end of this SQL programming book, you’ll have gained the confidence to use SQL queries to retrieve and manipulate data. What you will learn Install, configure, and use MySQL Workbench to restore a database Explore different data types such as string, numeric, and date and time Query a single table using the basic SQL SELECT statement and the FROM, WHERE, and ORDER BY clauses Query multiple tables by understanding various types of table relationships Modify data in tables using the INSERT, UPDATE, and DELETE statements Use aggregate functions to group and summarize data Detect bad data, duplicates, and irrelevant values while processing data Who this book is for This book is for business analysts, SQL developers, database administrators, and students learning SQL. If you want to learn how to query and manipulate SQL data for database administration tasks or simply extract and organize relevant data for analysis, you’ll find this book useful. No prior SQL experience is required.","language":"en","currency":"USD","id":"1838981705","title":"Learn SQL Database Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=94LoDwAAQBAJ&source=gbs_api","authors":["Josephine Bush"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=y5uBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.99,"subtitle":null,"description":"It is estimated that trillions of devices will be interconnected over the next decade through the Internet of Things, demanding a huge effort from developers. The emergence of low-cost Espressif microcontrollers, with WiFi connectivity, allows independent developers to quickly become part of this process. This book is not intended to comprehensively teach you the theory, but to give you practical and fully functional solutions, in the form of complete programs. Much of the theory is already known by some of the readers, or may be found in many other textbooks. However, the programs presented here include great effort and have many original solutions following one of the basic paradigms of programming: \"Keep i(o)t simple\". In addition, the most important thing for such a book – all the programs have already been verified by third parties, in this case students from Hyperion University, who have provided a very valuable feedback.","language":"en","currency":"USD","id":"0359282563","title":"Esp32 Programming for the Internet of Things","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=y5uBDwAAQBAJ&source=gbs_api","authors":["Sever Spanulescu"]},{"pageCount":352,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K1JtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Shipping Reliable Containers in Production","description":"Docker is rapidly changing the way organizations deploy software at scale. However, understanding how Linux containers fit into your workflow—and getting the integration details right—is not a trivial task. With the updated edition of this practical guide, you’ll learn how to use Docker to package your applications with all of their dependencies and then test, ship, scale, and support your containers in production. This edition includes significant updates to the examples and explanations that reflect the substantial changes that have occurred over the past couple of years. Sean Kane and Karl Matthias have added a complete chapter on Docker Compose, deeper coverage of Docker Swarm mode, introductions to both Kubernetes and AWS Fargate, examples on how to optimize your Docker images, and much more. Learn how Docker simplifies dependency management and deployment workflow for your applications Start working with Docker images, containers, and command line tools Use practical techniques to deploy and test Docker containers in production Debug containers by understanding their composition and internal processes Deploy production containers at scale inside your data center or cloud environment Explore advanced Docker topics, including deployment tools, networking, orchestration, security, and configuration","language":"en","currency":"USD","id":"1492036749","title":"Docker: Up & Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K1JtDwAAQBAJ&source=gbs_api","authors":["Sean P. Kane","Karl Matthias"]},{"pageCount":486,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OQAVWYJi9MUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A learner's guide to big numbers, statistics, and good decisions","description":"Today, interpreting data is a critical decision-making factor for businesses and organizations. If your job requires you to manage and analyze all kinds of data, turn to Head First Data Analysis, where you'll quickly learn how to collect and organize data, sort the distractions from the truth, find meaningful patterns, draw conclusions, predict the future, and present your findings to others. Whether you're a product developer researching the market viability of a new product or service, a marketing manager gauging or predicting the effectiveness of a campaign, a salesperson who needs data to support product presentations, or a lone entrepreneur responsible for all of these data-intensive functions and more, the unique approach in Head First Data Analysis is by far the most efficient way to learn what you need to know to convert raw data into a vital business tool. You'll learn how to: Determine which data sources to use for collecting information Assess data quality and distinguish signal from noise Build basic data models to illuminate patterns, and assimilate new information into the models Cope with ambiguous information Design experiments to test hypotheses and draw conclusions Use segmentation to organize your data within discrete market groups Visualize data distributions to reveal new relationships and persuade others Predict the future with sampling and probability models Clean your data to make it useful Communicate the results of your analysis to your audience Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First Data Analysis uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep.","language":"en","currency":"USD","id":"1449368336","title":"Head First Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OQAVWYJi9MUC&source=gbs_api","authors":["Michael Milton"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-1aBaguTz2MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"Getting Started with HTML5 Websocket Programming takes a tutorial-based approach.This book is for anyone who wants to build high-performance, true, real-time web applications. Being familiar with frontend web development (HTML \/ XHTML, JavaScript) would be ideal.","language":"en","currency":"USD","id":"1782166971","title":"Getting Started with HTML5 WebSocket Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-1aBaguTz2MC&source=gbs_api","authors":["Vangos Pterneas"]},{"pageCount":310,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FoswUBg_1aIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"The book is written in beginner’s guide style with each aspect of NumPy demonstrated with real world examples and required screenshots.If you are a programmer, scientist, or engineer who has basic Python knowledge and would like to be able to do numerical computations with Python, this book is for you. No prior knowledge of NumPy is required.","language":"en","currency":"USD","id":"1782166092","title":"NumPy Beginner's Guide (Second Edition)","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FoswUBg_1aIC&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=PYmkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"Build powerful Elastic dashboards with Kibana's data visualization capabilities, 2nd Edition","description":"A beginner's guide to analyzing and visualizing your Elasticsearch data using Kibana 7 and Timelion Key Features Gain a fundamental understanding of how Kibana operates within the Elastic Stack Explore your data with Elastic Graph and create rich dashboards in Kibana Learn scalable data visualization techniques in Kibana 7 Book Description Kibana is a window into the Elastic Stack, that enables the visual exploration and real-time analysis of your data in Elasticsearch. This book will help you understand the core concepts of the use of Kibana 7 for rich analytics and data visualization. If you’re new to the tool or want to get to grips with the latest features introduced in Kibana 7, this book is the perfect beginner's guide. You’ll learn how to set up and configure the Elastic Stack and understand where Kibana sits within the architecture. As you advance, you’ll learn how to ingest data from different sources using Beats or Logstash into Elasticsearch, followed by exploring and visualizing data in Kibana. Whether working with time series data to create complex graphs using Timelion or embedding visualizations created in Kibana into your web applications, this book covers it all. It also covers topics that every Elastic developer needs to be aware of, such as installing and configuring Application Performance Monitoring (APM) servers and agents. Finally, you’ll also learn how to create effective machine learning jobs in Kibana to find anomalies in your data. By the end of this book, you’ll have a solid understanding of Kibana, and be able to create your own visual analytics solutions from scratch. What you will learn Explore the data-driven architecture of the Elastic Stack Install and set up Kibana 7 and other Elastic Stack components Use Beats and Logstash to get input from different data sources Create different visualizations using Kibana Build enterprise-grade Elastic dashboards from scratch Use Timelion to play with time series data Install and configure APM servers and APM agents Work with Dev Tools, Spaces, Graph, and other important tools Who this book is for If you’re an aspiring Elastic developer or data analysts, this book is for you. You’ll also find it useful if you want to get up to speed with the new features of Kibana 7 and perform data visualization on enterprise data. No prior knowledge of Kibana is expected, but some experience with Elasticsearch will be helpful.","language":"en","currency":"USD","id":"1838556559","title":"Learning Kibana 7","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=PYmkDwAAQBAJ&source=gbs_api","authors":["Anurag Srivastava","Bahaaldine Azarmi"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5iR4hZNSCcgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Your Brain on SQL -- A Learner's Guide","description":"Is your data dragging you down? Are your tables all tangled up? Well we've got the tools to teach you just how to wrangle your databases into submission. Using the latest research in neurobiology, cognitive science, and learning theory to craft a multi-sensory SQL learning experience, Head First SQL has a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. Maybe you've written some simple SQL queries to interact with databases. But now you want more, you want to really dig into those databases and work with your data. Head First SQL will show you the fundamentals of SQL and how to really take advantage of it. We'll take you on a journey through the language, from basic INSERT statements and SELECT queries to hardcore database manipulation with indices, joins, and transactions. We all know \"Data is Power\" - but we'll show you how to have \"Power over your Data\". Expect to have fun, expect to learn, and expect to be querying, normalizing, and joining your data like a pro by the time you're finished reading!","language":"en","currency":"USD","id":"1449360440","title":"Head First SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5iR4hZNSCcgC&source=gbs_api","authors":["Lynn Beighley"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=mmjVIC6WolgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.67,"subtitle":"101 Rules, Guidelines, and Best Practices","description":"Consistent, high-quality coding standards improve software quality, reduce time-to-market, promote teamwork, eliminate time wasted on inconsequential matters, and simplify maintenance. Now, two of the world's most respected C++ experts distill the rich collective experience of the global C++ community into a set of coding standards that every developer and development team can understand and use as a basis for their own coding standards. The authors cover virtually every facet of C++ programming: design and coding style, functions, operators, class design, inheritance, construction\/destruction, copying, assignment, namespaces, modules, templates, genericity, exceptions, STL containers and algorithms, and more. Each standard is described concisely, with practical examples. From type definition to error handling, this book presents C++ best practices, including some that have only recently been identified and standardized-techniques you may not know even if you've used C++ for years. Along the way, you'll find answers to questions like What's worth standardizing--and what isn't? What are the best ways to code for scalability? What are the elements of a rational error handling policy? How (and why) do you avoid unnecessary initialization, cyclic, and definitional dependencies? When (and how) should you use static and dynamic polymorphism together? How do you practice \"safe\" overriding? When should you provide a no-fail swap? Why and how should you prevent exceptions from propagating across module boundaries? Why shouldn't you write namespace declarations or directives in a header file? Why should you use STL vector and string instead of arrays? How do you choose the right STL search or sort algorithm? What rules should you follow to ensure type-safe code? Whether you're working alone or with others, C++ Coding Standards will help you write cleaner code--and write it faster, with fewer hassles and less frustration.","language":"en","currency":"USD","id":"9780132654425","title":"C++ Coding Standards","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=mmjVIC6WolgC&source=gbs_api","authors":["Herb Sutter","Andrei Alexandrescu"]},{"pageCount":724,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ul9aBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Distributed Real-Time Search and Analytics Engine","description":"Whether you need full-text search or real-time analytics of structured data—or both—the Elasticsearch distributed search engine is an ideal way to put your data to work. This practical guide not only shows you how to search, analyze, and explore data with Elasticsearch, but also helps you deal with the complexities of human language, geolocation, and relationships. If you’re a newcomer to both search and distributed systems, you’ll quickly learn how to integrate Elasticsearch into your application. More experienced users will pick up lots of advanced techniques. Throughout the book, you’ll follow a problem-based approach to learn why, when, and how to use Elasticsearch features. Understand how Elasticsearch interprets data in your documents Index and query your data to take advantage of search concepts such as relevance and word proximity Handle human language through the effective use of analyzers and queries Summarize and group data to show overall trends, with aggregations and analytics Use geo-points and geo-shapes—Elasticsearch’s approaches to geolocation Model your data to take advantage of Elasticsearch’s horizontal scalability Learn how to configure and monitor your cluster in production","language":"en","currency":"USD","id":"1449358500","title":"Elasticsearch: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ul9aBgAAQBAJ&source=gbs_api","authors":["Clinton Gormley","Zachary Tong"]},{"pageCount":298,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QWOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This book is aimed at system administrators\/architects or DBAs who want to learn more about how to grow their current infrastructure to support larger traffic. Before beginning with this book, we expect you to be well-practiced with MySQL\/MariaDB for common usage. You will be able to get a grasp quickly if you are comfortable with learning and building large infrastructures for MariaDB using Linux.","language":"en","currency":"USD","id":"178398161X","title":"MariaDB High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QWOZBAAAQBAJ&source=gbs_api","authors":["Pierre MAVRO"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ms_RAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"A step-by-step guide, packed with examples of practical numerical analysis that will give you a comprehensive, but concise overview of NumPy. This book is for programmers, scientists, or engineers, who have basic Python knowledge and would like to be able to do numerical computations with Python.","language":"en","currency":"USD","id":"1783983914","title":"Learning NumPy Array","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ms_RAwAAQBAJ&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Zo39CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is for web developers who want to learn and implement WebSocket to create interesting apps for modern browsers, leveraging the capabilities of HTML5 with WebSockets.","language":"en","currency":"USD","id":"1784395005","title":"WebSocket Essentials – Building Apps with HTML5 WebSockets","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Zo39CAAAQBAJ&source=gbs_api","authors":["Varun Chopra"]},{"pageCount":153,"thumbnail":"http:\/\/books.google.com\/books\/content?id=H5E-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.81,"subtitle":"200 Practical Examples You Want to Know for Data Science","description":"Data visualization is one of the most important part of data science. Many books and courses present a catalogue of graphics but they don't teach you which charts to use according to the type of the data. In this book, we start by presenting the key graphic systems and packages available in R, including R base graphs, lattice and ggplot2 plotting systems. Next, we provide more than 200 practical examples to create great graphics for the right data using either the ggplot2 package and extensions or the traditional R graphics. With this book, you 'll learn: - How to quickly create beautiful graphics using ggplot2 packages - How to properly customize and annotate the plots - Type of graphics for visualizing categorical and continuous variables - How to add automatically p-values to box plots, bar plots and alternatives - How to add marginal density plots and correlation coefficients to scatter plots - Key methods for analyzing and visualizing multivariate data - R functions and packages for plotting time series data - How to combine multiple plots on one page to create production-quality figures.","language":"en","currency":"USD","id":"1979748101","title":"R Graphics Essentials for Great Data Visualization","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=H5E-DwAAQBAJ&source=gbs_api","authors":["Alboukadel Kassambara"]},{"pageCount":636,"thumbnail":"http:\/\/books.google.com\/books\/content?id=vWI5Jx5VRgEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Brain Friendly Guide to OOA&D","description":"\"Head First Object Oriented Analysis and Design is a refreshing look at subject of OOAD. What sets this book apart is its focus on learning. The authors have made the content of OOAD accessible, usable for the practitioner.\" Ivar Jacobson, Ivar Jacobson Consulting \"I just finished reading HF OOA&D and I loved it! The thing I liked most about this book was its focus on why we do OOA&D-to write great software!\" Kyle Brown, Distinguished Engineer, IBM \"Hidden behind the funny pictures and crazy fonts is a serious, intelligent, extremely well-crafted presentation of OO Analysis and Design. As I read the book, I felt like I was looking over the shoulder of an expert designer who was explaining to me what issues were important at each step, and why.\" Edward Sciore,Associate Professor, Computer Science Department, Boston College Tired of reading Object Oriented Analysis and Design books that only makes sense after you're an expert? You've heard OOA&D can help you write great software every time-software that makes your boss happy, your customers satisfied and gives you more time to do what makes you happy. But how? Head First Object-Oriented Analysis & Design shows you how to analyze, design, and write serious object-oriented software: software that's easy to reuse, maintain, and extend; software that doesn't hurt your head; software that lets you add new features without breaking the old ones. Inside you will learn how to: Use OO principles like encapsulation and delegation to build applications that are flexible Apply the Open-Closed Principle (OCP) and the Single Responsibility Principle (SRP) to promote reuse of your code Leverage the power of design patterns to solve your problems more efficiently Use UML, use cases, and diagrams to ensure that all stakeholders arecommunicating clearly to help you deliver the right software that meets everyone's needs. By exploiting how your brain works, Head First Object-Oriented Analysis & Design compresses the time it takes to learn and retain complex information. Expect to have fun, expect to learn, expect to be writing great software consistently by the time you're finished reading this!","language":"en","currency":"USD","id":"1449368492","title":"Head First Object-Oriented Analysis and Design","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=vWI5Jx5VRgEC&source=gbs_api","authors":["Brett McLaughlin","Gary Pollice","David West"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O-stAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"This book is written in a Cookbook style targeted towards an advanced audience. It covers the advanced topics of data visualization in Python.Python Data Visualization Cookbook is for developers that already know about Python programming in general. If you have heard about data visualization but you don't know where to start, then this book will guide you from the start and help you understand data, data formats, data visualization, and how to use Python to visualize data.You will need to know some general programming concepts, and any kind of programming experience will be helpful, but the code in this book is explained almost line by line. You don't need maths for this book, every concept that is introduced is thoroughly explained in plain English, and references are available for further interest in the topic.","language":"en","currency":"USD","id":"1782163379","title":"Python Data Visualization Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O-stAgAAQBAJ&source=gbs_api","authors":["Igor Milovanović"]},{"pageCount":260,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UmzQCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":44.95,"subtitle":"Bringing Together Data, Semantics, and Software","description":"How do we design for data when traditional design techniques cannot extend to new database technologies? In this era of big data and the Internet of Things, it is essential that we have the tools we need to understand the data coming to us faster than ever before, and to design databases and data processing systems that can adapt easily to ever-changing data schemas and ever-changing business requirements. There must be no intellectual disconnect between data and the software that manages it. It must be possible to extract meaning and knowledge from data to drive artificial intelligence applications. Novel NoSQL data organization techniques must be used side-by-side with traditional SQL databases. Are existing data modeling techniques ready for all of this? The Concept and Object Modeling Notation (COMN) is able to cover the full spectrum of analysis and design. A single COMN model can represent the objects and concepts in the problem space, logical data design, and concrete NoSQL and SQL document, key-value, columnar, and relational database implementations. COMN models enable an unprecedented level of traceability of requirements to implementation. COMN models can also represent the static structure of software and the predicates that represent the patterns of meaning in databases. This book will teach you: the simple and familiar graphical notation of COMN with its three basic shapes and four line styles how to think about objects, concepts, types, and classes in the real world, using the ordinary meanings of English words that aren’t tangled with confused techno-speak how to express logical data designs that are freer from implementation considerations than is possible in any other notation how to understand key-value, document, columnar, and table-oriented database designs in logical and physical terms how to use COMN to specify physical database implementations in any NoSQL or SQL database with the precision necessary for model-driven development","language":"en","currency":"USD","id":"1634621115","title":"NoSQL and SQL Data Modeling","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UmzQCwAAQBAJ&source=gbs_api","authors":["Ted Hills"]},{"pageCount":512,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FFpzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":"The Big Picture","description":"The Definitive Guide to Java Platform, Enterprise Edition 7 Java EE 7: The Big Picture uniquely explores the entire Java EE 7 platform in an all-encompassing style while examining each tier of the platform in enough detail so that you can select the right technologies for specific project needs. In this authoritative guide, Java expert Danny Coward walks you through the code, applications, and frameworks that power the platform. Take full advantage of the robust capabilities of Java EE 7, increase your productivity, and meet enterprise demands with help from this Oracle Press resource. Explore the features of the Java servlet model and Java servlet API Create dynamic web content with JavaServer Pages and JavaServer Faces Build websites for nonbrowser clients with JAX-RS Push data to web clients using Java WebSockets Secure web applications Work with web component APIs Maximize enterprise beans for multithreading, asynchronous processes, transactions, and more Access relational databases with the Java Database Connectivity APIs and the Java Persistence API Understand the packaging and deployment mechanisms of Java EE applications Work with Java EE Contexts and Dependency Injection Secure enterprise beans in a Java EE application Enable parallel processing with Java EE concurrency APIs","language":"en","currency":"USD","id":"0071837337","title":"Java EE 7: The Big Picture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FFpzAwAAQBAJ&source=gbs_api","authors":["Danny Coward"]},{"pageCount":408,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OH9vAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"A hands-on guide with easy-to-follow examples to help you learn about option theory, quantitative finance, financial modeling, and time series using Python. Python for Finance is perfect for graduate students, practitioners, and application developers who wish to learn how to utilize Python to handle their financial needs. Basic knowledge of Python will be helpful but knowledge of programming is necessary.","language":"en","currency":"USD","id":"1783284382","title":"Python for Finance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OH9vAwAAQBAJ&source=gbs_api","authors":["Yuxing Yan"]},{"pageCount":110,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Hef7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"A practical and a fast-paced guide that gives you all the information you need to start programming using Cython.This book is for developers who love C\/C++ for low latency and speed but who also require the ability to add more dynamic features to applications both fast and reliably. It will also show you how you can get new applications off the ground by reusing Python libraries to get started.","language":"en","currency":"USD","id":"1783280808","title":"Learning Cython Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Hef7AAAAQBAJ&source=gbs_api","authors":["Philip Herron"]},{"pageCount":258,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zWHCCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"If you are a Python developer with some experience of working on scientific, mathematical, and statistical applications and want to gain an expert understanding of NumPy programming in relation to science, math, and finance using practical recipes, then this book is for you.","language":"en","currency":"USD","id":"1784399825","title":"NumPy Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zWHCCAAAQBAJ&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TQAXzPIeu_UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"A step-by-step practical tutorial with plenty of examples on research-based problems from various areas of science, that prove how simple, yet effective, it is to provide solutions based on SciPy.This book is targeted at anyone with basic knowledge of Python, a somewhat advanced command of mathematics\/physics, and an interest in engineering or scientific applications---this is broadly what we refer to as scientific computing.This book will be of critical importance to programmers and scientists who have basic Python knowledge and would like to be able to do scientific and numerical computations with SciPy.","language":"en","currency":"USD","id":"1782161635","title":"Learning SciPy for Numerical and Scientific Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TQAXzPIeu_UC&source=gbs_api","authors":["Francisco J. Blanco-Silva"]},{"pageCount":348,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BqEbBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"This book is for programmers, scientists, and engineers who have knowledge of the Python language and know the basics of data science. It is for those who wish to learn different data analysis methods using Python and its libraries. This book contains all the basic ingredients you need to become an expert data analyst.","language":"en","currency":"USD","id":"1783553367","title":"Python Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BqEbBQAAQBAJ&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":409,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4L--DAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"Fully updated to the latest CSS modules, make the journey to CSS mastery as simple and painless as possible. This book dives into advanced aspects of CSS-based design, such as responsive design, modular CSS, and CSS typography. Through a series of easy-to-follow tutorials, you will learn practical CSS techniques you can immediately start using in your daily work. CSS Mastery: Advanced Web Standards Solutions is your indispensable guide to cutting-edge CSS development—this book demystifies the secrets of CSS. While CSS is a relatively simple technology to learn, it is a difficult one to master. When you first start developing sites using CSS, you will come across all kinds of infuriating browser bugs and inconsistencies. It sometimes feels like there are a million and one different techniques to master, spread across a bewildering array of websites. The range of possibilities seems endless and makes for a steep and daunting learning curve. While most books concentrate on basic skills, this one is different, assuming that you already know the basics and why you should be using CSS in your work, and concentrating mainly on advanced techniques. This new edition covers all of the CSS fundamentals such as the importance of meaningful markup, how to structure and maintain your code, and how the CSS layout model really works. This new edition contains: New examples and updated browser support information Full coverage of modular CSS and responsive design Essential information on CSS typography and layout control What You'll Learn Discover the best practice concepts in CSS design Master the most important (and tricky) parts of CSS Identify and fix the most common CSS problems Deal with the most common bugs See the latest information on CSS features and support Who This Book Is For Intermediate and advanced web designers and developers. It offers a quick recap of the main points of CSS, while dispelling some common myths, but then moves forward to delve into the higher-level aspects of CSS. It contains fully up-to-date information throughout, and acts as a one-stop-shop for current CSS best practices.","language":"en","currency":"USD","id":"1430258640","title":"CSS Mastery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4L--DAAAQBAJ&source=gbs_api","authors":["Andy Budd","Emil Björklund"]},{"pageCount":422,"thumbnail":"http:\/\/books.google.com\/books\/content?id=spdrCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":79.2,"subtitle":"13th International Conference, MODELS 2010, Oslo, Norway 3-8, 2010, Proceedings","description":"The MODELS series of conferences is the premier venue for the exchange of - novative technical ideas and experiences focusing on a very important new te- nical discipline: model-driven software and systems engineering. The expansion ofthisdisciplineisadirectconsequenceoftheincreasingsigni?canceandsuccess of model-based methods in practice. Numerous e?orts resulted in the invention of concepts, languagesand tools for the de?nition, analysis,transformation, and veri?cationofdomain-speci?cmodelinglanguagesandgeneral-purposemodeling language standards, as well as their use for software and systems engineering. MODELS 2010, the 13th edition of the conference series, took place in Oslo, Norway, October 3-8, 2010, along with numerous satellite workshops, symposia and tutorials. The conference was fortunate to have three prominent keynote speakers: Ole Lehrmann Madsen (Aarhus University, Denmark), Edward A. Lee (UC Berkeley, USA) and Pamela Zave (AT&T Laboratories, USA). To provide a broader forum for reporting on scienti?c progress as well as on experience stemming from practical applications of model-based methods, the 2010 conference accepted submissions in two distinct tracks: Foundations and Applications. The primary objective of the ?rst track is to present new research results dedicated to advancing the state-of-the-art of the discipline, whereas the second aims to provide a realistic and veri?able picture of the current state-- the-practice of model-based engineering, so that the broader community could be better informed of the capabilities and successes of this relatively young discipline. This volume contains the ?nal version of the papers accepted for presentation at the conference from both tracks.","language":"en","currency":"USD","id":"3642161294","title":"Model Driven Engineering Languages and Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=spdrCQAAQBAJ&source=gbs_api","authors":["Dorina C. Petriu","Nicolas Rouquette","Oystein Haugen"]},{"pageCount":308,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8Fs3AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"This is a practical, hands-on book, with a lot of code and images. It presents the real code that generates every image and describes almost every single line of it, so that you know exactly what's going on. Introductory, descriptive, and theoretical parts are mixed with examples, so that reading and understanding them is easy. All of the examples build gradually with code snippets, their explanations, and plot images where necessary with the complete code and output presented at the end. This book is essentially for Python developers who have a good knowledge of Python; no knowledge of Matplotlib is required. You will be creating 2D plots using Matplotlib in no time at all.","language":"en","currency":"USD","id":"1847197914","title":"Matplotlib for Python Developers","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8Fs3AgAAQBAJ&source=gbs_api","authors":["Sandro Tosi"]},{"pageCount":326,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G_mrBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"This book primarily targets Python developers who want to learn and use Python's machine learning capabilities and gain valuable insights from data to develop effective solutions for business problems.","language":"en","currency":"USD","id":"178439288X","title":"Building Machine Learning Systems with Python - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G_mrBwAAQBAJ&source=gbs_api","authors":["Luis Pedro Coelho","Willi Richert"]},{"pageCount":78,"thumbnail":"http:\/\/books.google.com\/books\/content?id=7DFhgWgm_a8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Covers JDBC, Hibernate, JPA and JDO","description":"JDBC has simplified database access in Java applications, but a few nagging wrinkles remain—namely, persisting Java objects to relational databases. With this book, you’ll learn how the Spring Framework makes that job incredibly easy with dependency injection, template classes, and object-relational-mapping (ORM). Through sample code, you’ll discover how Spring streamlines the use of JDBC and ORM tools such as Hibernate, the Java Persistence API (JPA), and Java Data Objects (JDO). If you’re a Java developer familiar with Spring (perhaps through O’Reilly’s Just Spring tutorial) and want to advance your data access skills, this book shows you how. Learn how to use Spring’s basic and advanced data access tools Work with Spring’s JdbcTemplate class to separate non-critical code from business code Eliminate placeholder variables in your queries with the NamedParameterJdbcTemplate class Use Spring’s template classes to perform batch executions Operate inserts on database tables without writing any SQL statements Learn about Spring’s support for Hibernate as an object-relational-mapping tool Use JPA as a standards-based ORM—alone or with Spring support Move data from a relational to a non-relational database with JDO","language":"en","currency":"USD","id":"1449339867","title":"Just Spring Data Access","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=7DFhgWgm_a8C&source=gbs_api","authors":["Madhusudhan Konda"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OOotAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"The book adopts a tutorial-based approach to introduce the user to Scikit-learn.If you are a programmer who wants to explore machine learning and data-based methods to build intelligent applications and enhance your programming skills, this the book for you. No previous experience with machine-learning algorithms is required.","language":"en","currency":"USD","id":"1783281944","title":"Learning scikit-learn: Machine Learning in Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OOotAgAAQBAJ&source=gbs_api","authors":["Raul Garreta","Guillermo Moncecchi"]},{"pageCount":184,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BgOACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Over 40 recipes to help you create real-time JavaScript applications using the robust Socket.IO framework About This Book Create secure WebSocket connections and real-time mobile applications using Socket.IO Devise efficient messaging systems between the server side and the client side A step-by-step implementation guide to help you create elements of Socket.IO application Who This Book Is For If you have some knowledge of JavaScript and Node.js and want to create awe-inspiring application experiences using real time communication, then this book is for you. Developers with knowledge of other scripting languages should also be able to easily follow along. What You Will Learn Build rich and interactive real-time dashboards using Socket.IO to pipe in data as it becomes available Design chat and multiple-person interfaces that leverage Socket.IO for communication Segment conversations to rooms and namespaces so that every socket doesn't have to receive every message Secure your data by implementing various authentication techniques, locking down the HTTP referrer and using secure WebSockets Load balance across multiple server-side nodes and keep your WebSockets in sync using Redis, RabbitMQ or Memcached Stream binary data such as audio and video in real-time over a Socket.IO connection Create real-time experiences outside of the browser by integrating Socket.IO with hybrid mobile applications In Detail Socket.IO is a JavaScript library that provides you with the ability to implement real-time analytics, binary streaming, instant messaging, and document collaboration. It has two parts: a client-side library that runs in the browser, and a server-side library for node.js. Socket.IO is event-driven and primarily uses the WebSocket protocol that allows us to emit data bi-directionally from the server and the client. Socket.IO This book is a complete resource, covering topics from webSocket security to scaling the server-side of a Socket.IO application and everything in between. This book will provide real-world examples of how secure bi-directional, full-duplex connections that can be created using Socket.IO for different environments. It will also explain how the connection vulnerabilities can be resolved for large numbers of users and huge amounts of data\/messages. By the end of the book, you will be a competent Socket.IO developer. With the help of the examples and real-world solutions,you will learn to create fast, scalable, and dynamic real-time apps by creating efficient messaging systems between the server side and the client side using Socket.IO. Style and approach This book is written in a cookbook-style format and provides practical, immediately usable task-based recipes that show you how to create the elements of a Socket.IO application.","language":"en","currency":"USD","id":"1785884433","title":"Socket.IO Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BgOACwAAQBAJ&source=gbs_api","authors":["Tyson Cadenhead"]},{"pageCount":1027,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dIvgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"Optimize Java Persistence Performance in Spring Boot Applications","description":"This book is a collection of developer code recipes and best practices for persisting data using Spring, particularly Spring Boot. The book is structured around practical recipes, where each recipe discusses a performance case or performance-related case, and almost every recipe has one or more applications. Mainly, when we try to accomplish something (e.g., read some data from the database), there are several approaches to do it, and, in order to choose the best way, you have to know the implied trades-off from a performance perspective. You’ll see that in the end, all these penalties slow down the application. Besides presenting the arguments that favor a certain choice, the application is written in Spring Boot style which is quite different than plain Hibernate. Persistence is an important set of techniques and technologies for accessing and using data, and this book demonstrates that data is mobile regardless of specific applications and contexts. In Java development, persistence is a key factor in enterprise, ecommerce, cloud and other transaction-oriented applications. After reading and using this book, you'll have the fundamentals to apply these persistence solutions into your own mission-critical enterprise Java applications that you build using Spring. What You Will Learn Shape *-to-many associations for best performances Effectively exploit Spring Projections (DTO) Learn best practices for batching inserts, updates and deletes Effectively fetch parent and association in a single SELECT Learn how to inspect Persistent Context content Dissect pagination techniques (offset and keyset) Handle queries, locking, schemas, Hibernate types, and more Who This Book Is For Any Spring and Spring Boot developer that wants to squeeze the persistence layer performances.","language":"en","currency":"USD","id":"1484256263","title":"Spring Boot Persistence Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dIvgDwAAQBAJ&source=gbs_api","authors":["Anghel Leonard"]},{"pageCount":218,"thumbnail":"http:\/\/books.google.com\/books\/content?id=j6XWDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Build data-driven React applications with ease using GraphQL and Relay About This Book Take your React applications to the next level with GraphQl and Relay Explore the concepts of data fetching, data handling, and more Learn to deploy your applications, which are compliant with GraphQl and Relay Who This Book Is For This book is perfect for those who have no prior experience or familiarity with Relay and\/or GraphQL. You should be comfortable writing NodeJS applications on a MongoDB database with REST APIs as well as applications on the client-side using React and ES2015. What You Will Learn Understand what problem GraphQL solves and how it differs from traditional REST architectures Create a GraphQL server Develop modular and maintainable GraphQL code Grasp how to define GraphQL mutations Comprehend how to define GraphQL queries Modify a GraphQL server to be Relay-compliant Develop a Relay client-side application with ReactJS that consumes a GraphQL endpoint In Detail There's a new choice for implementing APIs – the open source and Facebook-created GraphQL specification. Designed to solve many of the issues of working with REST, GraphQL comes alongside RelayJS, a React library for querying a server that implements the GraphQL specification. This book takes you quickly and simply through the skills you need to be able to build production ready applications with both GraphQL and RelayJS. Beginning with a solid foundation in the GraphQl specification, this book swiftly moves to how a data layer can be implemented for your web application using Relay. Get to grips with GraphQL and Relay concepts creating data containers, data masking, and more as your progress towards building a production-ready application. Style and approach This book serves as the answer to every question related to data-driven app development with React. Using real-world examples, this book will show you how to enhance the functionality of React apps by introducing efficient data handling features within the app.","language":"en","currency":"USD","id":"1786461978","title":"Learning GraphQL and Relay","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=j6XWDQAAQBAJ&source=gbs_api","authors":["Samer Buna"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=EfqoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build mesmerizing visualizations, analytics, and logs from your data using Elasticsearch, Logstash, and Kibana About This Book Solve all your data analytics problems with the ELK stack Explore the power of Kibana4 search and visualizations built over Elasticsearch queries and learn about the features and plugins of Logstash Develop a complete data pipeline using the ELK stack Who This Book Is For If you are a developer or DevOps engineer interested in building a system that provides amazing insights and business metrics out of data sources, of various formats and types, using the open source technology stack that ELK provides, then this book is for you. Basic knowledge of Unix or any programming language will be helpful to make the most out of this book. What You Will Learn Install, configure, and run Elasticsearch, Logstash, and Kibana Understand the need for log analytics and the current challenges in log analysis Build your own data pipeline using the ELK stack Familiarize yourself with the key features of Logstash and the variety of input, filter, and output plugins it provides Build your own custom Logstash plugin Create actionable insights using charts, histograms, and quick search features in Kibana4 Understand the role of Elasticsearch in the ELK stack In Detail The ELK stack—Elasticsearch, Logstash, and Kibana, is a powerful combination of open source tools. Elasticsearch is for deep search and data analytics. Logstash is for centralized logging, log enrichment, and parsing. Kibana is for powerful and beautiful data visualizations. In short, the Elasticsearch ELK stack makes searching and analyzing data easier than ever before. This book will introduce you to the ELK (Elasticsearch, Logstash, and Kibana) stack, starting by showing you how to set up the stack by installing the tools, and basic configuration. You'll move on to building a basic data pipeline using the ELK stack. Next, you'll explore the key features of Logstash and its role in the ELK stack, including creating Logstash plugins, which will enable you to use your own customized plugins. The importance of Elasticsearch and Kibana in the ELK stack is also covered, along with various types of advanced data analysis, and a variety of charts, tables ,and maps. Finally, by the end of the book you will be able to develop full-fledged data pipeline using the ELK stack and have a solid understanding of the role of each of the components. Style and approach This book is a step-by-step guide, complete with various examples to solve your data analytics problems by using the ELK stack to explore and visualize data.","language":"en","currency":"USD","id":"1785886703","title":"Learning ELK Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=EfqoCwAAQBAJ&source=gbs_api","authors":["Saurabh Chhajed"]},{"pageCount":498,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LvNFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Build robust and scalable real-time server-side web applications efficiently","description":"Expert techniques for building fast servers and scalable, real-time network applications with minimal effort; rewritten for Node.js 8 and Node.js 9 About This Book Packed with practical examples and explanations, Mastering Node.js contains everything you need to take your applications to the next level. Unleash the full potential of Node.js 9 to build real-time and scalable applications. Gain in-depth knowledge of asynchronous programming, event loops, and parallel data processing. Explore Node's innovative event-non-blocking design, and build professional applications with the help of detailed examples. Who This Book Is For This book is targeted at JavaScript developers who want to take an in-depth look at the latest Node.js framework to create faster, scalable, real-time backend applications. Basic JavaScript programming knowledge—and also some previous Node.js development experience—are mandatory to get the best out of this book What You Will Learn Build an Electron desktop app using Node that manages a filesystem Explore Streams and understand how they apply to building networked services Develop and deploy an SMS-driven customer service application Use WebSockets for rapid bi-directional communication Construct serverless applications with Amazon Lambda Test and debug with headless browsers, CPU profiling, Mocha, Sinon, and more Scale applications vertically and horizontally across multiple cores and web services In Detail Node.js, a modern development environment that enables developers to write server- and client-side code with JavaScript, thus becoming a popular choice among developers. This book covers the features of Node that are especially helpful to developers creating highly concurrent real-time applications. It takes you on a tour of Node's innovative event non-blocking design, showing you how to build professional applications. This edition has been updated to cover the latest features of Node 9 and ES6. All code examples and demo applications have been completely rewritten using the latest techniques, introducing Promises, functional programming, async\/await, and other cutting-edge patterns for writing JavaScript code. Learn how to use microservices to simplify the design and composition of distributed systems. From building serverless cloud functions to native C++ plugins, from chatbots to massively scalable SMS-driven applications, you'll be prepared for building the next generation of distributed software. By the end of this book, you'll be building better Node applications more quickly, with less code and more power, and know how to run them at scale in production environments. Style and approach Mastering Node.js contains all of the examples and explanations you'll need to build applications in a short amount of time and at a low cost, running rapidly and at scale.","language":"en","currency":"USD","id":"1785883038","title":"Mastering Node.js","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LvNFDwAAQBAJ&source=gbs_api","authors":["Sandro Pasquali","Kevin Faaborg"]},{"pageCount":632,"thumbnail":"http:\/\/books.google.com\/books\/content?id=z5gulmnPynoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"A Brain-Friendly Guide","description":"Ever wished you could learn C from a book? Head First C provides a complete learning experience for C and structured imperative programming. With a unique method that goes beyond syntax and how-to manuals, this guide not only teaches you the language, it helps you understand how to be a great programmer. You'll learn key areas such as language basics, pointers and pointer arithmetic, and dynamic memory management. Advanced topics include multi-threading and network programming—topics typically covered on a college-level course. This book also features labs: in-depth projects intended to stretch your abilities, test your new skills, and build confidence. Head First C mimics the style of college-level C courses, making it ideal as an accessible textbook for students. We think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First C uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep.","language":"en","currency":"USD","id":"1449345018","title":"Head First C","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=z5gulmnPynoC&source=gbs_api","authors":["David Griffiths","Dawn Griffiths"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":831,"thumbnail":"http:\/\/books.google.com\/books\/content?id=L-U5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"A Problem-Solution Approach","description":"Solve all your Spring 5 problems using complete and real-world code examples. When you start a new project, you’ll be able to copy the code and configuration files from this book, and then modify them for your needs. This can save you a great deal of work over creating a project from scratch. The recipes in Spring 5 Recipes cover Spring fundamentals such as Spring IoC container, Spring AOP\/ AspectJ, and more. Other recipes include Spring enterprise solutions for topics such as Spring Java EE integration, Spring Integration, Spring Batch, Spring Remoting, messaging, transactions, and working with big data and the cloud using Hadoop and MongoDB. Finally, Spring web recipes cover Spring MVC, other dynamic scripting, integration with the popular Grails Framework (and Groovy), REST\/web services, and more. You’ll also see recipes on new topics such as Spring Framework 5, reactive Spring, Spring 5 microservices, the functional web framework and much more. This book builds upon the best-selling success of the previous editions and focuses on the latest Spring Framework features for building enterprise Java applications. What You'll Learn Get re-usable code recipes and snippets for core Spring, annotations and other development tools Access Spring MVC for web development Work with Spring REST and microservices for web services development and integration into your enterprise Java applications Use Spring Batch, NoSQL and big data for building and integrating various cloud computing services and resources Integrate Java Enterprise Edition and other Java APIs for use in Spring Use Grails code and much more Who This Book Is For Experienced Java and Spring programmers.","language":"en","currency":"USD","id":"1484227905","title":"Spring 5 Recipes","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=L-U5DwAAQBAJ&source=gbs_api","authors":["Marten Deinum","Daniel Rubio","Josh Long"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NRO8AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"A practical tutorial that covers the difficult design, implementation, and management of search solutions.Mastering ElasticSearch is aimed at to intermediate users who want to extend their knowledge about ElasticSearch. The topics that are described in the book are detailed, but we assume that you already know the basics, like the query DSL or data indexing. Advanced users will also find this book useful, as the examples are getting deep into the internals where it is needed.","language":"en","currency":"USD","id":"1783281448","title":"Mastering ElasticSearch","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NRO8AQAAQBAJ&source=gbs_api","authors":["Rafał Kuć","Marek Rogoziński"]},{"pageCount":140,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YgdbZbkTDkoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"Socket.io Real-time Web Application Development.","language":"en","currency":"USD","id":"1782160795","title":"Socket. IO Real-Time Web Application Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YgdbZbkTDkoC&source=gbs_api","authors":["Rohit Rai"]},{"pageCount":null,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YUI1AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":null,"description":null,"language":"en","currency":null,"id":"0077588258","title":"Java Programming: A Comprehensive Introduction","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YUI1AAAAQBAJ&source=gbs_api","authors":["Herbert Schildt","Dale Skrien"]},{"pageCount":262,"thumbnail":"http:\/\/books.google.com\/books\/content?id=yp3cDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Change the way your organization deploys software at scale with this fast-paced guide to the world of Docker About This Book Cut through the noise and in simple terms learn to package your applications and test, ship, and scale your containers Find and build images and successfully run your programs within containers Build, deploy, and test your Docker containers and put them to work in production Who This Book Is For This book is for IT professionals, system administrators, and DevOps professionals or anyone looking to quickly develop and deploy software to production at scale. If you are interested in Docker, DevOps, or containers in general, don't look any further. What You Will Learn Understand Docker's architecture Build, ship, and run distributed applications Deploy, automate, and manage the execution of applications within Docker Scale and virtualize images and containers Utilize the networking features that Docker offers Use repositories to store and retrieve images In Detail This fast-paced practical guide will get you up and running with Docker. Using Docker, you will be able to build, ship, and run many distributed applications in real time. You will start with quickly installing Docker and start working with images and containers. We will present different types of containers and their applications, and show you how to find and build images. You will learn how you can contribute to the image repository by publishing different images. This will familiarize you with the image building process and you will be able to successfully run your programs within containers. By finishing this book, you will be well equipped in deploying your applications using Docker and will have a clear understanding of concepts, techniques, and practical methods to get it running in production systems. Style and approach This book takes a fast-paced practical approach that quickly gets you up and running with Docker so that you spend less time learning and more time deploying Docker containers effectively. This book contains a mix of concepts, practical examples, techniques, and the most up-to-date content to run things effectively in production. We'll show you the easiest way to speed up your development and deployment with Docker.","language":"en","currency":"USD","id":"1786466333","title":"Developing with Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=yp3cDgAAQBAJ&source=gbs_api","authors":["Jaroslaw Krochmalski"]},{"pageCount":931,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iHc5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":57.59,"subtitle":null,"description":"Leverage the power of Python to clean, scrape, analyze, and visualize your data About This Book Clean, format, and explore your data using the popular Python libraries and get valuable insights from it Analyze big data sets; create attractive visualizations; manipulate and process various data types using NumPy, SciPy, and matplotlib; and more Packed with easy-to-follow examples to develop advanced computational skills for the analysis of complex data Who This Book Is For This course is for developers, analysts, and data scientists who want to learn data analysis from scratch. This course will provide you with a solid foundation from which to analyze data with varying complexity. A working knowledge of Python (and a strong interest in playing with your data) is recommended. What You Will Learn Understand the importance of data analysis and master its processing steps Get comfortable using Python and its associated data analysis libraries such as Pandas, NumPy, and SciPy Clean and transform your data and apply advanced statistical analysis to create attractive visualizations Analyze images and time series data Mine text and analyze social networks Perform web scraping and work with different databases, Hadoop, and Spark Use statistical models to discover patterns in data Detect similarities and differences in data with clustering Work with Jupyter Notebook to produce publication-ready figures to be included in reports In Detail Data analysis is the process of applying logical and analytical reasoning to study each component of data present in the system. Python is a multi-domain, high-level, programming language that offers a range of tools and libraries suitable for all purposes, it has slowly evolved as one of the primary languages for data science. Have you ever imagined becoming an expert at effectively approaching data analysis problems, solving them, and extracting all of the available information from your data? If yes, look no further, this is the course you need! In this course, we will get you started with Python data analysis by introducing the basics of data analysis and supported Python libraries such as matplotlib, NumPy, and pandas. Create visualizations by choosing color maps, different shapes, sizes, and palettes then delve into statistical data analysis using distribution algorithms and correlations. You'll then find your way around different data and numerical problems, get to grips with Spark and HDFS, and set up migration scripts for web mining. You'll be able to quickly and accurately perform hands-on sorting, reduction, and subsequent analysis, and fully appreciate how data analysis methods can support business decision-making. Finally, you will delve into advanced techniques such as performing regression, quantifying cause and effect using Bayesian methods, and discovering how to use Python's tools for supervised machine learning. The course provides you with highly practical content explaining data analysis with Python, from the following Packt books: Getting Started with Python Data Analysis. Python Data Analysis Cookbook. Mastering Python Data Analysis. By the end of this course, you will have all the knowledge you need to analyze your data with varying complexity levels, and turn it into actionable insights. Style and approach Learn Python data analysis using engaging examples and fun exercises, and with a gentle and friendly but comprehensive \"learn-by-doing\" approach. It offers you a useful way of analyzing the data that's specific to this course, but that can also be applied to any other data. This course is designed to be both a guide and a reference for moving beyond the basics of data analysis.","language":"en","currency":"USD","id":"1788396545","title":"Python: End-to-end Data Analysis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iHc5DwAAQBAJ&source=gbs_api","authors":["Phuong Vothihong","Martin Czygan","Ivan Idris","Magnus Vilhelm Persson","Luiz Felipe Martins"]},{"pageCount":128,"thumbnail":"http:\/\/books.google.com\/books\/content?id=lSHlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Over 50 hands-on recipes to efficiently administer, maintain, and use your Apache Kafka installation About This Book Quickly configure and manage your Kafka cluster Learn how to use the Apache Kafka cluster and connect it with tools for big data processing A practical guide to monitor your Apache Kafka installation Who This Book Is For If you are a programmer or big data engineer using or planning to use Apache Kafka, then this book is for you. This book has several recipes which will teach you how to effectively use Apache Kafka. You need to have some basic knowledge of Java. If you don't know big data tools, this would be your stepping stone for learning how to consume the data in these kind of systems. What You Will Learn Learn how to configure Kafka brokers for better efficiency Explore how to configure producers and consumers for optimal performance Set up tools for maintaining and operating Apache Kafka Create producers and consumers for Apache Kafka in Java Understand how Apache Kafka can be used by several third party system for big data processing, such as Apache Storm, Apache Spark, Hadoop, and more Monitor Apache Kafka using tools like graphite and Ganglia In Detail This book will give you details about how to manage and administer your Apache Kafka Cluster. We will cover topics like how to configure your broker, producer, and consumer for maximum efficiency for your situation. Also, you will learn how to maintain and administer your cluster for fault tolerance. We will also explore tools provided with Apache Kafka to do regular maintenance operations. We shall also look at how to easily integrate Apache Kafka with big data tools like Hadoop, Apache Spark, Apache Storm, and Elasticsearch. Style and approach Easy-to-follow, step-by-step recipes explaining from start to finish how to accomplish real-world tasks.","language":"en","currency":"USD","id":"1785880187","title":"Apache Kafka Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=lSHlCwAAQBAJ&source=gbs_api","authors":["Saurabh Minni"]},{"pageCount":92,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XjXXnWPkd-AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":7.99,"subtitle":"Lite","description":"The learn-by-doing approach of this book will enable you to dive right into the heart of text processing from the very first page. Each recipe is carefully designed to fulfill your appetite for Natural Language Processing. Packed with numerous illustrative examples and code samples, it will make the task of using the NLTK for Natural Language Processing easy and straightforward. This book is for Python programmers who want to quickly get to grips with using the NLTK for Natural Language Processing. Familiarity with basic text processing concepts is required. Programmers experienced in the NLTK will also find it useful. Students of linguistics will find it invaluable.","language":"en","currency":"USD","id":"1849516391","title":"Python Text Processing with Nltk 2.0 Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XjXXnWPkd-AC&source=gbs_api","authors":["Jacob Perkins"]},{"pageCount":226,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Vfm_Z4d1FFoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Written in Cookbook style, the code examples will take your Numpy skills to the next level. This book will take Python developers with basic Numpy skills to the next level through some practical recipes.","language":"en","currency":"USD","id":"9781849518932","title":"NumPy Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Vfm_Z4d1FFoC&source=gbs_api","authors":["Ivan Idris"]},{"pageCount":814,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wXwrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":37.12,"subtitle":"A Brain-Friendly Guide","description":"If you're ready to create web pages more complex than those you can build with HTML and CSS, Head First PHP & MySQL is the ultimate learning guide to building dynamic, database-driven websites using PHP and MySQL. Packed with real-world examples, this book teaches you all the essentials of server-side programming, from the fundamentals of PHP and MySQL coding to advanced topics such as form validation, session IDs, cookies, database queries and joins, file I\/O operations, content management, and more. Head First PHP & MySQL offers the same visually rich format that's turned every title in the Head First series into a bestseller, with plenty of exercises, quizzes, puzzles, and other interactive features to help you retain what you've learned. Use PHP to transform static HTML pages into dynamic web sites Create and populate your own MySQL database tables, and work with data stored in files Perform sophisticated MySQL queries with joins, and refine your results with LIMIT and ORDER BY Use cookies and sessions to track visitors' login information and personalize the site for users Protect your data from SQL injection attacks Use regular expressions to validate information on forms Dynamically display text based on session info and create images on the fly Pull syndicated data from other sites using PHP and XML Throughout the book, you'll build sophisticated examples -- including a mailing list, a job board, and an online dating site -- to help you learn how to harness the power of PHP and MySQL in a variety of contexts. If you're ready to build a truly dynamic website, Head First PHP & MySQL is the ideal way to get going.","language":"en","currency":"USD","id":"1449331556","title":"Head First PHP & MySQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wXwrAQAAQBAJ&source=gbs_api","authors":["Lynn Beighley","Michael Morrison"]},{"pageCount":438,"thumbnail":"http:\/\/books.google.com\/books\/content?id=da-9BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"Research and Practice","description":"The issue of data quality is as old as data itself. However, the proliferation of diverse, large-scale and often publically available data on the Web has increased the risk of poor data quality and misleading data interpretations. On the other hand, data is now exposed at a much more strategic level e.g. through business intelligence systems, increasing manifold the stakes involved for individuals, corporations as well as government agencies. There, the lack of knowledge about data accuracy, currency or completeness can have erroneous and even catastrophic results. With these changes, traditional approaches to data management in general, and data quality control specifically, are challenged. There is an evident need to incorporate data quality considerations into the whole data cycle, encompassing managerial\/governance as well as technical aspects. Data quality experts from research and industry agree that a unified framework for data quality management should bring together organizational, architectural and computational approaches. Accordingly, Sadiq structured this handbook in four parts: Part I is on organizational solutions, i.e. the development of data quality objectives for the organization, and the development of strategies to establish roles, processes, policies, and standards required to manage and ensure data quality. Part II, on architectural solutions, covers the technology landscape required to deploy developed data quality management processes, standards and policies. Part III, on computational solutions, presents effective and efficient tools and techniques related to record linkage, lineage and provenance, data uncertainty, and advanced integrity constraints. Finally, Part IV is devoted to case studies of successful data quality initiatives that highlight the various aspects of data quality in action. The individual chapters present both an overview of the respective topic in terms of historical research and\/or practice and state of the art, as well as specific techniques, methodologies and frameworks developed by the individual contributors. Researchers and students of computer science, information systems, or business management as well as data professionals and practitioners will benefit most from this handbook by not only focusing on the various sections relevant to their research area or particular practical work, but by also studying chapters that they may initially consider not to be directly relevant to them, as there they will learn about new perspectives and approaches.","language":"en","currency":"USD","id":"3642362575","title":"Handbook of Data Quality","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=da-9BAAAQBAJ&source=gbs_api","authors":["Shazia Sadiq"]},{"pageCount":504,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2brVAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40,"subtitle":null,"description":"The go-to guidebook for deploying Big Data solutions withHadoop Today's enterprise architects need to understand how the Hadoopframeworks and APIs fit together, and how they can be integrated todeliver real-world solutions. This book is a practical, detailedguide to building and implementing those solutions, with code-levelinstruction in the popular Wrox tradition. It covers storing datawith HDFS and Hbase, processing data with MapReduce, and automatingdata processing with Oozie. Hadoop security, running Hadoop withAmazon Web Services, best practices, and automating Hadoopprocesses in real time are also covered in depth. With in-depth code examples in Java and XML and the latest onrecent additions to the Hadoop ecosystem, this complete resourcealso covers the use of APIs, exposing their inner workings andallowing architects and developers to better leverage and customizethem. The ultimate guide for developers, designers, and architectswho need to build and deploy Hadoop applications Covers storing and processing data with various technologies,automating data processing, Hadoop security, and deliveringreal-time solutions Includes detailed, real-world examples and code-levelguidelines Explains when, why, and how to use these tools effectively Written by a team of Hadoop experts in theprogrammer-to-programmer Wrox style Professional Hadoop Solutions is the reference enterprisearchitects and developers need to maximize the power of Hadoop.","language":"en","currency":"USD","id":"1118824180","title":"Professional Hadoop Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2brVAAAAQBAJ&source=gbs_api","authors":["Boris Lublinsky","Kevin T. Smith","Alexey Yakubovich"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VPh_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"Quickly get up to speed with MariaDB—the leading, drop-in replacement for MySQL, through this practical tutorial About This Book Get to know the basic SQL queries so you can quickly start using MariaDB Take control of your data through the advanced features of MariaDB Exploit the full potential of MariaDB's exclusive features through quick, practical examples Who This Book Is For If you don't know the SQL language, but you want to quickly jump into the SQL world and learn how to use MariaDB, or if you already know how to use MySQL but you want to go further, then this book is ideal for you. What You Will Learn Install and configure MariaDB Create databases, tables, and indexes Import and export data from and to external files Work with views and virtual columns Create, read, update, and delete records in your database Use dynamic columns Set up a powerful full-text search system Access your external data from MariaDB through the CONNECT engine In Detail This book will take you through all the nitty-gritty parts of MariaDB, right from the creation of your database all the way to using MariaDB's advanced features. At the very beginning, we show you the basics, that is, how to install MariaDB. Then, we walk you through the databases and tables of MariaDB, and introduce SQL in MariaDB. You will learn about all the features that have been added in MariaDB but are absent in MySQL. Moving on, you'll learn to import and export data, views, virtual columns, and dynamic columns in MariaDB. Then, you'll get to grips with full-text searches and queries in MariaDb. You'll also be familiarized with the CONNECT storage engine. At the end of the book, you'll be introduced to the community of MariaDB. Style and approach This is a complete guide that uses concrete examples to help you understand and exploit the full potential of MariaDB.","language":"en","currency":"USD","id":"178398287X","title":"MariaDB Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VPh_CwAAQBAJ&source=gbs_api","authors":["Emilien Kenler","Federico Razzoli"]},{"pageCount":182,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FoBvAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"This book is a quick and concise introduction to RabbitMQ. Follow the unique case study of Clever Coney Media as they progressively discover how to fully utilize RabbitMQ, containing clever examples and detailed explanations. Whether you are someone who develops enterprise messaging products professionally or a hobbyist who is already familiar with open source Message Queuing software and you are looking for a new challenge, then this is the book for you. Although you should be familiar with Java, Ruby, and Python to get the most out of the examples, RabbitMQ Essentials will give you the push you need to get started that no other RabbitMQ tutorial can provide you with.","language":"en","currency":"USD","id":"1783983213","title":"RabbitMQ Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FoBvAwAAQBAJ&source=gbs_api","authors":["David Dossot"]},{"pageCount":428,"thumbnail":"http:\/\/books.google.com\/books\/content?id=F1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Master the intricacies of Elasticsearch 5 and use it to create flexible and scalable search solutions About This Book Master the searching, indexing, and aggregation features in ElasticSearch Improve users' search experience with Elasticsearch's functionalities and develop your own Elasticsearch plugins A comprehensive, step-by-step guide to master the intricacies of ElasticSearch with ease Who This Book Is For If you have some prior working experience with Elasticsearch and want to take your knowledge to the next level, this book will be the perfect resource for you.If you are a developer who wants to implement scalable search solutions with Elasticsearch, this book will also help you. Some basic knowledge of the query DSL and data indexing is required to make the best use of this book. What You Will Learn Understand Apache Lucene and Elasticsearch 5's design and architecture Use and configure the new and improved default text scoring mechanism in Apache Lucene 6 Know how to overcome the pitfalls while handling relational data in Elasticsearch Learn about choosing the right queries according to the use cases and master the scripting module including new default scripting language, painlessly Explore the right way of scaling production clusters to improve the performance of Elasticsearch Master the searching, indexing, and aggregation features in Elasticsearch Develop your own Elasticsearch plugins to extend the functionalities of Elasticsearch In Detail Elasticsearch is a modern, fast, distributed, scalable, fault tolerant, and open source search and analytics engine. Elasticsearch leverages the capabilities of Apache Lucene, and provides a new level of control over how you can index and search even huge sets of data. This book will give you a brief recap of the basics and also introduce you to the new features of Elasticsearch 5. We will guide you through the intermediate and advanced functionalities of Elasticsearch, such as querying, indexing, searching, and modifying data. We'll also explore advanced concepts, including aggregation, index control, sharding, replication, and clustering. We'll show you the modules of monitoring and administration available in Elasticsearch, and will also cover backup and recovery. You will get an understanding of how you can scale your Elasticsearch cluster to contextualize it and improve its performance. We'll also show you how you can create your own analysis plugin in Elasticsearch. By the end of the book, you will have all the knowledge necessary to master Elasticsearch and put it to efficient use. Style and approach This comprehensive guide covers intermediate and advanced concepts in Elasticsearch as well as their implementation. An easy-to-follow approach means you'll be able to master even advanced querying, searching, and administration tasks with ease.","language":"en","currency":"USD","id":"1786468875","title":"Mastering Elasticsearch 5.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=F1QoDwAAQBAJ&source=gbs_api","authors":["Bharvi Dixit"]},{"pageCount":124,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GAgqAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book is an easy-to-follow guide, full of hands-on, real-world examples. Each topic is explained and demonstrated in a specific and user-friendly flow, from search optimization using Solr to Deployment of Zookeeper applications. This book is ideal for Apache Solr developers and want to learn different techniques to optimize Solr performance with utmost efficiency, along with effectively troubleshooting the problems that usually occur while trying to boost performance. Familiarity with search servers and database querying is expected.","language":"en","currency":"USD","id":"1782164839","title":"Apache Solr High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GAgqAwAAQBAJ&source=gbs_api","authors":["Surendra Mohan"]},{"pageCount":224,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1DnpDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":null,"description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Implement maximum control, security, and compliance processes in Azure cloud environments In Microsoft Azure Security Infrastructure ,1\/e three leading experts show how to plan, deploy, and operate Microsoft Azure with outstanding levels of control, security, and compliance. You’ll learn how to prepare infrastructure with Microsoft’s integrated tools, prebuilt templates, and managed services–and use these to help safely build and manage any enterprise, mobile, web, or Internet of Things (IoT) system. The authors guide you through enforcing, managing, and verifying robust security at physical, network, host, application, and data layers. You’ll learn best practices for security-aware deployment, operational management, threat mitigation, and continuous improvement–so you can help protect all your data, make services resilient to attack, and stay in control no matter how your cloud systems evolve. Three Microsoft Azure experts show you how to: • Understand cloud security boundaries and responsibilities • Plan for compliance, risk management, identity\/access management, operational security, and endpoint and data protection • Explore Azure’s defense-in-depth security architecture • Use Azure network security patterns and best practices • Help safeguard data via encryption, storage redundancy, rights management, database security, and storage security • Help protect virtual machines with Microsoft Antimalware for Azure Cloud Services and Virtual Machines • Use the Microsoft Azure Key Vault service to help secure cryptographic keys and other confidential information • Monitor and help protect Azure and on-premises resources with Azure Security Center and Operations Management Suite • Effectively model threats and plan protection for IoT systems • Use Azure security tools for operations, incident response, and forensic investigation","language":"en","currency":"USD","id":"1509304045","title":"Microsoft Azure Security Infrastructure","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1DnpDAAAQBAJ&source=gbs_api","authors":["Yuri Diogenes","Tom Shinder","Debra Shinder"]},{"pageCount":240,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jkkOCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Docker is a next-generation platform for simplifying application containerization life-cycle. Docker allows you to create a robust and resilient environment in which you can generate portable, composable, scalable, and stable application containers. This book is a step-by-step guide that will walk you through the various features of Docker from Docker software installation to the impenetrable security of containers. The book starts off by elucidating the installation procedure for Docker and a few troubleshooting techniques. You will be introduced to the process of downloading Docker images and running them as containers. You'll learn how to run containers as a service (CaaS) and also discover how to share data among containers. Later on, you'll explore how to establish the link between containers and orchestrate containers using Docker Compose. You will also come across relevant details about application testing inside a container. You will discover how to debug a container using the docker exec command and the nsenter tool. Finally, you will learn how to secure your containers with SELinux and other proven methods.","language":"en","currency":"USD","id":"178439193X","title":"Learning Docker","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jkkOCgAAQBAJ&source=gbs_api","authors":["Pethuru Raj","Jeeva S. Chelladhurai","Vinod Singh"]},{"pageCount":172,"thumbnail":"http:\/\/books.google.com\/books\/content?id=_PKoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":null,"description":"Create your own massively scalable Cassandra database with highly responsive database queries About This Book Create a Cassandra cluster and tweak its configuration to get the best performance based on your environment Analyze the key concepts and architecture of Cassandra, which are essential to create highly responsive Cassandra databases A fast-paced and step-by-step guide on handling huge amount of data and getting the best out of your database applications Who This Book Is For If you are a developer who is working with Cassandra and you want to deep dive into the core concepts and understand Cassandra's non-relational nature, then this book is for you. A basic understanding of Cassandra is expected. What You Will Learn Install and set up your Cassandra Cluster using various installation types Use Cassandra Query Language (CQL) to design Cassandra database and tables with various configuration options Design your Cassandra database to be evenly loaded with the lowest read\/write latencies Employ the available Cassandra tools to monitor and maintain a Cassandra cluster Debug CQL queries to discover why they are performing relatively slowly Choose the best-suited compaction strategy for your database based on your usage pattern Tune Cassandra based on your deployment operation system environment In Detail Apache Cassandra Essentials takes you step-by-step from from the basics of installation to advanced installation options and database design techniques. It gives you all the information you need to effectively design a well distributed and high performance database. You'll get to know about the steps that are performed by a Cassandra node when you execute a read\/write query, which is essential to properly maintain of a Cassandra cluster and to debug any issues. Next, you'll discover how to integrate a Cassandra driver in your applications and perform read\/write operations. Finally, you'll learn about the various tools provided by Cassandra for serviceability aspects such as logging, metrics, backup, and recovery. Style and approach This step-by-step guide is packed with examples that explain the core concepts as well as advanced concepts, techniques, and usages of Apache Cassandra.","language":"en","currency":"USD","id":"1783989114","title":"Apache Cassandra Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=_PKoCwAAQBAJ&source=gbs_api","authors":["Nitin Padalia"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OVQoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Exploit the visualization capabilities of Kibana and build powerful interactive dashboards About This Book Introduction to data-driven architecture and the Elastic stack Build effective dashboards for data visualization and explore datasets with Elastic Graph A comprehensive guide to learning scalable data visualization techniques in Kibana Who This Book Is For If you are a developer, data visualization engineer, or data scientist who wants to get the best of data visualization at scale then this book is perfect for you. A basic understanding of Elasticsearch and Logstash is required to make the best use of this book. What You Will Learn How to create visualizations in Kibana Ingest log data, structure an Elasticsearch cluster, and create visualization assets in Kibana Embed Kibana visualization on web pages Scaffold, develop, and deploy new Kibana & Timelion customizations Build a metrics dashboard in Timelion based on time series data Use the Graph plugin visualization feature and leverage a graph query Create, implement, package, and deploy a new custom plugin Use Prelert to solve anomaly detection challenges In Detail Kibana is an open source data visualization platform that allows you to interact with your data through stunning, powerful graphics. Its simple, browser-based interface enables you to quickly create and share dynamic dashboards that display changes to Elasticsearch queries in real time. In this book, you'll learn how to use the Elastic stack on top of a data architecture to visualize data in real time. All data architectures have different requirements and expectations when it comes to visualizing the data, whether it's logging analytics, metrics, business analytics, graph analytics, or scaling them as per your business requirements. This book will help you master Elastic visualization tools and adapt them to the requirements of your project. You will start by learning how to use the basic visualization features of Kibana 5. Then you will be shown how to implement a pure metric analytics architecture and visualize it using Timelion, a very recent and trendy feature of the Elastic stack. You will learn how to correlate data using the brand-new Graph visualization and build relationships between documents. Finally, you will be familiarized with the setup of a Kibana development environment so that you can build a custom Kibana plugin. By the end of this book you will have all the information needed to take your Elastic stack skills to a new level of data visualization. Style and approach This book takes a comprehensive, step-by-step approach to working with the visualization aspects of the Elastic stack. Every concept is presented in a very easy-to-follow manner that shows you both the logic and method of implementation. Real world cases are referenced to highlight how each of the key concepts can be put to practical use.","language":"en","currency":"USD","id":"1786465795","title":"Learning Kibana 5.0","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OVQoDwAAQBAJ&source=gbs_api","authors":["Bahaaldine Azarmi"]},{"pageCount":342,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JkBPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.19,"subtitle":"An expert's guide to building fault-tolerant MongoDB applications","description":"An expert's guide to build fault tolerant MongoDB application About This Book Master the advanced modeling, querying, and administration techniques in MongoDB and become a MongoDB expert Covers the latest updates and Big Data features frequently used by professional MongoDB developers and administrators If your goal is to become a certified MongoDB professional, this book is your perfect companion Who This Book Is For Mastering MongoDB is a book for database developers, architects, and administrators who want to learn how to use MongoDB more effectively and productively. If you have experience in, and are interested in working with, NoSQL databases to build apps and websites, then this book is for you. What You Will Learn Get hands-on with advanced querying techniques such as indexing, expressions, arrays, and more. Configure, monitor, and maintain highly scalable MongoDB environment like an expert. Master replication and data sharding to optimize read\/write performance. Design secure and robust applications based on MongoDB. Administer MongoDB-based applications on-premise or in the cloud Scale MongoDB to achieve your design goals Integrate MongoDB with big data sources to process huge amounts of data In Detail MongoDB has grown to become the de facto NoSQL database with millions of users—from small startups to Fortune 500 companies. Addressing the limitations of SQL schema-based databases, MongoDB pioneered a shift of focus for DevOps and offered sharding and replication maintainable by DevOps teams. The book is based on MongoDB 3.x and covers topics ranging from database querying using the shell, built in drivers, and popular ODM mappers to more advanced topics such as sharding, high availability, and integration with big data sources. You will get an overview of MongoDB and how to play to its strengths, with relevant use cases. After that, you will learn how to query MongoDB effectively and make use of indexes as much as possible. The next part deals with the administration of MongoDB installations on-premise or in the cloud. We deal with database internals in the next section, explaining storage systems and how they can affect performance. The last section of this book deals with replication and MongoDB scaling, along with integration with heterogeneous data sources. By the end this book, you will be equipped with all the required industry skills and knowledge to become a certified MongoDB developer and administrator. Style and approach This book takes a practical, step-by-step approach to explain the concepts of MongoDB. Practical use-cases involving real-world examples are used throughout the book to clearly explain theoretical concepts.","language":"en","currency":"USD","id":"1783982616","title":"Mastering MongoDB 3.x","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JkBPDwAAQBAJ&source=gbs_api","authors":["Alex Giamas"]}]