[{"pageCount":365,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8FHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":null,"description":"See a Mesos-based big data stack created and the components used. You will use currently available Apache full and incubating systems. The components are introduced by example and you learn how they work together. In the Complete Guide to Open Source Big Data Stack, the author begins by creating a private cloud and then installs and examines Apache Brooklyn. After that, he uses each chapter to introduce one piece of the big data stack—sharing how to source the software and how to install it. You learn by simple example, step by step and chapter by chapter, as a real big data stack is created. The book concentrates on Apache-based systems and shares detailed examples of cloud storage, release management, resource management, processing, queuing, frameworks, data visualization, and more. What You’ll Learn Install a private cloud onto the local cluster using Apache cloud stack Source, install, and configure Apache: Brooklyn, Mesos, Kafka, and Zeppelin See how Brooklyn can be used to install Mule ESB on a cluster and Cassandra in the cloud Install and use DCOS for big data processing Use Apache Spark for big data stack data processing Who This Book Is For Developers, architects, IT project managers, database administrators, and others charged with developing or supporting a big data system. It is also for anyone interested in Hadoop or big data, and those experiencing problems with data size.","language":"en","currency":"USD","id":"1484221494","title":"Complete Guide to Open Source Big Data Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8FHDwAAQBAJ&source=gbs_api","authors":["Michael Frampton"]},{"pageCount":338,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DDc9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":148,"subtitle":null,"description":"Relational databases have been predominant for many years and are used throughout various industries. The current system faces challenges related to size and variety of data thus the NoSQL databases emerged. By joining these two database models, there is room for crucial developments in the field of computer science. Bridging Relational and NoSQL Databases is an innovative source of academic content on the convergence process between databases and describes key features of the next database generation. Featuring coverage on a wide variety of topics and perspectives such as BASE approach, CAP theorem, and hybrid and native solutions, this publication is ideally designed for professionals and researchers interested in the features and collaboration of relational and NoSQL databases.","language":"en","currency":"USD","id":"1522533869","title":"Bridging Relational and NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DDc9DwAAQBAJ&source=gbs_api","authors":["Gaspar, Drazena","Coric, Ivica"]},{"pageCount":434,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iiKXBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":268,"subtitle":null,"description":"Cloud technologies have revolutionized the way we store information and perform various computing tasks. With the rise of this new technology, the ability to secure information stored on the cloud becomes a concern. The Handbook of Research on Securing Cloud-Based Databases with Biometric Applications explores the latest innovations in promoting cloud security through human authentication techniques. Exploring methods of access by identification, including the analysis of facial features, fingerprints, DNA, dental characteristics, and voice patterns, this publication is designed especially for IT professionals, academicians, and upper-level students seeking current research surrounding cloud security.","language":"en","currency":"USD","id":"1466665602","title":"Handbook of Research on Securing Cloud-Based Databases with Biometric Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iiKXBQAAQBAJ&source=gbs_api","authors":["Deka, Ganesh Chandra"]},{"pageCount":456,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O_UwBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":21,"subtitle":null,"description":"Get up to speed on the nuances of NoSQL databases and what they mean for your organization This easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros. If you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now, and in the future, can be a tall task. This is where NoSQL For Dummies comes in! Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases Big data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.","language":"en","currency":"USD","id":"1118905628","title":"NoSQL For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O_UwBgAAQBAJ&source=gbs_api","authors":["Adam Fowler"]},{"pageCount":427,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QsWoBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":135.2,"subtitle":null,"description":"This book presents a range of cloud computing platforms for data-intensive scientific applications. It covers systems that deliver infrastructure as a service, including: HPC as a service; virtual networks as a service; scalable and reliable storage; algorithms that manage vast cloud resources and applications runtime; and programming models that enable pragmatic programming and implementation toolkits for eScience applications. Many scientific applications in clouds are also introduced, such as bioinformatics, biology, weather forecasting and social networks. Most chapters include case studies. Cloud Computing for Data-Intensive Applications targets advanced-level students and researchers studying computer science and electrical engineering. Professionals working in cloud computing, networks, databases and more will also find this book useful as a reference.","language":"en","currency":"USD","id":"1493919059","title":"Cloud Computing for Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QsWoBQAAQBAJ&source=gbs_api","authors":["Xiaolin Li","Judy Qiu"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=rC5aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"A Guide to Modern Databases and the NoSQL Movement","description":"Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the only comprehensive guide to the world of NoSQL databases, with in-depth practical and conceptual introductions to seven different technologies: Redis, Neo4J, CouchDB, MongoDB, HBase, Postgres, and DynamoDB. This second edition includes a new chapter on DynamoDB and updated content for each chapter. While relational databases such as MySQL remain as relevant as ever, the alternative, NoSQL paradigm has opened up new horizons in performance and scalability and changed the way we approach data-centric problems. This book presents the essential concepts behind each database alongside hands-on examples that make each technology come alive. With each database, tackle a real-world problem that highlights the concepts and features that make it shine. Along the way, explore five database models - relational, key\/value, columnar, document, and graph - from the perspective of challenges faced by real applications. Learn how MongoDB and CouchDB are strikingly different, make your applications faster with Redis and more connected with Neo4J, build a cluster of HBase servers using cloud services such as Amazon's Elastic MapReduce, and more. This new edition brings a brand new chapter on DynamoDB, updated code samples and exercises, and a more up-to-date account of each database's feature set. Whether you're a programmer building the next big thing, a data scientist seeking solutions to thorny problems, or a technology enthusiast venturing into new territory, you will find something to inspire you in this book. What You Need: You'll need a *nix shell (Mac OS or Linux preferred, Windows users will need Cygwin), Java 6 (or greater), and Ruby 1.8.7 (or greater). Each chapter will list the downloads required for that database.","language":"en","currency":"USD","id":"1680505971","title":"Seven Databases in Seven Weeks","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=rC5aDwAAQBAJ&source=gbs_api","authors":["Luc Perkins","Eric Redmond","Jim Wilson"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AyY1a6-k3PIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":"A Brief Guide to the Emerging World of Polyglot Persistence","description":"The need to handle increasingly larger data volumes is one factor driving the adoption of a new class of nonrelational “NoSQL” databases. Advocates of NoSQL databases claim they can be used to build systems that are more performant, scale better, and are easier to program. NoSQL Distilled is a concise but thorough introduction to this rapidly emerging technology. Pramod J. Sadalage and Martin Fowler explain how NoSQL databases work and the ways that they may be a superior alternative to a traditional RDBMS. The authors provide a fast-paced guide to the concepts you need to know in order to evaluate whether NoSQL databases are right for your needs and, if so, which technologies you should explore further. The first part of the book concentrates on core concepts, including schemaless data models, aggregates, new distribution models, the CAP theorem, and map-reduce. In the second part, the authors explore architectural and design issues associated with implementing NoSQL. They also present realistic use cases that demonstrate NoSQL databases at work and feature representative examples using Riak, MongoDB, Cassandra, and Neo4j. In addition, by drawing on Pramod Sadalage’s pioneering work, NoSQL Distilled shows how to implement evolutionary design with schema migration: an essential technique for applying NoSQL databases. The book concludes by describing how NoSQL is ushering in a new age of Polyglot Persistence, where multiple data-storage worlds coexist, and architects can choose the technology best optimized for each type of data access.","language":"en","currency":"USD","id":"013303612X","title":"NoSQL Distilled","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AyY1a6-k3PIC&source=gbs_api","authors":["Pramod J. Sadalage","Martin Fowler"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=G4N-DPk9R5sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Time to Relax","description":"Three of CouchDB's creators show you how to use this document-oriented database as a standalone application framework or with high-volume, distributed applications. With its simple model for storing, processing, and accessing data, CouchDB is ideal for web applications that handle huge amounts of loosely structured data. That alone would stretch the limits of a relational database, yet CouchDB offers an open source solution that's reliable, scales easily, and responds quickly. CouchDB works with self-contained data that has loose or ad-hoc connections. It's a model that fits many real-world items, such as contacts, invoices, and receipts, but you'll discover that this database can easily handle data of any kind. With this book, you'll learn how to work with CouchDB through its RESTful web interface, and become familiar with key features such as simple document CRUD (create, read, update, delete), advanced MapReduce, deployment tuning, and more. Understand the basics of document-oriented storage and manipulation Interact with CouchDB entirely though HTTP using its RESTful interface Model data as self-contained JSON documents Handle evolving data schemas naturally Query and aggregate data in CouchDB using MapReduce views Replicate data between nodes Tune CouchDB for increased performance and reliability","language":"en","currency":"USD","id":"9781449382933","title":"CouchDB: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=G4N-DPk9R5sC&source=gbs_api","authors":["J. Chris Anderson","Jan Lehnardt","Noah Slater"]},{"pageCount":86,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6-M_eVneQxYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":49.99,"subtitle":null,"description":"Zehntausende Web-Services verwenden relationale Datenbanken, um Daten zu speichern und auszulesen. Im Vergleich zu modernen Konzepten können relationale Datenbanken als wichtigster Stellvertreter für ``traditionelle Technologien'' bezeichnet werden. Wenn man als Entwickler zu Seiten wie Google.com, Facebook.com, Amazon.com, Digg.com, Ebay.com, Yahoo.com, Twitter.com oder Dawanda.com surft, wird meist angenommen, dass eine verteilte relationale Datenbank verwendet wird. Die Annahme ist zu 50% richtig, jedoch ist die Datenhaltung meist nicht relational. Diese Großunternehmen verwalten mehrere hundert Gigabytes, bis hin zu 100.000 Gigabyte an Daten, und mussten in den letzten sechs Jahren Lösungen finden, um erfolgreich diese riesigen Datenmengen zu beherrschen. Google erfand vor ca. sieben Jahren ein Verfahren, um Datenmengen im Petabytebereich zu beherrschen. Facebook entwickelte selbst eine Datenbanktechnologie, um die Posteingänge von Benutzern verfügbar zu machen, Twitter.com adaptiert diese Technologie für andere Zwecke. Amazon.com entwickelte \"Dynamo'', um Hochverfügbarkeit für deren weltgrößte E-Commerce Plattform zu schaffen. Diese und andere Eigenentwicklungen entstanden aus der Notwendigkeit heraus, riesige Datenmengen bzw. Datenbanken hoch verfügbar, konsistent und skalierbar zu machen. Seit den letzten drei Jahren sind alternative \"Open-Source-Implementierungen'' dieser Entwicklungen entstanden. Die Veröffentlichung der Konzepte und Technologien führten zu einer ganzen Bewegung namens \"NoSQL''. Sind diese Konzepte vorteilhafter, um eine bessere und für Entwickler einfachere Skalierung, Abfragemöglichkeit und Datenkonsistenz in einem hochverfügbaren Datenbanksystem, zu gewährleisten? Wie werden komplexe Abfragen in modernen und traditionellen verteilten Systemen gemacht und wie werden diese ausgeführt? Speziell stellt sich die Frage, ob das MapReduce Verfahren ein vollständiger Ersatz für SQL ist. Für welche Einsatzzwecke sind beide besonders gut geeignet und für welche weniger? Ausgewählte Konzepte moderner, verteilter Datenbanksysteme sind zentrale Bestandteile dieser Arbeit. Dazu werden die Eigenschaften Verfügbarkeit, Konsistenz und Skalierbarkeit in den verteilten Systemen ausführlicher beschrieben, um zu analysieren, ob gegenüber relationalen Datenbanken Vorteile und Nachteile dieser Eigenschaften existieren. Ergebnisse dieser Aufgabenstellung sollen Chancen und Risiken von modernen Datenbanken aufdecken. Key-Value-Stores sind die einfachsten Vertreter moderner Datenbanken. \"Riak'' wird in dieser Arbeit als Implementierung moderner Konzepte benutzt. \"MySQL'' soll als Vertreter für relationale Datenbanken verwendet werden da dieser Vertreter eine weit verbreitete Open-Source-Implementierung von relationalen Datenbanken ist. Andere Datenbankkonzepte\/Datenbanken werden in dieser Arbeit nicht behandelt. Dazu zählen unter anderem objektorientierte, objektrelationale, hierarchische, spaltenorientierte und graphenorientierte Datenbankformen, sowie Repräsentanten von relationalen Datenbanken, wie \"db2'', \"Sybase'' oder \"Oracle'', da diese nicht Open-Source sind. Das konsistente Hashfunktionsverfahren wird zuerst kurz erläutert, um theoretische Grundlagen für die Implementierung moderner und traditioneller Skalierungsmethoden zu legen. Danach werden, im Kontext moderner Datenbanktechnologien, wichtige theoretische Konzepte zur Skalierung erläutert. Dazu werden die drei wichtigsten Eigenschaften verteilter Systeme definiert und in Zusammenhang gebracht (Verfügbarkeit, Konsistenz und Partitionstoleranz). Dementsprechend wird das Prinzip \"letztendliche Konsistenz'' vorgestellt, welches eine zentrale Rolle bei modernen verteilten Systemen darstellt. Weiterhin wird das MapReduce-Verfahren konzeptionell vorgestellt. Es wird aus zwei Perspektiven betrachtet: Filterung von Daten durch benutzerdefinierte Funktionen anhand eines Beispiels und in diesem Zusammenhang die Ausführung des Verfahrens in verteilten Systemen. Implementierungen dieser theoretischen Ansätze werden in diesem Kapitel aufgelistet. Eine detaillierte Beschreibung von \"Key-Value-Stores'' (KVS) wird im nächsten Kapitel bereitgestellt. KVS sind die einfachste Form von modernen Datenbanken, an denen sich die grundlegenden Konzepte abstrakt beschreiben lassen. \"Riak'' ist ein wichtiger Vertreter für moderne Datenbanken und KVS. Die theoretischen Grundlagen der drei zentralen Eigenschaften verteilter System werden an dieser direkten Implementierung gefestigt und erweitert. Dem folgt eine kurze Vorstellung von relationalen Datenbanken. Dabei wird ausschließlich auf Möglichkeiten zur Skalierung eingegangen. Im letzten Kapitel werden zuerst beide Datenbanktechnologien hinsichtlich der Skalierung, Konsistenz, Verfügbarkeit und Komplexität verglichen. Weiterhin findet ein Vergleich zwischen MapReduce und SQL bzw. \"benutzerdefinierten Funktionen'' anhand von Einsatzmöglichkeiten, Stabilität und Komplexität statt. Der Vergleich von MySQL und Riak erfolgt durch eine Analyse der Abfragemöglichkeiten mittels Stored Procedures und MapReduce anhand mehrerer Beispiele. Hierbei sollen die zentralen Fragestellungen beantwortet werden. Abschließend werden die Ergebnisse zusammengefasst und bewertet.","language":"de","currency":"USD","id":"3842856792","title":"Vergleich und Evaluation zwischen modernen und traditionellen Datenbankkonzepten unter den Gesichtspunkten Skalierung, Abfragem”glichkeit und Konsistenz","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6-M_eVneQxYC&source=gbs_api","authors":["Nils Petersohn"]},{"pageCount":83,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BuHEWIjNEysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"In an age where everything is measurable, understanding big data is an essential. From creating new data-driven products through to increasing operational efficiency, big data has the potential to make your organization both more competitive and more innovative. As this emerging field transitions from the bleeding edge to enterprise infrastructure, it's vital to understand not only the technologies involved, but the organizational and cultural demands of being data-driven. Written by O'Reilly Radar's experts on big data, this anthology describes: The broad industry changes heralded by the big data era What big data is, what it means to your business, and how to start solving data problems The software that makes up the Hadoop big data stack, and the major enterprise vendors' Hadoop solutions The landscape of NoSQL databases and their relative merits How visualization plays an important part in data work","language":"en","currency":"USD","id":"1449329640","title":"Planning for Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BuHEWIjNEysC&source=gbs_api","authors":["Edd Wilder-James"]},{"pageCount":482,"thumbnail":"http:\/\/books.google.com\/books\/content?id=uXosDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Implement Robust, Fault-Tolerant Systems","description":"If you need to build a scalable, fault tolerant system with requirements for high availability, discover why the Erlang\/OTP platform stands out for the breadth, depth, and consistency of its features. This hands-on guide demonstrates how to use the Erlang programming language and its OTP framework of reusable libraries, tools, and design principles to develop complex commercial-grade systems that simply cannot fail. In the first part of the book, you’ll learn how to design and implement process behaviors and supervision trees with Erlang\/OTP, and bundle them into standalone nodes. The second part addresses reliability, scalability, and high availability in your overall system design. If you’re familiar with Erlang, this book will help you understand the design choices and trade-offs necessary to keep your system running. Explore OTP’s building blocks: the Erlang language, tools and libraries collection, and its abstract principles and design rules Dive into the fundamentals of OTP reusable frameworks: the Erlang process structures OTP uses for behaviors Understand how OTP behaviors support client-server structures, finite state machine patterns, event handling, and runtime\/code integration Write your own behaviors and special processes Use OTP’s tools, techniques, and architectures to handle deployment, monitoring, and operations","language":"en","currency":"USD","id":"1449361560","title":"Designing for Scalability with Erlang\/OTP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=uXosDAAAQBAJ&source=gbs_api","authors":["Francesco Cesarini","Steve Vinoski"]},{"pageCount":316,"thumbnail":"http:\/\/books.google.com\/books\/content?id=DeTO4xbC-eoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Modern Data Access for Enterprise Java","description":"You can choose several data access frameworks when building Java enterprise applications that work with relational databases. But what about big data? This hands-on introduction shows you how Spring Data makes it relatively easy to build applications across a wide range of new data access technologies such as NoSQL and Hadoop. Through several sample projects, you’ll learn how Spring Data provides a consistent programming model that retains NoSQL-specific features and capabilities, and helps you develop Hadoop applications across a wide range of use-cases such as data analysis, event stream processing, and workflow. You’ll also discover the features Spring Data adds to Spring’s existing JPA and JDBC support for writing RDBMS-based data access layers. Learn about Spring’s template helper classes to simplify the use ofdatabase-specific functionality Explore Spring Data’s repository abstraction and advanced query functionality Use Spring Data with Redis (key\/value store), HBase(column-family), MongoDB (document database), and Neo4j (graph database) Discover the GemFire distributed data grid solution Export Spring Data JPA-managed entities to the Web as RESTful web services Simplify the development of HBase applications, using a lightweight object-mapping framework Build example big-data pipelines with Spring Batch and Spring Integration","language":"en","currency":"USD","id":"1449331882","title":"Spring Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=DeTO4xbC-eoC&source=gbs_api","authors":["Mark Pollack","Oliver Gierke","Thomas Risberg","Jon Brisbin","Michael Hunger"]},{"pageCount":235,"thumbnail":"http:\/\/books.google.com\/books\/content?id=q6pPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"NoSQLand Big Data","description":"\"It’s not easy to find such a generous book on big data and databases. Fortunately, this book is the one.\" Feng Yu. Computing Reviews. June 28, 2016. This is a book for enterprise architects, database administrators, and developers who need to understand the latest developments in database technologies. It is the book to help you choose the correct database technology at a time when concepts such as Big Data, NoSQL and NewSQL are making what used to be an easy choice into a complex decision with significant implications. The relational database (RDBMS) model completely dominated database technology for over 20 years. Today this \"one size fits all\" stability has been disrupted by a relatively recent explosion of new database technologies. These paradigm-busting technologies are powering the \"Big Data\" and \"NoSQL\" revolutions, as well as forcing fundamental changes in databases across the board. Deciding to use a relational database was once truly a no-brainer, and the various commercial relational databases competed on price, performance, reliability, and ease of use rather than on fundamental architectures. Today we are faced with choices between radically different database technologies. Choosing the right database today is a complex undertaking, with serious economic and technological consequences. Next Generation Databases demystifies today’s new database technologies. The book describes what each technology was designed to solve. It shows how each technology can be used to solve real word application and business problems. Most importantly, this book highlights the architectural differences between technologies that are the critical factors to consider when choosing a database platform for new and upcoming projects. Introduces the new technologies that have revolutionized the database landscape Describes how each technology can be used to solve specific application or business challenges Reviews the most popular new wave databases and how they use these new database technologies","language":"en","currency":"USD","id":"1484213297","title":"Next Generation Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=q6pPCwAAQBAJ&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":328,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NmZoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":27.13,"subtitle":null,"description":"開発者に新しい視点を与える7つのデータベース 近年、伝統的なRDBMS（リレーショナルデータベース管理システム）ではない、いわゆるNoSQL系の次世代DBMSが、クラウド上で動く分散アプリケーションの普及を背景に台頭しつつあります。しかし、さまざまな実装が群雄割拠しており、導入しようにもどこから手をつけたらよいか分かりにくい状態です。 本書は、NoSQL系DBMSに関心がある技術者を対象として書かれた“Seven Databases in Seven Weeks: A Guide to Modern Databases and the NoSQL Movement”（Pragmatic Bookshelf, 2012）の日本語訳です。特徴的な7種類の次世代DBMSのエッセンスを体験しながら学べる構成となっており、ひととおりの概念を理解したい人に最適です。 本書に寄せて 謝辞 はじめに 第1章 イントロダクション 1.1 最初に質問 1.2 データベースの分類 1.3 今後の行方 第2章 PostgreSQL 2.1 Post-greS-Q-L 2.2 1 日目：リレーション・CRUD・結合 2.3 2 日目：応用的なクエリ・コード・ルール 2.4 3 日目：全文検索と多次元 2.5 まとめ 第3章 Riak 3.1 Riak はウェブがお好き 3.2 1 日目：CRUD・リンク・MIME タイプ 3.3 2 日目：mapreduce とサーバークラスタ 3.4 3 日目：コンフリクトの解消とRiak の拡張 3.5 まとめ 第4章 HBase 4.1 HBase 入門 4.2 1 日目：CRUDとテーブル管理 4.3 2 日目：ビッグデータを扱う 4.4 3 日目：クラウドに持って行く 4.5 まとめ 第5章 MongoDB 5.1 ばかでかいMongo 5.2 1 日目：CRUDとネスト 5.3 2 日目：インデックス・集約・mapreduce 5.4 3 日目：レプリカセット・シャーディング・地理空間情報・GridFS 5.5 まとめ 第6章 CouchDB 6.1 カウチでリラックス 6.2 1 日目：CRUD・Futon・cURL Redux 6.3 2 日目：問い合わせビューの作成 6.4 3 日目：応用的なビュー・Changes API・レプリケーション 6.5 まとめ 第7章 Neo4j 7.1 Neo4j はホワイトボードフレンドリー 7.2 1 日目：グラフ・Groovy・CRUD 7.3 2 日目：REST・インデックス・アルゴリズム 7.4 3 日目：分散型高可用性 7.5 まとめ 第8章 Redis 8.1 データ構造サーバーストア 8.2 1 日目：CRUDとデータ型 8.3 2 日目：応用的な利用と分散 8.4 3 日目：他のデータベースと戯れる 8.5 まとめ 第9章 まとめ 9.1 データベースの分類ふたたび 9.2 選択 9.3 これから 付録A データベースの概要表 付録B CAP定理 B.1 結果整合性 B.2 現実世界のCAP 定理 B.3 レイテンシーのトレードオフ 付録C 参考文献 訳者あとがき 索引 著者・訳者について","language":"ja","currency":"USD","id":"4274069087","title":"7つのデータベース 7つの世界","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NmZoDwAAQBAJ&source=gbs_api","authors":["Eric Redmond and Jim R. Wilson"]},{"pageCount":206,"thumbnail":"http:\/\/books.google.com\/books\/content?id=K1QoDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Build, implement and scale distributed deep learning models for large-scale datasets About This Book Get to grips with the deep learning concepts and set up Hadoop to put them to use Implement and parallelize deep learning models on Hadoop's YARN framework A comprehensive tutorial to distributed deep learning with Hadoop Who This Book Is For If you are a data scientist who wants to learn how to perform deep learning on Hadoop, this is the book for you. Knowledge of the basic machine learning concepts and some understanding of Hadoop is required to make the best use of this book. What You Will Learn Explore Deep Learning and various models associated with it Understand the challenges of implementing distributed deep learning with Hadoop and how to overcome it Implement Convolutional Neural Network (CNN) with deeplearning4j Delve into the implementation of Restricted Boltzmann Machines (RBM) Understand the mathematical explanation for implementing Recurrent Neural Networks (RNN) Get hands on practice of deep learning and their implementation with Hadoop. In Detail This book will teach you how to deploy large-scale dataset in deep neural networks with Hadoop for optimal performance. Starting with understanding what deep learning is, and what the various models associated with deep neural networks are, this book will then show you how to set up the Hadoop environment for deep learning. In this book, you will also learn how to overcome the challenges that you face while implementing distributed deep learning with large-scale unstructured datasets. The book will also show you how you can implement and parallelize the widely used deep learning models such as Deep Belief Networks, Convolutional Neural Networks, Recurrent Neural Networks, Restricted Boltzmann Machines and autoencoder using the popular deep learning library deeplearning4j. Get in-depth mathematical explanations and visual representations to help you understand the design and implementations of Recurrent Neural network and Denoising AutoEncoders with deeplearning4j. To give you a more practical perspective, the book will also teach you the implementation of large-scale video processing, image processing and natural language processing on Hadoop. By the end of this book, you will know how to deploy various deep neural networks in distributed systems using Hadoop. Style and approach This book takes a comprehensive, step-by-step approach to implement efficient deep learning models on Hadoop. It starts from the basics and builds the readers' knowledge as they strengthen their understanding of the concepts. Practical examples are included in every step of the way to supplement the theory.","language":"en","currency":"USD","id":"1787121232","title":"Deep Learning with Hadoop","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=K1QoDwAAQBAJ&source=gbs_api","authors":["Dipayan Dev"]},{"pageCount":384,"thumbnail":"http:\/\/books.google.com\/books\/content?id=fN5Aa_m38vAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Evolutionary Database Design (paperback)","description":"Refactoring has proven its value in a wide range of development projects–helping software professionals improve system designs, maintainability, extensibility, and performance. Now, for the first time, leading agile methodologist Scott Ambler and renowned consultant Pramodkumar Sadalage introduce powerful refactoring techniques specifically designed for database systems. Ambler and Sadalage demonstrate how small changes to table structures, data, stored procedures, and triggers can significantly enhance virtually any database design–without changing semantics. You’ll learn how to evolve database schemas in step with source code–and become far more effective in projects relying on iterative, agile methodologies. This comprehensive guide and reference helps you overcome the practical obstacles to refactoring real-world databases by covering every fundamental concept underlying database refactoring. Using start-to-finish examples, the authors walk you through refactoring simple standalone database applications as well as sophisticated multi-application scenarios. You’ll master every task involved in refactoring database schemas, and discover best practices for deploying refactorings in even the most complex production environments. The second half of this book systematically covers five major categories of database refactorings. You’ll learn how to use refactoring to enhance database structure, data quality, and referential integrity; and how to refactor both architectures and methods. This book provides an extensive set of examples built with Oracle and Java and easily adaptable for other languages, such as C#, C++, or VB.NET, and other databases, such as DB2, SQL Server, MySQL, and Sybase. Using this book’s techniques and examples, you can reduce waste, rework, risk, and cost–and build database systems capable of evolving smoothly, far into the future.","language":"en","currency":"USD","id":"9780321630179","title":"Refactoring Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=fN5Aa_m38vAC&source=gbs_api","authors":["Scott W. Ambler","Pramod J. Sadalage"]},{"pageCount":246,"thumbnail":"http:\/\/books.google.com\/books\/content?id=n1nTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you're an application developer familiar with SQL databases such as MySQL or Postgres, and you want to explore distributed databases such as Cassandra, this is the perfect guide for you. Even if you've never worked with a distributed database before, Cassandra's intuitive programming interface coupled with the step-by-step examples in this book will have you building highly scalable persistence layers for your applications in no time.","language":"en","currency":"USD","id":"1783989211","title":"Learning Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=n1nTBgAAQBAJ&source=gbs_api","authors":["Mat Brown"]},{"pageCount":472,"thumbnail":"http:\/\/books.google.com\/books\/content?id=jXFuBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.44,"subtitle":null,"description":"If you are a developer who implements ElasticSearch in your web applications and want to sharpen your understanding of the core elements and applications, this is the book for you. It is assumed that you’ve got working knowledge of JSON and, if you want to extend ElasticSearch, of Java and related technologies.","language":"en","currency":"USD","id":"1783554843","title":"ElasticSearch Cookbook - Second Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=jXFuBgAAQBAJ&source=gbs_api","authors":["Alberto Paro"]},{"pageCount":912,"thumbnail":"http:\/\/books.google.com\/books\/content?id=U1RwBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.72,"subtitle":"Covering 14.10 and 15.04","description":"Ubuntu Unleashed 2015 Edition is filled with unique and advanced information for everyone who wants to make the most of the Linux-based Ubuntu operating system. This new edition has been thoroughly revised and updated by a long-time Ubuntu community leader to reflect the exciting new Ubuntu 14.10 while including tons of information that will continue to apply to future editions. Former Ubuntu Forum administrator Matthew Helmke covers all you need to know about Ubuntu 14.10 installation, configuration, productivity, multimedia, development, system administration, server operations, networking, virtualization, security, DevOps, and more–including intermediate-to-advanced techniques you won’t find in any other book. Helmke presents up-to-the-minute introductions to Ubuntu’s key productivity and Web development tools, programming languages, hardware support, and more. You’ll find new or improved coverage of Ubuntu’s Unity interface, various types of servers, software repositories, database options, virtualization and cloud services, development tools, monitoring, troubleshooting, Ubuntu’s push into mobile and other touch screen devices, and much more. Detailed information on how to… Configure and customize the Unity desktop Get started with multimedia and productivity applications, including LibreOffice Manage Linux services, users, and software packages Administer and run Ubuntu from the command line Automate tasks and use shell scripting Provide secure remote access and configure a secure VPN Manage kernels and modules Administer file, print, email, proxy, LDAP, DNS, and HTTP servers (Apache, Nginx, or alternatives) Learn about new options for managing large numbers of servers Work with databases (both SQL and the newest NoSQL alternatives) Get started with virtualization Build a private cloud with Juju and Charms Learn the basics about popular programming languages including Python, PHP, Perl, and new alternatives such as Go and Rust Learn about Ubuntu’s work toward usability on touch-screen and phone devices Ubuntu 14.10 on DVD DVD includes the full Ubuntu 14.10 distribution for 64 bit computers (most desktop and notebooks systems today) as well as the complete LibreOffice office suite and hundreds of additional programs and utilities. Free Kick Start Chapter! Purchase this book and receive a free Ubuntu 15.04 Kick Start chapter after Ubuntu 15.04 is released. See inside back cover for details","language":"en","currency":"USD","id":"0133794067","title":"Ubuntu Unleashed 2015 Edition","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=U1RwBQAAQBAJ&source=gbs_api","authors":["Matthew Helmke"]},{"pageCount":230,"thumbnail":"http:\/\/books.google.com\/books\/content?id=BVfTBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"If you are a JavaScript developer with a basic knowledge of WebRTC and software development, but want to explore how to use it in more depth, this book is for you.","language":"en","currency":"USD","id":"1783284463","title":"WebRTC Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=BVfTBgAAQBAJ&source=gbs_api","authors":["Andrii Sergiienko"]},{"pageCount":454,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Ys4GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"If you're a JavaScript developer interested in a deeper understanding of how to create and design Node.js applications, this is the book for you.","language":"en","currency":"USD","id":"1783287322","title":"Node.js Design Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Ys4GBgAAQBAJ&source=gbs_api","authors":["Mario Casciaro"]},{"pageCount":139,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8ZK5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"8th International Workshop, MOMPES 2012, Essen, Germany, September 4, 2012, Revised Papers","description":"This book constitutes the thoroughly refereed post-conference proceedings of the 8th International Workshop on Model-Based Methodologies for Pervasive and Embedded Software, MOMPES 2012, held in Essen, Germany, in September 2012. The 7 revised full papers presented together with 1 short papers were carefully reviewed and selected from 16 submissions. The papers cover a large spectrum of topics including model-driven engineering, model analysis, runtime verification, modeling of reactive systems, variability modeling, and domain-specific languages.","language":"en","currency":"USD","id":"3642382096","title":"Model-Based Methodologies for Pervasive and Embedded Software","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8ZK5BQAAQBAJ&source=gbs_api","authors":["Ricardo J. Machado","Rita Suzana Maciel","Julia Rubin","Goetz Botterweck"]},{"pageCount":192,"thumbnail":"http:\/\/books.google.com\/books\/content?id=o6jtBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":null,"description":"If you are a professional or enthusiast who has a basic understanding of graphs or has basic knowledge of Neo4j operations, this is the book for you. Although it is targeted at an advanced user base, this book can be used by beginners as it touches upon the basics. So, if you are passionate about taming complex data with the help of graphs and building high performance applications, you will be able to get valuable insights from this book.","language":"en","currency":"USD","id":"1783555165","title":"Neo4j High Performance","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=o6jtBgAAQBAJ&source=gbs_api","authors":["Sonal Raj"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t72uBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.65,"subtitle":"Using the CloudStack Ecosystem","description":"Planning to deploy and maintain a public, private, or hybrid cloud service? This cookbook’s handy how-to recipes help you quickly learn and install Apache CloudStack, along with several API clients, API wrappers, data architectures, and configuration management technologies that work as part of CloudStack’s ecosystem. You’ll learn how to use Vagrant, Ansible, Chef, Fluentd, Libcloud, and several other open source tools that let you build and operate CloudStack better and faster. If you’re an experienced programmer, system administrator, or DevOps practitioner familiar with bash, Git, package management, and some Python, you’re ready to go. Learn basic CloudStack installation from source, including features such as DevCloud, the CloudStack sandbox Get a step-by-step guide for installing CloudStack from packages on Ubuntu 14.04 using KVM Write your own applications on top of the CloudStack API, using CloudMonkey, Libcloud, jclouds, and CloStack Expose different APIs on CloudStack with the EC2Stack, Boto, and Eutester API wrappers Deploy applications easily, using Puppet, Salt, Ansible, Chef, and Vagrant Dive into cloud monitoring and storage with RiakCS, Fluentd, and Apache Whirr","language":"en","currency":"USD","id":"1491910100","title":"60 Recipes for Apache CloudStack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t72uBAAAQBAJ&source=gbs_api","authors":["Sébastien Goasguen"]},{"pageCount":101,"thumbnail":"http:\/\/books.google.com\/books\/content?id=dGu-BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"Big data is currently one of the most critical emerging technologies. Organizations around the world are looking to exploit the explosive growth of data to unlock previously hidden insights in the hope of creating new revenue streams, gaining operational efficiencies, and obtaining greater understanding of customer needs. It is important to think of big data and analytics together. Big data is the term used to describe the recent explosion of different types of data from disparate sources. Analytics is about examining data to derive interesting and relevant trends and patterns, which can be used to inform decisions, optimize processes, and even drive new business models. With today's deluge of data comes the problems of processing that data, obtaining the correct skills to manage and analyze that data, and establishing rules to govern the data's use and distribution. The big data technology stack is ever growing and sometimes confusing, even more so when we add the complexities of setting up big data environments with large up-front investments. Cloud computing seems to be a perfect vehicle for hosting big data workloads. However, working on big data in the cloud brings its own challenge of reconciling two contradictory design principles. Cloud computing is based on the concepts of consolidation and resource pooling, but big data systems (such as Hadoop) are built on the shared nothing principle, where each node is independent and self-sufficient. A solution architecture that can allow these mutually exclusive principles to coexist is required to truly exploit the elasticity and ease-of-use of cloud computing for big data environments. This IBM® RedpaperTM publication is aimed at chief architects, line-of-business executives, and CIOs to provide an understanding of the cloud-related challenges they face and give prescriptive guidance for how to realize the benefits of big data solutions quickly and cost-effectively.","language":"en","currency":"USD","id":"0738453994","title":"Building Big Data and Analytics Solutions in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=dGu-BQAAQBAJ&source=gbs_api","authors":["Wei-Dong Zhu","Manav Gupta","Ven Kumar","Sujatha Perepa","Arvind Sathi","Craig Statchuk","IBM Redbooks"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UEOZBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.39,"subtitle":"Mongo, Express, AngularJS, and Node.js","description":"Traditionally, web applications have been architected so that the back-end houses all the front-end code. This has resulted in heavy projects that are difficult to manage and scale. This book will explain a new way to write web applications by treating the front-end as if it were a third-party (such as a mobile client). This book, written by a practicing MEAN developer, will take a holistic approach to using the MEAN JavaScript platform for creating modern web applications and lay out how to use the MEAN (Mongo, Express, AngularJS, and Node.js) set of tools to create a web application, from installation and setup of the tools to debugging and deploying your app. After an introduction to how web development is changing and the advantages of using the MEAN stack, the author jumps into an introduction to each tool and then dives into using the complete JavaScript-based application stack to build, test, and deploy apps.","language":"en","currency":"USD","id":"0133962377","title":"Write Modern Web Apps with the MEAN Stack","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UEOZBAAAQBAJ&source=gbs_api","authors":["Jeff Dickey"]},{"pageCount":209,"thumbnail":"http:\/\/books.google.com\/books\/content?id=TSq5BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":59.99,"subtitle":"14th IFIP WG 6.1 International Conference, DAIS 2014, Held as Part of the 9th International Federated Conference on Distributed Computing Techniques, DisCoTec 2014, Berlin, Germany, June 3-5, 2014, Proceedings","description":"This book constitutes the proceedings of the 14th IFIP International Conference on Distributed Applications and Interoperable Systems, DAIS 2014, held in Berlin, Germany, in June 2014. The 12 papers presented in this volume were carefully reviewed and selected from 53 submissions. They deal with cloud computing, replicated storage, and large-scale systems.","language":"en","currency":"USD","id":"3662433524","title":"Distributed Applications and Interoperable Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=TSq5BQAAQBAJ&source=gbs_api","authors":["Kostas Magoutis","Peter Pietzuch"]},{"pageCount":483,"thumbnail":"http:\/\/books.google.com\/books\/content?id=6xpRBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":70.19,"subtitle":"25th International Conference, DEXA 2014, Munich, Germany, September 1-4, 2014. Proceedings","description":"This two volume set LNCS 8644 and LNCS 8645 constitutes the refereed proceedings of the 25th International Conference on Database and Expert Systems Applications, DEXA 2014, held in Munich, Germany, September 1-4, 2014. The 37 revised full papers presented together with 46 short papers, and 2 keynote talks, were carefully reviewed and selected from 159 submissions. The papers discuss a range of topics including: data quality; social web; XML keyword search; skyline queries; graph algorithms; information retrieval; XML; security; semantic web; classification and clustering; queries; social computing; similarity search; ranking; data mining; big data; approximations; privacy; data exchange; data integration; web semantics; repositories; partitioning; and business applications.","language":"en","currency":"USD","id":"3319100858","title":"Database and Expert Systems Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=6xpRBAAAQBAJ&source=gbs_api","authors":["Hendrik Decker","Lenka Lhotská","Sebastian Link","Marcus Spies","Roland R. Wagner"]},{"pageCount":130,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HyQbAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"The book is a concise guide for using LevelDB. It explains database concepts and the use of C++, ranging from the basics all the way to high level topics in an easy to follow, step-by-step format.The book is meant for developers who want an embedded database for their applications. Experienced programmers can pick up on the sophisticated data mapping patterns and tuning tips. Getting Started with LevelDB requires a minimal background in programming in C++ or Objective-C for OS\/X or iOS and familiarity with XCode. Therefore it teaches enough C++ to use LevelDB without presuming any C++ knowledge, so is suitable for beginner Objective-C programmers.","language":"en","currency":"USD","id":"1783281022","title":"Getting Started with LevelDB","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HyQbAgAAQBAJ&source=gbs_api","authors":["Andy Dent"]},{"pageCount":616,"thumbnail":"http:\/\/books.google.com\/books\/content?id=p1heDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"The Big Ideas Behind Reliable, Scalable, and Maintainable Systems","description":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures","language":"en","currency":"USD","id":"1491903104","title":"Designing Data-Intensive Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=p1heDgAAQBAJ&source=gbs_api","authors":["Martin Kleppmann"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XPkAEFXo7VgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18,"subtitle":null,"description":"Find the right big data solution for your business ororganization Big data management is one of the major challenges facingbusiness, industry, and not-for-profit organizations. Data setssuch as customer transactions for a mega-retailer, weather patternsmonitored by meteorologists, or social network activity can quicklyoutpace the capacity of traditional data management tools. If youneed to develop or manage big data solutions, you'll appreciate howthese four experts define, explain, and guide you through this newand often confusing concept. You'll learn what it is, why itmatters, and how to choose and implement solutions that work. Effectively managing big data is an issue of growing importanceto businesses, not-for-profit organizations, government, and ITprofessionals Authors are experts in information management, big data, and avariety of solutions Explains big data in detail and discusses how to select andimplement a solution, security concerns to consider, data storageand presentation issues, analytics, and much more Provides essential information in a no-nonsense,easy-to-understand style that is empowering Big Data For Dummies cuts through the confusion and helpsyou take charge of big data solutions for your organization.","language":"en","currency":"USD","id":"1118644174","title":"Big Data For Dummies","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XPkAEFXo7VgC&source=gbs_api","authors":["Judith S. Hurwitz","Alan Nugent","Fern Halper","Marcia Kaufman"]},{"pageCount":360,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4UEwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build a scalable, fault-tolerant and highly available data layer for your applications using Apache Cassandra About This Book Install Cassandra and set up multi-node clusters Design rich schemas that capture the relationships between different data types Master the advanced features available in Cassandra 3.x through a step-by-step tutorial and build a scalable, high performance database layer Who This Book Is For If you are a NoSQL developer and new to Apache Cassandra who wants to learn its common as well as not-so-common features, this book is for you. Alternatively, a developer wanting to enter the world of NoSQL will find this book useful. It does not assume any prior experience in coding or any framework. What You Will Learn Install Cassandra Create keyspaces and tables with multiple clustering columns to organize related data Use secondary indexes and materialized views to avoid denormalization of data Effortlessly handle concurrent updates with collection columns Ensure data integrity with lightweight transactions and logged batches Understand eventual consistency and use the right consistency level for your situation Understand data distribution with Cassandra Develop simple application using Java driver and implement application-level optimizations In Detail Cassandra is a distributed database that stands out thanks to its robust feature set and intuitive interface, while providing high availability and scalability of a distributed data store. This book will introduce you to the rich feature set offered by Cassandra, and empower you to create and manage a highly scalable, performant and fault-tolerant database layer. The book starts by explaining the new features implemented in Cassandra 3.x and get you set up with Cassandra. Then you'll walk through data modeling in Cassandra and the rich feature set available to design a flexible schema. Next you'll learn to create tables with composite partition keys, collections and user-defined types and get to know different methods to avoid denormalization of data. You will then proceed to create user-defined functions and aggregates in Cassandra. Then, you will set up a multi node cluster and see how the dynamics of Cassandra change with it. Finally, you will implement some application-level optimizations using a Java client. By the end of this book, you'll be fully equipped to build powerful, scalable Cassandra database layers for your applications. Style and approach This book takes a step-by- step approach to give you basic to intermediate knowledge of Apache Cassandra. Every concept is explained in depth, and is supplemented with practical examples when required.","language":"en","currency":"USD","id":"1787128407","title":"Learning Apache Cassandra","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4UEwDwAAQBAJ&source=gbs_api","authors":["Sandeep Yarabarla"]},{"pageCount":318,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ON0DCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"This book will introduce Redis and help you understand its various facets. Starting with an introduction to NoSQL, you will learn how to install Redis and how to classify and work with data structures. By working with real world scenarios pertaining to using Redis, you will discover sharding and indexing techniques, along with how to improve scalability and performance through persistent strategies and data migration techniques. With the help of multiple examples, you will learn to design web and business applications. You will also learn how to configure Redis for setting up clusters and tuning it for performance. At the end of this book, you will find essential tips on backup and recovery strategies for the Redis environment.","language":"en","currency":"USD","id":"1783980133","title":"Learning Redis","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ON0DCgAAQBAJ&source=gbs_api","authors":["Vinoo Das"]},{"pageCount":624,"thumbnail":"http:\/\/books.google.com\/books\/content?id=WgYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":29.99,"subtitle":"A Beginner's Guide","description":"Erlang is the language of choice for programmers who want to write robust, concurrent applications, but its strange syntax and functional design can intimidate the uninitiated. Luckily, there’s a new weapon in the battle against Erlang-phobia: Learn You Some Erlang for Great Good! Erlang maestro Fred Hébert starts slow and eases you into the basics: You’ll learn about Erlang’s unorthodox syntax, its data structures, its type system (or lack thereof!), and basic functional programming techniques. Once you’ve wrapped your head around the simple stuff, you’ll tackle the real meat-and-potatoes of the language: concurrency, distributed computing, hot code loading, and all the other dark magic that makes Erlang such a hot topic among today’s savvy developers. As you dive into Erlang’s functional fantasy world, you’ll learn about: –Testing your applications with EUnit and Common Test –Building and releasing your applications with the OTP framework –Passing messages, raising errors, and starting\/stopping processes over many nodes –Storing and retrieving data using Mnesia and ETS –Network programming with TCP, UDP, and the inet module –The simple joys and potential pitfalls of writing distributed, concurrent applications Packed with lighthearted illustrations and just the right mix of offbeat and practical example programs, Learn You Some Erlang for Great Good! is the perfect entry point into the sometimes-crazy, always-thrilling world of Erlang.","language":"en","currency":"USD","id":"1593275048","title":"Learn You Some Erlang for Great Good!","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=WgYvDwAAQBAJ&source=gbs_api","authors":["Fred Hebert"]},{"pageCount":274,"thumbnail":"http:\/\/books.google.com\/books\/content?id=sjflCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":22.39,"subtitle":null,"description":"Build fault tolerant concurrent and distributed applications with Akka About This Book Build networked applications that self-heal Scale out your applications to handle more traffic faster An easy-to-follow guide with a number of examples to ensure you get the best start with Akka Who This Book Is For This book is intended for beginner to intermediate Java or Scala developers who want to build applications to serve the high-scale user demands in computing today. If you need your applications to handle the ever-growing user bases and datasets with high performance demands, then this book is for you. Learning Akka will let you do more for your users with less code and less complexity, by building and scaling your networked applications with ease. What You Will Learn Use Akka to overcome the challenges of concurrent programming Resolve the issues faced in distributed computing with the help of Akka Scale applications to serve a high number of concurrent users Make your system fault-tolerant with self-healing applications Provide a timely response to users with easy concurrency Reduce hardware costs by building more efficient multi-user applications Maximise network efficiency by scaling it In Detail Software today has to work with more data, more users, more cores, and more servers than ever. Akka is a distributed computing toolkit that enables developers to build correct concurrent and distributed applications using Java and Scala with ease, applications that scale across servers and respond to failure by self-healing. As well as simplifying development, Akka enables multiple concurrency development patterns with particular support and architecture derived from Erlang's concept of actors (lightweight concurrent entities). Akka is written in Scala, which has become the programming language of choice for development on the Akka platform. Learning Akka aims to be a comprehensive walkthrough of Akka. This book will take you on a journey through all the concepts of Akka that you need in order to get started with concurrent and distributed applications and even build your own. Beginning with the concept of Actors, the book will take you through concurrency in Akka. Moving on to networked applications, this book will explain the common pitfalls in these difficult problem areas while teaching you how to use Akka to overcome these problems with ease. The book is an easy to follow example-based guide that will strengthen your basic knowledge of Akka and aid you in applying the same to real-world scenarios. Style and approach An easy-to-follow, example-based guide that will take you through building several networked-applications that work together while you are learning concurrent and distributed computing concepts. Each topic is explained while showing you how to design with Akka and how it is used to overcome common problems in applications. By showing Akka in context to the problems, it will help you understand what the common problems are in distributed applications and how to overcome them.","language":"en","currency":"USD","id":"1784393541","title":"Learning Akka","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=sjflCwAAQBAJ&source=gbs_api","authors":["Jason Goodwin"]},{"pageCount":146,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gf2wDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Aligning Principles, Practices, and Culture","description":"Microservices can have a positive impact on your enterprise—just ask Amazon and Netflix—but you can fall into many traps if you don’t approach them in the right way. This practical guide covers the entire microservices landscape, including the principles, technologies, and methodologies of this unique, modular style of system building. You’ll learn about the experiences of organizations around the globe that have successfully adopted microservices. In three parts, this book explains how these services work and what it means to build an application the Microservices Way. You’ll explore a design-based approach to microservice architecture with guidance for implementing various elements. And you’ll get a set of recipes and practices for meeting practical, organizational, and cultural challenges to microservice adoption. Learn how microservices can help you drive business objectives Examine the principles, practices, and culture that define microservice architectures Explore a model for creating complex systems and a design process for building a microservice architecture Learn the fundamental design concepts for individual microservices Delve into the operational elements of a microservices architecture, including containers and service discovery Discover how to handle the challenges of introducing microservice architecture in your organization","language":"en","currency":"USD","id":"1491956224","title":"Microservice Architecture","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gf2wDAAAQBAJ&source=gbs_api","authors":["Irakli Nadareishvili","Ronnie Mitra","Matt McLarty","Mike Amundsen"]},{"pageCount":370,"thumbnail":"http:\/\/books.google.com\/books\/content?id=8ngws8f_lNsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36.76,"subtitle":null,"description":"Data Warehousing in the Age of the Big Data will help you and your organization make the most of unstructured data with your existing data warehouse. As Big Data continues to revolutionize how we use data, it doesn't have to create more confusion. Expert author Krish Krishnan helps you make sense of how Big Data fits into the world of data warehousing in clear and concise detail. The book is presented in three distinct parts. Part 1 discusses Big Data, its technologies and use cases from early adopters. Part 2 addresses data warehousing, its shortcomings, and new architecture options, workloads, and integration techniques for Big Data and the data warehouse. Part 3 deals with data governance, data visualization, information life-cycle management, data scientists, and implementing a Big Data–ready data warehouse. Extensive appendixes include case studies from vendor implementations and a special segment on how we can build a healthcare information factory. Ultimately, this book will help you navigate through the complex layers of Big Data and data warehousing while providing you information on how to effectively think about using all these technologies and the architectures to design the next-generation data warehouse. Learn how to leverage Big Data by effectively integrating it into your data warehouse. Includes real-world examples and use cases that clearly demonstrate Hadoop, NoSQL, HBASE, Hive, and other Big Data technologies Understand how to optimize and tune your current data warehouse infrastructure and integrate newer infrastructure matching data processing workloads and requirements","language":"en","currency":"USD","id":"0124059201","title":"Data Warehousing in the Age of Big Data","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=8ngws8f_lNsC&source=gbs_api","authors":["Krish Krishnan"]},{"pageCount":156,"thumbnail":"http:\/\/books.google.com\/books\/content?id=a2C4CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":11.99,"subtitle":null,"description":"This book helps beginner-level AngularJS developers organize AngularJS applications by discussing important AngularJS concepts and best practices. If you are an experienced AngularJS developer but haven't written directives or haven't created custom HTML controls before, then this book is ideal for you.","language":"en","currency":"USD","id":"178439419X","title":"Data-oriented Development with AngularJS","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=a2C4CAAAQBAJ&source=gbs_api","authors":["Manoj Waikar"]},{"pageCount":272,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ota_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Evolutionary Patterns to Transform Your Monolith","description":"How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture. With many illustrative examples, insightful migration patterns, and a bevy of practical advice to transition your monolith enterprise into a microservice operation, this practical guide covers multiple scenarios and strategies for a successful migration, from initial planning all the way through application and database decomposition. You’ll learn several tried and tested patterns and techniques that you can use as you migrate your existing architecture. Ideal for organizations looking to transition to microservices, rather than rebuild Helps companies determine whether to migrate, when to migrate, and where to begin Addresses communication, integration, and the migration of legacy systems Discusses multiple migration patterns and where they apply Provides database migration examples, along with synchronization strategies Explores application decomposition, including several architectural refactoring patterns Delves into details of database decomposition, including the impact of breaking referential and transactional integrity, new failure modes, and more","language":"en","currency":"USD","id":"1492047791","title":"Monolith to Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ota_DwAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":374,"thumbnail":"http:\/\/books.google.com\/books\/content?id=YKMLCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":56,"subtitle":"For SQL, NoSQL, Cloud and Distributed Databases","description":"Advanced data management has always been at the core of efficient database and information systems. Recent trends like big data and cloud computing have aggravated the need for sophisticated and flexible data storage and processing solutions. This book provides a comprehensive coverage of the principles of data management developed in the last decades with a focus on data structures and query languages. It treats a wealth of different data models and surveys the foundations of structuring, processing, storing and querying data according these models. Starting off with the topic of database design, it further discusses weaknesses of the relational data model, and then proceeds to convey the basics of graph data, tree-structured XML data, key-value pairs and nested, semi-structured JSON data, columnar and record-oriented data as well as object-oriented data. The final chapters round the book off with an analysis of fragmentation, replication and consistency strategies for data management in distributed databases as well as recommendations for handling polyglot persistence in multi-model databases and multi-database architectures. While primarily geared towards students of Master-level courses in Computer Science and related areas, this book may also be of benefit to practitioners looking for a reference book on data modeling and query processing. It provides both theoretical depth and a concise treatment of open source technologies currently on the market.","language":"en","currency":"USD","id":"3110441411","title":"Advanced Data Management","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=YKMLCwAAQBAJ&source=gbs_api","authors":["Lena Wiese"]},{"pageCount":376,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"A Deep Dive into How Distributed Data Systems Work","description":"When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency","language":"en","currency":"USD","id":"1492040304","title":"Database Internals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-F2vDwAAQBAJ&source=gbs_api","authors":["Alex Petrov"]},{"pageCount":100,"thumbnail":"http:\/\/books.google.com\/books\/content?id=wuRD0VxVAKEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Working with REST and Web Sockets on Yaws","description":"Why choose Erlang for web applications? Discover the answer hands-on by building a simple web service with this book. If you’re an experienced web developer who knows basic Erlang, you’ll learn how to work with REST, dynamic content, web sockets, and concurrency through several examples. In the process, you’ll see first-hand that Erlang is ideal for building business-critical services. Erlang was designed for fault-tolerant, non-stop telecom systems, and building applications with it requires a large set of skills. By the end of the book, you’ll have the information you need to build a basic web service and get it running. Explore the power of Erlang and REST for building web services Serve static and dynamic content with the Yaws web server Use different methods for outputting data to user, such as encoding Erlang data structures into JSON or XML Build an application to listen for HTTP requests, process them, store data, and return useful data Go beyond the request-response model—push data to clients with web sockets Use Erlang and Yaws to stream data from the server to a client \"A book which is truly needed and will help get Erlang to the next level.\" —Francesco Cesarini, CEO of Erlang Solutions, author of Erlang Programming.","language":"en","currency":"USD","id":"1449320651","title":"Building Web Applications with Erlang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=wuRD0VxVAKEC&source=gbs_api","authors":["Zachary Kessin"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=CJd__8ANvtQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":64,"subtitle":"Lessons from Successful Projects in the Top Companies","description":"Proven techniques for software engineering success This in-depth volume examines software engineering topics that are not covered elsewhere: the question of why software engineering has developed more than 2,500 programming languages; problems with traditional definitions of software quality; and problems with common metrics, \"lines of code,\" and \"cost per defect\" that violate standard economic assumptions. The book notes that a majority of \"new\" projects are actually replacements for legacy applications, illustrating that data mining for lost requirements should be a standard practice. Difficult social engineering issues are also covered, such as how to minimize harm from layoffs and downsizing. Software Engineering Best Practices explains how to effectively plan, size, schedule, and manage software projects of all types, using solid engineering procedures. It details proven methods, from initial requirements through 20 years of maintenance. Portions of the book have been extensively reviewed by key engineers from top companies, including IBM, Microsoft, Unisys, and Sony. Manage Agile, hierarchical, matrix, and virtual software development teams Optimize software quality using JAD, OFD, TSP, static analysis, inspections, and other methods with proven success records Use high-speed functional metrics to assess productivity and quality levels Plan optimal organization, from small teams through more than 1,000 personnel","language":"en","currency":"USD","id":"0071621628","title":"Software Engineering Best Practices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=CJd__8ANvtQC&source=gbs_api","authors":["Capers Jones"]},{"pageCount":556,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nUhiQxUXVpMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Random Access to Your Planet-Size Data","description":"If you're looking for a scalable storage solution to accommodate a virtually endless amount of data, this book shows you how Apache HBase can fulfill your needs. As the open source implementation of Google's BigTable architecture, HBase scales to billions of rows and millions of columns, while ensuring that write and read performance remain constant. Many IT executives are asking pointed questions about HBase. This book provides meaningful answers, whether you’re evaluating this non-relational database or planning to put it into practice right away. Discover how tight integration with Hadoop makes scalability with HBase easier Distribute large datasets across an inexpensive cluster of commodity servers Access HBase with native Java clients, or with gateway servers providing REST, Avro, or Thrift APIs Get details on HBase’s architecture, including the storage format, write-ahead log, background processes, and more Integrate HBase with Hadoop's MapReduce framework for massively parallelized data processing jobs Learn how to tune clusters, design schemas, copy tables, import bulk data, decommission nodes, and many other tasks","language":"en","currency":"USD","id":"1449315224","title":"HBase: The Definitive Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nUhiQxUXVpMC&source=gbs_api","authors":["Lars George"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Veb7AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"Filled with practical, step-by-step instructions and clear explanations for the most important and useful tasks.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.A practical, step-by-step guide featuring recipes that will get you up and running quickly with Nancy.If you are a .NET oriented web developer who is curious to find out what lies beyond the Microsoft provided frameworks, then this book is for you! It’s beneficial to have a good knowledge of C# and .NET, as well as a basic working knowledge of HTTP. If testability is important to you, and you’re looking for a lightweight, code focused approach to building web applications, this book offers you all the guidance that you will need.","language":"en","currency":"USD","id":"1783283920","title":"Instant Nancy Web Development","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Veb7AAAAQBAJ&source=gbs_api","authors":["Christian Horsdal"]},{"pageCount":416,"thumbnail":"http:\/\/books.google.com\/books\/content?id=UA78f2vJsLcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.44,"subtitle":"A Problem-Solving Primer","description":"This textbook provides an engaging and motivational introduction to traditional topics in discrete mathematics, in a manner specifically designed to appeal to computer science students. The text empowers students to think critically, to be effective problem solvers, to integrate theory and practice, and to recognize the importance of abstraction. Clearly structured and interactive in nature, the book presents detailed walkthroughs of several algorithms, stimulating a conversation with the reader through informal commentary and provocative questions. Features: no university-level background in mathematics required; ideally structured for classroom-use and self-study, with modular chapters following ACM curriculum recommendations; describes mathematical processes in an algorithmic manner; contains examples and exercises throughout the text, and highlights the most important concepts in each section; selects examples that demonstrate a practical use for the concept in question.","language":"en","currency":"USD","id":"1447140699","title":"Fundamentals of Discrete Math for Computer Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=UA78f2vJsLcC&source=gbs_api","authors":["Tom Jenkyns","Ben Stephenson"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=LebtAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Paradigm Over Syntax","description":"If you’re familiar with functional programming basics and want to gain a much deeper understanding, this in-depth guide takes you beyond syntax and demonstrates how you need to think in a new way. Software architect Neal Ford shows intermediate to advanced developers how functional coding allows you to step back a level of abstraction so you can see your programming problem with greater clarity. Each chapter shows you various examples of functional thinking, using numerous code examples from Java 8 and other JVM languages that include functional capabilities. This book may bend your mind, but you’ll come away with a much better grasp of functional programming concepts. Understand why many imperative languages are adding functional capabilities Compare functional and imperative solutions to common problems Examine ways to cede control of routine chores to the runtime Learn how memoization and laziness eliminate hand-crafted solutions Explore functional approaches to design patterns and code reuse View real-world examples of functional thinking with Java 8, and in functional architectures and web frameworks Learn the pros and cons of living in a paradigmatically richer world If you’re new to functional programming, check out Josh Backfield’s book Becoming Functional.","language":"en","currency":"USD","id":"1449365477","title":"Functional Thinking","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=LebtAwAAQBAJ&source=gbs_api","authors":["Neal Ford"]},{"pageCount":22,"thumbnail":"http:\/\/books.google.com\/books\/content?id=-OQ2q5JqOdEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":0,"subtitle":null,"description":"We've all heard it: according to Hal Varian, statistics is the next sexy job. Five years ago, in What is Web 2.0, Tim O'Reilly said that \"data is the next Intel Inside.\" But what does that statement mean? Why do we suddenly care about statistics and about data? This report examines the many sides of data science -- the technologies, the companies and the unique skill sets.The web is full of \"data-driven apps.\" Almost any e-commerce application is a data-driven application. There's a database behind a web front end, and middleware that talks to a number of other databases and data services (credit card processing companies, banks, and so on). But merely using data isn't really what we mean by \"data science.\" A data application acquires its value from the data itself, and creates more data as a result. It's not just an application with data; it's a data product. Data science enables the creation of data products.","language":"en","currency":"USD","id":"1449336094","title":"What Is Data Science?","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=-OQ2q5JqOdEC&source=gbs_api","authors":["Mike Loukides"]},{"pageCount":190,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qYI2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Support Constant Change","description":"The software development ecosystem is constantly changing, providing a constant stream of new tools, frameworks, techniques, and paradigms. Over the past few years, incremental developments in core engineering practices for software development have created the foundations for rethinking how architecture changes over time, along with ways to protect important architectural characteristics as it evolves. This practical guide ties those parts together with a new way to think about architecture and time.","language":"en","currency":"USD","id":"1491986328","title":"Building Evolutionary Architectures","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qYI2DwAAQBAJ&source=gbs_api","authors":["Neal Ford","Rebecca Parsons","Patrick Kua"]},{"pageCount":481,"thumbnail":"http:\/\/books.google.com\/books\/content?id=NKjDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"With MVC, Razor Pages, Web API, jQuery, Angular, SQL Server, and NoSQL","description":"Hit the ground running with this book to quickly learn the fundamentals of HTML form processing, user authentication, and database CRUD (Create, Read, Update, and Delete) operations using the ASP.NET Core family of technologies. You will utilize cutting-edge and popular technology options from both the server side and client side to help you achieve your web application goals as quickly as possible. Developers who want to learn ASP.NET Core and complementary technologies are often overwhelmed by the large number of options involved in building modern web applications. This book introduces you to the most popular options so that you can confidently begin working on projects in no time. You will learn by example, building a sample application that demonstrates how the same application can be built using different options. This experiential approach will give you the basic skills and knowledge to understand how the options work together so that you can make an informed decision about the available choices, their trade-offs, and code level comparison. After reading this book, you will be able to choose your selected learning path. What You Will Learn Develop data entry forms in ASP.NET Core, complete with validations and processing Perform CRUD operations using server-side options: ASP.NET Core MVC, Razor Pages, Web APIs, and Blazor Perform CRUD operations using client-side options: jQuery and Angular Secure web applications using ASP.NET Core Identity, cookie authentication, and JWT authentication Use RDBMS and NoSQL data stores: SQL Server, Azure SQL Database, Azure Cosmos DB, and MongoDB for CRUD operations Deploy ASP.NET Core web applications to IIS and Azure App Service Who This Book Is For Developers who possess a basic understanding of ASP.NET and how web applications work. Some experience with Visual Studio 2017 or higher, C#, and JavaScript is helpful.","language":"en","currency":"USD","id":"1484255097","title":"Beginning Database Programming Using ASP.NET Core 3","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=NKjDDwAAQBAJ&source=gbs_api","authors":["Bipin Joshi"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qRERCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.81,"subtitle":"Application Development, Table Design, and Best Practices","description":"Get up to speed on Apache Accumulo, the flexible, high-performance key\/value store created by the National Security Agency (NSA) and based on Google’s BigTable data storage system. Written by former NSA team members, this comprehensive tutorial and reference covers Accumulo architecture, application development, table design, and cell-level security. With clear information on system administration, performance tuning, and best practices, this book is ideal for developers seeking to write Accumulo applications, administrators charged with installing and maintaining Accumulo, and other professionals interested in what Accumulo has to offer. You will find everything you need to use this system fully. Get a high-level introduction to Accumulo’s architecture and data model Take a rapid tour through single- and multiple-node installations, data ingest, and query Learn how to write Accumulo applications for several use cases, based on examples Dive into Accumulo internals, including information not available in the documentation Get detailed information for installing, administering, tuning, and measuring performance Learn best practices based on successful implementations in the field Find answers to common questions that every new Accumulo user asks","language":"en","currency":"USD","id":"149194692X","title":"Accumulo","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qRERCgAAQBAJ&source=gbs_api","authors":["Aaron Cordova","Billie Rinaldi","Michael Wall"]},{"pageCount":488,"thumbnail":"http:\/\/books.google.com\/books\/content?id=O4wwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":67.99,"subtitle":"19th International Conference, DaWaK 2017, Lyon, France, August 28–31, 2017, Proceedings","description":"This book constitutes the refereed proceedings of the 19th International Conference on Big Data Analytics and Knowledge Discovery, DaWaK 2017, held in Lyon, France, in August 2017. The 24 revised full papers and 11 short papers presented were carefully reviewed and selected from 97 submissions. The papers are organized in the following topical sections: new generation data warehouses design; cloud and NoSQL databases; advanced programming paradigms; non-functional requirements satisfaction; machine learning; social media and twitter analysis; sentiment analysis and user influence; knowledge discovery; and data flow management and optimization.","language":"en","currency":"USD","id":"3319642839","title":"Big Data Analytics and Knowledge Discovery","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=O4wwDwAAQBAJ&source=gbs_api","authors":["Ladjel Bellatreche","Sharma Chakravarthy"]},{"pageCount":164,"thumbnail":"http:\/\/books.google.com\/books\/content?id=JJtsBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":null,"description":"This book is intended for developers and Big Data engineers who want to know all about HBase at a hands-on level. For in-depth understanding, it would be helpful to have a bit of familiarity with HDFS and MapReduce programming concepts with no prior experience with HBase or similar technologies. This book is also for Big Data enthusiasts and database developers who have worked with other NoSQL databases and now want to explore HBase as another futuristic, scalable database solution in the Big Data space.","language":"en","currency":"USD","id":"1783987251","title":"HBase Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=JJtsBQAAQBAJ&source=gbs_api","authors":["Nishant Garg"]},{"pageCount":229,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XOCgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Models, Languages, Consistency Options and Architectures for Big Data Management","description":"This book offers a comprehensive introduction to relational (SQL) and non-relational (NoSQL) databases. The authors thoroughly review the current state of database tools and techniques, and examine coming innovations. The book opens with a broad look at data management, including an overview of information systems and databases, and an explanation of contemporary database types: SQL and NoSQL databases, and their respective management systems The nature and uses of Big Data A high-level view of the organization of data management Data Modeling and Consistency Chapter-length treatment is afforded Data Modeling in both relational and graph databases, including enterprise-wide data architecture, and formulas for database design. Coverage of languages extends from an overview of operators, to SQL and and QBE (Query by Example), to integrity constraints and more. A full chapter probes the challenges of Ensuring Data Consistency, covering: Multi-User Operation Troubleshooting Consistency in Massive Distributed Data Comparison of the ACID and BASE consistency models, and more System Architecture also gets from its own chapter, which explores Processing of Homogeneous and Heterogeneous Data; Storage and Access Structures; Multi-dimensional Data Structures and Parallel Processing with MapReduce, among other topics. Post-Relational and NoSQL Databases The chapter on post-relational databases discusses the limits of SQL – and what lies beyond, including Multi-Dimensional Databases, Knowledge Bases and and Fuzzy Databases. A final chapter covers NoSQL Databases, along with Development of Non-Relational Technologies, Key-Value, Column-Family and Document Stores XML Databases and Graphic Databases, and more The book includes more than 100 tables, examples and illustrations, and each chapter offers a list of resources for further reading. SQL & NoSQL Databases conveys the strengths and weaknesses of relational and non-relational approaches, and shows how to undertake development for big data applications. The book benefits readers including students and practitioners working across the broad field of applied information technology. This textbook has been recommended and developed for university courses in Germany, Austria and Switzerland.","language":"en","currency":"USD","id":"3658245492","title":"SQL & NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XOCgDwAAQBAJ&source=gbs_api","authors":["Andreas Meier","Michael Kaufmann"]},{"pageCount":229,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XOCgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.49,"subtitle":"Models, Languages, Consistency Options and Architectures for Big Data Management","description":"This book offers a comprehensive introduction to relational (SQL) and non-relational (NoSQL) databases. The authors thoroughly review the current state of database tools and techniques, and examine coming innovations. The book opens with a broad look at data management, including an overview of information systems and databases, and an explanation of contemporary database types: SQL and NoSQL databases, and their respective management systems The nature and uses of Big Data A high-level view of the organization of data management Data Modeling and Consistency Chapter-length treatment is afforded Data Modeling in both relational and graph databases, including enterprise-wide data architecture, and formulas for database design. Coverage of languages extends from an overview of operators, to SQL and and QBE (Query by Example), to integrity constraints and more. A full chapter probes the challenges of Ensuring Data Consistency, covering: Multi-User Operation Troubleshooting Consistency in Massive Distributed Data Comparison of the ACID and BASE consistency models, and more System Architecture also gets from its own chapter, which explores Processing of Homogeneous and Heterogeneous Data; Storage and Access Structures; Multi-dimensional Data Structures and Parallel Processing with MapReduce, among other topics. Post-Relational and NoSQL Databases The chapter on post-relational databases discusses the limits of SQL – and what lies beyond, including Multi-Dimensional Databases, Knowledge Bases and and Fuzzy Databases. A final chapter covers NoSQL Databases, along with Development of Non-Relational Technologies, Key-Value, Column-Family and Document Stores XML Databases and Graphic Databases, and more The book includes more than 100 tables, examples and illustrations, and each chapter offers a list of resources for further reading. SQL & NoSQL Databases conveys the strengths and weaknesses of relational and non-relational approaches, and shows how to undertake development for big data applications. The book benefits readers including students and practitioners working across the broad field of applied information technology. This textbook has been recommended and developed for university courses in Germany, Austria and Switzerland.","language":"en","currency":"USD","id":"3658245492","title":"SQL & NoSQL Databases","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XOCgDwAAQBAJ&source=gbs_api","authors":["Andreas Meier","Michael Kaufmann"]},{"pageCount":284,"thumbnail":"http:\/\/books.google.com\/books\/content?id=khIYY4MVIIoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"What Relational Databases Are Really All About","description":"All of today’s mainstream database products support the SQL language, and relational theory is what SQL is supposed to be based on. But are those products truly relational? Sadly, the answer is no. This book shows you what a real relational product would be like, and how and why it would be so much better than what’s currently available. With this unique book, you will: Learn how to see database systems as programming systems Get a careful, precise, and detailed definition of the relational model Explore a detailed analysis of SQL from a relational point of view There are literally hundreds of books on relational theory or the SQL language or both. But this one is different. First, nobody is more qualified than Chris Date to write such a book. He and Ted Codd, inventor of the relational model, were colleagues for many years, and Chris’s involvement with the technology goes back to the time of Codd’s first papers in 1969 and 1970. Second, most books try to use SQL as a vehicle for teaching relational theory, but this book deliberately takes the opposite approach. Its primary aim is to teach relational theory as such. Then it uses that theory as a vehicle for teaching SQL, showing in particular how that theory can help with the practical problem of using SQL correctly and productively. Any computer professional who wants to understand what relational systems are all about can benefit from this book. No prior knowledge of databases is assumed.","language":"en","currency":"USD","id":"1449369456","title":"Relational Theory for Computer Professionals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=khIYY4MVIIoC&source=gbs_api","authors":["C.J. Date"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=iLNCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Gain a solid understanding of T-SQL—and write better queries Master the fundamentals of Transact-SQL—and develop your own code for querying and modifying data in Microsoft SQL Server 2012. Led by a SQL Server expert, you’ll learn the concepts behind T-SQL querying and programming, and then apply your knowledge with exercises in each chapter. Once you understand the logic behind T-SQL, you’ll quickly learn how to write effective code—whether you’re a programmer or database administrator. Discover how to: Work with programming practices unique to T-SQL Create database tables and define data integrity Query multiple tables using joins and subqueries Simplify code and improve maintainability with table expressions Implement insert, update, delete, and merge data modification strategies Tackle advanced techniques such as window functions, pivoting and grouping sets Control data consistency using isolation levels, and mitigate deadlocks and blocking Take T-SQL to the next level with programmable objects","language":"en","currency":"USD","id":"0735673950","title":"Microsoft SQL Server 2012 T-SQL Fundamentals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=iLNCAwAAQBAJ&source=gbs_api","authors":["Itzik Ben-Gan"]},{"pageCount":336,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oA9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":28.99,"subtitle":"Practical, Server-Side JavaScript That Scales","description":"Node.js is the platform of choice for creating modern web services. This fast-paced book gets you up to speed on server-side programming with Node.js 8, as you develop real programs that are small, fast, low-profile, and useful. Take JavaScript beyond the browser, explore dynamic language features, and embrace evented programming.Harness the power of the event loop and non-blocking I\/O to create highly parallel microservices and applications. This expanded and updated second edition showcases the latest ECMAScript features, current best practices, and modern development techniques. JavaScript is the backbone of the modern web, powering nearly every web app's user interface. Node.js is JavaScript for the server. This greatly expanded second edition introduces new language features while dramatically increasing coverage of core topics. Each hands-on chapter offers progressively more challenging topics and techniques, broadening your skill set and enabling you to think in Node.js. Write asynchronous, non-blocking code using Node.js's style and patterns. Cluster and load balance services with Node.js core features and third-party tools. Harness the power of databases such as Elasticsearch and Redis. Work with many protocols, create RESTful web services, TCP socket clients and servers, and more. Test your code's functionality with Mocha, and manage its life cycle with npm. Discover how Node.js pairs a server-side event loop with a JavaScript runtime to produce screaming fast, non-blocking concurrency. Through a series of practical programming domains, use the latest available ECMAScript features and harness key Node.js classes and popular modules. Create rich command-line tools and a web-based UI using modern web development techniques. Join the smart and diverse community that's rapidly advancing the state of the art in JavaScript development. What You Need: Node.js 8.x Operating system with bash-like shell OMQ (pronounced \"Zero-M-Q\") library, version 3.2 or higher Elasticsearch version 5.0 or higher jq version 1.5 or higher Redis version 3.2 or higher","language":"en","currency":"USD","id":"168050536X","title":"Node.js 8 the Right Way","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oA9QDwAAQBAJ&source=gbs_api","authors":["Jim Wilson"]},{"pageCount":768,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OwPG6pFAGX8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":41.07,"subtitle":"A Systematic Approach to Database Optimization","description":"Oracle Performance Survival Guide A Systematic Approach to Database Optimization The fast, complete, start-to-finish guide to optimizing Oracle performance Oracle Performance Survival Guide offers a structured, systematic, start-to-finish methodology for optimizing Oracle performance as efficiently as possible. Leading Oracle expert Guy Harrison shows how to maximize your tuning investment by focusing on causes rather than symptoms, and by quickly identifying the areas that deliver the greatest “bang for the buck.” Writing for DBAs and developers with all levels of experience, Harrison covers every area of Oracle performance management, from application design through SQL tuning, contention management through memory and physical IO management. He also presents up-to-the-minute guidance for optimizing the performance of the Oracle 11g Release 2. You’ll start by mastering Oracle structured performance tuning principles and tools, including techniques for tracing and monitoring Oracle execution. Harrison illuminates the interaction between applications and databases, guides you through choosing tuning tools, and introduces upfront design techniques that lead to higher-performance applications. He also presents a collection of downloadable scripts for reporting on all aspects of database performance. Coverage includes • “Tuning by layers,” the most effective, highest-value approach to Oracle performance optimization • Making the most of Oracle’s core tools for tracing, monitoring, and diagnosing performance • Highly efficient database logical and physical design, indexing, transaction design, and API use • SQL and PL\/SQL tuning, including the use of parallel SQL techniques • Minimizing contention for locks, latches, shared memory, and other database resources • Optimizing memory and physical disk IO • Tuning Real Application Cluster (RAC) databases guyharrison.net informit.com\/ph","language":"en","currency":"USD","id":"0137000502","title":"Oracle Performance Survival Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OwPG6pFAGX8C&source=gbs_api","authors":["Guy Harrison"]},{"pageCount":176,"thumbnail":"http:\/\/books.google.com\/books\/content?id=C7j3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15,"subtitle":"An Innocent's Guide to the Tech Inside","description":"What is “the cloud”? Is it here or there? Should it be allowed? Should I even care? Have you ever imagined the internet as a giant Rube Goldberg machine? Or the fast-evolving cloud computing space as a literal jungle filled with prehistoric beasts? Does a data breach look like a neo-noir nightmare full of turned-up coat collars and rain-soaked alleys? Wouldn’t all these vital concepts be easier to understand if they looked as interesting as they are? And wouldn’t they be more memorable if we could explain them in rhyme? Whether you’re a kid or an adult, the answer is: YES! The medicine in this spoonful of sugar is a sneaky-informative tour through the past, present and future of cloud computing, from mainframes to serverless and from the Internet of Things to artificial intelligence. Forrest is a professional explainer whose highly-rated conference talks and viral cartoon graphics have been teaching engineers to cloud for years. He knows that a picture is worth a thousand words. But he has plenty of words, too. Your hotel key, your boarding pass, The card you swipe to pay for gas, The smart TV atop the bar, The entertainment in your car, Your doorbell, toothbrush, thermostat, The vacuum that attacked your cat, They all connect the cloud and you. Maybe they shouldn't, but they do. As a graduation gift (call it “Oh the Places You’ll Go” for engineering students), a cubicle conversation starter, or just a delightfully nerdy bedtime story for your kids, “The Read-Aloud Cloud” will be the definitive introduction to the technologies that everyone uses and nobody understands. You can even read it silently if you want. But good luck with that.","language":"en","currency":"USD","id":"1119677645","title":"The Read Aloud Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=C7j3DwAAQBAJ&source=gbs_api","authors":["Forrest Brazeal"]},{"pageCount":167,"thumbnail":"http:\/\/books.google.com\/books\/content?id=l-VyDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"7th International Workshop on Accelerating Data Analysis and Data Management Systems Using Modern Processor and Storage Architectures, ADMS 2016 and 4th International Workshop on In-Memory Data Management and Analytics, IMDM 2016, New Delhi, India, September 1, 2016, Revised Selected Papers","description":"This book contains selected papers from the 7th International Workshop on Accelerating Analytics and Data Management Systems Using Modern Processor and Storage Architectures, ADMS 2016, and the 4th International Workshop on In-Memory Data Management and Analytics, IMDM 2016, held in New Dehli, India, in September 2016. The joint Workshops were co-located with VLDB 2016. The 9 papers presented were carefully reviewed and selected from 18 submissions. They investigate opportunities in accelerating analytics\/data management systems and workloads (including traditional OLTP, data warehousing\/OLAP, ETL streaming\/real-time, business analytics, and XML\/RDF processing) running memory-only environments, using processors (e.g. commodity and specialized multi-core, GPUs and FPGAs, storage systems (e.g. storage-class memories like SSDs and phase-change memory), and hybrid programming models like CUDA, OpenCL, and Open ACC. The papers also explore the interplay between overall system design, core algorithms, query optimization strategies, programming approaches, performance modeling and evaluation, from the perspective of data management applications.","language":"en","currency":"USD","id":"3319561111","title":"Data Management on New Hardware","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=l-VyDgAAQBAJ&source=gbs_api","authors":["Spyros Blanas","Rajesh Bordawekar","Justin Levandoski","Andrew Pavlo","Tirthankar Lahiri"]},{"pageCount":462,"thumbnail":"http:\/\/books.google.com\/books\/content?id=SD_LAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.46,"subtitle":"Protecting Your Database from Attackers","description":"SQL server is the most widely-used database platform in the world, and a large percentage of these databases are not properly secured, exposing sensitive customer and business data to attack. In Securing SQL Server, Third Edition, you will learn about the potential attack vectors that can be used to break into SQL server databases as well as how to protect databases from these attacks. In this book, Denny Cherry - a Microsoft SQL MVP and one of the biggest names in SQL server - will teach you how to properly secure an SQL server database from internal and external threats using best practices as well as specific tricks that the author employs in his role as a consultant for some of the largest SQL server deployments in the world. Fully updated to cover the latest technology in SQL Server 2014, this new edition walks you through how to secure new features of the 2014 release. New topics in the book include vLANs, setting up RRAS, anti-virus installs, key management, moving from plaintext to encrypted values in an existing application, securing Analysis Services Objects, Managed Service Accounts, OS rights needed by the DBA, SQL Agent Security, Table Permissions, Views, Stored Procedures, Functions, Service Broker Objects, and much more. Presents hands-on techniques for protecting your SQL Server database from intrusion and attack Provides the most in-depth coverage of all aspects of SQL Server database security, including a wealth of new material on Microsoft SQL Server 2014. Explains how to set up your database securely, how to determine when someone tries to break in, what the intruder has accessed or damaged, and how to respond and mitigate damage if an intrusion occurs.","language":"en","currency":"USD","id":"0128013753","title":"Securing SQL Server","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=SD_LAwAAQBAJ&source=gbs_api","authors":["Denny Cherry"]},{"pageCount":687,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XUmvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":95.2,"subtitle":"5th International Conference of Pioneering Computer Scientists, Engineers and Educators, ICPCSEE 2019, Guilin, China, September 20–23, 2019, Proceedings","description":"This two volume set (CCIS 1058 and 1059) constitutes the refereed proceedings of the 5th International Conference of Pioneering Computer Scientists, Engineers and Educators, ICPCSEE 2019 held in Guilin, China, in September 2019. The 104 revised full papers presented in these two volumes were carefully reviewed and selected from 395 submissions. The papers cover a wide range of topics related to basic theory and techniques for data science including data mining; data base; net work; security; machine learning; bioinformatics; natural language processing; software engineering; graphic images; system; education; application.","language":"en","currency":"USD","id":"9811501181","title":"Data Science","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XUmvDwAAQBAJ&source=gbs_api","authors":["Xiaohui Cheng","Weipeng Jing","Xianhua Song","Zeguang Lu"]},{"pageCount":498,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Qr_WuvfTSpEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Concurrent Approach to Software Development","description":"This book is an in-depth introduction to Erlang, a programming language ideal for any situation where concurrency, fault tolerance, and fast response is essential. Erlang is gaining widespread adoption with the advent of multi-core processors and their new scalable approach to concurrency. With this guide you'll learn how to write complex concurrent programs in Erlang, regardless of your programming background or experience. Written by leaders of the international Erlang community -- and based on their training material -- Erlang Programming focuses on the language's syntax and semantics, and explains pattern matching, proper lists, recursion, debugging, networking, and concurrency. This book helps you: Understand the strengths of Erlang and why its designers included specific features Learn the concepts behind concurrency and Erlang's way of handling it Write efficient Erlang programs while keeping code neat and readable Discover how Erlang fills the requirements for distributed systems Add simple graphical user interfaces with little effort Learn Erlang's tracing mechanisms for debugging concurrent and distributed systems Use the built-in Mnesia database and other table storage features Erlang Programming provides exercises at the end of each chapter and simple examples throughout the book.","language":"en","currency":"USD","id":"0596555857","title":"Erlang Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Qr_WuvfTSpEC&source=gbs_api","authors":["Francesco Cesarini","Simon Thompson"]},{"pageCount":256,"thumbnail":"http:\/\/books.google.com\/books\/content?id=OySOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.41,"subtitle":"Triples Storage and SPARQL Query Processing","description":"RDF Database Systems is a cutting-edge guide that distills everything you need to know to effectively use or design an RDF database. This book starts with the basics of linked open data and covers the most recent research, practice, and technologies to help you leverage semantic technology. With an approach that combines technical detail with theoretical background, this book shows how to design and develop semantic web applications, data models, indexing and query processing solutions. Understand the Semantic Web, RDF, RDFS, SPARQL, and OWL within the context of relational database management and NoSQL systems Learn about the prevailing RDF triples solutions for both relational and non-relational databases, including column family, document, graph, and NoSQL Implement systems using RDF data with helpful guidelines and various storage solutions for RDF Process SPARQL queries with detailed explanations of query optimization, query plans, caching, and more Evaluate which approaches and systems to use when developing Semantic Web applications with a helpful description of commercial and open-source systems","language":"en","currency":"USD","id":"0128004703","title":"RDF Database Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=OySOAwAAQBAJ&source=gbs_api","authors":["Olivier Curé","Guillaume Blin"]},{"pageCount":200,"thumbnail":"http:\/\/books.google.com\/books\/content?id=xUYDm7nq2_AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":15.74,"subtitle":"Joel Spolsky's Concise Guide to Finding the Best Technical Talent","description":"A \"good\" programmer can outproduce five, ten, and sometimes more run-of-the-mill programmers. The secret to success for any software company then is to hire the good programmers. But how to do that? In Joel on Hiring, Joel Spolsky draws from his experience both at Microsoft and running his own successful software company based in New York City. He writes humorously, but seriously about his methods for sorting resumes, for finding great candidates, and for interviewing, in person and by phone. Joel’s methods are not complex, but they do get to the heart of the matter: how to recognize a great developer when you see one.","language":"en","currency":"USD","id":"9781430202547","title":"Smart and Gets Things Done","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=xUYDm7nq2_AC&source=gbs_api","authors":["Avram Joel Spolsky"]},{"pageCount":548,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Pg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":35.99,"subtitle":"Software for a Concurrent World","description":"A multi-user game, web site, cloud application, or networked database can have thousands of users all interacting at the same time. You need a powerful, industrial-strength tool to handle the really hard problems inherent in parallel, concurrent environments. You need Erlang. In this second edition of the bestselling Programming Erlang, you'll learn how to write parallel programs that scale effortlessly on multicore systems. Using Erlang, you'll be surprised at how easy it becomes to deal with parallel problems, and how much faster and more efficiently your programs run. That's because Erlang uses sets of parallel processes-not a single sequential process, as found in most programming languages. Joe Armstrong, creator of Erlang, introduces this powerful language in small steps, giving you a complete overview of Erlang and how to use it in common scenarios. You'll start with sequential programming, move to parallel programming and handling errors in parallel programs, and learn to work confidently with distributed programming and the standard Erlang\/Open Telecom Platform (OTP) frameworks. You need no previous knowledge of functional or parallel programming. The chapters are packed with hands-on, real-world tutorial examples and insider tips and advice, and finish with exercises for both beginning and advanced users. The second edition has been extensively rewritten. New to this edition are seven chapters covering the latest Erlang features: maps, the type system and the Dialyzer, WebSockets, programming idioms, and a new stand-alone execution environment. You'll write programs that dynamically detect and correct errors, and that can be upgraded without stopping the system. There's also coverage of rebar (the de facto Erlang build system), and information on how to share and use Erlang projects on github, illustrated with examples from cowboy and bitcask. Erlang will change your view of the world, and of how you program. What You Need The Erlang\/OTP system. Download it from erlang.org.","language":"en","currency":"USD","id":"1680504320","title":"Programming Erlang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Pg9QDwAAQBAJ&source=gbs_api","authors":["Joe Armstrong"]},{"pageCount":412,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ttJfDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.99,"subtitle":"Functional |> Concurrent |> Pragmatic |> Fun","description":"This book is the introduction to Elixir for experienced programmers, completely updated for Elixir 1.6 and beyond. Explore functional programming without the academic overtones (tell me about monads just one more time). Create concurrent applications, butget them right without all the locking and consistency headaches. Meet Elixir, a modern, functional, concurrent language built on the rock-solid Erlang VM. Elixir's pragmatic syntax and built-in support for metaprogramming will make you productive and keep you interestedfor the long haul. Maybe the time is right for the Next Big Thing. Maybe it's Elixir. Functional programming techniques help you manage the complexities of today's real-world, concurrent systems; maximize uptime; and manage security. Enter Elixir, with its modern, Ruby-like, extendable syntax, compile and runtime evaluation, hygienic macro system, and more. But, just as importantly, Elixir brings a sense of enjoyment to parallel,functional programming. Your applications become fun to work with, and the language encourages you to experiment. Part 1 covers the basics of writing sequential Elixir programs. We'll look at the language, the tools, and the conventions. Part 2 uses these skills to start writing concurrent code-applications that use all the cores on your machine, or all the machines on your network! And we do it both with and without OTP. Part 3 looks at the more advanced features of the language, from DSLs and code generation to extending the syntax. This edition is fully updated with all the new features of Elixir 1.6, with a new chapter on structuring OTP applications, and new sections on the debugger, code formatter, Distillery, and protocols. What You Need: You'll need a computer, a little experience with another high-levellanguage, and a sense of adventure. No functional programmingexperience is needed.","language":"en","currency":"USD","id":"1680506137","title":"Programming Elixir ≥ 1.6","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ttJfDwAAQBAJ&source=gbs_api","authors":["Dave Thomas"]},{"pageCount":332,"thumbnail":"http:\/\/books.google.com\/books\/content?id=QDZm1juBH1YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.49,"subtitle":null,"description":"As part of Packt's cookbook series, each recipe offers a practical, step-by-step solution to common problems found in HBase administration. This book is for HBase administrators, developers, and will even help Hadoop administrators. You are not required to have HBase experience, but are expected to have a basic understanding of Hadoop and MapReduce.","language":"en","currency":"USD","id":"1849517150","title":"Hbase Administration Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=QDZm1juBH1YC&source=gbs_api","authors":["Yifeng Jiang"]},{"pageCount":158,"thumbnail":"http:\/\/books.google.com\/books\/content?id=9c0hT2EOxLQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":"Create and Manage Virtualized Development Environments","description":"Discover why Vagrant is a must-have tool for thousands of developers and ops engineers. This hands-on guide shows you how to use this open source software to build a virtual machine for any purpose—including a completely sandboxed, fully provisioned development environment right on your desktop. Vagrant creator Mitchell Hashimoto shows you how to share a virtual machine image with members of your team, set up a separate virtualization for each project, and package virtual machines for use by others. This book covers the V1 (1.0.x) configuration syntax running on top of a V2 (1.1+) core, the most stable configuration format running on the latest core. Build a simple virtual machine with just two commands and no configuration Create a development environment that closely resembles production Automate software installation and management with shell scripts, Chef, or Puppet Set up a network interface to access your virtual machine from any computer Use your own editor and browser to develop and test your applications Test complicated multi-machine clusters with a single Vagrantfile Change Vagrant’s default operating system to match your production OS Extend Vagrant features with plugins, including components you build yourself","language":"en","currency":"USD","id":"1449336124","title":"Vagrant: Up and Running","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=9c0hT2EOxLQC&source=gbs_api","authors":["Mitchell Hashimoto"]},{"pageCount":356,"thumbnail":"http:\/\/books.google.com\/books\/content?id=kqpCAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.19,"subtitle":null,"description":"Capitalize on the faster GPU processors in today’s computers with the C++ AMP code library—and bring massive parallelism to your project. With this practical book, experienced C++ developers will learn parallel programming fundamentals with C++ AMP through detailed examples, code snippets, and case studies. Learn the advantages of parallelism and get best practices for harnessing this technology in your applications. Discover how to: Gain greater code performance using graphics processing units (GPUs) Choose accelerators that enable you to write code for GPUs Apply thread tiles, tile barriers, and tile static memory Debug C++ AMP code with Microsoft Visual Studio Use profiling tools to track the performance of your code","language":"en","currency":"USD","id":"0735668191","title":"C++ AMP","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=kqpCAwAAQBAJ&source=gbs_api","authors":["Ade Miller","Kate Gregory"]},{"pageCount":714,"thumbnail":"http:\/\/books.google.com\/books\/content?id=nh0okI1a1sQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"Code You Can Believe In","description":"This easy-to-use, fast-moving tutorial introduces you to functional programming with Haskell. You'll learn how to use Haskell in a variety of practical ways, from short scripts to large and demanding applications. Real World Haskell takes you through the basics of functional programming at a brisk pace, and then helps you increase your understanding of Haskell in real-world issues like I\/O, performance, dealing with data, concurrency, and more as you move through each chapter.","language":"en","currency":"USD","id":"9780596554309","title":"Real World Haskell","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=nh0okI1a1sQC&source=gbs_api","authors":["Bryan O'Sullivan","John Goerzen","Donald Bruce Stewart"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=oPiT-V2eYTsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"As with all Packt books this guide will use practical examples to impart information to the reader. Getting Started with NoSQL is a great resource for someone starting with NoSQL and an indispensable guide for technology decision makers. It is assumed that you have a background in RDBMS modeling and SQL and have had exposure to at least one of the programming languages - Java or JavaScript.","language":"en","currency":"USD","id":"1849694990","title":"Getting Started with Nosql","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=oPiT-V2eYTsC&source=gbs_api","authors":["Gaurav Vaish"]},{"pageCount":150,"thumbnail":"http:\/\/books.google.com\/books\/content?id=zFeZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.16,"subtitle":"Models, Techniques and Applications","description":"Data Analysis in the Cloud introduces and discusses models, methods, techniques, and systems to analyze the large number of digital data sources available on the Internet using the computing and storage facilities of the cloud. Coverage includes scalable data mining and knowledge discovery techniques together with cloud computing concepts, models, and systems. Specific sections focus on map-reduce and NoSQL models. The book also includes techniques for conducting high-performance distributed analysis of large data on clouds. Finally, the book examines research trends such as Big Data pervasive computing, data-intensive exascale computing, and massive social network analysis. Introduces data analysis techniques and cloud computing concepts Describes cloud-based models and systems for Big Data analytics Provides examples of the state-of-the-art in cloud data analysis Explains how to develop large-scale data mining applications on clouds Outlines the main research trends in the area of scalable Big Data analysis","language":"en","currency":"USD","id":"0128029145","title":"Data Analysis in the Cloud","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=zFeZBQAAQBAJ&source=gbs_api","authors":["Domenico Talia","Paolo Trunfio","Fabrizio Marozzo"]},{"pageCount":735,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qqB7nrrna_sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":43.11,"subtitle":"Designing, Building, and Deploying Messaging Solutions","description":"Enterprise Integration Patterns provides an invaluable catalog of sixty-five patterns, with real-world solutions that demonstrate the formidable of messaging and help you to design effective messaging solutions for your enterprise. The authors also include examples covering a variety of different integration technologies, such as JMS, MSMQ, TIBCO ActiveEnterprise, Microsoft BizTalk, SOAP, and XSL. A case study describing a bond trading system illustrates the patterns in practice, and the book offers a look at emerging standards, as well as insights into what the future of enterprise integration might hold. This book provides a consistent vocabulary and visual notation framework to describe large-scale integration solutions across many technologies. It also explores in detail the advantages and limitations of asynchronous messaging architectures. The authors present practical advice on designing code that connects an application to a messaging system, and provide extensive information to help you determine when to send a message, how to route it to the proper destination, and how to monitor the health of a messaging system. If you want to know how to manage, monitor, and maintain a messaging system once it is in use, get this book.","language":"en","currency":"USD","id":"0133065103","title":"Enterprise Integration Patterns","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qqB7nrrna_sC&source=gbs_api","authors":["Gregor Hohpe","Bobby Woolf"]},{"pageCount":324,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GpoKZncgCxsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Over 150 recipes to design and optimize large scale Apache Cassandra deployments.","language":"en","currency":"USD","id":"1849515131","title":"Cassandra High Performance Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GpoKZncgCxsC&source=gbs_api","authors":["Edward Capriolo"]},{"pageCount":560,"thumbnail":"http:\/\/books.google.com\/books\/content?id=owV0AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.16,"subtitle":"Temporal Databases in the Relational Model and SQL","description":"Time and Relational Theory provides an in-depth description of temporal database systems, which provide special facilities for storing, querying, and updating historical and future data. Traditionally, database management systems provide little or no special support for temporal data at all. This situation is changing because: Cheap storage enables retention of large volumes of historical data in data warehouses Users are now faced with temporal data problems, and need solutions Temporal features have recently been incorporated into the SQL standard, and vendors have begun to add temporal support to their DBMS products Based on the groundbreaking text Temporal Data & the Relational Model (Morgan Kaufmann, 2002) and new research led by the authors, Time and Relational Theory is the only book to offer a complete overview of the functionality of a temporal DBMS. Expert authors Nikos Lorentzos, Hugh Darwen, and Chris Date describe an approach to temporal database management that is firmly rooted in classical relational theory and will stand the test of time. This book covers the SQL:2011 temporal extensions in depth and identifies and discusses the temporal functionality still missing from SQL. Understand how the relational model provides an ideal basis for taming the complexities of temporal databases Learn how to analyze and evaluate commercial temporal products with this timely and important information Be able to use sound principles in designing and using temporal databases Understand the temporal support recently added to SQL with coverage of the new SQL features in this unique, accurate, and authoritative reference Appreciate the benefits of a truly relational approach to the problem with this clear, user friendly presentation","language":"en","currency":"USD","id":"0128006757","title":"Time and Relational Theory","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=owV0AwAAQBAJ&source=gbs_api","authors":["C.J. Date","Hugh Darwen","Nikos Lorentzos"]},{"pageCount":448,"thumbnail":"http:\/\/books.google.com\/books\/content?id=1D24-cGQRdsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":17.27,"subtitle":"Hypermedia and Systems Architecture","description":"Why don't typical enterprise projects go as smoothly as projects you develop for the Web? Does the REST architectural style really present a viable alternative for building distributed systems and enterprise-class applications? In this insightful book, three SOA experts provide a down-to-earth explanation of REST and demonstrate how you can develop simple and elegant distributed hypermedia systems by applying the Web's guiding principles to common enterprise computing problems. You'll learn techniques for implementing specific Web technologies and patterns to solve the needs of a typical company as it grows from modest beginnings to become a global enterprise. Learn basic Web techniques for application integration Use HTTP and the Web’s infrastructure to build scalable, fault-tolerant enterprise applications Discover the Create, Read, Update, Delete (CRUD) pattern for manipulating resources Build RESTful services that use hypermedia to model state transitions and describe business protocols Learn how to make Web-based solutions secure and interoperable Extend integration patterns for event-driven computing with the Atom Syndication Format and implement multi-party interactions in AtomPub Understand how the Semantic Web will impact systems design","language":"en","currency":"USD","id":"9781449396923","title":"REST in Practice","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=1D24-cGQRdsC&source=gbs_api","authors":["Jim Webber","Savas Parastatidis","Ian Robinson"]},{"pageCount":220,"thumbnail":"http:\/\/books.google.com\/books\/content?id=pg9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":39.99,"subtitle":"Rethink the Modern Web App","description":"Elixir and Phoenix are generating tremendous excitement as an unbeatable platform for building modern web applications. For decades OTP has helped developers create incredibly robust, scalable applications with unparalleled uptime. Make the most of them as you build a stateful web app with Elixir, OTP, and Phoenix. Model domain entities without an ORM or a database. Manage server state and keep your code clean with OTP Behaviours. Layer on a Phoenix web interface without coupling it to the business logic. Open doors to powerful new techniques that will get you thinking about web development in fundamentally new ways. Elixir and OTP provide exceptional tools to build rock-solid back-end applications that scale. In this book, you'll build a web application in a radically different way, with a back end that holds application state. You'll use persistent Phoenix Channel connections instead of HTTP's request-response, and create the full application in distinct, decoupled layers. In Part 1, start by building the business logic as a separate application, without Phoenix. Model the application domain with Elixir functions and simple data structures. By keeping state in memory instead of a database, you can reduce latency and simplify your code. In Part 2, add in the GenServer Behaviour to make managing in-memory state a breeze. Create a supervision tree to boost fault tolerance while separating error handling from business logic. Phoenix is a modern web framework you can layer on top of business logic while keeping the two completely decoupled. In Part 3, you'll do exactly that as you build a web interface with Phoenix. Bring in the application from Part 2 as a dependency to a new Phoenix project. Then use ultra-scalable Phoenix Channels to establish persistent connections between the stateful server and a stateful front-end client. You're going to love this way of building web apps! What You Need: You'll need a computer that can run Elixir version 1.5 or higher and Phoenix 1.3 or higher. Some familiarity with Elixir and Phoenix is recommended.","language":"en","currency":"USD","id":"1680505440","title":"Functional Web Development with Elixir, OTP, and Phoenix","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=pg9QDwAAQBAJ&source=gbs_api","authors":["Lance Halvorsen"]},{"pageCount":367,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Y8lHVFeJ6EQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":null,"description":"In modern computing a program is usually distributed among several processes. The fundamental challenge when developing reliable and secure distributed programs is to support the cooperation of processes required to execute a common task, even when some of these processes fail. Failures may range from crashes to adversarial attacks by malicious processes. Cachin, Guerraoui, and Rodrigues present an introductory description of fundamental distributed programming abstractions together with algorithms to implement them in distributed systems, where processes are subject to crashes and malicious attacks. The authors follow an incremental approach by first introducing basic abstractions in simple distributed environments, before moving to more sophisticated abstractions and more challenging environments. Each core chapter is devoted to one topic, covering reliable broadcast, shared memory, consensus, and extensions of consensus. For every topic, many exercises and their solutions enhance the understanding This book represents the second edition of \"Introduction to Reliable Distributed Programming\". Its scope has been extended to include security against malicious actions by non-cooperating processes. This important domain has become widely known under the name \"Byzantine fault-tolerance\".","language":"en","currency":"USD","id":"9783642152603","title":"Introduction to Reliable and Secure Distributed Programming","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Y8lHVFeJ6EQC&source=gbs_api","authors":["Christian Cachin","Rachid Guerraoui","Luís Rodrigues"]},{"pageCount":852,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2sFRpAmNnoMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":108.8,"subtitle":"Theory, Algorithms, and the Practice of Concurrency Control and Recovery","description":"Transactional Information Systems is the long-awaited, comprehensive work from leading scientists in the transaction processing field. Weikum and Vossen begin with a broad look at the role of transactional technology in today's economic and scientific endeavors, then delve into critical issues faced by all practitioners, presenting today's most effective techniques for controlling concurrent access by multiple clients, recovering from system failures, and coordinating distributed transactions. The authors emphasize formal models that are easily applied across fields, that promise to remain valid as current technologies evolve, and that lend themselves to generalization and extension in the development of new classes of network-centric, functionally rich applications. This book's purpose and achievement is the presentation of the foundations of transactional systems as well as the practical aspects of the field what will help you meet today's challenges. Provides the most advanced coverage of the topic available anywhere--along with the database background required for you to make full use of this material. Explores transaction processing both generically as a broadly applicable set of information technology practices and specifically as a group of techniques for meeting the goals of your enterprise. Contains information essential to developers of Web-based e-Commerce functionality--and a wide range of more \"traditional\" applications. Details the algorithms underlying core transaction processing functionality.","language":"en","currency":"USD","id":"0080519563","title":"Transactional Information Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2sFRpAmNnoMC&source=gbs_api","authors":["Gerhard Weikum","Gottfried Vossen"]},{"pageCount":142,"thumbnail":"http:\/\/books.google.com\/books\/content?id=395XD3tVHjgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":null,"description":"This is a short, practical guide, with lots of examples to help you learn Google Guava.There is no minimum level of experience required. There is something for everyone who works with Java, from the beginner to the expert programmer.","language":"en","currency":"USD","id":"1783280166","title":"Getting Started with Google Guava","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=395XD3tVHjgC&source=gbs_api","authors":["Bill Bejeck"]},{"pageCount":290,"thumbnail":"http:\/\/books.google.com\/books\/content?id=d8pqCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.99,"subtitle":"Theory and Practice","description":"Replication is a topic of interest in the distributed computing, distributed systems, and database communities. Although these communities have traditionally looked at replication from different viewpoints and with different goals (e.g., performance versus fault tolerance), recent developments have led to a convergence of these different goals. The objective of this state-of-the-art survey is not to speculate about the future of replication, but rather to understand the present, to make an assessment of approximately 30 years of research on replication, and to present a comprehensive view of the achievements made during this period of time. This book is the outcome of the seminar entitled A 30-Year Perspective on Replication, which was held at Monte Verità, Ascona, Switzerland, in November 2007. The book is organized in 13 self-contained chapters written by most of the people who have contributed to developing state-of-the-art replication techniques. It presents a comprehensive view of existing solutions, from a theoretical as well as from a practical point of view. It covers replication of processes\/objects and of databases; replication for fault tolerance and replication for performance - benign faults and malicious (Byzantine) faults - thus forming a basis for both professionals and students of distributed computing, distributed systems, and databases.","language":"en","currency":"USD","id":"3642112943","title":"Replication","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=d8pqCQAAQBAJ&source=gbs_api","authors":["Bernadette Charron-Bost","Fernando Pedone","Andre Schiper"]},{"pageCount":282,"thumbnail":"http:\/\/books.google.com\/books\/content?id=t6PcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":null,"description":"Unleash the power and flexibility of the Bayesian framework About This Book Simplify the Bayes process for solving complex statistical problems using Python; Tutorial guide that will take the you through the journey of Bayesian analysis with the help of sample problems and practice exercises; Learn how and when to use Bayesian analysis in your applications with this guide. Who This Book Is For Students, researchers and data scientists who wish to learn Bayesian data analysis with Python and implement probabilistic models in their day to day projects. Programming experience with Python is essential. No previous statistical knowledge is assumed. What You Will Learn Understand the essentials Bayesian concepts from a practical point of view Learn how to build probabilistic models using the Python library PyMC3 Acquire the skills to sanity-check your models and modify them if necessary Add structure to your models and get the advantages of hierarchical models Find out how different models can be used to answer different data analysis questions When in doubt, learn to choose between alternative models. Predict continuous target outcomes using regression analysis or assign classes using logistic and softmax regression. Learn how to think probabilistically and unleash the power and flexibility of the Bayesian framework In Detail The purpose of this book is to teach the main concepts of Bayesian data analysis. We will learn how to effectively use PyMC3, a Python library for probabilistic programming, to perform Bayesian parameter estimation, to check models and validate them. This book begins presenting the key concepts of the Bayesian framework and the main advantages of this approach from a practical point of view. Moving on, we will explore the power and flexibility of generalized linear models and how to adapt them to a wide array of problems, including regression and classification. We will also look into mixture models and clustering data, and we will finish with advanced topics like non-parametrics models and Gaussian processes. With the help of Python and PyMC3 you will learn to implement, check and expand Bayesian models to solve data analysis problems. Style and approach Bayes algorithms are widely used in statistics, machine learning, artificial intelligence, and data mining. This will be a practical guide allowing the readers to use Bayesian methods for statistical modelling and analysis using Python.","language":"en","currency":"USD","id":"1785889850","title":"Bayesian Analysis with Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=t6PcDgAAQBAJ&source=gbs_api","authors":["Osvaldo Martin"]},{"pageCount":552,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qGgpYBighBcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":36,"subtitle":null,"description":"The vast majority of software applications use relational databases that virtually every application developer must work with. This book introduces you to database design, whether you're a DBA or database developer. You'll discover what databases are, their goals, and why proper design is necessary to achieve those goals. Additionally, you'll master how to structure the database so it gives good performance while minimizing the chance for error. You will learn how to decide what should be in a database to meet the application's requirements.","language":"en","currency":"USD","id":"9780470440520","title":"Beginning Database Design Solutions","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qGgpYBighBcC&source=gbs_api","authors":["Rod Stephens"]},{"pageCount":212,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4tNLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":18.35,"subtitle":"Getting Started in Functional Programming","description":"If you’re new to Erlang, its functional style can seem difficult, but with help from this hands-on introduction, you’ll scale the learning curve and discover how enjoyable, powerful, and fun this language can be. In this updated second edition, author Simon St.Laurent shows you how to write simple Erlang programs by teaching you one skill at a time. You’ll learn about pattern matching, recursion, message passing, process-oriented programming, and establishing pathways for data rather than telling it where to go. By the end of your journey, you’ll understand why Erlang is ideal for concurrency and resilience. Get cozy with Erlang’s shell, its command line interface Define functions, using the fun tool, to represent repeated calculations Discover atoms, pattern matching, and guards: the foundations of your program structure Delve into the heart of Erlang processing with recursion, strings, lists, and higher-order functions Create processes, send messages among them, and apply pattern matching to incoming messages Store and manipulate structured data with Erlang Term Storage and the Mnesia database Learn about Open Telecom Platform, Erlang’s open source libraries and tools","language":"en","currency":"USD","id":"1491973323","title":"Introducing Erlang","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4tNLDgAAQBAJ&source=gbs_api","authors":["Simon St. Laurent"]},{"pageCount":672,"thumbnail":"http:\/\/books.google.com\/books\/content?id=B3dcSWopawwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.39,"subtitle":"A Hands-On Guide to Relational Database Design","description":"&a>Database Design for Mere Mortals™, Second Edition, is a straightforward, platform-independent tutorial on the basic principles of relational database design. It provides a commonsense design methodology for developing databases that work. Database design expert Michael J. Hernandez has expanded his best-selling first edition, maintaining its hands-on approach and accessibility while updating its coverage and including even more examples and illustrations. This book will give you the knowledge and tools you need to create efficient and effective relational databases.","language":"en","currency":"USD","id":"9780321605474","title":"Database Design for Mere Mortals","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=B3dcSWopawwC&source=gbs_api","authors":["Michael J. Hernandez"]},{"pageCount":302,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HnxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Build web applications with MongoDB, Express.js, React, and Node","description":"Build web applications with MongoDB, ExpressJS, React, and Node Key Features Build applications with the MERN stack Work with each component of the MERN stack Become confident with MERN and ready for more! Book Description The MERN stack is a collection of great tools—MongoDB, Express.js, React, and Node—that provide a strong base for a developer to build easily maintainable web applications. With each of them a JavaScript or JavaScript-based technology, having a shared programming language means it takes less time to develop web applications. This book focuses on providing key tasks that can help you get started, learn, understand, and build full-stack web applications. It walks you through the process of installing all the requirements and project setup to build client-side React web applications, managing synchronous and asynchronous data flows with Redux, and building real-time web applications with Socket.IO, RESTful APIs, and other concepts. This book gives you practical and clear hands-on experience so you can begin building a full-stack MERN web application. Quick Start Guides are focused, shorter titles that provide a faster paced introduction to a technology. They are for people who don't need all the detail at this point in their learning curve. The presentation has been streamlined to concentrate on the things you really need to know. What you will learn Get started with the MERN stack Install Node.js and configure MongoDB Build RESTful APIs with Express.js and Mongoose Build real-time applications with Socket.IO Manage synchronous and asynchronous data flows with Redux Build web applications with React Who this book is for The book is for JavaScript developers who want to get stated with the MERN Stack.","language":"en","currency":"USD","id":"1787280047","title":"MERN Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HnxeDwAAQBAJ&source=gbs_api","authors":["Eddy Wilson"]},{"pageCount":280,"thumbnail":"http:\/\/books.google.com\/books\/content?id=RDl4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"Designing Fine-Grained Systems","description":"Distributed systems have become more fine-grained in the past 10 years, shifting from code-heavy monolithic applications to smaller, self-contained microservices. But developing these systems brings its own set of headaches. With lots of examples and practical advice, this book takes a holistic view of the topics that system architects and administrators must consider when building, managing, and evolving microservice architectures. Microservice technologies are moving quickly. Author Sam Newman provides you with a firm grounding in the concepts while diving into current solutions for modeling, integrating, testing, deploying, and monitoring your own autonomous services. You’ll follow a fictional company throughout the book to learn how building a microservice architecture affects a single domain. Discover how microservices allow you to align your system design with your organization’s goals Learn options for integrating a service with the rest of your system Take an incremental approach when splitting monolithic codebases Deploy individual microservices through continuous integration Examine the complexities of testing and monitoring distributed services Manage security with user-to-service and service-to-service models Understand the challenges of scaling microservice architectures","language":"en","currency":"USD","id":"1491950315","title":"Building Microservices","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=RDl4BgAAQBAJ&source=gbs_api","authors":["Sam Newman"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=J42nDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.24,"subtitle":"From Novice to Professional","description":"Start developing with Oracle SQL. This book is a one-stop introduction to everything you need to know about getting started developing an Oracle Database. You'll learn about foundational concepts, setting up a simple schema, adding data, reading data from the database, and making changes. No experience with databases is required to get started. Examples in the book are built around Oracle Live SQL, a freely available, online sandbox for practicing and experimenting with SQL statements, and Oracle Express Edition, a free version of Oracle Database that is available for download. A marquee feature of Beginning Oracle SQL for Oracle Database 18c is the small chapter size. Content is divided into easily digestible chunks that can be read and practiced in very short intervals of time, making this the ideal book for a busy professional to learn from. Even just a 15-20 minute block of free time can be put to good use. Author Ben Brumm begins by helping you understand what a database is, and getting you set up with a sandbox in which to practice the SQL that you are learning. From there, easily digestible chapters cover, point-by-point, the different aspects of writing queries to get data out of a database. You’ll also learn about creating tables and getting data into the database. Crucial topics such as working with nulls and writing analytic queries are given the attention they deserve, helping you to avoid pitfalls when writing queries for production use. What You'll Learn Create, update, and delete tables in an Oracle database Add, update, delete data from those database tables Query and view data stored in your database Manipulate and transform data using in-built database functions and features Correctly choose when to use Oracle-specific syntax and features Who This Book Is For Those new to Oracle who are planning to develop software using Oracle as the back-end data store. The book is also for those who are getting started in software development and realize they need to learn some kind of database language. Those who are learning software development on the side of their normal job, or learning it as a college student, who are ready to learn what a database is and how to use it also will find this book useful.","language":"en","currency":"USD","id":"1484244303","title":"Beginning Oracle SQL for Oracle Database 18c","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=J42nDwAAQBAJ&source=gbs_api","authors":["Ben Brumm"]},{"pageCount":70,"thumbnail":"http:\/\/books.google.com\/books\/content?id=Clv0uTLZDzIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Patterns and processes for the popular document-oriented database","description":"Learn how to leverage MongoDB with your Python applications, using the hands-on recipes in this book. You get complete code samples for tasks such as making fast geo queries for location-based apps, efficiently indexing your user documents for social-graph lookups, and many other scenarios. This guide explains the basics of the document-oriented database and shows you how to set up a Python environment with it. Learn how to read and write to MongoDB, apply idiomatic MongoDB and Python patterns, and use the database with several popular Python web frameworks. You’ll discover how to model your data, write effective queries, and avoid concurrency problems such as race conditions and deadlocks. The recipes will help you: Read, write, count, and sort documents in a MongoDB collection Learn how to use the rich MongoDB query language Maintain data integrity in replicated\/distributed MongoDB environments Use embedding to efficiently model your data without joins Code defensively to avoid keyerrors and other bugs Apply atomic operations to update game scores, billing systems, and more with the fast accounting pattern Use MongoDB with the Pylons 1.x, Django, and Pyramid web frameworks","language":"en","currency":"USD","id":"144931709X","title":"MongoDB and Python","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=Clv0uTLZDzIC&source=gbs_api","authors":["Niall O'Higgins"]},{"pageCount":372,"thumbnail":"http:\/\/books.google.com\/books\/content?id=HfcMDvxb43AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"For all the buzz about trendy IT techniques, data processing is still at the core of our systems, especially now that enterprises all over the world are confronted with exploding volumes of data. Database performance has become a major headache, and most IT departments believe that developers should provide simple SQL code to solve immediate problems and let DBAs tune any \"bad SQL\" later. In The Art of SQL, author and SQL expert Stephane Faroult argues that this \"safe approach\" only leads to disaster. His insightful book, named after Art of War by Sun Tzu, contends that writing quick inefficient code is sweeping the dirt under the rug. SQL code may run for 5 to 10 years, surviving several major releases of the database management system and on several generations of hardware. The code must be fast and sound from the start, and that requires a firm understanding of SQL and relational theory. The Art of SQL offers best practices that teach experienced SQL users to focus on strategy rather than specifics. Faroult's approach takes a page from Sun Tzu's classic treatise by viewing database design as a military campaign. You need knowledge, skills, and talent. Talent can't be taught, but every strategist from Sun Tzu to modern-day generals believed that it can be nurtured through the experience of others. They passed on their experience acquired in the field through basic principles that served as guiding stars amid the sound and fury of battle. This is what Faroult does with SQL. Like a successful battle plan, good architectural choices are based on contingencies. What if the volume of this or that table increases unexpectedly? What if, following a merger, the number of users doubles? What if you want to keep several years of data online? Faroult's way of looking at SQL performance may be unconventional and unique, but he's deadly serious about writing good SQL and using SQL well. The Art of SQL is not a cookbook, listing problems and giving recipes. The aim is to get you-and your manager-to raise good questions.","language":"en","currency":"USD","id":"9780596555368","title":"The Art of SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=HfcMDvxb43AC&source=gbs_api","authors":["Stephane Faroult","Peter Robson"]},{"pageCount":608,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5iR4hZNSCcgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":40.79,"subtitle":"Your Brain on SQL -- A Learner's Guide","description":"Is your data dragging you down? Are your tables all tangled up? Well we've got the tools to teach you just how to wrangle your databases into submission. Using the latest research in neurobiology, cognitive science, and learning theory to craft a multi-sensory SQL learning experience, Head First SQL has a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. Maybe you've written some simple SQL queries to interact with databases. But now you want more, you want to really dig into those databases and work with your data. Head First SQL will show you the fundamentals of SQL and how to really take advantage of it. We'll take you on a journey through the language, from basic INSERT statements and SELECT queries to hardcore database manipulation with indices, joins, and transactions. We all know \"Data is Power\" - but we'll show you how to have \"Power over your Data\". Expect to have fun, expect to learn, and expect to be querying, normalizing, and joining your data like a pro by the time you're finished reading!","language":"en","currency":"USD","id":"1449360440","title":"Head First SQL","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5iR4hZNSCcgC&source=gbs_api","authors":["Lynn Beighley"]},{"pageCount":182,"thumbnail":"http:\/\/books.google.com\/books\/content?id=FoBvAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.04,"subtitle":null,"description":"This book is a quick and concise introduction to RabbitMQ. Follow the unique case study of Clever Coney Media as they progressively discover how to fully utilize RabbitMQ, containing clever examples and detailed explanations. Whether you are someone who develops enterprise messaging products professionally or a hobbyist who is already familiar with open source Message Queuing software and you are looking for a new challenge, then this is the book for you. Although you should be familiar with Java, Ruby, and Python to get the most out of the examples, RabbitMQ Essentials will give you the push you need to get started that no other RabbitMQ tutorial can provide you with.","language":"en","currency":"USD","id":"1783983213","title":"RabbitMQ Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=FoBvAwAAQBAJ&source=gbs_api","authors":["David Dossot"]},{"pageCount":368,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0X7Dohne1tQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":31.19,"subtitle":"A Value-Driven Approach to Business Intelligence and Data Warehousing","description":"Using Agile methods, you can bring far greater innovation, value, and quality to any data warehousing (DW), business intelligence (BI), or analytics project. However, conventional Agile methods must be carefully adapted to address the unique characteristics of DW\/BI projects. In Agile Analytics, Agile pioneer Ken Collier shows how to do just that. Collier introduces platform-agnostic Agile solutions for integrating infrastructures consisting of diverse operational, legacy, and specialty systems that mix commercial and custom code. Using working examples, he shows how to manage analytics development teams with widely diverse skill sets and how to support enormous and fast-growing data volumes. Collier’s techniques offer optimal value whether your projects involve “back-end” data management, “front-end” business analysis, or both. Part I focuses on Agile project management techniques and delivery team coordination, introducing core practices that shape the way your Agile DW\/BI project community can collaborate toward success Part II presents technical methods for enabling continuous delivery of business value at production-quality levels, including evolving superior designs; test-driven DW development; version control; and project automation Collier brings together proven solutions you can apply right now—whether you’re an IT decision-maker, data warehouse professional, database administrator, business intelligence specialist, or database developer. With his help, you can mitigate project risk, improve business alignment, achieve better results—and have fun along the way.","language":"en","currency":"USD","id":"0321669541","title":"Agile Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0X7Dohne1tQC&source=gbs_api","authors":["Ken W. Collier"]},{"pageCount":236,"thumbnail":"http:\/\/books.google.com\/books\/content?id=5wN0AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":"Implementing Cloud Privacy and Security","description":"CSA Guide to Cloud Computing brings you the most current and comprehensive understanding of cloud security issues and deployment techniques from industry thought leaders at the Cloud Security Alliance (CSA). For many years the CSA has been at the forefront of research and analysis into the most pressing security and privacy related issues associated with cloud computing. CSA Guide to Cloud Computing provides you with a one-stop source for industry-leading content, as well as a roadmap into the future considerations that the cloud presents. The authors of CSA Guide to Cloud Computing provide a wealth of industry expertise you won't find anywhere else. Author Raj Samani is the Chief Technical Officer for McAfee EMEA; author Jim Reavis is the Executive Director of CSA; and author Brian Honan is recognized as an industry leader in the ISO27001 standard. They will walk you through everything you need to understand to implement a secure cloud computing structure for your enterprise or organization. Your one-stop source for comprehensive understanding of cloud security from the foremost thought leaders in the industry Insight into the most current research on cloud privacy and security, compiling information from CSA's global membership Analysis of future security and privacy issues that will impact any enterprise that uses cloud computing","language":"en","currency":"USD","id":"0124201857","title":"CSA Guide to Cloud Computing","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=5wN0AwAAQBAJ&source=gbs_api","authors":["Raj Samani","Jim Reavis","Brian Honan"]},{"pageCount":186,"thumbnail":"http:\/\/books.google.com\/books\/content?id=XkAwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":19.79,"subtitle":null,"description":"Become a Node.js craftsman. About This Book This book will help readers to dive deeper into software development with Node.js and JavaScript Takes a craftsman approach to Node.js and object-orientation and test-driven development Crafts many of the small details of Node.js and through to fully-fledged web applications with REST Who This Book Is For This book is written to help you if you're working with Node.js already, but you want to move your craft to the next level with Node.js, so some working knowledge of Node.js is of course already assumed, so that we can look at the work of crafting applications with Node. What You Will Learn How to connect to databases like MongoDB and MySQL from your Node.js application How to unit tests and end-to-end tests for your code When and how to leverage migrations for setting up a continuous deployment workflow Detailed insight into how the Node Package Manager, NPM works How object-orientation actually works in JavaScript Ways to keep your code fast and efficient using asynchronous and non-blocking operations How to use and create event emitters How to use REST frameworks to write full-fledged web applications How to integrate Node.js with Angular In Detail The Node Craftsman Book helps JavaScript programmers with basic Node.js knowledge to now thoroughly master Node.js and JavaScript. This book dives you deeper into the craft of software development with Node.js and JavaScript, incuding object-orientation, test-driven development, database handling, web frameworks, and much more. The Node Craftsman Book shows you how to work with Node.js and how to think deeply about how you build your Node projects. You'll master how to build a complete Node.js application across six crafting milestones, and you'll learn many specific skills to achieve that mastery. These skills include how to work with the Node Package Manager in depth, how to connect your Node applications to databases, and how to write unit tests and end-to-end tests for your code. You'll experience the full Node.js development picture, and learn how to craft and control your Node.js applications - right through to fully-fledged web applications using REST, and integration with Angular applications. Style and approach This book builds on your early knowledge and experience of Node.js and takes a craftsman approach to understanding the whole picture more deeply and shaping your Node applications to perform the way a craftsman would want. So, we take a thoughtful and broad thinking and coding approach to work with Node.js in this book.","language":"en","currency":"USD","id":"1787289257","title":"The Node Craftsman Book","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=XkAwDwAAQBAJ&source=gbs_api","authors":["Manuel Kiessling"]},{"pageCount":460,"thumbnail":"http:\/\/books.google.com\/books\/content?id=qU3rAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":24.99,"subtitle":"An In-Depth Guide for Programmers","description":"Like it or not, JavaScript is everywhere these days—from browser to server to mobile—and now you, too, need to learn the language or dive deeper than you have. This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position. Speaking JavaScript helps you approach the language with four standalone sections. First, a quick-start guide teaches you just enough of the language to help you be productive right away. More experienced JavaScript programmers will find a complete and easy-to-read reference that covers each language feature in depth. Complete contents include: JavaScript quick start: Familiar with object-oriented programming? This part helps you learn JavaScript quickly and properly. JavaScript in depth: Learn details of ECMAScript 5, from syntax, variables, functions, and object-oriented programming to regular expressions and JSON with lots of examples. Pick a topic and jump in. Background: Understand JavaScript’s history and its relationship with other programming languages. Tips, tools, and libraries: Survey existing style guides, best practices, advanced techniques, module systems, package managers, build tools, and learning resources.","language":"en","currency":"USD","id":"1449364993","title":"Speaking JavaScript","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=qU3rAgAAQBAJ&source=gbs_api","authors":["Axel Rauschmayer"]},{"pageCount":414,"thumbnail":"http:\/\/books.google.com\/books\/content?id=4ZctAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":20.48,"subtitle":"What You Need to Know about Data Mining and Data-Analytic Thinking","description":"Written by renowned data science experts Foster Provost and Tom Fawcett, Data Science for Business introduces the fundamental principles of data science, and walks you through the \"data-analytic thinking\" necessary for extracting useful knowledge and business value from the data you collect. This guide also helps you understand the many data-mining techniques in use today. Based on an MBA course Provost has taught at New York University over the past ten years, Data Science for Business provides examples of real-world business problems to illustrate these principles. You’ll not only learn how to improve communication between business stakeholders and data scientists, but also how participate intelligently in your company’s data science projects. You’ll also discover how to think data-analytically, and fully appreciate how data science methods can support business decision-making. Understand how data science fits in your organization—and how you can use it for competitive advantage Treat data as a business asset that requires careful investment if you’re to gain real value Approach business problems data-analytically, using the data-mining process to gather good data in the most appropriate way Learn general concepts for actually extracting knowledge from data Apply data science principles when interviewing data science job candidates","language":"en","currency":"USD","id":"144937428X","title":"Data Science for Business","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=4ZctAAAAQBAJ&source=gbs_api","authors":["Foster Provost","Tom Fawcett"]},{"pageCount":431,"thumbnail":"http:\/\/books.google.com\/books\/content?id=2_aVDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":55.96,"subtitle":"A Primer for the Data Scientist","description":"Over the past 5 years, the concept of big data has matured, data science has grown exponentially, and data architecture has become a standard part of organizational decision-making. Throughout all this change, the basic principles that shape the architecture of data have remained the same. There remains a need for people to take a look at the \"bigger picture\" and to understand where their data fit into the grand scheme of things. Data Architecture: A Primer for the Data Scientist, Second Edition addresses the larger architectural picture of how big data fits within the existing information infrastructure or data warehousing systems. This is an essential topic not only for data scientists, analysts, and managers but also for researchers and engineers who increasingly need to deal with large and complex sets of data. Until data are gathered and can be placed into an existing framework or architecture, they cannot be used to their full potential. Drawing upon years of practical experience and using numerous examples and case studies from across various industries, the authors seek to explain this larger picture into which big data fits, giving data scientists the necessary context for how pieces of the puzzle should fit together. New case studies include expanded coverage of textual management and analytics New chapters on visualization and big data Discussion of new visualizations of the end-state architecture","language":"en","currency":"USD","id":"0128169176","title":"Data Architecture: A Primer for the Data Scientist","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=2_aVDwAAQBAJ&source=gbs_api","authors":["W.H. Inmon","Daniel Linstedt","Mary Levins"]},{"pageCount":386,"thumbnail":"http:\/\/books.google.com\/books\/content?id=VyisDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":12.64,"subtitle":"Perform fast and efficient data analysis with the power of SQL","description":"SQL for Data Analytics teaches everything you need to know to progress from basic SQL to identifying trends and creating compelling narratives with data. With this book, you will be able to look at data with the critical eye of an analytics professional and extract meaningful insights that will improve your business.","language":"en","currency":"USD","id":"1789803845","title":"SQL for Data Analytics","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=VyisDwAAQBAJ&source=gbs_api","authors":["Upom Malik","Matt Goldwasser","Benjamin Johnston"]},{"pageCount":1248,"thumbnail":"http:\/\/books.google.com\/books\/content?id=gaEuAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":null,"subtitle":"The Complete Book","description":"This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Database Systems: The Complete Book is ideal for Database Systems and Database Design and Application courses offered at the junior, senior and graduate levels in Computer Science departments. A basic understanding of algebraic expressions and laws, logic, basic data structure, OOP concepts, and programming environments is implied. Written by well-known computer scientists, this introduction to database systems offers a comprehensive approach, focusing on database design, database use, and implementation of database applications and database management systems. The first half of the book provides in-depth coverage of databases from the point of view of the database designer, user, and application programmer. It covers the latest database standards SQL:1999, SQL\/PSM, SQL\/CLI, JDBC, ODL, and XML, with broader coverage of SQL than most other texts. The second half of the book provides in-depth coverage of databases from the point of view of the DBMS implementor. It focuses on storage structures, query processing, and transaction management. The book covers the main techniques in these areas with broader coverage of query optimization than most other texts, along with advanced topics including multidimensional and bitmap indexes, distributed transactions, and information integration techniques.","language":"en","currency":null,"id":"0133002012","title":"Database Systems","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=gaEuAAAAQBAJ&source=gbs_api","authors":["Hector Garcia-Molina","Jeffrey D. Ullman","Jennifer Widom"]},{"pageCount":544,"thumbnail":"http:\/\/books.google.com\/books\/content?id=GYtrDEwZiN4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":69.71,"subtitle":"Developing Application-Oriented Software with the Tools & Materials Approach","description":"Successful businesses and organizations are continually looking for ways to improve service and customer satisfaction in order to achieve long-term customer loyalty. In light of these goals, software developers must ask the question: how does customer orientation influence traditional approaches, methods, and principles of software development? In this book, a leading software architect and his team of software engineers describe how the idea of customer orientation in an organization leads to the creation of application-oriented software. This book describes what application-oriented software development is and how it can be conceptually and constructively designed with object-oriented techniques. It goes further to describe how to best fit together the many different methodologies and techniques that have been created for object-orientation (such as frameworks, platforms, components, UML, Unified Process, design patterns, and eXtreme Programming) to design and build software for real projects. This book brings together the best of research, development, and day-to-day project work to the task of building large software systems. *Written by and for developers of large, interactive, and long-lived software systems *Includes patterns of proven analysis, design, and documentation techniques *Shows how to develop an appropriate design approach and concrete software development techniques","language":"en","currency":"USD","id":"0080491960","title":"Object-Oriented Construction Handbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=GYtrDEwZiN4C&source=gbs_api","authors":["Heinz Züllighoven"]},{"pageCount":74,"thumbnail":"http:\/\/books.google.com\/books\/content?id=ZqP8E3CmWggC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":9.99,"subtitle":"Practical Techniques for Fast Data Manipulation","description":"Two years since its initial release, Redis already has an impressive list of adopters, including Engine Yard, GitHub, Craigslist, and Digg. This open source data structure server is built for speed and flexibility, making it ideal for many applications. If you're using Redis, or considering it, this concise cookbook provides recipes for a variety of issues you're likely to face. Each recipe solves a specific problem, and provides an in-depth discussion of how the solution works. You’ll discover that Redis, while simple in nature, offers extensive functionality for manipulating and storing data. Learn when it makes sense to use Redis Explore several methods for installing Redis Connect to Redis in a number of ways, ranging from the command line to popular languages such as Python and Ruby Solve a range of needs, from linked datasets to analytics Handle backups, sharding, datasets larger than available memory, and many other tasks","language":"en","currency":"USD","id":"1449315410","title":"Redis Cookbook","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=ZqP8E3CmWggC&source=gbs_api","authors":["Tiago Macedo","Fred Oliveira"]},{"pageCount":292,"thumbnail":"http:\/\/books.google.com\/books\/content?id=3n1Vy81G6b8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":16.54,"subtitle":null,"description":"Annotation With the rise of Web 2.0, the need for a highly scalable database, capable of storing diverse user-generated content is increasing. MongoDB, an open-source, non-relational database has stepped up to meet this demand and is being used in some of the most popular websites in the world. MongoDB is one of the NoSQL databases which is gaining popularity for developing PHP Web 2.0 applications.PHP and MongoDB Web Development Beginners Guide is a fast-paced, hands-on guide to get started with web application development using PHP and MongoDB. The book follows a Code first, explain later approach, using practical examples in PHP to demonstrate unique features of MongoDB. It does not overwhelm you with information (or starve you of it), but gives you enough to get a solid practical grasp on the concepts.The book starts by introducing the underlying concepts of MongoDB. Each chapter contains practical examples in PHP that teache specific features of the database.The book teaches you to build a blogging application, handle user sessions and authentication, and perform aggregation with MapReduce. You will learn unique MongoDB features and solve interesting problems like real-time analytics, location-aware web apps etc. You will be guided to use MongoDB alongside MySQL to build a diverse data back-end.With its concise coverage of concepts and numerous practical examples, PHP and MongoDB Web Development Beginners Guide is the right choice for the PHP developer to get started with learning MongoDB.","language":"en","currency":"USD","id":"1849513635","title":"PHP and MongoDB Web Development Beginner¿s Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=3n1Vy81G6b8C&source=gbs_api","authors":["Rubayeet Islam"]},{"pageCount":202,"thumbnail":"http:\/\/books.google.com\/books\/content?id=eU5sAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":10.69,"subtitle":null,"description":"Written in a practical and concise manner, this book is a crash-course in teaching you the fundamental concepts of Less with real-life examples and problems. If you use CSS(3) in your web development tasks and would love to learn how to create maintainable and reusable code with Less, this book is ideal for you. Although you need to have some experience in web development, even beginners will find that this book is useful.","language":"en","currency":"USD","id":"1783981474","title":"Less Web Development Essentials","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=eU5sAwAAQBAJ&source=gbs_api","authors":["Bass Jobsen"]},{"pageCount":288,"thumbnail":"http:\/\/books.google.com\/books\/content?id=0bWYBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":47.36,"subtitle":null,"description":"Architecting High Performing, Scalable and Available Enterprise Web Applications provides in-depth insights into techniques for achieving desired scalability, availability and performance quality goals for enterprise web applications. The book provides an integrated 360-degree view of achieving and maintaining these attributes through practical, proven patterns, novel models, best practices, performance strategies, and continuous improvement methodologies and case studies. The author shares his years of experience in application security, enterprise application testing, caching techniques, production operations and maintenance, and efficient project management techniques. Delivers holistic view of scalability, availability and security, caching, testing and project management Includes patterns and frameworks that are illustrated with end-to-end case studies Offers tips and troubleshooting methods for enterprise application testing, security, caching, production operations and project management Exploration of synergies between techniques and methodologies to achieve end-to-end availability, scalability, performance and security quality attributes 360-degree viewpoint approach for achieving overall quality Practitioner viewpoint on proven patterns, techniques, methodologies, models and best practices. Bulleted summary and tabular representation of concepts for effective understanding Production operations and troubleshooting tips","language":"en","currency":"USD","id":"012802528X","title":"Architecting High Performing, Scalable and Available Enterprise Web Applications","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=0bWYBAAAQBAJ&source=gbs_api","authors":["Shailesh Kumar Shivakumar"]},{"pageCount":180,"thumbnail":"http:\/\/books.google.com\/books\/content?id=AdJwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","price":14.59,"subtitle":"Create amazing, interactive visualizations in the browser with JavaScript","description":"This book will help you build interactive graphs that are viewable in any web browser using JavaScript, D3.js, and SVG. You will learn how to make a scatter plot, a bar graph, a pie chart, a force directed graph, and a map. Key Features Takes you through the most common graphs you'll need Add interactivity to your visualizations Easy to follow builds Book Description D3.js is a JavaScript library that allows you to create graphs and data visualizations in the browser with HTML, SVG, and CSS. This book will take you from the basics of D3.js, so that you can create your own interactive visualizations, to creating the most common graphs that you will encounter as a developer, scientist, statistician, or data scientist. The book begins with an overview of SVG, the basis for creating two-dimensional graphics in the browser. Once the reader has a firm understanding of SVG, we will tackle the basics of how to use D3.js to connect data to our SVG elements. We will start with a scatter plot that maps run data to circles on a graph, and expand our scatter plot to make it interactive. You will see how you can easily allow the users of your graph to create, edit, and delete run data by simply dragging and clicking the graph. Next, we will explore creating a bar graph, using external data from a mock API. After that, we will explore animations and motion with a bar graph, and use various physics-based forces to create a force-directed graph. Finally, we will look at how to use GeoJSON data to create a map. What you will learn Build a scatter plot Build a bar graph Build a pie chart Build a force-directed graph Build a map Build interactivity into your graphs Who this book is for This book is for web developers, interactive news developers, data scientists, and anyone interested in representing data through interactive visualizations on the Web with D3. Some basic knowledge of JavaScript is expected, but no prior experience with data visualization or D3 is required to follow this book.","language":"en","currency":"USD","id":"1789347742","title":"D3.js Quick Start Guide","infoLink":"https:\/\/play.google.com\/store\/books\/details?id=AdJwDwAAQBAJ&source=gbs_api","authors":["Matthew Huntington"]}]